{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"North Platte","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is not the first time i have seen ufos, however, this time i felt the need to report it because it has been very disturbing.  when i was a kid, i read lots of books about alien abductions, but as i became an adult, i decided that ufo stuff was false.  this year things have changed, i have seen about 3 ufos, and now i don't know what to think.  \r\n\r\nat about 9:20pm, i was headed out of my apartment to my parents' house.  i have a good relationship with them, and we live in the same hometown, so i was going to pay them a visit.  as i walked out, i noticed a star in the sky that was moving.  there was no sound, and no lights blinking, so i knew it wasn't an airplane.  i started wondering what it could be, but then the light started curling around in an \"s\" shape.  then i knew that it wasn't a plane or satellite, and i was pretty scared, because i've seen 2 other ufos that scared me and i didn't want to see another one, so i decided to get in my car and immediately drive to my parent's house, and pretend and try to convince myself i saw a plane.\r\n\r\nwhen i got to my parents house a couple minutes later, i was shaken, and then i decided to look at the skies again, to see if it was still there.  i saw nothing and decided to walk inside.  as i walked towards the house again, i had the urge to jerk my head back and look again, and when i did, i saw a black triangle ufo just zip out of nowhere at an unrealistic and frightening speed, and then it suddenly stopped on a dime right above my parent's house and me in a very threatening and scary manner.  the ufo zipped and then stopped in the middle of the air just long enough for me to see it definitely wasn't a plane, and that it was a triangle.  \r\n\r\nthe triangle ufo wasn't very big, just about as big as a plane flying low, but i didn't look at it very long.  it stopped in a very frightening manner, almost like it knew i was looking at/for it, and was trying to intimidate me.\r\n\r\nsince this is the 3rd ufo i have seen, i have been thinking about carrying a camera with me, however every ufo is very frightening to me, and i usually try to put it out of my head however i can.  also because i read books about alien abductions as a kid, i don't want to get abducted either.  the reason why i am finally coming forward, is that 3 times is too much, and it's really starting to disturb me, and i am afraid to walk outside at night.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path then hovering","formattedAddress":null,"id":16739,"landingOccurred":false,"latitude":41.1272173,"location":null,"logNumber":"US-04302009-0001","longitude":-100.7566232,"occurred":1241065200000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Star-like,  Triangle","source":"MUFON","status":null,"submitted":1241065200000,"summary":"Flying star ufo, then a triangle.","tags":["triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"North Platte, Nebraska","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235710"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Jose","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am avid photographer and sky watcher who loves to take pictures of airplanes and nature.  in california i always noticed the different types of military and commercial planes flying.  so as a normal evening i was going out to grill dinner and i glanced in the sky and i saw it.  i told my wife , who also witnessed the sighting.  this is the third time i have saw sphere objects through out my life.  all in different states. twice in colorado and one in california.  i notices and imediatley new it was unusual.  i ruled out the possibilities of it being a balloon because of the altitude....It seemed to be above normal air traffic for the region.  the object eventually moved up and diagnol before i lost sight of it behind  the trees... before that it was very still ,,stationary.  i was excited that i saw it and was able to document the event...Because it has happend before and everybody gets a chuckle when i talk about it ..But to me it is no joke it is real..\r\nthese are pictures of the object and a picture of an air plane you decide...I do have alot more pictures if interested ...Some better than others..\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16737,"landingOccurred":false,"latitude":37.3406557,"location":null,"logNumber":"US-04292009-0017","longitude":-121.8855955,"occurred":1208329200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1208329200000,"summary":"Circular, floating.","tags":["photo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/16737_submitter_file1__DSC01753.JPG","http://www.mufoncms.com/files_jeud8334j/16737_submitter_file2__DSC01748.JPG","http://www.mufoncms.com/files_jeud8334j/16737_submitter_file3__DSC01755.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Jose, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235711"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Burlington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving in my car on the way to price chopper on s. winooski road and my girlfriend spotted what looked like a bright orange/yellow diamond fireball in the sky over lake champlain to the south west. we tracked it for about a minute until it suddenly vanished in the sky. probably just an exploding star or something like that right? or is the world going to end?","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16736,"landingOccurred":false,"latitude":44.4858525,"location":null,"logNumber":"US-04292009-0016","longitude":-73.204142,"occurred":1241063580000,"potentialRelations":[],"rating":"Unrated","region":"Vermont","reportedWeather":null,"shape":"Diamond,  Fireball,  Star-like","source":"MUFON","status":null,"submitted":1241063580000,"summary":"Bright diamond fireball in the sky.","tags":["fireball"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Burlington, Vermont","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235712"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Jacksonville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside @ 9:03 pm april 29 2009 to take a phone call when i glanced upward and seen an interesting light.It was dim and white.I noticed no flashing lights of any kind,just one solid dim light.I continued to observe when after a couple minutes it grew really bright for approximately 15 seconds,then once again dimmed.I then looked away to check the time it was 9:06 pm.I looked back up afraid once i looked away and would disappear,but,it was still going.It was moving from the northwest to the southeast direction slowly.Another reason it caught my eye,i live in a fly zone with lots of air traffic.So i can distinguish a plane or helicopter.When the event ended it got to a cloudbank and as if someone shut out the lights and disappeared.This was also interesting because it never entered the clouds.It disappeared before it got to the clouds.Like a light switch.Very odd behavior for a plane or helicopter.It was definitely something different.Well as for this story it isn't my only sighting in this area.I have seen dozens around here.Many being this same type.It always gives me goosebumps like wow!\r\nwell thats my story.Feel free to contact me on this matter.I believe and want answers as well from the government.\r\nyours sincerely,douglas walker","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":16735,"landingOccurred":false,"latitude":30.3356138,"location":null,"logNumber":"US-04292009-0015","longitude":-81.654461,"occurred":1241064180000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1241064180000,"summary":"A dim light flew over then got very bright then dimmed again then disappeared.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Jacksonville, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235713"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Pittsburgh","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just coming home from the store when i saw a meteor like object that disappeared and reappeared in the horizon. it started above the tree line, streaked toward the horizon at a 45 degree angle, disappeared, then reappeared taking the same path, then disappeared again before the horizon. i thought it may have been a meteor, but it flashed and didn't continue into the tree line like a normal meteor would. ","distance":"501 Feet - 1 Mile","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Other","formattedAddress":null,"id":16734,"landingOccurred":false,"latitude":40.4421048,"location":null,"logNumber":"US-04292009-0014","longitude":-79.9883264,"occurred":1241064000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1241064000000,"summary":"Meteor like object that disappeared and reappeared.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/16734_submitter_file1__sketch.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pittsburgh, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235714"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Colorado Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was going over to my friend linda kings house & i noticed a very ,very bright  light hovering in the sky & couldn't explain it so i ran home & went downstairs & grabbed my video camera & started video taping it. i get in the video view of the camera for reference. i had no tripod handy& my\r\nbrother couldnt find one. but thebottom of the sphere pulses in & out & \r\nthe shape of it changed from big to small when i left the camerea alone& didnt move it. i still have the video tape & want to find out how or if it can be identified.","distance":"Unknown","duration":"01:17:16","entityEncountered":false,"favorited":0,"features":"Patterned Surface,  Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":16733,"landingOccurred":false,"latitude":38.8374016,"location":null,"logNumber":"US-04292009-0013","longitude":-104.8121634,"occurred":1230535200000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1230535200000,"summary":"Very bright light  hovering in sky behind my house & i video taped it with my brother present.","tags":["video","light","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Colorado Springs, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235715"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Concord","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A fast circle object orange at the size of a frissbee and it left a glowing orange trail which disapeared in avapor after a few seconds.\r\n\r\n   i was walking tworads my friends house so we can shoot some bats but before i got there it flewnpast my face twards the woods. i stood there shocked and did not move for about two minuts. it did nothing special just flew past me.","distance":"Unknown","duration":"00:00:16","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16732,"landingOccurred":false,"latitude":33.0912359,"location":null,"logNumber":"US-04292009-0012","longitude":-84.4374232,"occurred":1152416700000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Disc,  Oval","source":"MUFON","status":null,"submitted":1152416700000,"summary":"Small frissbee size orange.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/16732_submitter_file1__ufoinc.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Concord, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235716"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I first noticed what looked to be like a star at 5am in tucson az , but i quickly realized if it was a star, it was huge, really low and it was the only one. totally freaked, i was still able to get my binoculars and snapped a picture from my phone. it literally stayed their for almost 2 hours even when it was bright as day!! that all happened on the 28th at about 5 am. then again, on the 29th at about 3am, i go outside to have a cigarette and i see the same damn thing! this time i was freaked, i went and got my brother up, and while he thought about it for approximately 2 minutes, he tried convincing himself that it was a \"satellite.\"  then he started laughing and asked if i was able to go back to sleep now that i saw this. so we got the binoculars one more time and confirmed that satellites don't remain in the same spot within the atmosphere for over 30 minutes. i'm gonna go out on a limb and say it was at least 2 objects. interestingly, tucson international airport and davis monthan airforce base are within a 10 to 12 mile radius from our address, and i'm wondering if a situation like that of what happened in the 60's at edwards in ca - what the hell would they do? listen brothers and sisters, it may have been something man-made. i will say this though, its been consistently there for hours at a time, in the same spot, and its in the same spot - exact same spot by measuring it against the telephone wires that mark the sky all over this neighborhood. ","distance":"Unknown","duration":"02:14:15","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16731,"landingOccurred":false,"latitude":32.2309029,"location":null,"logNumber":"US-04292009-0012","longitude":-110.917139,"occurred":1240920420000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1240920420000,"summary":"2 nights in a row, a craft hovers over rincon mountains for hours!!!","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235717"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minot","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving my girlfriend home and after i dropped her off, i was on my way home and stopped at a yeild sign and saw in the distance a squarish object in the sky about 300 feet in the air. it had 4 bright red lights 2 in the back and 2 in the front and a bright white light under it that kinda went around to the rear. the rest was a dark black i bent down to find a camera in the truck and by the time i found it and got out of the object was up in the sky so high it looked almost like a star.It took about 7seconds to find the camera.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":16730,"landingOccurred":false,"latitude":48.2408395,"location":null,"logNumber":"US-04292009-0011","longitude":-101.2889432,"occurred":1240572600000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1240572600000,"summary":"I was driving object flew over my truck about 300 feet above it.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Minot, North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235718"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Whitechurch, Cork","country":"Ireland","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi everybody, i saw the report a welsh guy put in today and decided i would do the same as my sighting was roughly around the same time and a short distance across the water in wales, maybe they could be correlated. i previously did not want to report it because i had put it in the back of my mind for a while, but recently i have been insatiable about researching the phenomena.\r\nwell one day while on shift rotation i decided i would go body boarding,so i got to the beach, pulled on my wet suit walked down the cliff on to the beach.\r\nwhile i was standing there contemplating the size of the waves as i was a novice, also i had no buddy with me, i noticed that the waves were pretty big, maybe to big!, so i wondered how the waves were getting so big so close to the beach, then i just turned right around and looked up at about 70 degrees, and there was this big chrome almost mirror like sphere floating in the sky, it was pretty impressive in size too..I thought hold on..It cant be..So i turned around looking back at the sea..(id heard stories from friends), so i turned around and looked at it again, and it was still there! clear as day shining in a clear blue sky, and also, it hadn't moved, so i kept looking at it and tried to reference as much as i could about it. its distance was hard to make out but i reckon maybe 500 yards/meters away roughly, so in my head i counted how long in seconds i was looking at it(15 seconds), then i thought to turn round look at the sea again, then i looked back at it, to make sure it wasn't anything like a balloon floating or something like that, just to be sure, and it was still there!..I thought this is amazing!! and looked at it, turned to look at the sea again counted 10 seconds looked back and it was gone! 10 seconds in a clear sky and it was gone!..Then i noticed a women on the beach walking her dog(whom i hadn,t noticed before) and was going to ask her did she see it, but for some reason i didn't ask her,needless to say i didn't go body boarding either as the waves were too scary. i dont think i even told anybody about it for a good while after..Strange! but true..\r\ni cannot discount what i have seen, so i keep an open and thoughtful mind to all serious reports. i dont like timewasters or people who make pranks(but i too was very skeptical at one time) . now ive said it..There you go. happy days=).","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16729,"landingOccurred":false,"latitude":51.9832233,"location":null,"logNumber":"IE-04292009-0010","longitude":-8.5319331,"occurred":907916400000,"potentialRelations":[],"rating":"Unrated","region":"County Cork","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":907916400000,"summary":"Chrome or polished steel spheroid shape, no windows or any other protuberences.","tags":["none"],"timeZone":"Europe/Dublin","timeZoneName":"Europe/Dublin","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Whitechurch, Cork, County Cork","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235719"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Madison","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking east out my bedroom window the eastern sky was just turning gray when i was drawn towards a very bright light high in the eastern sky. first thought it was a star, to big to bright, not a helicopter, to high, not a plane, light to big, so i was just staring at it. as i watched the light went stright down, just as fast as i have ever seen anything move, there was a band of clouds moving from north to south at approx. 5000 feet the light dropped behind that cloud bank and i was sure it would come out the bottom, but it didnt. i looked north and south but no light it was gone. i mean who do you tell this to but you guys.I was probably the only guy in madison that was looking right were this thing was and i debated about reporting it but i know what i saw and it wasnt anything i can explain to myself. i was not thinking ufo until it dropped like a rock and vanished!!!","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":16728,"landingOccurred":false,"latitude":43.0797217,"location":null,"logNumber":"US-04292009-0009","longitude":-89.3977302,"occurred":1240400280000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1240400280000,"summary":"Bright, basketball size light high in the east, that just dropped rapidlly and vanished.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Madison, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235720"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Glasgow","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"White oval about 20 feet longe 16 feet high stoped 60 feet above me 2 maybe 4 mins was heading n at the time turned nw moved slow 10 seconds then at a speed out a novel you know and i know wot it was  no noise  it was a lovely sunday morn my girlfriend so it to i must be very lucky this is my second encounter the last one you just would not believe","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":16727,"landingOccurred":false,"latitude":55.868397,"location":null,"logNumber":"GB-04292009-0008","longitude":-4.247386,"occurred":547410000000,"potentialRelations":[],"rating":"Unrated","region":"Scotland","reportedWeather":null,"shape":"Egg,  Sphere","source":"MUFON","status":null,"submitted":547410000000,"summary":"White no markings no windows just him and me. ","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Glasgow, Scotland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235721"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marana","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"     on april 28, 2009 at 9:05 p.M.,  i went outside into my backyard to let my dog out when  i immediately noticed in the sky three bright white strobe lights in the shape of a triangle.  these lights were in a northwesterly direction, approximately one mile away and at a height about level with the moon and just west of the moon.  the three strobe lights flashed in sync with one another about every second.  in the space between the lights or object was about the size of a football field.  these lights appeared to be hovering in the air in a perfect triangular shape with absolutely no sound.  the sky was clear and calm.  i did not see any stars in between the lights as if the lights were attached to a solid object.  \r\n     after watching this for about two minutes, i ran over and banged on my bedroom slider to alert my wife, where she then came outside to join me.  as she was coming out, the three lights moved very slowly toward the northwest, changing shape into a straight line, then into a stretched backwards letter \"c\" shape and added four or five more strobe lights.  the strobes changed as well, with three strobes in sync with one another, then two with another two or three at the far end of the line of lights or object where it had curved into the backward c shape.  \r\n     i then ran into the house to get my binoculars.  when i came back out (which took about 15 seconds), i looked at the lights through my binoculars to see when the strobe lit, it illuminated a dark colored object behind the lights. my wife and i then watched this move off toward the northwest.  the whole experience lasted about five to seven minutes.  to make this even more interesting to me, was the fact that this object or objects were flying in the flight pattern toward the tucson airport and at the time, i saw no airplanes flying south in the flight pattern until the end of my siting, a plane was flying south but east of the normal flight pattern.  i believe this plane may have seen the object or it was diverted.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":16726,"landingOccurred":false,"latitude":32.442821,"location":null,"logNumber":"US-04292009-0007","longitude":-111.2186222,"occurred":1240977900000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1240977900000,"summary":"Triangle shape object whith strobe lights that changed shape.","tags":["triangle","lights"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Marana, Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235722"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Shiloh","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was heading toward st louis on i-64 this fall, just got on at the lebanon/mascoutah entrance mm23, when i noticed what appeared to be a \"bank\" of windows in the southwest portion of the sky, i thought it was the tower for scottafb, but then noticed the same kind of lights over greenmount rd.Mm16.  i put it off to headlights reflecting off the big green road sign, and thought nothing of it for awhile.  as i got into school in ladue mo., i thought wait a minute!! those lights couldn't have been the tower because they were bright yellowish white like you see in windows at night at a house or building. all in a row in a long rectangle like a bank of windows. airtraffic control towers dont use that kind of lighting, its usually red or green so as not to mess with night vision. i lost sight of the lights as i drove down i64. i grew up in o'fallon, my dad was a ret. af major and pilot, and i was in the usn and worked on a-4 skyhawks in gitmo.  so i know it was not an airplane.  i talked to my sister about it when i got home ( i live with her) and we talked about the wierd \"ufo\" she and her husband saw back in the 60's, and just put it off to wierd lights until i watched the travel channel and saw the highland, lebanon,..Sighting in \"ufo's over illinois.\"  they showed the graphics, and when they described the lights and then showed the back of the \"craft\" i thought that's exactly what the lights i saw looked like.  now i don't know what it was that i saw, but there are no buildings that tall in that area, and airtraffic control towers don't move, so i must assume i saw an unidentified aircraft of some sort. i just feel that something should be said/reported, and i regret not doing so sooner.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":16725,"landingOccurred":false,"latitude":38.5614383,"location":null,"logNumber":"US-04292009-0006","longitude":-89.8973233,"occurred":1096807500000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1096807500000,"summary":"Saw lights in sw sky about 0545 end of sept begining of oct in 2008 thought it was the tower at scott afb.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Shiloh, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235723"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Miami","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife and i were visting friends at thier house. while my friends played xbox inside the house, my wife wanted to smoke a cigarette outside, i agreed to accompany her. we went outside to the back of the house to the porch. we stood outside for a few seconds looking at the moon. the moon seemed very bright. while i looked at the moon my wife spotted something spectacular behind me. she was in awe and told me to look behind me. i turned to look and to my amazement i saw and big black triangle (delta). i first taught it was a b-2 stealth bomber. being that i am ex-military and was in the united states air force and have a secret clearence. the b-2 bomber is the closes thing i could think of but is way off.  it emerged from a cloud that had happen to slow down making the object come out of the cloud completely and i could cleary distinguish the shape of the object to be a massive triangle slowy coasting at a very low altitude over our heads. it was at least a hundred yards long, like a football field. it had 8-12 white lights underneath it shaped in a v. it was very silent.  i couldn't believe that such a massive object could be flying over our heads at such a low altitude without falling out of the sky in dead silence.As i looked at it, i needed my friends to see it, i ran into the house to tell my friends to come out side immediately. as i came out i could see it going into another cloud directly infront of it's on-going course over our heads.It flew from south to north right over our heads.By the time my friends came out it had gone into the clouds. i was ecstatic that i was very lucky to have seen such an amazing object. i first taught it was military. but as soon as my reasoning started to think otherwise(non-human) that is when i started to get chills all over, that such an object can be flying over so close without any detection is very scary, i was in the military and i've never seen that before. i am sorry to say i have no pics of the event. just to witness being that of me and my wife.\r\n\r\nbig black triangle\r\n8-12 lights forming a v-shape\r\nlow altitude flying,silent, ","distance":"501 Feet - 1 Mile","duration":"00:00:20","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":16724,"landingOccurred":false,"latitude":25.7954689,"location":null,"logNumber":"US-04292009-0005","longitude":-80.2173993,"occurred":1238664600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1238664600000,"summary":"Big black delta fly over miami .....It was in the clouds.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Miami, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235724"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Middle Grove","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Our exact location at the time of the sighting was, 39.392370, -92.233883.  i was staying the weekend at a friend's home. we were outside looking to the north.  there was enough of a moon to beable to see the cloud bank. we noticed that there was a frosty green intermitantly blinking light that was moving south under the cloud bank.  the only way to determine it's movent was compareing it's location from one blink to the other.  the blinks had absolutely no patteren to them, they were completely random. once the object came to the edge of the cloud bank it then moved up and then proceeded to go back north over the cloud bank untill it was out of view.  at no time did we hear any engie noise.  the object had only the one light, no normal faa lighting, and agian the one light strobed with no set intervals. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":16723,"landingOccurred":false,"latitude":39.395271,"location":null,"logNumber":"US-04292009-0004","longitude":-92.269852,"occurred":728467200000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":728467200000,"summary":"All that was visable was the one frosty green blinking light","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Middle Grove, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235725"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Delano","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Literally directly overhead, overall southwest sky, has appeared for past 7 weeks, every evening, has a larger reflection than most other stars in sky, appears early ( sunset ) and remains all night in geo-syncronois orbit with east coast of usa, it makes shapes while inbound, it's in front of jupiter but behind mars for distance, shapes match strips discovered at roswell site in new mexico usa, several other people acknnowledge sighting but they are trying to get attention for event but we have no takers, we think it's possible a cover-up of some sort is being played out.","distance":"Unknown","duration":"12:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":16722,"landingOccurred":false,"latitude":40.8448732,"location":null,"logNumber":"US-04292009-0003","longitude":-76.0813085,"occurred":1240891200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other,  Unknown","source":"MUFON","status":null,"submitted":1240891200000,"summary":"Bright object changing directions rapidly.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Delano, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235726"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While in glendale arizona i was looking south toward estrella mountain {south west of phoenix- directly west of south mountain} right above the horizon i saw 3 amber lights that didn't move. i had seen them before i went into the store, but didn't pay that much attention, thinking they were two planes together, because it was at a distance to where i was i only glanced that way and noticed it but went into the store as i was in a hurry and on the phone at the same time. when i came out of the store around 5 minutes later, the 3 amber lights were still there, hovering, not moving since i had gone in the store, in the same exact spot and they looked like they were twinkling. there were 3 distinctive lights. what i noticed was it seem way too large to be a plane on approach to sky harbor {my son and i watch planes on approach all the time} when i was watching it intensely a plane was coming from the west and dwarfed in size to these three lights. if i had to estimate the size i would say 3-4 jet plane size wise at least. way to big to be a regular craft. plus they were amber in color, not like any normal craft lights. it was not a helicopter as it was too far to be that big. and they run with white, green and red lights. as i was watching these 3 lights i called my son on the phone to try and see it, but he was in an area that the tree lines near our house blocked the view but because i was at the field at 51st and olive i could see clearly the area it was hovering at. i stood there for 3-4 minutes watching then i couldn't believe my eyes as the lights started to twinkle brighter then dim then the center light went out first, then the one on the right, then the one on the left. it was not a plane or helicopter, nor was it a craft i have seen at any airshow i have been to in the last 30 years. the lights were in a line next to each other but what was weird is that it was parallel, or slightly above the nearby south mountain lights but not too far above the horizon. about .5 - 10 degrees above the ground but more over the estrella mountains side of the southland.  it was not like flares i have seen in the past, it was not like blimps or balloons we see here often in arizona, it was 3 amber lights close together but separate. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":16721,"landingOccurred":false,"latitude":33.4898258,"location":null,"logNumber":"US-04292009-0002","longitude":-112.2264794,"occurred":1240980600000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other,  Unknown","source":"MUFON","status":null,"submitted":1240980600000,"summary":"3 amber lights above estrella mountain.","tags":["lights"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235727"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Went out on my porch this evening about a hour ago and saw a bright, amber colored light in the southwest sky, low above the horizon at about 25 to 30 degrees. the light was stationary. \r\nearlier in the evening i was driving on my way home and saw a pair of lights that looked similar but further away as if on a distant mountain. but these lights i viewed from my porch were bright and would then dim, sometimes releasing new lights that would go dark. i then got into my truck and began to drive south towards the ak-chin indian comunity that was a few miles down the road which would provide me a better view. driving south i saw about a mile behind the ak-chin casino the lights were then on the ground (landed) with flashing orange strobe lights as if from emergency vehicles spaced about a hundred yards apart in a line parallel to the road i was on. i proceeded to make a u-turn and see the lights on the ground once i had passed the casino and lost my line of sight. on the northbound portion of my car ride i agains saw the yellow emergency lights within close proximity to the bright amber lights on the ground. i decided to head home after not finding any viable way to drive any closer.   ","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":16720,"landingOccurred":true,"latitude":33.4497571,"location":null,"logNumber":"US-04292009-0001","longitude":-112.0646473,"occurred":1240902000000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Oval,  Sphere,  Star-like","source":"MUFON","status":null,"submitted":1240902000000,"summary":"Lights seen 'spawning' more lights.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Landing","$$hashKey":"object:235728"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Grand Bay","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out on my deck smoking and looked out towards i-10. suddenly a red orb shot up from below the tree line, hovered for a few seconds then a bright ring of red light emiited from it and it shot straight up and out of sight. a few seconds later my home shook but there was no sound at all.\r\n\r\nearlier there was a helicopter in the area, have been helicopters in the skies here for the last few weeks. i don't know what to make of it but it was impressive to say the least.\r\n","distance":"501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":16719,"landingOccurred":false,"latitude":30.4763084,"location":null,"logNumber":"US-04282009-0016","longitude":-88.3422303,"occurred":1240371600000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1240371600000,"summary":"Strange red orb and a bit of a light show.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grand Bay, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235729"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Caerphilly","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and a friend where just out playing at the top of the street when the friend say's to me look at that looking upwards so i look and it was almost as if your eyes had to change focus it's hard to explain but you could of had this object fly past you a million times and not notice it but there in the sky was a silver/metalic sphere moving from my left to right as i looked up on either side but not attached to it was black traingles also one in front i would say they where sperate craft almost a escort these could have been stealth bombers i suppose? but i don't think they where. it was a bright clear day and i see no way how such a object could fly being it had no wings and there was no noise at all also nothing coming out of it just a pure ball. we just stood watching as they continued to go across the sky until they where out of site, to this day i believe it was something not made on this planet and i don't think anyone could convince me otherwise. i don't know what my friend saw before that but he said the object's that we both saw weren't what he was orginally trying to point out. to be honest we didn't really talk about what we saw to each other and haven't spoken for quite a few years now. i really wish i had a camera at the time but when your a kid out playing who does right? the thought did cross my mind to run to the house about 1min away and ask for one but it would have been to late anyway. this story is 100% true although the date/time are probably wrong it was quite a few years ago but not something you forget.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":16718,"landingOccurred":false,"latitude":51.578829,"location":null,"logNumber":"GB-04282009-0014","longitude":-3.218134,"occurred":912412800000,"potentialRelations":[],"rating":"Unrated","region":"Wales","reportedWeather":null,"shape":"Sphere,  Triangle","source":"MUFON","status":null,"submitted":912412800000,"summary":"Silver sphere & with triangle escort?","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Caerphilly, Wales","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235730"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Potsdam","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my girlfriend were driving down rt. 72 in potsdam ny at night about 9:30 pm when we first noticed something that looked like it was either on fire or melting in the sky, then the trees blocked our view. we kept our eyes on the sky in that direction and noticed a thin, horizontal blinking light. it was in front of us at this point. we then turned right onto county route 58 so the blinking light was at 7oclock from the drivers position. it seemed far away, until when we were somewhere in between high flats and wildwood (still on county route 58). as we drove past an opening in the trees i looked again towards were we saw the blinking light. i swear to god this was unlike any other lights ive ever seen in the sky. there was three red/dark tan lights about 20 degrees from the surface. they were horizontal, the middle one being a tiny bit higher than the other two on its wings. the lights were like an old, dim street lamp except they were perfect circles. there was no light beyond the edge of the circle, like almost a perfect circle. all three stayed light for about a second, enough time for me to look at her and say 'holy [cms/tg/pd} {cms/tg/pid} did you see that.' i then turned back towards them and saw all three still light, but immediately starting from the right they all quickly turned off their lights, and there was just nothing there again. we kept driving and saw 3 lights, strobing in a pattern. the three lights made a triangular shape, the top one strobe with the bottom left as the bottom right was invisible. then they all went invisible. then the top one strobed with the one on the bottom right while the bottom left was invisible. then they all went out. and that pattern repeated a couple times, each light staying on for about a half a second. then the lights went invisible and we didnt see them again. ive never seen anything like this before, ive never seen lights react that way.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":16717,"landingOccurred":false,"latitude":44.6697805,"location":null,"logNumber":"US-04282009-0014","longitude":-74.9813084,"occurred":1240980000000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1240980000000,"summary":"3 horizontal red lights moving slowly, low to horizon, strobing.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Potsdam, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235731"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fort Myers","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On tuesdat mar. 31, 2009 my wifre and i were sitting on our front poarch at about 6:00 pm. we noticed the airplanes were taking off to the north east. while watching the planes fly over head we saw the object flying south east. it was still sunny outside at the time, it looked like a stasr coming at us, it waas shinny from the reflection of the sun. then we thought it might be a sattelite visible during the daylight. it seemed very high in the sky, no contrail moving at at about the same speed as a sattelite. i think the ??? in the planes had ????? it was very noticeable.\r\n\r\ntom walter    ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":16716,"landingOccurred":false,"latitude":26.644908,"location":null,"logNumber":"US-04282009-0013","longitude":-81.8680084,"occurred":1238482800000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1238482800000,"summary":"","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort Myers, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235732"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Prescott Valley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my home, went out to get my dogs. the yard is fenced and i left the porch to call them. i looked to the south and over head of the homes was an orb. it was flying very slow. i could out run it if i had wanted to. the orb was red/orange, made no noise and was approximately one to two feet above the very tops of the homes. all were single family residences and all homes were single story.  i ran got my camera and started filming the orb. by the time i got the lens cap off and turned on the video the orb had started to assend. i was with three other people, they saw it too. i ask my neighbor if he had seen anything the night before. he said, \"o was it the orb?\". his wife that was with him didn't know what he was talking about. i said, \"have you seen it before?\". he said no< \"but it has been around here for years.\" \"what are you talking about?\", his wife asked. but he got quiet and walked away. this was a very large orb, about the volumn of 3 cars easy, not a small one at all.\r\n\r\njennifer smith","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":16715,"landingOccurred":false,"latitude":34.6194443,"location":null,"logNumber":"US-04282009-0012","longitude":-112.308611,"occurred":1143264240000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1143264240000,"summary":"Sighted an orb moving over houses.","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Prescott Valley, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235733"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Carmel","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home from work and noticed what first looked like the moon in the sky, however it was in the wrong setting for the moon at this time of year.  as i continued to look i observed that it was not the fingernail moon that i had originally thought. the illumination was alternating around the edge intermittently counterclockwise from the 8 o clock position to the 2 o clock position and then it would disappear and cycle back around again about every 15-25 seconds. i did remmain steady in the sky in the same area and as i continued to drive (after calling to tell someone what i was looking at) it eventually was out of my range as it was in behind me and off to the north.  \r\n\r\nsince december of 08 i have been noticing more lights in the sky to the extent that my family and i had purchased binoculars and one member a telescope.  at first we were taken aback at the lights but had no explanation so we had contacted the authorities but no response.  those lights were differnt though of a triangle (elongated)shape. it had red and blue lights on the apex of each angle and depending on the cloud cover at times you could see a single bright light on one end only. because of this we have just gotten used to see them and just comment from time to time. on occassion i will look up when i am out at night. this particulare night was one that i just happened to look up not expectinng anything...Especially anything differnet.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Other","formattedAddress":null,"id":16714,"landingOccurred":false,"latitude":39.980071,"location":null,"logNumber":"US-04282009-0011","longitude":-86.1168435,"occurred":1240895700000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1240895700000,"summary":"First look thought it was a fingernail moon but in the wrong direction and illumination varied.","tags":["none"],"timeZone":"America/Indiana/Indianapolis","timeZoneName":"America/Indiana/Indianapolis","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Carmel, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235734"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Knoxville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 5:30 this morning i spotted a bright lighted object about 200 to 300 yards , outside my living room window . it had strobing red , white and green lights and other white lights along its sides . altitude was 100 feet or less , and it was completly silent , no rotor or engine sounds at all . its length was about 50 feet or so between the strobing outer lights on the object , and was moving very slow through the sky .\r\nit was heading south for the river and crossing it when i lost sight of it ( due to building obstruction ). the object turned to the right and i saw it again heading west on the other side of the river . i lost sight of it when it went behind the hills . total time of the sighting was 2 minutes or so . \r\n\r\nwith its strobing and lighting on it . it looked like the object i saw on the night of january seventh of this year . i wish i would have seen it in daylight to see what shape it was . \r\n\r\n","distance":"101-500 Feet","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":16713,"landingOccurred":false,"latitude":35.9645484,"location":null,"logNumber":"US-04282009-0010","longitude":-83.9179392,"occurred":1240921800000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1240921800000,"summary":"Bright lighted object over the tennessee river in knoxville. ","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Knoxville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235735"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Kearney","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I and my girlfriend, now wife, was driving south on i-35 south of kearney, mo. this area is right in the flight path for incomming traffic to kci/mci.  i was looking up out of my windshield. my first instant reaction was to alert my girlfriend so she could see the metorite, but before i could get out, \"look honey a falling..\" it was no longer a metorite.  the metorite had instantly, before my eyes, become a small single engine plane with normal faa lighting.  it was low enough i could hear the engine.  i would have immediatly dismissed what i had seen if it not had been for accounts of others seeing the same thing that i had read a year or so previously. it happened so quickly that the exact words that came out of my mouth were, \"look honey, a falling..  what the hell did i just see?\"","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s),  Wings","flightPath":"","formattedAddress":null,"id":16712,"landingOccurred":false,"latitude":39.3677802,"location":null,"logNumber":"US-04282009-0009","longitude":-94.3621703,"occurred":886305600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Star-like,  Other","source":"MUFON","status":null,"submitted":886305600000,"summary":"What appeared to be meteorite became a small singe engine plane.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kearney, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235736"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Leesburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am not certain of the exact date. i know it was after sept. 15th 2008 because i got back from my honeymoon on the 14th. it was also before nov. 21st 2008 because that is when i moved into our home in west virginia. it was only around 7:30 pm and it was already quite dark but it was rather warm outside so i believe it was mid october. i was living with my wife at my in laws house and shortly after arriving home from work we left to go to leesburg to get dog food for our dogs. on our way home it was quite dark and as we came over a hill leaving leesburg heading west on route 7 there was a very bright light just over the tree line. i remember thinking that it was a large commercial airplane like a 747 at first. dulles is right around the corner(10-15 miles) but i thought the plane was much to low to be going there. also there is a leesburg airport but i thought the runways there are much to small for an aircraft of that size. thoughts were racing through my head and my next thought was either it was making an emergency landing on route 7 or it was hijacked like 9/11 since we were so close to dc. as we got closer i realized it was moving very slow. the one bright light started to become clear it was multiple lights. it was a disk shaped aircraft. lights around the bottom with one light in the center. it was heading dead east parallel with the road. 200 yards north of the road at an altitude of 250-500 feet. it was about 50 feet in diameter. as we pulled up next to it it had come to a stop and was hovering over some houses. my wife was driving and had slowed to 25-30 mph on the highway to look at it. i rolled down my window and turned off the stereo to listen for it. nothing. no sound what so ever. neither of us had our phones on us so we couldn't take a pic. i asked astoundingly if she was seeing what i was seeing. she said no. i said \"it is right above us, look, it is right there\". she said no again. when i took my eyes off it to look at her i realized she was white as a ghost, eyes forward, hands gripping the wheel and was sweating. she was scared of what she was seeing. as we went passed it it started moving south over the road, only moving 10-20 mph. it passed directly behind the car. aside from the silence another thing i found weird was when it moved it didn't gyrate about an axis. it stayed level not rotating at all. i talked my wife into turning around at the next exit (1/4 mile up the road) to look for it but when we got back, it was gone. the craziest thing i ever saw. when we got home i immediately started calling people telling them what i had seen. some believed me, some didn't. i called my dad because he was just south of us and told him to look for it in the sky. he didn't see anything that night. i am reporting this because i want to find out if anyone else saw this. there were other cars on the road and everyone of them slowed down to the same speed as us. someone else has to have seen this.    ","distance":"101-500 Feet","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Straight-line path,Path then hovering","formattedAddress":null,"id":16711,"landingOccurred":false,"latitude":39.1170315,"location":null,"logNumber":"US-04282009-0008","longitude":-77.5592915,"occurred":1224124200000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1224124200000,"summary":"Disc, slow moving, silent, flying low then gone.","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Leesburg, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:235737"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Independence","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I do not recall the exact address but the location is 39.091666, -94.438345. it was about 9:30pm and i had stepped out onto the porch of our third floor apartment. i looked to the south and saw a very unusual aircraft going east. it passed just below a full moon. although i was 14 at the time i had a very deep interest in aircraft and new this was not normal as it did not have the standard faa lighting. once the craft was out of view i went inside and told my mother what i had seen. she shortly left for work. \r\n\r\nabout 20 minutes later i return to the porch. after standing there for a few minutes i look up to see three of the same aircraft flying in diamond formation. i was in awe.  the aircrafts were at roughly 10-15,000 ft.  now i was used to seeing airliners coming into kci/ (mci) all the time.  these craft were flying above the normal approach altitude but below the normal transcontinental altitude.  the only thing was even at their altitude they appeared at least three times larger than a conventional airliner at the approach altitude.  they were massive.  they moved slowly, taking at least two minutes to leave my field of vision that was fairly confined as i was in an apartment complex.  the other thing that i noted is that at no time did i ever hear engines of any kind.  one detail that i wish to mention is the circle in the middle of these triangles.  when i saw the first one at a profile, this circle appeared to be more of a dome on the bottom of the craft.  then later looking up at them this dome had white light but also appeared to have swirling colors within that white light.  \r\n\r\nat this point i went back inside. i then placed a phone call to the control tower at kci/ (mci).  i asked the man who answered if there had been any aircraft fly formation over the kansas city area anytime in the last 48 hours. he said that he didn't know the answer but if i could hold he knew who would.  after being on hold for about five minutes he returned and informed me that indeed there had been no aircraft flying formation in the area in the last 48 hours.  i then told him that we had a problem because i just saw three large aircraft less than 15 minutes ago in formation. i explained what i had seen.  he then asked if i would like to report a ufo.  i said that i did.  he said that i would need to hold as he put in a conference call to the, \"united states ufo reporting agency\".  after being on hold for about five minutes the man from kci introduced another guy that was on one of the worst phone connections i have ever heard. it was distorted, scratchy, a lot of line noise. i gave the man a detailed account of what i saw.  he took my name and number and said that they would be in touch. i never heard back from anyone.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":16710,"landingOccurred":false,"latitude":39.0983961,"location":null,"logNumber":"US-04282009-0007","longitude":-94.4119968,"occurred":609058800000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":609058800000,"summary":"Classic bbd. same as well known photos from '90s belgium. one light on each corner and the circle light in the middle.","tags":["triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Independence, Missouri","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235738"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Albany","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was talking with my girlfriend when i noticed a bright white light emerging from the trees. stepped outside and continued talking. when it got closer it looked like 3 white lights right next to each other. i told my girlfriend i thought i might be seeing something strange. i thought it might be a plane going to crash or something because it was so low. as it moved over my neighbors house it appeared as the above description. was very large, not making any sound nor were the lights blinking. it just hovered there. i hung up the phone and tried to wake my mother and brother, the thing was still there when i got back out. i got in my car and called 911 and started driving away. i felt an immense state of fear and panic, horror, confusion and absolute terror. i lost sight of it while speeding away, it seemed to follow me for a bit then took off in another direction. i actually drove across my neighbors lawn i was so scared. it was like living in a nightmare, i hope to never experience something like this again. ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":16709,"landingOccurred":false,"latitude":42.6592693,"location":null,"logNumber":"US-04282009-0006","longitude":-73.7501317,"occurred":1238482800000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1238482800000,"summary":"Triangular, three white lights, one red light, ","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Albany, New York","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:235739"}],"last":false,"totalElements":82759,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2244}
