{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Montgomery","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"June 15, 2013 - we were driving home just after dark.  i noticed a string of 5 lights in front of me as i drove toward our home.  i stopped the car and pointed it out to my wife.  we watched as more lights appeared, moving in a northern direction for over 10 minutes.  after a few minutes of watching, i drove the rest of the way home and continued to watch with 3 neighbors across the street that had seen the same lights as they sat around the pool in their backyard.  we did not count them, but there were over 2 dozen total. all flying in a horizontal line, though some were slightly higher of lower than the main stream.  speed was fairly consistant for all, though a few seemed a bit faster than the rest.  the light(s) of each object would pulsate. could not tell if there were multiple lights on each causing this blinking, but they glowed orange in color and appeared almost on fire at times. they produced no noise. i estimated the height at 4,000 feet and speed above 150 mph. at first i thought it was a flight of military helicopters, but the speed seemed too fast. because of different speeds and height, i didn't think it was a series of floating lanterns. our location was montgomery, ohio. just inside the i-275 loop north of cincinnati.  i took a video on my iphone 4 of the first few moments of the event: [link moved to fi section/cms/tg]","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":48198,"landingOccurred":false,"latitude":39.231497,"location":null,"logNumber":"US-06172013-0017","longitude":-84.355508,"occurred":1371358200000,"potentialRelations":[48219],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1371501135000,"summary":"String of pulsating lights","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48198_submitter_file1__IMG3750.MOV"],"weather":null,"zipcode":"45242","daysBetweenOccurrenceAndSubmission":1,"locationName":"Montgomery, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1381"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ottumwa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Saw the triangle airplane shaped object in sky. as we watched it some misty looking stuff was ejected from the object and it all hung suspended in the sky in same area we had first seen it.  then it slowly over 10 or 15 minutes just dissipated until you could see nothing. during the first part when there was just one object, we could hear a jet off to the south east. could not see it. we were sitting on the porch on a quiet evening.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary","formattedAddress":null,"id":48197,"landingOccurred":false,"latitude":41.00133040422457,"location":null,"logNumber":"US-06172013-0016","longitude":-92.50865878626291,"occurred":1371366000000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1371499862000,"summary":"Triangle airplane shaped object, sort of translucent. ejected a misty cloud of stuff the same color as object. they all just hung suspended until disipated.","tags":["triangle"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"52501","daysBetweenOccurrenceAndSubmission":1,"locationName":"Ottumwa, Iowa","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1382"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Big Pine Key","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was getting ready for bed at approximately midnight, as i was walking to my sliding glass door to lock it i noticed a light reflecting on top of the trees and trailers next door moving quickly,( i live in a stilted house with a raised deck that overlooks my neighbors), i said to myself out loud \"what the hell is that\". i thought at first a large bird had flown so close to the glass that it distorted the light but immediately realized that this was impossible.I opened my door and stepped out onto my deck just in time to see this gigantic flying chevron or wing heading north and ascending at the same time. the only reason i could tell it was a flying object was because the lights were uniform in size a distance between them, and in between the lights the actual stars were blocked out. i felt it was cloaked to blend into the night sky because the lights looked like the surrounding stars. there was no sound and i watched as the object simply disappeared into the night sky. it looked as if it went through a wormhole or a tear in the fabric of space. i can't quantify the size exactly but it was larger that 10 747s side by side and relative to the size actually seemed to move slow as i watched it fly away.  i was so mesmerized that i am not sure exactly how long i watched it but it could not have been more than 10 or 15 seconds. i have longed believed that we are not alone in the universe and have always wished to see something but felt the odds were astronomical, but my excitement at seeing this was so amazing i couldn't wait to tell my husband and son. i am truly a believer now. i wished i had just stepped out a few seconds or a minute sooner so i could have watched longer or been able to film this phenomenon. ","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":48196,"landingOccurred":false,"latitude":24.656935070434905,"location":null,"logNumber":"US-06172013-0014","longitude":-81.36230265417402,"occurred":1335423600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1371495332000,"summary":"Extremely large chevron with lights that looked like stars as if it was cloaked to blend into the sky. the only way to tell it was a solid object was that the lights stay uniform and moved with great speed while blocking out the stars in between the light","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"33043","daysBetweenOccurrenceAndSubmission":417,"locationName":"Big Pine Key, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1383"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Macomb Township","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As many as 20 irregular shaped spherical object were seen moving from tree top height in an ascending path from n.W of my location to n.E. in the general direction of selfridge field. the object appeared yellow/orange and were in pairs as they moved accross my sightline. as they moved east one object would appear to accelerate and ascend ahead of the other. occassionally one of the pairs would descend and appear to hover in the east approximately in the area of selfridge field. i also observed 2-3 objects leave the pairing and head in a directly north direction while the other one in that pairing continued to move east. my wife also observed these object. i first though they may be candle bags floating, however the speed change and directional changes did not seem to make that feasible from pairs of abjects that appeared to be moving in unison and then suddenly one would appear to accelerate or change direction. also, 1 or 2 of the object decended and slowed to near hovering while the other object in the pair acsended and accelerated. i tried to photo. with my cellphone but could not pick them up: perhaps too far for the technology of a not smart phone. perhaps a kids prank but the movement just seemed a little too strange to me.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":48194,"landingOccurred":false,"latitude":42.6574332,"location":null,"logNumber":"US-06172013-0013","longitude":-82.9359684,"occurred":1371447000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1371492786000,"summary":"Multiple spherical object in groups of 2-3 moving n.W to n.E. or directly n. slight wavering motion of sphere's that were yellow/orange. speed increased as objects moved awaay in ascending path 2-3 objects moved in to a lower trajectory.","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"48044","daysBetweenOccurrenceAndSubmission":0,"locationName":"Macomb Township, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1384"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Conception Bay South","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just left my telescope in my observatory and started to go inside.I stopped and scanned the sky as i usually do.I noticed a bright light coming towards me from the west south west just above the tree line. [ let me explain the area around my house. behind my house the is a tree line, the highest part of the tree line is 40 to 50 ft.High and this high point is approx. 250 ft away from my house. this is the direction which the object came. in the front of my house approx 1 mile away there is a high hill, cliff,or small mountain approx. 420 ft. high and this is the direction which it went.] the ufo flew to the east north east. when i first noticed it i saw a bright light with a red glow around it. i first thought it was a plane, approx 5 seconds later it was a lot closer and brighter .At that point i new it was not a plane. my camera was about 14 ft. away on my dining room table, i keep my camera in a plastic bag, because of dust and dew. i had a bit of a problem getting the camera out of the bag,because of the excitement and the speed of the approaching ufo. by the time i got back outside again the ufo was almost overhead.It had gotten very bright and the red glow had gotten very large.[above i was asked if there was a shaddow, i guess there must have been a shadow becausr it travelled over me, but it all happened so fast and i was trying to get a few pictures i did not notice.]  i then had to remove the dust cap, turn off auto focus, set the lens to infinity. by the time i got the object in the viewfinder, the ufo was going away from me, over the roof of my house. i had shot 2 pictures by this time. the ufo was getting progressively smaller the further it got away from me. i ran into the patio door through the house, out through the front door onto the front deck.It was after getting very small. there was a tree  obstructing my view, i moved to my left to get a better view, but the object disappeared,behind the mountain in front of the house a few seconds later. i did not have time to get another shot.It only took 30 seconds give or take a few seconds from when i first saw the ufo and when it disappeared. the ufo was aprox. 1000 ft. high. almost all the sky was covered with light cloud, but i could see the moon clearly through it. there were patches of heavier cloud.The exposure were taken as canon raws.","distance":"501 Feet - 1 Mile","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":48193,"landingOccurred":false,"latitude":47.50716324610639,"location":null,"logNumber":"CA-06172013-0012","longitude":-52.94667520018782,"occurred":1371317160000,"potentialRelations":[],"rating":"Unrated","region":"Newfoundland and Lab","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1371492504000,"summary":"White light center with a bright redish glow around it was approx 1000 high travelling at a good rate of speed. if you want the canon raw images contact me.","tags":["light","contact"],"timeZone":"America/St_Johns","timeZoneName":"America/St_Johns","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48193_submitter_file1__UFO0001.JPG","http://www.mufoncms.com/files_jeud8334j/48193_submitter_file2__UFO0002.JPG"],"weather":null,"zipcode":"A1W4Y4","daysBetweenOccurrenceAndSubmission":2,"locationName":"Conception Bay South, Newfoundland and Lab","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1385"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Louisville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My father and i were driving eastbound on easton rd. on 6/16/13 at 9:45pm est. about a half mile from the bridge that crosses rt. 62 i noticed out my passenger window balls of light in the sky. i asked my dad, what are those? he looked out my window, which faced south, and he immediately pulled over. we stood on the side of the road and watched as 10 to 15 sphere-shaped balls of light floated what looked to be directly over the city of loeisville. some were clustered closer together than others, and all seemed to be at slightly different elevations. there was a storm just to the west of them and the clouds were very low. one by one they disapeared from left to right as we watched them but the clouds were moving faster than they were. i can't be certain if they shot up into the air one by one.  my dad felt they did.  or did they disappear one by one as the clouds overtook them.  that is not clear.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":48192,"landingOccurred":false,"latitude":40.8446809,"location":null,"logNumber":"US-06172013-0011","longitude":-81.2516519,"occurred":1371443160000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1371491184000,"summary":"10-15 round objects in sky. all disapearing into clouds in order as they flew towards the east.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Louisville, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1386"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Bradenton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was amazing when i first saw it.It was still about a minute thet it started to zig zag all over the place.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":48191,"landingOccurred":false,"latitude":27.492341322169022,"location":null,"logNumber":"US-06172013-0010","longitude":-82.5292384554404,"occurred":1368412080000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Disc,   Flash","source":"MUFON","status":null,"submitted":1371489802000,"summary":"Hard to explane.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"34208","daysBetweenOccurrenceAndSubmission":35,"locationName":"Bradenton, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1387"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Dudley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was coming home from work it was about 1am,i turned into my driveway,a long  dirt road,my house was a half mile off main road,driving down my road,i noticed a light in my rearview,in the new sub that was being built,i thought it was newly installed street lights,then the light started rising up too high to be a street light. i stopped my van got out,watched as several other lights begin to rise up from the ground level.They started moving in my direction at 40-50 feet high,they came within 200 ft.From me,i got back in my van and raced down my dirt road to my house.When i got out of the van i seen them coming.I watched them until they stopped overhead and hovered at tree top level.Unnerved, i got back in my van and drove like hell away from there back down my dirt road to the main road.In a paniced state i drove to my friends house about 3 miles away,but he wasn;t home,driving back to my house there was a orange dodge ramcharger driving like a bat out of hell,coming from the direction of my house.As i rounded the curve i seen the lights over the main road,genoa rd.The guy in the ramcharger must have seen them too..Driving about 80 mph i drove under the lights and back to my house.As i drove under the lights they started following me.When i got back to my house i could see them coming, when they came over my property i went in the house and got my guns and came back out.They were hovering over me no more than 50 ft.I could have thrown a rock and hit them.There were 7 white orbs about10-12 ft. wide.I raised my .22 rifle with a scope  and was going to shoot,when i looked thru the scope to shoot,i could see right thru them, and see the stars behind them. as i was ready to pull the trigger, a very strong calming feeling washed over me..And i felt at peace like nothing i've ever felt.I propped my gun against light pole i was standing by, and just watched them for what felt like 10 min. they started leaving, heading in a line towards the full moon.I watched until they were out of sight. when i went back inside my house i looked at the clock and it was 4:30 am.. i know what i seen could not have taking more than 45 min to an hour.Like chris bledsoe i can't explain the missing time.. ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":48190,"landingOccurred":false,"latitude":35.307781112692645,"location":null,"logNumber":"US-06172013-0009","longitude":-78.01328938950194,"occurred":329900400000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1371486967000,"summary":"Orbs followed me to my house hoverd , i drove away was followed ,came back home was followed ,they hovered at tree top ,looked thru rifle scope a calming feeling washed over me,          ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"28333","daysBetweenOccurrenceAndSubmission":12055,"locationName":"Dudley, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1388"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"North Hollywood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking at stars threw my telescope when i noticed orange ball thar moved at fast speed from north to south as it got bigger made a sharp right turn to the west got larger went at fast speeds getting larger untill it just vanished this was not a shooting star it was like an orb but moving fast throw out the south west sky ","distance":"Unknown","duration":"00:01:20","entityEncountered":false,"favorited":0,"features":"None,  Insignia","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":48189,"landingOccurred":false,"latitude":34.22182420986857,"location":null,"logNumber":"US-06172013-0008","longitude":-118.3675921034051,"occurred":1371463920000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,   Sphere","source":"MUFON","status":null,"submitted":1371477625000,"summary":"Orange ball thar moved at fast speed from north to south as it got bigger made a sharp right turn to the west got larger went at fast speeds getting larger untill it just vanished ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"91605","daysBetweenOccurrenceAndSubmission":0,"locationName":"North Hollywood, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1389"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sioux City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside the house at around 10:30 pm to find a bright object hovering in the sky. it was stationary, but flickered and looked like it was changing colors. it was very strange-looking, but i thought it might be a star. after watching it for several minutes and calling out a second person to view it, i got a pair of binoculars (7x50) from inside the house to get a better look at it. with the binoculars, i was able to see the object in much greater detail. from what i could tell, it was triangular in shape, with at least three lights (one on each side, one in the middle). the colors of these lights slowly alternated between red and white, one after the other, when seen through binoculars, but the object looked mostly white (pulsating) without binoculars. at around the same time i started watching with binoculars, the object began to move across the sky in a straight path towards us (the two witnesses). at one point during this flight, an actual plane flew under it (i think there was a lot of distance between the two). the plane and unidentified object were very different from each other. the plane, although closer to the ground, was much smaller (in apparent size). the plane went out of view much faster and the blinking lights on the plane were much clearer. the unidentified object took 2-5 minutes to fly across the sky over the house and go out of view. from what i could tell, there was no noise coming from the object. the entire sighting lasted approximately 10 to 15 minutes. planes do not hover in place for minutes at a time and stars do not fly and have blinking lights. the object was bright enough to be visible in pictures, but the detail cannot be seen, so it just looks like an an extremely bright star. video was taken but the quality is too poor to make out the object as it moved. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":48188,"landingOccurred":false,"latitude":42.5064342,"location":null,"logNumber":"US-06172013-0007","longitude":-96.3972969,"occurred":1371447000000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1371466406000,"summary":"A triangular ufo was found hovering in the sky and remained there for several minutes until flying out of sight.","tags":["ufo","hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48188_submitter_file1__ufo1.jpg","http://www.mufoncms.com/files_jeud8334j/48188_submitter_file2__ufo2.jpg","http://www.mufoncms.com/files_jeud8334j/48188_submitter_file3__ufo3.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Sioux City, Iowa","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1390"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 11:20am, pacific coast time, on june 10, 2013, i was outside in the backyard (in oregon) taking pictures of my nephew while he was playing. the day was sunny and calm. i don't remember seeing any planes or helicopters or hearing any either. today, on june 17, 2013, i was going through my photo gallery and i saw that in one of the pictures there appears to be two objects above a house roof. when i zoomed in, i couldn't identify either object. i think one might be a helicopter and the other is possibly a bird, but i'm not sure. a friend suggested that i submit the picture to an organization that might be able to sharpen the picture and bring out the details.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Unknown","flightPath":"Unknown","formattedAddress":null,"id":48187,"landingOccurred":false,"latitude":43.8101434,"location":null,"logNumber":"US-06172013-0006","longitude":-120.5525312,"occurred":1370888400000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere,   Unknown","source":"MUFON","status":null,"submitted":1371465298000,"summary":"Two ufo's in oregon?","tags":["photo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48187_submitter_file1__noahandsky.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":6,"locationName":"Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1391"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ogoki post ","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This orb was goin to fast to be a plane but seemed too close to be a satalite  it was maken absulutly no noise and we both see it  i would have never believed this becoue my son told me he saw anouther one last nite and i witnessed only one object tonight  also with my son ..\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":48186,"landingOccurred":false,"latitude":51.6584966,"location":null,"logNumber":"CA-06172013-0005","longitude":-85.9021621,"occurred":1371452400000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1371461448000,"summary":"Orange redish orb headed sw coming from ne  ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"pot 2lo","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ogoki post , Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1392"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Walking north on bowles avenue at 11:30pm. was listening to a radio program via a wireless headset through my phone 3g on youtube. my phone went in and out and my headphones lost bluetooth connection. i pulled out my phone at eye level. my phone had froze. i noticed in the corner of my eye an amber light at the treeline. a little smaller than a advil pill. it was ascending north and in a tight zig-zag flight pattern. towards ursa major. immediately i knew it was not a plane or a sattalite. nor was it the space station. this was by definition a unidentified flying object. i tried to get to my camera on my htc evo 4g but it was frozen. the flight pattern continued north but straitened out. and it also slowed to almost a halt. i sensed it would fade out. and thats what the object did. i watched it come from behind the trees to were it disapeared at 60 degrees. when you encounter a sighting of this kind your mind has trouble understanding what it is actually seeing. i did my best to stay calm and observe. the color and size of the object does not fit any description of any known plane/sattalite/ or planet. i was a witness to a fireball/meteor sighting last month here in st.Louis and made the report on a meteorlogical website. many other reports were made of that fireball sighting and that is my hope with this sighting. it was not a meteor i saw tonite. the flight pattern was amazing. i have had 3 sightings in the last two years. i made a similar report last year in anahiem california of a similar amber teardropped shaped object that ejected another orb from beneath it. the colors of these two sightings are the same. but my sighting in california was at a lower altitude. this one was very far away. i hope this information is helpful. i will keep my eye on the sky.","distance":"Over One Mile","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":48185,"landingOccurred":false,"latitude":37.9660729,"location":null,"logNumber":"US-06172013-0004","longitude":-91.8295934,"occurred":1371450600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1371460531000,"summary":"Solid amber orb. rising north with a tight zig-zag flight pattern north. slowed to a straight flight path and than stopped and faded out. ","tags":["fireball"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1393"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Graysville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was laying in driveway just looking at stars like i like to do often when large plane like object flew over me.  where jet engines should have been were large spotlights. 4-5 ft across.  two total. reminded me of headlights on a vw bug.  the aircraft as large as it was flew only yards above the trees. the craft made no sound at all. after it passed i could hear only the sound of the air being displaced. kinda like a wind.  i don't know what it was some sort of secret propulsion system being used on regular cargo type pane or what.  don't think it was alien craft but maybe a way to test alien propulsion system in disguise.  any it was unidentified an it was a flying object for sure","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Straight-line path","formattedAddress":null,"id":48184,"landingOccurred":false,"latitude":33.6206611,"location":null,"logNumber":"US-06172013-0003","longitude":-86.9713844,"occurred":1177138800000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Bullet,   Missile,   Cigar,   Other","source":"MUFON","status":null,"submitted":1371458977000,"summary":"Saw what looked like commercial airliner but where jet engines shout be was huge spotlighted aircraft was only 20 feet above trees could see details besides the huge lighted what struck me as odd was no sound only sound heard was air displacement","tags":["sound","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"35073","daysBetweenOccurrenceAndSubmission":2249,"locationName":"Graysville, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1394"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Miamisburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"One afternoon in late august of 2004, i was with a friend in miamisburg, ohio. i was sitting in a parking lot waiting for her to come out of a vets office, when i noticed a faint flash above the tree tops. i watched for a few seconds, thinking it was just a signal tower due to the color, i went back to listening to the radio. a few moments later i was looking into the trees when i saw the flash again, i looked up and realized the flash was a little to the left of where i saw the first. i starred up over the trees and noticed yet another flash to the right and down. that's when i realized there where no tower connecting the lights vertically. while waiting i witnessed flashing coming from six different positions, roughly 15-20 seconds apart, this continued for a good 10-15 minutes. it eventually just stopped and i continued watching until she came out and waited a few moments after just to show her, but no lights. i've tried contacting her a couple of times to get the exact location of the office, and the date, but she stopped talking to me shortly after the event.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":48183,"landingOccurred":false,"latitude":39.6452362,"location":null,"logNumber":"US-06172013-0002","longitude":-84.2815683,"occurred":1093730400000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Flash,   Unknown","source":"MUFON","status":null,"submitted":1371458858000,"summary":"Pulsing lights over miamisburg ohio","tags":["contact","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":3214,"locationName":"Miamisburg, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1395"},{"address":null,"addressResolution":null,"altitude":"Treetop, Unknown","city":"While taking the I-5N exi","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving home from a bbq in portland, or just after midnight saturday june 15, 2013. my son was sitting in the front passenger seat and witnessed with me. he asked me what it was.  i slowed the car down as i was taking the exit to i-5 north the other cars slowed down, it was late so not many cars out. i first thought a helicopter but it was much larger and did not have propeller or wings. it had circular green lights and violet flashing lights.  it was very close to us about 100 feet away(?!?)  i am drawing a picture of what i saw. i then thought possible military vehicle?  it was flying in a figure 8 pattern then hovered over the water. then i kept driving wishing i would have stopped longer...Ugh. what is this?  ethereal experience. ","distance":"21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":48182,"landingOccurred":false,"latitude":43.8125334,"location":null,"logNumber":"US-06172013-0001","longitude":-120.5447912,"occurred":1371279600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1371455800000,"summary":"At first i thought it was a helicopter but it was too large and did not have any propellers/wings.  no noise.  windows down in car. my 10 year old son witnessed with me while driving. it felt surreal...No sound. and hovering like motion.  very close to us","tags":["sound","hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"While taking the I-5N exi, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1396"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Appleton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside at 12:35am to take out recycling. noticed bright red object above my building flying from west to east slowly. at first i thought it was a plane but after watching it i knew it wasn't. had no plane lights. it brightened from bright bright red to dim orange in a non specific pattern. i looked away for a second to throw recycling away in the bin & was gone. no clouds. no sounds. just vanished. very strange.","distance":"501 Feet - 1 Mile","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":48181,"landingOccurred":false,"latitude":44.287901,"location":null,"logNumber":"US-06162013-0024","longitude":-88.38786,"occurred":1371366000000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Fireball,   Star-like","source":"MUFON","status":null,"submitted":1371452067000,"summary":"Red pulsating glowing object floated slowly across sky then disappeared","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"54911","daysBetweenOccurrenceAndSubmission":0,"locationName":"Appleton, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1397"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop, 500 Feet or Less","city":"Howell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As i remember i was 20 or21 yrs old maybe 1994 95 the reason im trying to cantact mufon is because i have finally heard accounts similar to what i saw . there is a decent amount of woods behind my parents house one night i went out into backyard  i noticed many little lights clustered out in the woods like little search lights like they were looking for something. i was trying to figure out what was the lights were just above ground level. suddenly i felt a terrifying feeling that whatever these things were it became aware i was watching it and the lights suddenly rose traveling out and up of the trees.I turned and began to run when something zapped me i was paralyzed and what seemed like something was just over my head i had to look at it it flashed many different symbols into my eyes.The beam for lack of a better word let me go i turned and ran as i was running toward front of house i remember stepping or knocking over a bucket of water in back yard, the next morning when i woke up my one sock was wet i went out in the yard and found bucket on side i felt crazy i thought i had a dream but my sock was wet and it was right where i remember (the bucket) i don't remember exact symbols flashed at me.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path","formattedAddress":null,"id":48180,"landingOccurred":false,"latitude":40.1645785,"location":null,"logNumber":"US-06162013-0023","longitude":-74.2082671,"occurred":765529200000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Fireball,   Flash","source":"MUFON","status":null,"submitted":1371451785000,"summary":"Multiple lights in woods  rose up through trees then flashed images into mind lights ","tags":["lights","ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"07731","daysBetweenOccurrenceAndSubmission":7012,"locationName":"Howell, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1398"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Collegeville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were on our way back home from a cousins graduation party in collegeville. we were on our way to the pa turnpike. it was aproximantly 9pm. we were on pa 422 heading towards king of pursia when myself and my passengers saw these lights. between mm 179 and 189. four at first, then we say that one was a helicopter. the helicopter was flying by it. the three lights were circular and were in the shape of an obtuse isosceles triangle. they were white/yellow. they were not blinking like the nav lights on the helicopter. it seemed as if they were attached to some sort of an aircraft. but after seeing them for a few minuetes(aprox. 4min) the lights just disapeared. the were there one minuete and gone the next. \r\n\r\ni dont think this has anything to do with this but we did see 2 military convoys on our 300 mile trip. both were in that area (within 75 miles). \r\n\r\ni think that they were well over 3000 feet in the air. at that height the aircraft seemed to be extremly large. from one corner light to the other light it seemed to be aproximatly 1 1/2 to 2 feet viewed from our car. where as a 737 is only like 9 inches. it was probably a foot wide. it was a very large objeect.    \r\n\r\n1. on pa 422 heading towards the pa turnpike\r\n2. i saw them and just thought what the hell is that\r\n3. at first i thought it was stars, but after a second i realized that that would've been impossible because they were low\r\n4. the round lights, white/yellow in color. stationary for upwards of 5 minuetes or so, then disapeared all at once\r\n5. it freaked me out seeing it. i knew it wasn't an aircraft that i have seen (im a airort buff, and soon to be an aviation electronics technican and it didn't look like anything i have ever seen)\r\n6. it disapeared","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":48179,"landingOccurred":false,"latitude":40.1489502,"location":null,"logNumber":"US-06162013-0022","longitude":-75.4608352,"occurred":1371355200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Circle,   Triangle","source":"MUFON","status":null,"submitted":1371451769000,"summary":"Three lights hovering over pa422 between mm 180 and 188 going towards king of pursia","tags":["lights","triangle"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Collegeville, Pennsylvania","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1399"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Fairfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1: we were in the mountains near the methodist camp sitting around the fire. \r\n\r\n2: i was looking for satellites or shooting stars, and noticed a bright star moving very quickly across the sky.\r\n\r\n3:  i thought it might have been the international space station.\r\n\r\n4: the larger star-like object was moving in a straight line across the sky followed by a smaller dimmer star-like object. both were following the same track across the sky, never deviated from distance between each other, was to high and fast to be any aircraft.\r\n\r\n5: was very curious about the objects and what they were doing or what it could be.\r\n\r\n6: the objects passed across the sky behind the mountain.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":48178,"landingOccurred":false,"latitude":43.3465675,"location":null,"logNumber":"US-06162013-0021","longitude":-114.7917279,"occurred":1371193200000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1371451400000,"summary":"Bright star-like orb followed by dimmer star-like orb","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Fairfield, Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1400"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Kitchener","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approximately 9:15 pm on saturday, june 15, 2013, my fiance and i were in an apartment on heritage street in kitchener, ontario when i looked out my southeast-facing balcony to see two bright, red-orange balls of light - one slightly in front of the other - moving from the treeline at the horizon to 15-20 degrees from us. the first thing i noticed was their speed and silence. then, they rotated slightly counter-clockwise and wavered towards each other, so close that their lights almost appeared to touch. they seperated again slightly, and hovered in place. by this time my partner and i were both on the balcony, watching, and then we saw 2 more of the same lights coming from south (rather than southeast), heading towards the first two. it was at this time the first two objects dimmed their lights (or perhaps, rotated the beam away from us) and we clearly saw them as being pitch black, perfectly spherical orbs. we did not see any details like wings, propellers, a tail, etc. they did not leave any trail of light nor did they have a corona. they moved more quickly than airplanes, and occasionally seemed to 'zig-zag' very quickly instead of flying in a perfectly straight line. their movement was especially fast when the first two orbs adjusted their position before hovering.\r\n \r\nin formation, the orbs abruptly stopped hovering in place and ascended straight up, to be quickly lost in the cloud cover.\r\n\r\ni would guess the orbs to be about the size of a helicopter, but it is hard to judge. \r\n\r\nwe called the waterloo regional airport (close by, southeast of us as well) and asked them if they knew anything about the aircraft, and after holding for a short time, the answer we got was a big no. ","distance":"101-500 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":48177,"landingOccurred":false,"latitude":43.45355917898713,"location":null,"logNumber":"CA-06162013-0020","longitude":-80.41703517912825,"occurred":1371356100000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1371450951000,"summary":"Four black orbs with orange-red lights moved, in pairs, from horizon to join in formation; hovered; turned off/dimmed lights, flew straight up as unit into clouds.","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Kitchener, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1401"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Reedsburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was working in reedsburg at the time. a friend of mine from work and myself where on the back roads on the ridges between reedsburg and loganville. he was driving and i noticed three green fluttering lights in the sky. we both observed them as we drove and at first thought that they were aircraft. they moved in relation to each other as if they were in perfect flying pattern or they were lights fixed to the same object. after observing them move it became apparent that it was something different. they would move slowly together but at what seemed to be random moments they would dart across a third of the nights sky in a blink of an eye and leave a green trail when it did the trail would slowly fade from the intensity of the lights themselves to nothing. the lights would rotate standing still but not leave a trail nor would it leave a trail when moving slowly through the sky. we drove for a half hour and we would lose sight of them and regain sight in a part of the sky we weren't expecting them to be in. finally as we were headed back to work they took off in a moment of a fraction of a second and all we could see was a fading green trail going out of our line of view of the sky. we weren't scared or anything like that. it seemed to be a long way away high in the sky we couldn't make out a vessel or anything it was just lights. i was excited to experience something not easily explained. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change,Other","formattedAddress":null,"id":48176,"landingOccurred":false,"latitude":43.5324809,"location":null,"logNumber":"US-06162013-0019","longitude":-90.0026259,"occurred":1244779800000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1371450841000,"summary":"Green lights fluttering a ways off in the distance left trails when they moved. moved in pattern realtive to eachother","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"53959","daysBetweenOccurrenceAndSubmission":1466,"locationName":"Reedsburg, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1402"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Millsboro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I believe it was may of 2008.  at that time i lived in the longneck area of millsboro, delaware within view of the indian river.  directly across the street was a large swampy wildlife preserve with the river directly beyond.  the swampy area contained water deep enough for a kayak, and during a heavy rain even developed white caps.  really a lovely view from our third story deck.  i often liked to go out on the deck to watch the stars.  after living close to philadelphia for so many years, complete darkness to observe the stars was a joy.\r\n\r\nthis particular night i was looking at the stars when suddenly, and i do mean suddenly, a beam of light came out of the night sky and shone on the swamp directly in front of me.  one second no light, the next a bright white light.  our complex was primarily owned by summer folk and they hadn't arrived yet, usually after memorial day they would descend like locusts.  therefore, there were no other townhouses occupied at that time on our street.  we were one of the few year-round residents, hence total darkness.  there was absolutely no sound and no sight of where the light was coming from.  the light covered an area of approximately thirty feet in circumference, coming from an elevation of approximately 200 feet, and was perhaps 100 feet or more in front of me.  i think i was in disbelief for quite a while, then in awe, then wanting to call my husband two stories below to come look, but afraid if i turned away it would be gone.  so i stood tranfixed for about 20 minutes and the light never faultered it's position.  then it was gone, like someone had turned off a switch.  still no sound.  my immediate thought was i had a ufo experience, and i still believe that.  i don't tell too many people about it though.  don't really want to get measured for a white jacket.\r\n\r\ni told my husband the next day and while he listened politely i could tell he thought i'd lost it.  however, that night it was back and i did call him to look.  he was dumfounded.  it only lasted perhaps ten minutes that night and i never saw it again.  i have no evidence, only my experience which i will never forget.\r\n\r\ni was watching a program tonight about a woman who lived near willow grove, pennsylvania in 2008, her sighting, and the ensuing mufon investigation.  it was the beam of light she described that caught my attention and compelled me to send mufon the account of my experience.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":48175,"landingOccurred":false,"latitude":38.60503272104486,"location":null,"logNumber":"US-06162013-0018","longitude":-75.11164506929151,"occurred":1211958000000,"potentialRelations":[],"rating":"Unrated","region":"Delaware","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1371450789000,"summary":"Spotlight-like beam shining down to swamp area across from home ","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"19966","daysBetweenOccurrenceAndSubmission":1845,"locationName":"Millsboro, Delaware","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1403"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Dearlodgepark","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"30 yrs ago i was harrased by some sort of flying energy,and to this day i remember it like it was yesterday!I can tell u that this was not the first time that ive seen this thing ,but it usualy would bounse around the back side of mountains and hills,peeping over and disapeering just as quickly. strange but i always shruged it off as itermitten lights ,airplanes,hellys u know anything,at night .In the air.But this hot summer night,this thing i guese decided to make its presence known.Everyone should know ,be aware ,the highdesert is a beautiful place,at night be careful!Be very careful!!!","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":48174,"landingOccurred":false,"latitude":36.787121,"location":null,"logNumber":"US-06162013-0017","longitude":-119.4141624,"occurred":228478200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1371448624000,"summary":"Thought it was somebody with lantern,then it ascended about 500 feet above us and hoverd","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":13228,"locationName":"Dearlodgepark, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1404"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"St. Petersburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I go to a chick fil a for lunch and take it back to a open field by st. pete/clearwater airport to eat and watch planes take off and land. it was a typical summer day with puffy clouds. i saw a cloud that was kinda vertical. a small shiny orb like object flew out and back into the cloud. it popped out many times popping out a little higher than before. i took off my sun glasses and looked again, i rubbed my eyes and looked again, and i finally accepted that something was popping in and out of the clouds. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":48173,"landingOccurred":false,"latitude":27.7771356,"location":null,"logNumber":"US-06162013-0016","longitude":-82.63692,"occurred":1245179700000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1371447993000,"summary":"Small shiny orb flying in and out of clouds","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48173_submitter_file1__UFOpic.jpg"],"weather":null,"zipcode":"33760","daysBetweenOccurrenceAndSubmission":1461,"locationName":"St. Petersburg, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1405"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Ottawa","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Saturday, june 15, 2013, around 8:50pm.\r\nvisibility was unlimited with scattered clouds coming in from the west.\r\n\r\ni was westbound on st joseph blvd leaving orleans. coming over the hill heading toward bearbrook rd, i noticed a single bright stationary light (too bright for aircraft landing lights) below a small cloud in the western sky. after about 15 seconds it suddenly increased altitude at a fixed speed at a 70deg northerly angle and in about 2 seconds disappeared in the small cloud. it did not reappear above the cloud.\r\n\r\nwhen i got home i checked a weather website to verify the cloud ceiling (2850m). i then roughly sketched what i saw and used digital calipers to estimate the altitude of the ball of light (approx 2600m). based on the altitude and distance the ball of light traveled (approx 300m), i estimated the speed of climb at around 500kph (300mph).\r\n\r\non june 16 i did a web search for ufo sightings for the 15th and there were a number of sightings reported for that day.","distance":"Over One Mile","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":48172,"landingOccurred":false,"latitude":45.4255596,"location":null,"logNumber":"CA-06162013-0015","longitude":-75.6881931,"occurred":1371354600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1371447080000,"summary":"Hovering ball of light suddenly climbs and disappears in a cloud","tags":["light","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Ottawa, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1406"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Daaden","country":"Germany","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking up the sky at night and starting a ce5.\r\nit worked. after a few minutes i saw three different ufos in a five-minute-tact.\r\ni do this every night. \r\nit's an amazing feeling to have contact with extraterrestial beings.\r\n","distance":"Unknown","duration":"00:03:02","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":48171,"landingOccurred":false,"latitude":50.7439155,"location":null,"logNumber":"DE-06162013-0014","longitude":7.9710263,"occurred":1371452400000,"potentialRelations":[],"rating":"Unrated","region":"Rhineland-Palatinate","reportedWeather":null,"shape":"Disc,   Star-like","source":"MUFON","status":null,"submitted":1371437904000,"summary":"Amazing!","tags":["none"],"timeZone":"Europe/Berlin","timeZoneName":"Europe/Berlin","tweeted":0,"urls":null,"weather":null,"zipcode":"57567","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Daaden, Rhineland-Palatinate","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1407"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Grayson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"About 9:50pm sat. evening,  i stepped outside my house to find my step ladder on the north side of my garage.  my son (22) and daughter (26) were in the pool on the south side of the house. i notice three bright orange lights in just west of me as i faced the moon. they slowly moved south to north in a near line. my kids saw five, my view was partially blockedy by trees.  the last three just disappeared acording to the kids. i saw the second one change immediate direction and go up at incredible speed, looking more like a dull white star as it became smaller and disappeared.  i came around the house and the kids were ecstatic to inform me of what they saw and i comfirmed it!  has anyone else reported these bright orange balls of light? the balls of light did not make noise, nor did they have aircraft navigation lights, red, green, or white. my daughter is a dentist and my son is a computer programmer. poor quality cellphone photo.  thanks,  dr. roger fannin","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":48170,"landingOccurred":false,"latitude":38.32718026520147,"location":null,"logNumber":"US-06162013-0013","longitude":-82.89377034037734,"occurred":1371358200000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere","source":"MUFON","status":null,"submitted":1371428811000,"summary":"Five bright orange orbs of light noted by 3 adults, three disappeared and one change color and direction at incredible speed and disappeared.","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"41143","daysBetweenOccurrenceAndSubmission":0,"locationName":"Grayson, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1408"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Quilmes","country":"Argentina","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Como todo el ao siguen los avistamientos- la camara capta esferas luces objetos voladores- afectando casi siempre la electricidad\r\n","distance":"Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":48169,"landingOccurred":false,"latitude":-34.7217846,"location":null,"logNumber":"AR-06162013-0012","longitude":-58.2484664,"occurred":1370286000000,"potentialRelations":[],"rating":"Unrated","region":"Buenos Aires Province","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1371427906000,"summary":"Avistamientos de esferas y luces","tags":["none"],"timeZone":"America/Argentina/Buenos_Aires","timeZoneName":"America/Argentina/Buenos_Aires","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/48169_submitter_file1__sillonpoltronarelaxreclinablecueronuevodiva.jpg","http://www.mufoncms.com/files_jeud8334j/48169_submitter_file2__DSCN5594.JPG","http://www.mufoncms.com/files_jeud8334j/48169_submitter_file3__CopiadeDSCN5716.JPG","http://www.mufoncms.com/files_jeud8334j/48169_submitter_file4__DSCN5430.JPG"],"weather":null,"zipcode":"1879","daysBetweenOccurrenceAndSubmission":13,"locationName":"Quilmes, Buenos Aires Province","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1409"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Groveland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Sleeping on porch, opened eyes at approx. 200am when i saw round object with aprox 16 lights about 6' away. i got the feeling it was looking through my body, it gave me goose pimples. the object stayed in same position for about 40 seconds and vanished.","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":48168,"landingOccurred":false,"latitude":37.81181914246938,"location":null,"logNumber":"US-06162013-0011","longitude":-120.22091714202382,"occurred":1342386000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1371424475000,"summary":"Saw round socker ball shaped object with approx 16 lights","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"95321S","daysBetweenOccurrenceAndSubmission":336,"locationName":"Groveland, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1410"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1319}
