{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Memphis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Massive object very colorful. i've been seeing such objects for the last week. and truing feel there watching over +++ to me it's just another revealing of how great our god is. i have to say to me it make complete sence to what was said in the lost books of the bible. biblical epic of (ezekiel)>>wow interesting!! i say now i beieve 100% and  just so everyone knows jesus is the bright morning star!!!!This all has taken place where i live","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22677,"landingOccurred":false,"latitude":35.1537343,"location":null,"logNumber":"US-04062010-0015","longitude":-90.0472001,"occurred":1270542000000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Disc,   Triangle","source":"MUFON","status":null,"submitted":1270613664000,"summary":"A feeling of peace( true peace of mind )","tags":["none"],"timeZone":"America/Kentucky/Monticello","timeZoneName":"America/Kentucky/Monticello","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Memphis, Tennessee","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:135411"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Palm City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching tv in living room and my son and nephew where in his bedroom playing n the computer. \r\nhe called me and said \"dad come look at this\". \r\ni looked out his window to see a very large black triangle with white lights at the corners heading west. it appeared to be moving about the same speed as  normal aircraft.  we do have some clouds in the sky and it was well below the cloud cover.  if i had to guess , i would say it was at around a 3,000 ft altitude.  i lost sight as it went behind other buildings \r\ni did not hear any noise , but my son said he heard a hum (thats what made him look). \r\ni am ex-military and a frequent flyer and i have never seen anything this large in the sky. \r\n","distance":"501 Feet - 1 Mile","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":22676,"landingOccurred":false,"latitude":27.1678268,"location":null,"logNumber":"US-04062010-0014","longitude":-80.2661591,"occurred":1270612500000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1270613528000,"summary":"Large black triangle","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Palm City, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:135412"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Delray Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My boyfriend and i watched as 2 round orangish red glowing objects followed each other from the north and curving to the west within a minute of each-other. my neighbors also saw the same objects. it was aprox 8:30 pm.\r\nthis is the 2nd time we watched these objects, the 1st time was december 21st at 6:15-6:30p.M. we were standing in our back yard and these reddish glowing objects moved from the north to the south a couple of minutes a part. our other neighbor saw it go over our house. each time there was no noise, they were quiet, if we had not been looking up we wouldn't have noticed them.\r\nthey don't fly fast just steady. \r\nthe first time in dec when they flew over the house, it was over cast but i could see like a metallic underside with what i thought at first was the fire from a hot air balloon but when we got our binoculars out we saw it wasn't a hot air balloon. we just watched as they disappeared in the distance. \r\nnot sure what it was.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":22675,"landingOccurred":false,"latitude":26.4663525,"location":null,"logNumber":"US-04062010-0013","longitude":-80.0635001,"occurred":1270135800000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Oval,   Sphere","source":"MUFON","status":null,"submitted":1270613294000,"summary":"2 fiery glowing orange(ish) red round objects","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Delray Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135413"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Ranger","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had 2 previous ufo sightings in a 8 day period.We knew activity was high and we headed up to the hilltop at the end of vivian street in ranger,texas.In hopes of catching another glimpse we were prepared with our gear which included an 250 mw green laser and digital camera.We wanted to test the area around the lights to see if space was being distorted.In other words to see if the green laser beam would bend toward the craft and indicate the use of a gravity generator or worm hole technology.We shined the green laser far into the night sky.Over a 30 minute period we saw many aircraft in the area.A couple of military jets flew overhead.We commented on the likely hood of not seeing anything with jets in the area.Ten minutes after the passing of the jets and continued use of the green laser to attract attention to ourselves we werent seeing anything out of the ordinary.My friend noticed something about 1/2 mile away above the tree line that had snuck upon us.It had a series of 5 lights.The light on the far right seemed to flicker and electrical sparks seemed to be coming from the area of the far right.I pulled the green laser out and made a circle around the craft.The laser light did not distort but could not be seen shooting past the object.I was tempted to put the laser directly on the craft but had second thoughts about how that might be taken.I struggled to pull the camera out of my pocket and the craft and lights simply disappeared before the lense opened.No great loss. there are enough crapy ufo pictures of lights in the world.We are excited about the laser test.We are trying to figure out if distorting gravity would alter light projectory.Probably not.The use of worm hole technology not indicated in our test.","distance":"501 Feet - 1 Mile","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":22674,"landingOccurred":false,"latitude":32.4730922,"location":null,"logNumber":"US-04062010-0012","longitude":-98.6708077,"occurred":1267763100000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1270608700000,"summary":"Eastland county ufo suprises ufo watchers","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":32,"locationName":"Ranger, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135414"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Joplin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I received this e-mail on 3/34/2010: \r\n\r\nsuject: ufo sighting 10-2-2009\r\n\r\nhi i live in joplin,mo @ approx: 716pm i was standing outside looking up due east south east . my mom and i saw a dimly lit amber colored large delta/v shaped object fly about 1500' agl. and it was flying from south to north at i estimate 200 mph. it was in view for about 10 to 15 seconds! it made no noise at all! and it had a reflective quality about it. \r\n\r\ni'm disabled, a us army veteran, and a civilian parachute rigger and ex-skydiver. we are approx 4 miles from the joplin airport it couldn't have been a conventional aircraft? no noise from object at all! \r\n\r\ni know what meteors look like i know every civilian aircraft and military aircraft by recognition. i know what i saw wasn't normal! thx \r\n(name and address omitted)\r\n\r\nhave attempted to contact this person via e-mail but so far he has not responded.  margie kay","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22673,"landingOccurred":false,"latitude":37.0889271,"location":null,"logNumber":"US-04062010-0011","longitude":-94.504511,"occurred":1254536160000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270603483000,"summary":"Amber color large delta object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":185,"locationName":"Joplin, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135415"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Johnstown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 11:28 pm i was sitting in my sunroom. animals began to bark, chirp, whatever noise they make, their sound filled the area. i live on top one of the mountains so i have a great view down into the city and over to the horizon. high up in the sky i saw a strange electric cloud, it looked like a cloud shadowed the moon because it was very bright but the moon was nowhere around the area. i was facing south at the time and with the animals still going crazy, there appeared a three-pointed object with lights at each point. i am partially colorblind, but the colors seemed to look like greenish blue, or even a yellow purple, i really can't explain the color. i stared at object which seemed to appear over the horizon near the galleria mall / airport area. the object hovered for about 20 seconds, there were no blinking lights on it, so i knew it wasn't normal. it suddenly after 30-40 seconds disappeared into another cloud of what i can only explain as electricity. the cloud was amorphous and very jelly-fish like, long and whispy strings with a type of density. the animals stopped barking and the object then reappeared, closer to me than before. it moved very slowly from east to west then it stopped again then it started to move very fast past my field of vision. i ran through the house, out the front door and watched it fly quickly overhead towards the west. it made a strangely low humming noise and buzzed by me very quickly then it disappeared suddenly. i went back to the sunroom and sat down very confused. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":22671,"landingOccurred":false,"latitude":40.3280307,"location":null,"logNumber":"US-04062010-0009","longitude":-78.9128698,"occurred":1270191600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Diamond,   Flash,   Triangle,   Other","source":"MUFON","status":null,"submitted":1270581302000,"summary":"Cloud-like appearance in the sky followed by a hovering triangle. ","tags":["triangle","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":4,"locationName":"Johnstown, Pennsylvania","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:135416"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Navarre","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was 18 years old when this event happened. it was during the summer of 1990. i was alone, bodyboarding out in the gulf of mexico when i saw an object appear over the horizon. as it moved closer in my direction, i became a little nervous and swam to shore. i watched this thing come within 20 to 30 feet from the shoreline. it wasn't your typical looking ufo you read about or see in the movies. it was only about 4 feet wide and 5 feet tall. it resembled a small outdoor air conditioning unit. the sun reflected off of it and the cover or shell of the object was spinning as it hovered just above the water. as i recall there were at least three other witnesses. we watched this object zig zag over the water for approximately 10 minutes until we could no longer see it as it headed back out into the gulf. my guess is that it was probably something the air force was experimenting with. some air force guys probably got a good laugh watching us dopes standing on the beach freaking out. ","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22670,"landingOccurred":false,"latitude":30.4202442,"location":null,"logNumber":"US-04062010-0008","longitude":-86.9058317,"occurred":644137200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Cone,   Oval","source":"MUFON","status":null,"submitted":1270577652000,"summary":"Small object hovered just above the gulf of mexico within 20 to 30 feet from the shoreline of navarre beach.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7250,"locationName":"Navarre, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135417"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Yoakum","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were enjoying good friday with family south of yoakum, texas. my husband and his son and our grandchild spotted what they thought was a vehicle traveling along the upper ridge of the property. immediately we jumped into the car and went to see the object thinking it was a red vehicle. there was no vehicle in sight and there were no gates that a vehicle could have gone through....The \"vehicle\" dissappeared quickly and there were no signs of tire tracks ....After considering this scene i began to consider a ufo as i have been studying them for awhile now....\r\n\r\nanother story: my father-in-law [long time deceased], early 1900's was walking home from hunting [late at nite]...He was approached by bright lights and was knocked out so to speak...When he awoke his eyebrows were burned and the hair on the dog that was with him hair was burned....The dog frightened, must have jumped across his lap and you could see the \"burned\" area on mr. barre's britches where the frightened dog laid across his legs during this encounter. this man was a very upright man in the community, never drank, and very well respected.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22669,"landingOccurred":false,"latitude":29.2877469,"location":null,"logNumber":"US-04062010-0008","longitude":-97.151931,"occurred":1270191600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270569648000,"summary":"We spotted an object that we thought was a vehicle...Red in color, looked like a gas tank on back.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":4,"locationName":"Yoakum, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135418"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ranger","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went just outside my home to let my dog outside and because of its brightness, i noticed a very bright, intense amber-colored light about 20 degrees off the horizon in southwestern sky around 2110.  i tried to tell if the light was a nebula or star, but realized there is no nebula or star that is this low to the horizon.  the light did not move.  it remained on for about 10 seconds after i spotted it, and then it suddenly blinked out, like a light switch turned it off.  i kept looking at the spot i had seen the light, and then it reappeared in about 2 seconds, only it had moved (horizontally) in what appeared to be a northerly direction, the distance of about 1 foot from my line of sight, remaining at around 20 degrees from the horizon.  the light remained on for about 10 more seconds and again suddenly blinked out as it had before.  (there is no way i can explain exactly how far it actually moved).  i left the area to get my video camera and videotaped the area of sky for the next 10 minutes, but it never reappeared.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":22668,"landingOccurred":false,"latitude":32.4746222,"location":null,"logNumber":"US-04062010-0007","longitude":-98.6718976999999,"occurred":1270527000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270569348000,"summary":"Light in sky, suddenly blinked out and reappeared in another area within seconds.","tags":["video"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ranger, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135419"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pittsfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am a 3rd shift security guard [at what used to be ge] in pittsfield, massachusetts.  i was on my nightly security tour of the buildings, and not too long after i started i decided i was going to have a cigarette on the second floor roof.  i was finished with my cigarette and decided to do a bit of star-gazing for a few minutes, and almost immediately as i looked up at the sky, a dark orange object caught my eye.  it came from the south-west end of the sky, which i should add that from where i was standing the horizon was covered by another nearby building so i couldn't tell you if it came from behind the mountains, but was moving north-east in a straight line.  i know my coordinates in every building only because i am required to when reporting \"discrepancies\", so i know for sure it was moving south-west to north-east.  being on 3rd shift for over a year and a half now, i have seen many shooting stars and know that every single shooting star i've seen was followed by a streak and was bright.  i've even noticed a streak lingering in the sky immediatly after a shooting star has passed when i failed to see it before it had burned out, so there is absolutely no doubt in my mind that what i saw was not a shooting star - it was not bright and had no tail.  \r\n\r\nwhen i first saw the object, i initially thought it was a shooting star, until i noticed that it wouldn't fade away and was way too slow.  while tracking it through the dark sky, i was following it with my head, and when i turned a street light sort of screwed up my night vision so i thought i saw it fade away.  i lost sight of it for a good second, but sure enough, there it was again.  i watched it for probably another good, long second or two until it went behind the mountain-line.  \r\n\r\nthe one thing in particular that stood out to me at first was its pace.  i had never seen a shooting star move that slow nor a plane move that fast.  it went completely from one side of the sky to the other in about 5 seconds - if not less.\r\n\r\nonce it was out of sight, i had a second to re-think about what i just saw and that's when i felt the fear in the pit of my stomach make me almost feel ill.  i actually almost felt like i needed to run away or cry or something, but under the fear was a lot of excitement as well because i have been a long-time believer in ufo's.  so as for my reaction, i was very shaky and giddy at the same time.  \r\n\r\nafter calming my nerves for a few minutes (while still searching the skies to maybe see another) i called and woke up my girlfriend to tell her, and as it is she already has nightmares about aliens taking her off into space and harming her, so she wasn't too happy about me calling her at almost 2:30am to tell her that her worst fear just flew over my head.  \r\n\r\nlast words:  \r\n\r\ni wasnt paying attention to the time, but i just checked my cell phone and it says that i last called my girlfriend at 2:29am, so it must have been around 2:25 when i saw it.\r\n\r\nit was not a dot in the sky, it was too big to even look like a star.  and i also feel like it wasn't traveling that high in the sky, maybe a few thousand feet, but that's just an estimation.  it was a dim orange color, but i guess you could say it was illuminated or how else would i have seen it. \r\n\r\nno shape-shifting, no getting darker or brighter, and no changes of direction - just a straight line from point a to point b.\r\n\r\np.S. i called the pittsfield police dept. just to see if anyone else might have reported it, but nobody did..","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":22667,"landingOccurred":false,"latitude":42.4516845,"location":null,"logNumber":"US-04062010-0006","longitude":-73.2377624,"occurred":1270545960000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1270558211000,"summary":"Darkish orange, not very bright.  too slow to be shooting star and did not fade","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Pittsfield, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135420"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I checked out a story on my cell phone that the moon was at it's biggest, so i went to the window to check out the moon, which was setting over nj over the hudson river from my perspective. i see planes taking off in the distance all the time from nj, helicopters fly by all the time, but this was wierd and amazing at the same time. \r\n1- a bunch of lights were coming in right under the moon, they were special because they were not only bright, but were sort of high definition, when i see plane lights they are not as bright and kind of fuzzy. this was extremely bright, and when they shined they shined with a triangular hi def, super clear shine, so it got me watching. \r\n2- it was big and long, as it was coming in towards me towards the river, i realized it had to be as big as two 747's end to end at least. it came in with descent speed, and then slowed down, and hovered. that killed the some type of massive plane idea, and destroyed the some type of helicopter idea for two reasons. it hovered motionless for fifteen minutes, flashing it's lights in a few different sequences, pretty to watch, freaky to think what if it knew i was watching. it had way more lights than any plane or helicopter.\r\n3- after the whole, then calming and nice, now spooky and wierd, light show, for fifteen minutes, it slowly started to move north. i mean slowly. the thing was inching, perfectly level, helicopters tilt, period. this thing was beautiful, didn't tilt, and had me so amazed, i freaked myself out for weeks.\r\n4- it dissappeared behind my neighboring building, and i waited to see if it came back, i was feeling way to good for some reason, i mean i felt super calm, whatever. maybe it was like a mosquito staring at a light, i don't know. wierd wierd ideas were going through my head, whatever.\r\n5- while waiting about three to four minutes after it had dissappeared two helicopters flew in from the south, stopped exactly where the thing was, and they hovered there for about three minutes, and then flew back south. the two helicopters side by side were tiny in comparison.\r\nremember this was after the helicopter and the plane crash fiasco, so radar must be very good.\r\n i now own an hd video camera just in case. now i have to pay it off. :) i know taking pictures of something like this is rediculous, i bought my first camera after seeing a football shaped object over the world trade center in 1990, it hovered for 45 minutes, and got to check it out with my binoculars. that one had lots of little lights on it almost like a led display, but way brighter, with a matte black skin which absorbed light, that one sped up, zigzagged, and went straight up, wierd thing was it hovered right over wtc, for 45 minutes before that, both my brother and i were trying to guess what it was, it definitely was not a blimp, i've seen the blimps around here, they can't hover like these things can.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":22665,"landingOccurred":false,"latitude":40.7242828,"location":null,"logNumber":"US-04062010-0004","longitude":-74.0028331,"occurred":1264838400000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Disc,   Other","source":"MUFON","status":null,"submitted":1270553253000,"summary":"Object with at least 15 to 20 white and red lights, the size of at least 2 747's in length","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":66,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135421"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cisco","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approximately 8:30-8:35 on the night of march 31st, i was driving south on hwy 183 between breckenridge and cisco.  i was in eastland county about 6-7 miles northeast of cisco when white lights appeared suddenly to my southeast and caught my attention.  my view of the lights was somewhat obstructed, but the lights appeared to be stationary and in a wedge shaped formation (orientated as an inverted v or ^).  they were located to the east of 183 and to the south of 112.  after about two seconds the lights disappeared.\r\n\r\ni had traveled about another quarter of a mile when i saw a short flash of white light traveling upwards at an angle.  my view was obstructed by trees.  this light was very low to the ground, lasted for less than a second, and was almost directly to my east and closer to the highway.  \r\n\r\nafter i had gone a little further down the highway, a line of white lights appeared in the same relative position of where i had saw the wedge of lights.  the lights came on simultaneously and went off simultaneously after about a second or two.  they appeared to be stationary, in a perfectly straight line, and evenly spaced.  my view of this line of lights was unobstructed.  it is my opinion that this line of lights was the left side of the wedge.  \r\n\r\nover about the next mile, i saw a single white light appear twice, each time for about a second.  i then saw three white lights appear simultaneously.  they were stationary for about a second, then very quickly turned counterclockwise about a third of a turn and disappeared.  these lights were almost directly east of my position and close to the highway.  \r\n\r\ni have never before seen anything unexplainable.  these lights were unexplainable.  i had my cruise control set on about 66-67 mph and i did not speed up or slow down when i saw the lights.  looking back, i might have done things differently.  but, if i had stopped or slowed down at any point i might not have saw everything that i did.  i would say that utter disbelief was the prominent feeling that i had except i knew exactly what i was seeing.  it took about an hour for my pulse rate to go back to normal.\r\n\r\n\r\nplease note that below i have checked that my contact information not be released to third parties.  however, if it would be possible to remain anonymous and my identity kept confidential i may in the future consent to the release.  \r\n                        \r\n\r\n     ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Other","formattedAddress":null,"id":22664,"landingOccurred":false,"latitude":32.3977361,"location":null,"logNumber":"US-04062010-0003","longitude":-98.9751136,"occurred":1270092600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,   Flash,   Other","source":"MUFON","status":null,"submitted":1270550941000,"summary":"Northeast of cisco, texas, i witnessed various light phenomena for the duration of about three minutes as i was traveling on hwy 183.","tags":["light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Cisco, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135422"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Morgantown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My buddy and i were standing at the back of my car facing the rear windsheld. my car is facing south to fairmont.   we are located at a home stead on ocr in morgantown wv.  the weather was poor.  cloud cover and cloud to cloud lighting.  there are several small plans that fly over head but most of them are small craft and i estimate that they are at 1500 ft or below.  the planes are clearly visable with wing and tail lights.  while talking to my friend for a while outside, i notice a glowing object being refelected in my rear windsheild moving to the south.  at first i thought it might have been a satellite.  i looked over head to the south where the object cast a black dot with a red sphere surounded by another sphere in a pale blue.  the object stoped at about 35d angle from my vantage point in the sky.  the object then started retracting its flight and headed north to downtown morgantown at a high rate of speed. then it started moving in an arc to the east.  it seemed to follow the cuvuture of the earth. it dispered over a mountain. while it was starting into the arc a small plane was flying west and seemed to catch the object while it was moving.  the plane (to me) looked to stop (tree cover blocked full view of the plane) .  a few moments later the plane cleared the trees and looked to be rocking back and forth from the wings.   dan and i did not hear any prop or jet engine.  the object did not make any noise.  neither of us felt threatend or scared.  more amazed.  the light it produced is what make me feel like this is a real case.  the light feathered (softented) from a red sphere surounding a black center ball to a blue sphere of light.  it was amazing to see it.  i wanted to send this into mufon while it is still very fresh on my mind and the detail are still there.  \r\n\r\nthanks\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":22662,"landingOccurred":false,"latitude":39.5277589,"location":null,"logNumber":"US-04062010-0001","longitude":-79.95778,"occurred":1270530000000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Fireball,   Oval,   Sphere","source":"MUFON","status":null,"submitted":1270541773000,"summary":"Small craft moving overhead.  black center with radiating red then blue spheres of light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Morgantown, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135423"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"St Marys","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have beeb seeing these things for 6 months now and tonight at 9:30 pm i took my dog out and i looked up to see if i could see these objects again . i am a little skeptic and lately i have been seeing more  .When i looked up i seen the first object moving parallel to highway 219 heading north it looked like a star moving ,not a falling star cause i seen one of those tonight and the star was going faster than these objects ,it was round white and there were no strobing lights on it it flew north and as i watched it, the object stopped and the  vanished . as i was watching the sky a plane flew over(9:45 pm) it had red and white strobing lights and looked nothing like the previous object moving slower than the objects . at  around 9:55 i seen two objects cossing over my house white ,round ,star like  one was heading north bound  parrallel to 219 and the other one heading east looked like they were going to crash in the sky thats how close they looked to each other from were i was . i dont like reporting these things . awhile back i seen several of these objects flying over and one night i was out looking up i seen two black helicopters no markings on them fly over my house they were so low i could see 2 people in the each cock pit a purple light illuminating the cockpit  and i seen several men in the back of the choppers they looked like black hawks . i reported the sightings and the choppers to a well known ufo man  and he did email me saying   he checked and there was nothing going on that night . a week later 2 men  went to my x wifes house looking for me ,x wifes boyfriend said he opened the door and the one man in plane clothes kept repeating is [cms/tg/pid] here  we have a package for him ,the boyfriend said he doesnt live here and he didnt tell them were to find me . later that day  my brother called me he said that night  around 8 pm a man called and said are you [cms/tg/pid] he said no and they said we  need to find him we have a package for him  repating it my brother asked him who he was he just repeated the same thing . my brother gave him an adress to a house i bought to fix up and the man said i was there and no one is there it is empty and there is no power there ,which there wasnt . so my brother gave im my number and said call him first and he didnt tell him were i lived .I lived in house and i never changed my adress from the empty house . i even called the police to see if there were any other reports like this and the police said it coundnt of been a legal mater  that i would of got a letter   and the men would of identified themselves  by law. they would of never called after hours. they were in plane clothes and noone seen what they were driving .Kept reapting themselves . i dont know if this was connected to the first time i reported someting but it is kind of weird . i am a little skeptic but what i have been seeing i cant explain and i dont have a high quility video camera  i tried and its too far away . can you help","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":22661,"landingOccurred":false,"latitude":41.4375,"location":null,"logNumber":"US-04052010-0018","longitude":-78.5427778,"occurred":1270450800000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1270536335000,"summary":"White round. no strobing lights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"St Marys, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135424"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Orlando","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Shot 10-15 images of shuttle launch (digital images in raw file format) and in three, found off green object that appeared in only three images over a 3-second period of time.\r\n\r\ni did not notice this object with my naked eye. discovered the object when doing initial review/post processing of the raw images in adobe photoshop cs4. i have not altered the images in any manner. i have copied them in their raw format only to label them \"shuttleplusa etc.\r\n\r\ni do not know the origin of this object or the source of the green light and i wanted your team to inspect/review these three images to determine the spatial relationship between the ascending shuttle and the object. obviously, i am unable to make such a determination.\r\n\r\nthe images were atpured using canin eos t2i digital camera, handeld, 70-300mm sigma lens (actually at 480mm after 1.6 factor applied) f/5.6 at 1/6th of a second.\r\n\r\ni submit these fyi and make no claim that they represent the sighting of a controlled object. it may somehting as simple and innocent as lights (starboard-green) from a commercial aircraft downrange of the ascending shuttle. or it may in fact, be a ufo.\r\n\r\nupon discovery of this object in three of my 10-15 images my initial reaction was \"this is extremely odd\" given the security of the air space in and around a shuttle launch area. i was also puzzled as to why this object only appeared in three of the 10-15 images.\r\n\r\nthe order of the images, in capture order is - plusb  5:23:05  plus c  5:23:07  and  plus a  5:23:08. the raw files have been attached.\r\n\r\ngood luck. keep me posted please.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":22660,"landingOccurred":false,"latitude":28.5472955,"location":null,"logNumber":"US-04052010-0017","longitude":-81.3731065,"occurred":1270470180000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Unknown","source":"MUFON","status":null,"submitted":1270534210000,"summary":"Shooting shuttle launch and in three of a number of images, caught ufo in/near ascending shuttle","tags":["ufo"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22660_submitter_file1__ShuttlePlusB.CR2","http://www.mufoncms.com/files_jeud8334j/22660_submitter_file2__ShuttlePlusC.CR2","http://www.mufoncms.com/files_jeud8334j/22660_submitter_file3__ShuttlePlusA.CR2"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Orlando, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135425"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Center of Lake Michigan w","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A group of 3 of us, myself - a manufacturing business owner, my brother a firefighter/paramedic, and a family friend were traveling from saugatuck, mi on a 38' chris craft yacht, crossing lake michigan on the way to our marina just south of chicago in burnham, il (croissantmarina.Info).  this was a 15 hour ride and we were about 6 hours into the trip when we were circled by an f4 jet several times at very low altitude. this jet was so close we could clearly see the pilot in the cockpit (about 40 feet over the water).  i do not know if this is related to what happened 30 minutes later but we all found it very odd to see an air force jet in that area taking a closer look at us. of all times i've been on the lake i've never seen a fighter jet or anything odd, and i've been out there since 1994.\r\n\r\neventually the jet vanished and was never to be seen again.  about 30 minutes later we noticed an odd looking object to our starboard side (we were traveling ssw at the time).  this object was nothing any of us had ever seen and didn't look like the commonly known ufo either.  it was not a cigar or disc and it was not a triangle.  it was the strangest looking thing.  it was completely black and almost looked like a bunch of legos a child threw together, where the long rectangular shape had odd ends like steps but completely uneven.  it's very hard to describe.  there were no lights, no sounds.  just complete silence.  we idled down and proceeded to the bow to observe this thing.  it was hovering above the water, about 10 feet above the 1' wave caps.  it was about 500 feet wide, almost like a large building on it's side floating over the water.  we were about 6 blocks to 1 mile away.\r\n\r\nafter about 10 minutes of watching this thing it began to move our way, and we were all getting a bit nervous being that we were in deep waters and all alone.  outside of cellular range and poor chances of a good vhf distress call, our feelings were becoming uneasy quickly.  i guess we just feared this object because we didn't know what it was or why it was even there.  i hopped back inside the cabin to take the helm and threw her port & starboard engines in forward at idle to get ready to start moving out of there.  i wanted to know what i was seeing but i was way to nervous to see what would happen if i let it come close.  at that moment i myself, along with our family friend and my brother, observed this crazy looking thing move across the water from our starboard side to directly in front of our bow (keeping the same 6 blocks or so away from us and holding the same 10' hover over the water).  what really shocked us was the speed of the object.  it traveled an estimated 10 nautical miles in about 2 seconds.  there was just a long black streak across the horizon and then it stopped and just sat there in front of us.  i dropped the vessel back to neutral and just sat there as we all discussed what the heck was happening.  seconds later it jumped right back to our starboard side where it was before and again just hovered over the water.  that was enough, we throttled up and began heading ssw again, constantly observing the object as we moved on.  eventually we lost the object in the distance and never saw it again.\r\n\r\nthe date was, for sure, may 22nd, 2005.  that's the only time we ever made this trip.\r\n\r\nwe had no cameras, have no photos, but it happened.  the trip was being made for a single purpose, to move a boat i bought at tower marine in douglas, mi to my local marina.  it wasn't a pleasure cruise.  in june of this year i am returning to the gps coordinates where this happened, still saved on my gps.  i'll be going back with a couple friends and possibly my brother again if he can make it.  my hope is to see this again, although it's been 5 years now, ya never know.  this time we're bringing camcorders and cameras.\r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":22658,"landingOccurred":false,"latitude":43.4595805,"location":null,"logNumber":"US-04052010-0016","longitude":-87.2135587,"occurred":1116792000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Square,   Rectagular","source":"MUFON","status":null,"submitted":1270528090000,"summary":"Mid-day ufo near center of lake michigan in may 2005","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1779,"locationName":"Center of Lake Michigan w, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135426"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wamuran","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" \r\nthis was taken on the dagular hwy between woodford and closer to wamuran on 16 june 2009 aprox 3:24pm could not switch off auto focus painfull, appeard to b around 1500 feet up moving like a survey helicopter, but as you can see no tail no rotating blades and it had no sound, looked like a cockpit with nothing else i also got a lot of still photo's off the video, they are in my photo section check em out for a better look at it\r\n \r\nit was moving at the speed of a survey helicopter straight towards brisbane non stop in north to south direction i recorded it on the d'agular hwy between wamuran and woodford, i thought surley thousands of people would have seen it the video has been presented to the brisbane ufo society they have been around since the 1950's everybody clapped,i have as yet to present the photo's to them, im amazed���������that they didn't ask for a copy to analyse may be they don't do that? the photo's are on my facebook page at [cms/tg/pid] \r\n\r\n\r\nthis is the raw unedited version  has anyone seen this type of ufo before?\r\n\r\nyou can get a better view of this thing by going through the video frame by frame or just slow it down, it looks like 3 cylinders pointing upward a bit space shuttle'ey with the central cylinder curved at the bottom like a grasshopper with it's end curved and either it's landing gear (sort of triangles) on the other two cylinders or they are jets coming out of it still no noise tho would love a spectrum analysis to see if that bit could be explained (jets or just part of it) may be landing gear?  ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":22657,"landingOccurred":false,"latitude":-27.0399246,"location":null,"logNumber":"AU-04052010-0015","longitude":152.8622411,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"Queensland","reportedWeather":null,"shape":"Bullet,   Missile,   Cigar,   Cylinder,   Other","source":"MUFON","status":null,"submitted":1270516390000,"summary":"I was on my way to cabolture queensland australia in my car when i saw this thing up ahead i immediatly  recognised it as something usual.","tags":["none"],"timeZone":"Australia/Brisbane","timeZoneName":"Australia/Brisbane","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22657_submitter_file1__FILE0011.MOV"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2683,"locationName":"Wamuran, Queensland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135427"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"To near encounter:florida 0000/06/00  i had the same thing happen to me.  we lived on the charleston air force base back in 1982. during the night, i woke myself up by talking to something or someone while i was asleep.  as soon as i sat up i heard a motorized sound whizzing past me and then my bathroom door slammed shut.  so hard that i thought the door would come off the hindges. woke everyone up in the house. i did not look outside but wished i did. have you seen u.F.O.S up close?  i have. three times. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22656,"landingOccurred":false,"latitude":33.837151,"location":null,"logNumber":"US-04052010-0014","longitude":-81.1610245,"occurred":375955200000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270518784000,"summary":"Reference to near encounter","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":10353,"locationName":"South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135428"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  i think this is what that ufo could be flying at night on april 3, 2010 mesa, arizona.  a new type of blimp that has wings.  looks almost like a regular commercial jet, but much larger. smaller than a normal blimp as in structure height.  it may be very likely that is what i had been seeing lately, but i wonder why there are no anti-collision lights on the craft when it flies at night?\r\n\r\n  the blimp-plane craft was seen flying in mesa, arizona on april 5, 2010 around 10:04am.  it was 2 to 3 mile in distance from where i was observing. this is the first time i seen this type of flying craft.","distance":"Unknown","duration":"00:11:00","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Unknown","formattedAddress":null,"id":22655,"landingOccurred":false,"latitude":33.4568871,"location":null,"logNumber":"US-04052010-0013","longitude":-112.0650273,"occurred":1270487040000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1270516962000,"summary":"Blimp with wings","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22655_submitter_file1__Blimpjet.bmp"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135429"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Jinotega","country":"Nicaragua","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Estabamos tomando fotos para una visita de proyecto de agua potable y al llegar a la oficina una de las fotos presentaba una formacion rara.\r\n\r\nno sabesmos que es y en la oficina hay opiniones encontradas.... queriamos su experta opinion al respecto... a mi personalmente me parecen dos columnas o rayas blancas que van casi paralelas y parecen dejar una estala de humo..... la foto fue tomada en una zona rural del norte de nicaragua...\r\n\r\nsolo fue una foto.. las demas fotos de la misma secuencia no muestrada nada extra���o....\r\n\r\nsaludos","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":22654,"landingOccurred":false,"latitude":14.0507755,"location":null,"logNumber":"NI-04052010-0012","longitude":-85.1064373,"occurred":1269027060000,"potentialRelations":[],"rating":"Unrated","region":"Jinotega","reportedWeather":null,"shape":"Cigar,   Unknown","source":"MUFON","status":null,"submitted":1270515931000,"summary":"Estabamos tomando fotos para una visita de proyecto de agua potable y al llegar a la oficina una de las fotos presentaba una formacion rara","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22654_submitter_file1__100_0359.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":17,"locationName":"Jinotega, Jinotega","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135430"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Peekskill","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Myself and a friend where sitting on the deck watching the first yankee/ boston game when i noticed an orange light in the sky to the west. i pointed it out to my friend as it approached when it started its turn to the south  we both got up and walked to the front of the house to track which way it was going and watched it disappear in the distance to the south. granted there is a lot of air traffic in the area but as the light approached it was bright orange as it turned and moved away the color and shape did not change in color or intensity. additionally, there was no evidence of strobe maker lights normally associated with aircraft.  ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":22653,"landingOccurred":false,"latitude":41.2912439,"location":null,"logNumber":"US-04052010-0011","longitude":-73.9186658,"occurred":1270441800000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270515928000,"summary":"Saw an orange light approach from the west then turning gradually to the south and disappearing in the distance.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Peekskill, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135431"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mansfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My daughter and i were in the garden when a large glowing sphere aprox 3 m in diameter came over our neighbours wall and desended a few more feet in to  our garden it was less than 10 ft from ground moved very slowly and stoped suddenly, and just waited there for acouple of seconds then shot straight up and changed angle of direction.The object was silent but was clearly powered and able to reach speed faster than a plane solid looking my daughter was within a couple of feet of it and it gave off no heat or sound she was closer to it than me, she thought it was metal no visible opening or window just solid and glowing we both wondered if it had stopped to watch us thats what i felt like we maybe were being observed i know sounds crazy but was not lantern or weather balloon.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Straight-line path,Path with directional change","formattedAddress":null,"id":22652,"landingOccurred":false,"latitude":32.5567542,"location":null,"logNumber":"GB-04052010-0010","longitude":-97.0809453,"occurred":1253764800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1270506287000,"summary":"Orange  red as if on fire bright glowing sphere almost landed in garden ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":193,"locationName":"Mansfield, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135432"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mt Vernon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"After walking back to my dorm from a long hard days work at the writing center, i saw a chevron shaped object with multicolored lights hovering at a low altitude above our schools library.  i hide behind the obelisk  in front of the library and closed my eyes fearing that it, whatever it was, might spot me.  as soon as i gained to courage to look back at the object it suddenly made a bright flash and disappeared.  i waited a while to see if it would reappear but it didn't.  i could not sleep all night due to this occurrence. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":22651,"landingOccurred":false,"latitude":32.1785145,"location":null,"logNumber":"US-04052010-0009","longitude":-82.5945783,"occurred":1270364400000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1270504314000,"summary":"Last night while walking, saw chevron shaped object with flashing lights hovering above the library. ","tags":["lights","flash","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22651_submitter_file1__lastnightlightsabovelibrary.mp3"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Mt Vernon, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135433"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St Marys","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Youtube video: http://www.Youtube.Com/watch?V=4-tuulds31q\r\n\r\ni was outside in my front yard talking on the phone with my dad when i noticed a 'star' over the western horizon near saint marys, georgia.  i called my brother out to take a look at it and he thought it might be a star.  i know sirius is the brightest star in the sky and pointed it out to him.  this was easily 10 times as bright as sirius.  there were no aircraft lights that we could see... just lots of 'twinkling' that you'd see in a star.\r\ni went inside and grabbed my video camera.  the twinkling turned out to be pulsating lights that changed from blue to red.  towards the end of the video the light is a solid red and blinks on and off.  i would say from the time i noticed it until the time it escaped my view finder at a separate location was about 45 minutes total.  if i had to guess the appx. location it would've been right on the fl/ga border to the west of kingsland.  it appeared to move steadily to the west, but at a very slow rate of speed.  so much so that when we were watching it we thought it was stationary.\r\nalso, shortly after spotting it, there were many aircrafts in the sky all at once which we thought was odd.  i have no idea what this might have been but i'd like to know if anyone else had a better look at it, or what jax international airport (25 miles south on i-95) had on their radar.\r\n\r\ni have the video on youtube at: http://www.Youtube.Com/watch?V=4-tuulds31q","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":22650,"landingOccurred":false,"latitude":30.7609789,"location":null,"logNumber":"US-04052010-0008","longitude":-81.5628489,"occurred":1270438200000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270485375000,"summary":"Bright light in the night sky that changed colors and seemed stationary","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"St Marys, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135434"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I viewed the shuttle launch this morning at 6:21 am and once they released the booster rockets and switched camera angle so you see the rear of shuttle, starlike ufo's are visible traveling in different directions, then there's video interference and they stop airing live feed and begin to re-broadcast the initial launch again ( which ends abrubtly after rocket booster jetisen and it loops again ) unfortunately i wasn't able to record this and i doubt even youtube will get this, but if they do definately take a look at it.  \" absence of evidence, is not evidence of absence and governments must never lie to the people\" quote from sgt. clifford stone, disclosure project military witness. if you haven't viewed the documentary \"ufo-the greatest story ever denied\" take a look it's quite amazing.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22649,"landingOccurred":false,"latitude":40.5567165,"location":null,"logNumber":"US-04052010-0007","longitude":-85.5958243,"occurred":1270450800000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1270477382000,"summary":"Strange objects on nasa's sts-131 shuttle camera.....","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135435"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Coral Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sleeping and woke up because my cat was meowing loudly, i woke up to find her going crazy around the room and running through the blinds. i stood up to walk to the sliding glass door to see why she was going crazy and why it there was such a bright orange glow coming from outside at 3 in the morning. at the same time that i was walking over, a strange electronical, whizzing noise passed by my small side window across the room and then by the sliding glass door, which was so strange for how close it sounded because my door is surround by a screened in outdoor porch. after i recovered from hearing the noise, and my cat still going crazy all around the room, i looked outside to see the lawn and my view of the sky from over my bushes and saw everything lit up with that orangey red glow. i ran out into the house to see if other people where up, i was shocked to see no one up, how could they not be? it was so bright out! i turned towards the windows to see if light was coming in and it was gone. i decided to tell this to someone once i saw a docudrama on tv about a guy who was visited by an alien and was awakened for the same reasons i was, minus the crazy cat of course. he got something implanted into his arm though, i'v have of course checked mine and i think i'm good. i hope this means something to you guys, i personally hope it never happens again.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22648,"landingOccurred":false,"latitude":26.272262,"location":null,"logNumber":"US-04052010-0006","longitude":-80.2694744,"occurred":1022839200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1270458094000,"summary":"Near encounter.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2865,"locationName":"Coral Springs, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135436"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Albuquerque","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"About 9:05, ****** and i were sitting on the patio when we saw something strange in the sky (see attached photoshop rendering).  it passed by roughly south to north.  it was low in the sky (mountain tops visible above it).  it was visible for probably less than a minute before disappearing beyond the neighbor's trees.  it made no sound.  it was difficult to determine the size or altitude, but if it was about 3000' agl (common altitude for airliners passing over our house), it was bigger than (and traveling slower than) an airliner.  i have to think it was low, because if it was higher, it would have been huge!\r\n\r\nit was very dimly illuminated.  in fact, it was difficult to see if you looked straight at it (center field vision is not good at night).  it almost looked like it wasn't directly lighted, but might have been illuminated by reflection of the city lights.  (imagine the phosphorescent glow of a ship's wake on the ocean at night.)  it had no navigation lights.\r\n\r\nour house is just north of the tijeras arroyo, between tramway & juan tabo.  the patio faces east, with a good view of the south end of the sandias.  we spend a lot of evenings on the patio skygazing.  it is common for us to see aircraft (airliners, helicopters, ospreys), satellites, weather balloons and shooting stars.  this wasn't any of those.\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":22647,"landingOccurred":false,"latitude":35.0930309,"location":null,"logNumber":"US-04052010-0005","longitude":-106.6450367,"occurred":1270353900000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1270456662000,"summary":"Bow-shaped object low in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22647_submitter_file1__ufo_3.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Albuquerque, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135437"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Perth","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approximately 7.40pm, sitting outside burswood dome (3kms east from perth cbd), facing east, watching planes taking off in the distance. a star-like object appeared in the eastern sky at around 60degrees from the horizon. it was quite bright, and moved slowly in an easterly direction.The light moved slowly in the sky, and appeared to move up and down in a \"bouncing\" pattern. it remained visible for around 4 minutes. the light faded out within aprox 5 seconds. there were no flashing lights or other features resembling an aircraft. the object was quite high up, and not following the normal aircraft line of flight out of perth airports.There were 5 witnesses to the event from lady gaga's touring crew with whom i was working with that evening.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":22646,"landingOccurred":false,"latitude":-31.9473236,"location":null,"logNumber":"AU-04052010-0004","longitude":115.8608689,"occurred":1270176300000,"potentialRelations":[],"rating":"Unrated","region":"Western Australia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1270455126000,"summary":"Star-like object moving over perth","tags":["none"],"timeZone":"Australia/Perth","timeZoneName":"Australia/Perth","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3,"locationName":"Perth, Western Australia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135438"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Liberty","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving northwest on 291 hwy when i noticed a white shiny object moving slowly across the sky.  at first i thought it was a large plane, but it had no wings or tail.  it looked like two oval-shaped objects with a piece connecting them in the center.  as i watched, it stopped and went backwasrds, then forward again very quickly, then continued on its slow forward movement. this happened again, then i lost sight of it because i had to turn left at a light.  i pulled over to the side of the road to see if i could find it again, but it was gone.  due to the fast jerky movements backward, then forward again, this could not have been a plane or helicopter.  it moved too fast for that.  the object was headed in an east-west direction at 40 degrees off the horizon.  it looked very large.  the sky was clear with no overcast.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change","formattedAddress":null,"id":22645,"landingOccurred":false,"latitude":39.2529638,"location":null,"logNumber":"US-04052010-0003","longitude":-94.4148977,"occurred":1270227600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1270453308000,"summary":"Double-oval object over liberty, mo","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Liberty, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135439"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Toronto","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Re: \r\ncase # 22642  , log # ca-04042010-0009\r\n\r\nmy close-up hasn't showed up when i originally submitted my report , lol ! well, am not a computer wiz & i think when i've tried to attach the close-up  also add the original photo it has reverted itself to the original !\r\ni will try to attach the close up now .\r\n\r\nalso , i've noticed someone also have seen it via telescope at the same time frame & filed a report from ottawa , on. :-)\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":22643,"landingOccurred":false,"latitude":43.656046,"location":null,"logNumber":"CA-04052010-0001","longitude":-79.3769643,"occurred":1270425540000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1270451386000,"summary":"This is a follow up to the submitted original report ","tags":["none"],"timeZone":"America/Toronto","timeZoneName":"America/Toronto","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/22643_submitter_file1__100_0746.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Toronto, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:135440"}],"last":false,"totalElements":82759,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2061}
