{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Madison","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"About 11:50pm this evening 5 5 2011 - i saw something in the sky that i cannot explain the location of the object was over lake mendota in madison wi - around the blackhawk country club location.\r\n\r\nthe object was probably about 2-3 miles from me i live off of univ ave in madison wi--\r\n\r\ni noticed a bright light in the distance that looked like it was changing colors - i got out my binoculars and watched for some time - there were yellow, green and red pulsating lights - i could not tell if what the shape of the object was i do not think it was a square or rectangle it might have been a circle - i am not sure. i was very excited to see the lights and wondered what it was\r\n\r\ni watched for about 10 minutes...To see if i could see movement or sound, i did not hear any sound\r\n\r\nalso the object seemed to get lower in the sky - so i left to see it in my car - i could not find so i came back home and looked for it again and it was gone\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":28981,"landingOccurred":false,"latitude":43.0813017,"location":null,"logNumber":"US-05062011-0019","longitude":-89.3937102,"occurred":1304664600000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1304741815000,"summary":"Madison wi","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Madison, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59285"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop, Over 500 Feet (no cloudcover)","city":"Friendswood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My father worked at todd ship yard.Nasa would call him with the latitude and longitude of ufo's, he then would call home and give this info. to our mother, and then we would go outside and take turns watching them. we did this as if we were watching a tv show each night.Nothing to make a big deal over.Our family friends were mr. glen and also mr.Carpenter.The ones we saw in alvin, the guys in black would show up, they said they were salesmen and would go house to house and ask what they saw. they claimed it was gas burn off from the oil wells or swamp gas. as if we didn't know what that looked like. the men in black blocked off the road and would not let us go check on the lights coming from our friends home area.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":28980,"landingOccurred":false,"latitude":29.532599,"location":null,"logNumber":"US-05062011-0018","longitude":-95.199527,"occurred":-160502400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc,   Oval","source":"MUFON","status":null,"submitted":1304740782000,"summary":"Our family would locate and watch them","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":16958,"locationName":"Friendswood, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59286"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Newberry","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my brother and sister went to watermelon pond to spend some time alone.We parked facing south,got out and sat on the hood to talk.I noticed a red ball running from southeast to soutwest of our possition,i pointed it out to them,we then noticed a plane behind it following it,it was going west,it got to our southwest and turned north(the plane never did gain on the object but didnt loose ground either} so did the plane{we knew it was a plane becouse it had blinking lights consistant with a aircraft)the object and the plane got to our northwest and we noticed another plane coming at it from the east when both planes got the same distance from the object it shot straight up into space(it didnt turn off it faded at terrific speed straight up).We watched the planes for a minute as they circled and decided to go home.We didnt know what it was the only thing we knew for sure was that there was a plane chasing it.I cant tell you what they were feeling but i was in awe and shocked to witness such an event{we didnt speak of it again for 14 years,i finally broached the subject,my brother says that he vagely remembers it,my sister not at all.This was really frustrating for me becouse it was so vivid for me(i can picture this event like it was yesterday).I didnt call or tell anybody else about this for a long time for fear of ridicule.Finally i came to grips with what we saw that anybody that would listen heard the story.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":28979,"landingOccurred":false,"latitude":29.6463535,"location":null,"logNumber":"US-05062011-0017","longitude":-82.6065023,"occurred":724742880000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Fireball,   Oval,   Sphere","source":"MUFON","status":null,"submitted":1304740049000,"summary":"Me and my 2 siblings watched a plane chase a red ball from s.E. 2 s.W. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":6712,"locationName":"Newberry, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59287"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Toronto","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Looking outside my window i noticed a very bright light that was just below the horizon. it reappeared every night for about a week. showing up in three different places (over three different nights) showing up at the same level (just below the horizon) but moving about 15-20 degrees to the east each night. it was back in the third spot for multiple days. it was very bright and pulsated a little. i could not tell how far away it was. it would appear just as the lights of the city were becoming noticeable, stay in place then just shut off instantly. i though it was a construction light but it was way too bright. on looking at the photos later i realized that it had actually moved as well. the two attached photos show it at the very beginning of the second last night it was there and just a little later. please note that i have not done anything to the photos. i leave it in your judgment whether you think you should post this sighting or not.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Stationary,Other","formattedAddress":null,"id":28978,"landingOccurred":false,"latitude":43.662126,"location":null,"logNumber":"CA-05062011-0016","longitude":-79.3815843,"occurred":1297834200000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Circle,   Diamond,   Egg,   Fireball,   Oval,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1304739433000,"summary":"Very bright light in the distance, moved very little, could be nothing","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28978_submitter_file1__DSCN0254.JPG","http://www.mufoncms.com/files_jeud8334j/28978_submitter_file2__DSCN0262.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":79,"locationName":"Toronto, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59288"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was september 29th 2007 around 12 midnight i was outside on my front steps smoking a cigarette. i was scheduled to leave for a week of bootcamp. im sitting on my steps looking through the branches of a tree in my neighborghs yard. i remember no leaves were on the tree and i was looking at the stars, i noticed an unproportionatly large orange tinted star way off in the distance. through the tree branches i watched the object it was stationary for minute maybe two, but it started to drift away from the surrounding stars in an upward slow motion, it then would move right carrying the same speed then move up again. it did this up then right up then right up then right, i felt as if the object knew my eyes had seen it. it then moved in an upward and right positive angle more quickly than it had been traveling before. it was coming towards me covering miles of space within few seconds. as it was coming towards me i got up off the steps and walked into the road and saw the craft the size of a small helicopter but with a much diffrent shape 3 orange circle \"burners\" on the back and had been hovering 10 feet over the houses and trees i tryed to take a picture on my phone but it was too dark and wouldnt show, i ran down the street to get the picture and it slowed down enough that i ran down the street and got about 20feet from where the object was at i got a great visual on the object nothing ive ever seen before. it stayed for a few amazing moments then took off at the extreme acceleration it had came at covering thousands of feet over the school and disapeared behind a watertower in the distance.    i was shaken up but at the same time i felt connected with the craft as if they meant to show me what i saw and meant no harm to me.   i left the next day for bootcamp in franklin pa i returned a week later and the firat night i was back sleeping in my bed i woke up at night raised my head up and looked to the foot of my bed and at that moment i saw a small person in a black suit standing no taller than 3 feet tall at the foot of my bed, just as i caught glimps of this my body felt paralyzed and heavily forced back onto my pillow i fought it as hard as i could and got no movement from my body except one thing i felt a tear forming from my eye  as i lost concience again.   that encounter when i returned from bootcamp sent fear into me i havent told anyone til now beside my girlfriend at the time","distance":"20 Feet or Less, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":28977,"landingOccurred":false,"latitude":41.2050216,"location":null,"logNumber":"US-05062011-0015","longitude":-77.1934147,"occurred":1191049200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Cylinder,   Sphere,   Other","source":"MUFON","status":null,"submitted":1304738851000,"summary":"Orange orb slow hover extremly fast acceleration sound canceling ","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1315,"locationName":"Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59289"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ashland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While working i looked up to see a rainbow cloud i was shocked. i know some things like this can be caused by ice in clouds but this didnt seem natural and the cloud would fade and get brighter. about ten minutes later i noticed the rainbow colored halo around the sun which stayed for a few hours two people i was with saw it talked to my brother who was in omaha at the time and he saw it and got some pictuers of it. where he was at there was no clouds which made it weird. two days before a man i work with saw the same thing while golfing in a near by city i have a hard time beliving this was natural but who knows.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28976,"landingOccurred":false,"latitude":41.0405556,"location":null,"logNumber":"US-05062011-0014","longitude":-96.3725,"occurred":1304665200000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1304737239000,"summary":"Strange rainbow halo around the sun and rainbow clouds","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28976_submitter_file1__1.jpg","http://www.mufoncms.com/files_jeud8334j/28976_submitter_file2__3.jpg","http://www.mufoncms.com/files_jeud8334j/28976_submitter_file3__2.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ashland, Nebraska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59290"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Heber","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" i was watching the sun set and noticed. that one of the clouds looked like it had ripples in it. like you would have in water.\r\n then a bump formed. i just was transfixed on this cloud! when this thing started to lower down out of the cloud. i got my camera.\r\n i took a picture and soomed in on the picture i had just taken. i was like, \"what the hell is that!\"\r\n emotionaly i was handling it ok till this thing in the clouds lowered its self so far out of the cloud as seen in the pictures. \r\n the thing in the cloud looked as if it lowered its self down out of the cloud to release some type of gas or some thing else out of the end of what ever it was in the cloud. then it slowly went back up into the cloud. the same way it showed up.\r\n i showed the pictures to friends and they told me to give the pictures to the right people.\r\n so here you go!\r\n i have sent three pictures taken of the event.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other,  Unknown","flightPath":"Stationary","formattedAddress":null,"id":28975,"landingOccurred":false,"latitude":32.7308911,"location":null,"logNumber":"US-05062011-0013","longitude":-115.529718,"occurred":1303694940000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1304733086000,"summary":"While watching the sun set this thing drops down out of a cloud.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28975_submitter_file1__Ginavideo229.JPG","http://www.mufoncms.com/files_jeud8334j/28975_submitter_file2__Ginavideo230.JPG","http://www.mufoncms.com/files_jeud8334j/28975_submitter_file3__Ginavideo232.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":12,"locationName":"Heber, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59291"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Columbia","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching the dish earth channel showing my wife how the earth looks like from space and saw a round object move through the screen and go behind the earth.At first i thought is was the moon but it was to small and i checked where the moon was supposed to be on that date and it didnt add up. then i thought it was a planet but it is to big to be one because planets look like dots even through telescopes.To big to be a satillite.I just held my kodak camera up to the t.V and took pictures of it moving and going behind the earth and then coming out the other side and moving out of sight of the dish earth satillite camera.I have been watching the channel since and havent seen it again.I tried to zoom in on my tv screen and get a close up.I downloaded the pics to my computer and sending them to you. ithink my date on camera was wrong but the date on the dish earth channel is on there. im sure you could get the actual footage from dish earth channel since i have their time and date on the pics. if you find out what it is tell me please.I have over 60 pics i took going through the screen i dont know if i attached them send to you the right way if you didnt get them all let me know and i will try again. thank you for your time.","distance":"Unknown","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":28974,"landingOccurred":false,"latitude":37.110461,"location":null,"logNumber":"US-05062011-0012","longitude":-85.2998204,"occurred":1298246700000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Egg,   Oval","source":"MUFON","status":null,"submitted":1304732266000,"summary":"I was watching the dish earth channel on satillite.","tags":["none"],"timeZone":"America/Kentucky/Monticello","timeZoneName":"America/Kentucky/Monticello","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28974_submitter_file1__u1001.jpg","http://www.mufoncms.com/files_jeud8334j/28974_submitter_file2__u1030.jpg","http://www.mufoncms.com/files_jeud8334j/28974_submitter_file3__u1043.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":75,"locationName":"Columbia, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59292"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Orlando","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling north on the florida turnpike just south of the 528 exit. it was around 22:00 hours and a clear dark night. i could observe the landing lights for the planes approaching orlando international airport. as i was driving, a bright light suddenly caught my attention out of the front windshield to the west. it appeared to be in the same flightpath as the approaching planes. my first reaction was that it was an exploding and burning airliner falling out of the sky. it moved from the west to east and descended at a fast rate. my daughter and wife also observed the object and concluded that it was a meteorite. the entire event lasted approximately 10 seconds from the time i first noticed it until it appeared to turn off before striking the ground. we continued driving on the highway to our destination and talked about our sighting. i do not believe it was a meteorite because of the speed at which it was traveling being too slow. there must be more witnesses because of the area in which it occured. there were many other vehicles on the road with us that surely observed the same event.","distance":"Unknown","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28973,"landingOccurred":false,"latitude":28.5480255,"location":null,"logNumber":"US-05062011-0011","longitude":-81.3780365,"occurred":1304139600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1304731829000,"summary":"Bright descending light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":6,"locationName":"Orlando, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59293"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"El Paso","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was up really early to take a friend home after a long night of partying at home. as we walked outside i noticed the morning sky looked brilliant and was photo worthy. i ran inside real quick to get my camera to get a couple shots of the sunrise. i snapped two shots just seconds apart. years later, about 4 or 5, i was going through some old pictures. i found the two i took that day and i decided to use one of them as my desktop background on my pc. when i went to click on an icon on my desktop, i noticed a small object next to it in the photo. i thought to myself, what the heck is that?! i opened the image and zoomed in to see what the thing was. at first glance i thought maybe it was a bird, but after comparing it to the birds sitting on the telephone wires, and realizing the size differences, i ruled that theory out. i opened up the second picture and didn't see the object, although i did notice a second object in a different part of the photo. it looked like it was very high up, and was shaped like a disk of some sort. i'm not sure if the two objects are one of the same and were maybe at two different locations in the two pictures. and i know i didn't see anything in the sky when i took them. i like to take a lot of photos of sunsets and sunrises, and i know that if there happened to be a plane or a helicopter flying through the shot, i'd wait for it to pass. i can't explain what the objects were, but i've held on to those pics ever since. i never thought about reporting them until now...\r\n\r\nthe first photo shows the object at quite a far distance, and seems to be quite large. it looks as though it's heading west and there seems to be leaving a trail of some sort. \r\n\r\nthe second photo shows the second object high above the clouds, yet the object in the first photo is no longer there. keep in mind these photos were taken one right after the other, so i would assume the objects would be in both photos in the same vicinity...But this isn't the case. ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Other,  Unknown","flightPath":"Unknown","formattedAddress":null,"id":28972,"landingOccurred":false,"latitude":31.7608398,"location":null,"logNumber":"US-05062011-0010","longitude":-106.4795914,"occurred":1088859840000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1304725926000,"summary":"Strange objects in sunrise photos... ","tags":["photo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28972_submitter_file1__NewImage.JPG","http://www.mufoncms.com/files_jeud8334j/28972_submitter_file2__NewImage1.JPG","http://www.mufoncms.com/files_jeud8334j/28972_submitter_file3__zoomedin.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2498,"locationName":"El Paso, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59294"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fort Dodge","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Leaving coffe shop at 6:50 am. happened to look up into the western sky and saw this bright silver object. at first i thought it weas a plane but then it stopped and hovered for about 30 seconds. i took  3 pictures of it with my cellphone.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":28971,"landingOccurred":false,"latitude":42.5055594,"location":null,"logNumber":"US-05062011-0009","longitude":-94.1594158,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Oval,   Unknown","source":"MUFON","status":null,"submitted":1304724227000,"summary":"Saw bright silver object in sky.Thought at first it was a plane .Thenit hovered and i knew it wasnt","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28971_submitter_file1__0427110644b0101(36x26).jpg"],"weather":null,"zipcode":"50501","daysBetweenOccurrenceAndSubmission":3079,"locationName":"Fort Dodge, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59295"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mena","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife said \"look that star is moving\"! \r\nmoved very slowly southward the light was solid(no flash or strobe as in air plane). then suddenly looked as if it was falling slowly with no tail or trail. got to about mid horizon...Then flashed off, then flashed back on.\r\n\r\nmy wife and children oood and ahhhd then the light went off completely as it descended. my oldest daughter wanted to go to the road to find it...And my youngest was panicky and wanted to go inside the house. \r\nabout 3 minutes later to the north west i saw the same light over my garage ...High in the sky. asked my wife if she had seen it,,,she had...But we kept it very quiet so as not to disturb the children further. \r\n\r\nstayed outside playing with the kids with no more sightings. \r\n\r\nhas anyone else seen or reported this ???\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":28970,"landingOccurred":false,"latitude":34.5887971,"location":null,"logNumber":"US-05062011-0008","longitude":-94.2297054,"occurred":1304653380000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1304721019000,"summary":"Star lite star brite???","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mena, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59296"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Denver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking dogs home heading north. i seen a bright star fall. yet i kept watching where it dissapeared at because it didnt look right, no fading or shrinking. what i then saw on same spot it dissapeared i made out a gray ghost like mass that it seemed to go behind it when it dissapeared. i looked for about 2min and then started walking saw to the west of me about a quarter mile to west a low flying aircraft with lights on the under belly 4 to six lights in a row i didnt count them not sure. the craft was only seemed 200ft above me. it was trangle and made no noise. it was passing me heading north east and a male jogger was then passing me i told him look up he did he said wow and kept jogging.The object elevated and went staight to same northern spot and dissapeared as well!","distance":"101-500 Feet","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":28969,"landingOccurred":false,"latitude":39.7484636,"location":null,"logNumber":"US-05062011-0007","longitude":-104.9803934,"occurred":1304652600000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Blimp,   Star-like,   Triangle","source":"MUFON","status":null,"submitted":1304711980000,"summary":"Thought i saw a falling star yet it disappeared whit large light still, then i law kept looking where it disappeared and it looked like a foggy mass the size of 2 blimps side by side then i turned to walk home and saw triangle aircraft no noise! ","tags":["triangle","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Denver, Colorado","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:59297"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Irving","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My neighbor and i had been at my house all afternoon and we saw my other neighbor through the window so we went outside to say hello. it was so clear and nice out we decided to sit on the grass on the island in the middle of our cul-de-sac. the neighbor who had been with me most of the afternoon and i looked up at the sky at about the same time and both saw a bright, solid red point of light moving east to west. for something in the sky in broad daylight it was very bright, it was more visible than the planes that are normally in the sky. we debated weather or not it was a plane or a balloon of some kind and then it stopped dead in the sky and began to pulse then move slowly in the opposite direction. another neighbor was out playing with her kids so we called her over to look at it and she followed it with us. it stayed in the same area of the sky, moving around slightly, almost like a helicopter but more precise. it started fading in and out, then another light appeared literally out of nowhere and they began pulsing back and forth, completely disappearing and then getting really bright again. the other light was identical but not as constant as the original light that we were still following. a neighbor brought out a pair of binoculars and i tracked it for a few minutes as it pulsed before it completely disappeared. i studied it pretty closely through the binoculars and couldn't make out any details beyond a bright point of light, usually with binoculars i can make out some details on a plane but there were no wings or real shape to it what so ever. we watched the sky for about an hour after it disappeared but didn't see anything further. i've seen a lot of stuff in the sky, i've seen my share of comets, meteors, planes, helicopters, satellites, even a couple things at night that i've called ufos but never anything this clear during the day that i couldn't explain. there were 5 of us who all saw it in the sky","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":28968,"landingOccurred":false,"latitude":32.8165477,"location":null,"logNumber":"US-05062011-0006","longitude":-96.9432845,"occurred":1304643600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Fireball,   Star-like","source":"MUFON","status":null,"submitted":1304698993000,"summary":"Two bright points of red light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Irving, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59298"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Logansport","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving home from logansport approximately 9 pm\r\nin logansport\r\nsaw this strobing flashing craft heading north westerly direction. i was on high street in between mall road and cass plaza drive. \r\nit reminded me of a sighting i had on march 17 2010 when i saw a triangle craft that, suddenly started behaving like this strobing craft i saw this night of april 29th 2011. similar strobing lights. if not identical to those i saw that morning.\r\n\r\nalso my 16yr old daughter did also see these lights, while she was waiting for me to get home from walmart, she was dropped off waiting on the porch, she left her key that night. it freaked her out too.\r\n \r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28967,"landingOccurred":false,"latitude":40.7597443,"location":null,"logNumber":"US-05062011-0005","longitude":-86.3519959,"occurred":1304136600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1304695901000,"summary":"Strobing/flashing white colored lights","tags":["lights","triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":6,"locationName":"Logansport, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59299"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Melbourne","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My son daniel saw this object from upstairs and run down to the kitchen were i was having my tea and cleaning my camera.\r\n\r\ndaniel told me about a bright object in the sky just after dusk, he have seen similar strange things before so we the three of us including my wife step outside and i started to video this thing that i saw look like a star but as i got closer my eyes refuse to see what i was witnessing.\r\n\r\nthe first shots i took on march 30/03/2011 at 19:23:38.\r\nthe other shots i took on the same next day on march 31/03/2011 at 19:09:54.\r\n\r\ni took two more shots after this making three shots all together. the reason for that was that as i got closer i lost it again and so i felt that it be better if i stated from the beginning until i could zoom in again.\r\n\r\n \r\nall together the viodeos that i took was 30/03/2011 at 7:23:36 pm\r\nand 31/03/2011 at 7:19:48\r\nthedirection is due west.\r\n \r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28966,"landingOccurred":false,"latitude":-37.8056769,"location":null,"logNumber":"AU-05062011-0004","longitude":144.9721296,"occurred":1301624340000,"potentialRelations":[],"rating":"Unrated","region":"Victoria","reportedWeather":null,"shape":"Fireball,   Star-like,   Other,   Unknown","source":"MUFON","status":null,"submitted":1304677015000,"summary":"Fiery object over greenvale victoria australia","tags":["none"],"timeZone":"Australia/Melbourne","timeZoneName":"Australia/Melbourne","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28966_submitter_file1__AirservicesAustraliadisinformationonFieryObjectoverMelbourneAustralia.MVP","http://www.mufoncms.com/files_jeud8334j/28966_submitter_file2__FIERYCOMETUFOOVERMELBOURNEAUSTRALIAbySANGSTAR1_BAK0.MVP"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":35,"locationName":"Melbourne, Victoria","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59300"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ontario","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me an my brother weir out side his house talking then he says to me look look !! another one since hes seen two like the day befor.. then i see it comeing from the mountins tords us then it turns to the airport  an two airplanes from the airport must have seen it too because it was in front of them an it disapeard in front of them!!!! after i all that exitemeant i tolled him ima report this ufo an i get in my car .. then my brother says to me agin look look but wat i saw was what it looked like a shooting star falling fast tords the mountin  topan it disapears too!!!! some one should investegate quik befor we get an earthquake or something!!!!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":28965,"landingOccurred":false,"latitude":34.0670543,"location":null,"logNumber":"US-05062011-0003","longitude":-117.6433076,"occurred":1304651700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1304669128000,"summary":"Too many ufos  wow!!!!!  no bull!!","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28965_submitter_file1__050511202916.jpg","http://www.mufoncms.com/files_jeud8334j/28965_submitter_file2__050511202928.jpg","http://www.mufoncms.com/files_jeud8334j/28965_submitter_file3__050511202957.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ontario, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59301"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Port Orchard","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking north on pottery ave to my transit van pick up point (for reference of direction of sighting) when i checked my phone for the time. at which point i noticed movement in front of me, to the north, where the city of bremerton is, which gives off a lot of light pollution. the city's lights can be seen on the clouds at night (early morning). well, i saw that, as i looked up a dark curved object briefly come through the clouds. the clouds were an orange color and this object was completely black, it was not reflecting any light at all. as i watched (merely a few seconds)it went back into the clouds. this object was far to the north of me and looked to be of significant size. it did not completely clear the clouds so i only got to see a part of it.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Unknown","formattedAddress":null,"id":28964,"landingOccurred":false,"latitude":47.5458732,"location":null,"logNumber":"US-05062011-0002","longitude":-122.6326292,"occurred":1304596500000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1304668141000,"summary":"Dark object penetrates clouds...","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Port Orchard, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59302"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Abington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"   my wife and i were heading home from connersville one evening and we were driving through the country just a few miles before you enter the town of abington.  we both saw a bright red object come off the ground of a cornfield and shoot straight into the air and was out of sight in seconds. i asked my wife if she had seen it and she had. this was a pretty large field in the country and i haven't a clue as to what it could have been.  i noticed the object which was to my right and ahead of my current location because it was so dark out and the red light was very noticable. my initial reaction was to ask my wife if she had seen the object.  we talked about it for a little bit wondering what it was but didn't dwell on it since we had no answers.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":28963,"landingOccurred":false,"latitude":39.7331033,"location":null,"logNumber":"US-05062011-0001","longitude":-84.9630172,"occurred":1296460800000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1304665234000,"summary":"Bright red light  8-10 feet in diamiter","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":94,"locationName":"Abington, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59303"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Fort Mill","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside on our rear deck in fort mill and look at the sky as i always do and directly(or appears to be) overhead is a bright round white light that looks like a miniature version of the moon with a hallo around it from slight clouds. stars still visible around object.\r\n\r\nobject slowly moving from south to north pattern (not east to west like satellites) for 5 seconds then slowly fades away. the fade away took about 4 seconds. in the path it was traveling i could see stars so it did not go behind clouds, just faded out. \r\n\r\ncannot judge size of objects in sky because of distance but the object was close enough to be in our lower atmosphere and looked to be about half the size of the moon and much brighter. \r\n\r\ni am use to seeing planes in the sky being close to major airport and they fly over all the time. this was no plane, to close, slow, bright, no noise, and solid white light.\r\n\r\ndid not feel anything when i saw the object. i did think it was weird that it started to fade as soon as i saw it. like it didn't want me to see it anymore.\r\n\r\nvery bright, brighter then planes.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":28962,"landingOccurred":false,"latitude":35.0154597,"location":null,"logNumber":"US-05052011-0013","longitude":-80.9370459,"occurred":1304658000000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1304661964000,"summary":"Very bright light moving slowly from south to north directly overhead slowly fades out ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fort Mill, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59304"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Avon Lake","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While pulling into my development i noticed in the southern sky what i first thought was a plane. upon longer inspection i realized that it was not a plane. i can easily tell what makes a plane a plane. this light had no navigation lights or any other lights so i know it wasn't a plane or helicopter. it was just at first an orangish light. it was just hovering in the southern sky. after looking at it for about a min. it started moving in a southeaster direction. it started off slow but picked up speed and was moving faster than a plane and as it did the color of it changed from orange to a light blue and then finally a white color before it disappeared from my view behind the tree line. it is a cloudy night and the clouds are low and this was below the clouds. it also made no noise. seeing it really freaked me out a little. once i pulled into my drive i quickly got out of the car to see if i can see it still but there are a lot of trees around my house and it had disappeared behind them. i cannot stress this enough, but i know it wasn't a plane or helicopter.","distance":"501 Feet - 1 Mile","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path","formattedAddress":null,"id":28961,"landingOccurred":false,"latitude":41.5053178,"location":null,"logNumber":"US-08012011-0040","longitude":-82.0282001,"occurred":1304659200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1312252551000,"summary":"Color changing light in sky","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":87,"locationName":"Avon Lake, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59305"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rancho Cucamonga","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was turning on my sprinklers and noticed a strange light in the sky.  it was an orange colored light similar to a flame.  when i saw it i could not figure out what it was so i went inside to get my wife.  she came out and said it was an airplane.  as she said that the light dimmed and re-lit.  i told her that airplanes don't do that.  she then said that it must have gone behind a cloud.  i told her that there were no clouds today.  she then went inside.  living near ontario airport, i've seen many a plane go by, but this was not the same.  i watched the object about 1 to two minutes more before it dimmed out.  the object was moving at a very slow speed exactly parallel to the horizon and never descended or ascended.  it fully dimmed and re-lit twice as i was watching it.  at one point it stopped moving and hovered for about 5 seconds, then resumed it's path.  after about 2 minutes, it dimmed fully.  i then saw a black shadow of an object for about 1 second.  my eyes were unable to find the object in the dark sky after that.  i stayed out there another minute or two, but the object did not reappear.  i then went inside.  i have no pictures or video.  i was just curious if anyone else saw it and reported it.  that is the reason i am reporting it to you.    ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":28960,"landingOccurred":false,"latitude":34.1222317,"location":null,"logNumber":"US-05052011-0013","longitude":-117.5981086,"occurred":1304480700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1304646811000,"summary":"Orange colored light traveling very slow in a southernly direction parallel to the horizon.  light pulsated twice then dimmed out to a black shadow.  no clouds in the sky, light did not float downward.  at one point it hovered for a couple of seconds.","tags":["video"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Rancho Cucamonga, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59306"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Murfreesboro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was on phone talking with my mom. looked out at the the sky to see multiple planes leaving persistant contrails and noticed what appeared to be a bright star in the sky. now it being full daytime and clear blue skies where this object was located. i noticed that it first \"drifted\" west a bit over the course of about 20 minutes. i hung up the phone and ran around my house trying to find aa batteries or to steal them from a wii or dvd remote to power my digital camera, but all that i found were dead. i snapped a picture with my cell phone camera, however i think this object was to high or my cell phone camera just sucks. i looked at the picture i took and from the screen of my cell phone i see nothing but sky.\r\ni called my mom back to let he know it was still out there and drifting now slowly north towards the roofline of my apartment (keeping in mind that the contrails were moving south rather rapidly. i suddenly remembered i have a cheap tasco telescope upstairs and ran to get it.\r\n\r\nthis remembering of the telescope was a breakthrough in my frustration..What i saw through it was not what i expected to see. from the ground with the naked eye this object looked like a star would look in a clear night time sky. however this was broad daylight and it was very visable.\r\n\r\nit took me only seconds to locate the object with my scopr, and as it was moving so slowly it was quite easy to keep in the viewfinder with minor adjustments.\r\n\r\ni witnessed a clear yet reflective object that was continually changing shapes (morphing) it has no definative shape expect that it was contantly changing shape. it reminded me of a clear/metallic/lightproducing garbage bag floating at altitudes equal to the jet contrails being left in a bright blue sky. i am so pleased i got a clear up close look at this thing with my cheapo tasco telescope. once it moved north above my house after about an hour i was tired of watching it. and i have alot going on right now, so i decided to end my pursuit of the object at appx 4pm cdt","distance":"Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28959,"landingOccurred":false,"latitude":35.8490113,"location":null,"logNumber":"US-05052011-0012","longitude":-86.38579,"occurred":1304634780000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1304643542000,"summary":"Bright shiny sphere seen from back window moving slowly against the wind currents","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Murfreesboro, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59307"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Redondo Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live less than 1000 ft to the ocean and as i was driving home about a 1/2 mile from home i noticed a bright orange object over the ocean which first appeared to be a comet but as i watched it it was headed upward toward the sky.  my nephew and his friend were in the car with me when i pointed at it and said \"what is that u guys?\"  as we watched we had stop at a light on sepulveda blvd & prospect, but by that time we were all kind of in shock because we realized what we were witnessing was a definite anomaly.  about 5 min had passed by the time i had first noticed it and we were able to stop and get out of our car to witness it.  by the time we pulled over it had made a 90 degree turn and was heading toward us and was now almost directly over our heads.  it was more bright and larger than any other light source or aircraft in the sky and was changing colors, from orange to yellow to white, my nephew saw other colors. it was traveling at a constant slow speed and at about the\r\nsame altitude as the private airplanes fly at the nearby torrance airport.  i have seen stealth fighters, cessna's, f14's, commercial planes, rockets, comets and falling stars, but this was like nothing we had ever seen before.  when it was directly over head it disappeared and a few second later reappeared as bright as ever and then promptly burst again never to reappear.  whatever this was it flew in an extremely straight trajectory and the light emitted was most bright and prominent in front of the object, i seemed to be pushing through its own light source, kind of like a halo appearance.  it also had a comet like tail, but no contrail at all.  i had handed my cell phone to my nephew so that he could take video but i did not notice until it was too late that it was in camera not video mode, so when he thought he was turning off the camera to get out of the car he actually took a picture on accident, which is the only picture i have.  you can still see the orange object but it is blurred as are the rest of the light sources, i did notice something peculiar about the lights though, they are all blurred in a left angle, except for the orange object in the sky, it is at a left angle.  i am assuming some one with a physics background might be able to explain this.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28956,"landingOccurred":false,"latitude":33.8583816,"location":null,"logNumber":"US-05052011-0009","longitude":-118.3796078,"occurred":1302841320000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,   Sphere,   Square,   Rectagular,   Star-like","source":"MUFON","status":null,"submitted":1304633016000,"summary":"Bright orange oblong comet like object originating over open ocean","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28956_submitter_file1__IMAG0232.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":20,"locationName":"Redondo Beach, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59308"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Eagle Lake","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In july 2006 around 9:00pm on a clear night my wife and i were driving on our way from brenham,tx to bellville,tx on hwy 36 . as we where passing this town called kenny,tx . i was getting on the over pass i started to see a strait line of light passing right over us going towards the west . the lights were flying  so low as if their were helicopters. i mean their was about 15 to 20 lights as big as baseballs . i slowed down and put down my window but their was no noise . this is right in the middle of the woods so you could hear every single noise once i saw the lights i told my wife . that's when we started asking our self's what was those things up in the sky . this lights were so strait in line and so many i didn't know what to think about them . to this day we have never told anyone else about this light on hwy 36 .Kept going south on hwy 36 towards bellville all the way we kept asking our self's about this mysterious lights . the thing is theirs no big airports around this area .            ","distance":"101-500 Feet, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":28954,"landingOccurred":false,"latitude":29.573076,"location":null,"logNumber":"US-05052011-0007","longitude":-96.328263,"occurred":1151650800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1304628327000,"summary":"15 to 20 lights in line up in the sky","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1770,"locationName":"Eagle Lake, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59309"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dublin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":28953,"landingOccurred":false,"latitude":32.090443,"location":null,"logNumber":"US-05052011-0006","longitude":-98.3380882,"occurred":1199833200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cigar,   Cylinder,   Other","source":"MUFON","status":null,"submitted":1304622082000,"summary":"I saw a white, capsule-shaped ufo in january 2008","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1212,"locationName":"Dublin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59310"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"McAllen","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On may 4, 2011 at about noon, *(wit's name deleted--cms/sg) a teacher at mcallen high school, was standing in the administration parking lot at the high school, located at 2021 la vista ave. in mcallen, texas (26.226718,-98.238164), looking up at a strange \"rainbow halo\" effect around the sun. using his smart phone, he snapped a photo. while looking at the photo later, he noticed that there was a bright sphere in the upper right corner of the picture. the rainbow surrounding the sun was caused by high clouds containing ice crystals, according to local meteorologists (link moved to additional evidence section--cms/sg) and some observers think the bright sphere might be a planet or satellite visible because of the darkness of the halo.\r\n\r\nthe first photo attached (halo.Jpg) is the original smart phone photo unaltered in any way. the second photo (halo2.Jpg) is zoomed in and has brightness/contrast enhancement but no other alterations.\r\n","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28952,"landingOccurred":false,"latitude":26.2072971,"location":null,"logNumber":"US-05052011-0005","longitude":-98.2222024,"occurred":1304535600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1304617883000,"summary":"Object photographed within rainbow circle around sun.","tags":["photo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28952_submitter_file1__halo.jpg","http://www.mufoncms.com/files_jeud8334j/28952_submitter_file2__halo2.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"McAllen, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59311"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Cotati","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Bright orange flame like light moving straight and steadily towards us thru the dark starry evening sky at a rate of speed as if it were an airplane, but lacking sound, and having no flashing lights. as it drew close, being about 1,500' up, perhaps 1/2 mile away or less, it slowed as it seemed to notice us looking at it and dimmed and turned around and headed back somewhat the way it came. it continued to be just slightly visible as a dim orange dot in the sky for about a minuet as it continued to move off. \r\ni was walking for exercise a with friend along a path behind a residential neighborhood when i saw this. we were talking about the stars, so it was natural that we noticed this bright orange flame-like light heading right overhead. i thought right away, this is no normal airplane, so i said \"let's stop and wait to see what it is.\" it was heading steadily eastward out of the west and would have gone directly over our position, but just as i said this it began to slow and dim, then turned in a somewhat uneven motion and made a \"u\" turn and headed back slightly to the north of the direction from which it had come. \r\ni watched as it moved off but soon gave up as it was so dim as to be barley visible, and seemed to be heading away at a slow speed. \r\nthis object seemed to look and behave nearly identical to one i saw some time ago not far from this location. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":28951,"landingOccurred":false,"latitude":38.3277778,"location":null,"logNumber":"US-05052011-0004","longitude":-122.7091667,"occurred":1304570400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1304592941000,"summary":"Bright orange light","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cotati, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59312"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St Clair Shores","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This event i've never been able to explain. witnessed by a friend at the time as well, so i know it wasn't imagined. it had to of been 96' or 97' at the time. st clair shores had just finished it's annual christmas tree lighting ceremony at the 11 mile and jefferson library. on our way home the three of us (me, my mom and my friend) stopped at a party store which no longer runs on the corner of 13 mile and jefferson. as my mom went into the store my buddy and i waited in the car and were amazed by what we saw. as we were looking out the window in the east/south/east direction over the lake we noticed a light high in the sky was descending from further south over the lake to north lining up with the direction 13 mile points into the lake. it stayed about the same distance from the shore which i'd have to estimate at about a statue mile but still relatively high at roughly a couple thousand feet until it lined up pretty much exactly with 13 mile and went into a straight downward descent at a mile offshore. as it neared the horizon and water level out there on the lake it slowed drastically and orange and green sequencing illuminations were present. the shape appeared to be saucer on the bottom with larger dome on the top. it entered the water very slowly as we had 10-15 seconds of viewing the lights and the craft to get totally freaked out as it disappeared underwater still somewhat illuminating the water from below far offshore. we said nothing to each other the whole time, then my mother returned to the car, and as we said nothing and craned our necks to watch for anything else she drove off. my mother proceeded to drop my friend off without us saying anything.At the time there was no houses left of the house with the big anchor at the end of 13 mile so the viewing was uninhibited. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28950,"landingOccurred":false,"latitude":42.49876,"location":null,"logNumber":"US-05052011-0003","longitude":-82.886054,"occurred":849418200000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1304587594000,"summary":"Craft submerged itself in lac st clair","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5268,"locationName":"St Clair Shores, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59313"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home from class with my friend laurie jane and we were talking about things to make us laugh.It was approximately 9:47 pm!  i was staring outside my window towards the sky when a really bright light came out of nowhere. i continued to stare at it while calling my friend to it's attention. the bright light split into two, then it split into three bright lights, still having the light intensity as it had when it was only a single bright star. it was not an airplane because it was lower in elevation, it was very bright and there were many airplanes near us amplifying the difference between the lights. i looked at it and found no sign of a body, just a bright light. we tried to make a u turn but it was already gone . it was crazy and i know people are going to be skeptical but i don't care. i know what i saw and my friend does too. it was exhilirating and i wish i recorded it. it happened so fast and it was too exciting to look away from it. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28949,"landingOccurred":false,"latitude":32.7185492,"location":null,"logNumber":"US-05052011-0002","longitude":-117.1506851,"occurred":1304570820000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1304584296000,"summary":"Really bright light came out of nowhere, split into two, then three all going separate ways. ","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:59314"}],"last":false,"totalElements":82758,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1868}
