{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Las Vegas","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were going to area 51... i was taking pictures of the sand devils and this appeard in the picture on the left side.  i't a no fly zone...  didn't notice it there but found it in the picture.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21629,"landingOccurred":false,"latitude":36.123116,"location":null,"logNumber":"US-01242010-0022","longitude":-115.164756,"occurred":1249196400000,"potentialRelations":[],"rating":"Unrated","region":"Nevada","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1264396074000,"summary":"Unknown object out the window of the car (upper left side) with trail of smoke?","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":175,"locationName":"Las Vegas, Nevada","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152908"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Toronto","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  to whom it may concern,\r\n\r\n first of all, let it be known that i am not a ufo \"believer\" per say.\r\n\r\n although this occurred approximately 27 years ago, i thought it's time to report to various ufo investigation organizations. i hope this is worthy.\r\n thank you.\r\n\r\n around the winter of 1980, january perhaps, i just got off work at 9:30 p.M. from the auto dealership. i was a car salesman at the time. i started driving towards the city of toronto, canada, on the qew (queen elizabeth way) eastbound to meet some friends at a bar on the esplanad (a street lined with nightclubs). i didn't have anything to drink, medication and didn't smoke any pot. \r\n\r\nas i was driving, i noticed a string of lights slowly rotating counter clockwise over the city of toronto, at about the ten o'clock position from my point of view. this caught my eye because these formation of lights were very unusual. the lights were evidently in a circular pattern with about two thirds visible as the other third rotated out of view. imagine a pie plate with about 25 lights around the circumference of it. as this \"pie plate\" would revolve, a third of these lights would be hidden from view as if they were obstructed by a solid body. it was at night so all i could see was these rotating string of lights but they were definitely on a \"fixed\" platform as the lights were revolving in unison. \r\n\r\nalthough i've heard of ufo's and was curious, at that time in my life, i didn't really give that much thought about them. i've always been interested in nature and especially about the universe. i've seen all kinds of aircraft and advertising blimps at night before. i drove taxi's off and on for fifteen years on the night shift and have seen countless meteors, lightening, satellites etc. on two occasions i've even seen extremely bright, slow falling, green fireball meteors lighting up the ground, for a couple of seconds, as if it was daylight . i've read, in later years, were other witnesses reported green fireballs as ufo's. i chuckled to myself thinking how easily \"ufo believers\" can be fooled by natural phenomenon. \r\n\r\nanyway, these circle of lights were slowly descending and approaching towards me (westbound), while i was driving about 115 kilometers per hour on the highway (eastbound). these lights were getting closer and closer as \"we\" approached each other. i recall thinking to myself that this must be some kind of advertising balloon and those lights were letters. as i kept driving, i was paying more and more attention to this object because the closer it was getting, the more unusual it looked. i kept glancing at it, while driving, waiting until it was close enough to read what these letters were saying, still thinking it was some kind of advertising blimp. the closer it got, the more i looked at it. now at my nine o'clock position, the string of rotating lights appeared to started to bank left like an airplane would \"turning right\". actually it wasn't banking at all. it was dipping forward pointing towards the ground. at this point, i realized that these lights were not letters at all. they were different shaped, yellowish white lights. the reason these lights were different in shape was because they were \"inset\" into some solid body. when the lights were seen head on, they were circular. but as they rotated out of \"direct\" view, they changed shape like the different crescents of the moon. that's why they appeared to be all different shapes. \r\n\r\nduring the time when this object started to bank left, or i thought from my point of view, i was struggling with myself trying to understand whether this was a plane, blimp, or a balloon. it was flying too slow for a plane, yet, too fast for a blimp. also, it didn't appear to be flying or floating. the best way i can describe it's motion is that it looked like it was \"sailing\" in the sky. \r\n\r\nwhat's interesting here is that the human brain tries to associate what the eyes are seeing, to something already seen or experienced before. that's why i was at war with myself trying to decide whether this object was a plane, blimp or a balloon. every time i resigned myself to what i must be witnessing, i jumped to another conclusion. this jumping from one conclusion to another occurred during the whole experience. i was imagining all kinds of things. for example, if it was a plane, the only way these lights could have been positioned was in a circle because this plane must have had some kind of supporting structure in a circle from wing tip to wing tip. this didn't make any sense at all. i've seen advertising planes before. this was nothing like this. not even close. than i was trying to imagine a \"goodyear blimp\" with these letters going across it's side. this was nothing like it either. so here i was, trying to drive and watch this object at the same time. as i was driving, i started to slow down because i kept looking at this circle of lights more than the road ahead of me. in retrospect, i don't even know how i kept my car on the road because i was so awed by this display in the sky. \r\n\r\nhere is the killer. \r\n\r\nas the object kept dipping forward more and more, it eventually ended up totally perpendicular to the ground! the first thing that came to mind was a big ferris wheel rotating in the sky. at this point i slowed down to about 50 kph (30 miles an hour in a 60 mph highway for my american friends) and put my four way, flashing hazard lights on my car fearing that another car would crash into the back of me for going so slow on a 100 kph highway. \r\n\r\nhere is another shocker. \r\n\r\nas i was mesmerized by this strange looking object, a surge of adrenaline hit me like a ton of bricks. i didn't realize how big this thing was. at first i thought it was the size of an airplane fairly close. it was gigantic! at least twice the size of a football field, bigger than an aircraft carrier!!! i don't know what gave away it's size. maybe the reflections of light on the ground. the best way i can relate this sudden realization is like one of those illusions most of us have seen. you know, when you look at a pixel drawing with an image you can't see until you stare at it for a while? after a period of time, you make out the face of a women or something like that? that's kind of the transformation i experienced. at first i thought the object was the size of a large plane than suddenly i really saw it. it was huge!!! i yelled out loud to my self, \"holey f**k, it's huge!!!\". i don't f***ing believe it, it's f***ing huge!!!. i thought it was fairly close at first, than bang!, it was much farther away and larger than my brain first comprehended it. speaking about this surge of adrenaline. have you ever had a really close call having a car accident? when your heart rate skyrockets to about 180 beats per minute? that's what i felt when i realized how gargantuan this object was! i could actually feel my heart pounding like crazy. to be frank, it literally scared the hell out of me, when i realized how big it was. at this point, i rolled down my window and pointed to this giant \"ferris wheel\" in the sky to the other motorists, but it appeared no one seemed to notice as they screamed by me at regular highway speeds. i remember how cold it was when i rolled down my window. it was something like minus 30 celsius below zero. \r\n\r\nafter, i don't know how long, probably only a few seconds of rotating in this perpendicular position, this thing started to climb and right itself and \"sail\" back to the direction it originally came from. i rolled up my window, turned off my hazard lights, and started to speed up to chase it. still it seemed other motorists didn't notice this object. it still irks me to this day. as i was approaching the city limits, this object was in it's flat position again climbing over the city. then, all of a sudden, the rotating lights turned off except for a red \"aircraft like\" blinking light (which i never noticed before). after a few seconds, the rotating lights turned on again. it was like in the movie \"close encounters of the third kind\". the lights just blasted on. than after a few seconds they turned off again as it seemed to be right over the city. strange behavior. now i was exiting off of the highway on to spadina rd. i lost track of these lights because of the tall buildings. when i was on the street where i was going, i saw a cop parked on the other side of the road writing a parking ticked. i stopped in the middle of the road and ran over to him. he was quite taken aback by my seemingly aggressive approach. i asked him, \"how long have you been here?\" i forgot what he said, but i asked, \"did you see that big circle of lights flying in the sky? he said \"no\". after parking my car, i met my friends at the bar, \"baily's\", and told them what happened but they didn't take me seriously as they've already had a few and were more interested in the ladies. \r\n\r\nafter sitting at the bar by myself for a couple of hours i went home. i was living at my parent's house at the time, temporarily, so when i got home around 1 a.M., i called the police. i didn't know who else to phone at the time. they didn't take me seriously of course so after that, i phoned the toronto international airport and managed to get through to air traffic control and asked them if they had anyone call in with a ufo report. nothing. so i called the police again and convinced them to take me seriously as i wanted to make a report. they told me they can send a couple of officers to my house. as it was late and my parents were asleep, i told them i'd rather come to the station the next day to report. next morning, when i contemplated going in i decided not to, fearing they would think i'm some kind of wacko. \r\n\r\nas the days went by, scanning the newspapers looking for a \"ufo sighting\" to no avail, i started doubting myself. i was trying to convince myself that perhaps i was somehow mistaken. maybe it was something not out of the ordinary at all. maybe it was a balloon or airplane of some kind. maybe like thousands of others, i witnessed something that i misinterpreted for something else. \r\n\r\nand now the conclusion. \r\n\r\nabout a week or so later, on or about the tenth page of the toronto star, bottom right hand corner, there it was! a short article. \"dozens of mississauga residents reported a ufo as big as a football field!!!\" i don't recall the whole article. \"finally\" i said to myself. \"i knew it was real\", \"i knew i didn't imagine this\". i'll never, ever, doubt myself again no matter how much ridicule i'll be subjected to. i have only one regret however. that is i wish i had others with me to experience this. after about 27 years, i just had to let this out.\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21628,"landingOccurred":false,"latitude":43.655946,"location":null,"logNumber":"CA-01242010-0021","longitude":-79.3766843,"occurred":316848600000,"potentialRelations":[44257,21633,21632],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1264393596000,"summary":"\"dozens of mississauga residents report a ufo as big as a football field\"","tags":["ufo"],"timeZone":"EST","timeZoneName":"EST","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21628_submitter_file1__Original3.bmp","http://www.mufoncms.com/files_jeud8334j/21628_submitter_file2__Original4.bmp","http://www.mufoncms.com/files_jeud8334j/21628_submitter_file3__Redraw1.bmp"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":10966,"locationName":"Toronto, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152909"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Brownsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While standing outside my house with my dog, i noticed this rather large sphere object coming towards my direction from the west northwest direction towards an east southeast direction, i would calculate around 8 thousand feet judging from comercial flights passing over 10 thousand feet. it moved rather gracefully, no sound, no anti-collision lights of any type. i called my wife out to see it and as she came out of the house the object made a smooth curve turn towards the east, then it turned again smoothing towards the south. we both stared at it for a couple of seconds till it dissappeared or better yet dimmed out. there is no way it would have dimmed out so quickly. it would have been visible for another minute or so since it was brighter than any object in the sky including the visible planets to the east and west and any star in orions constellation at the moment. this thing was huge in brightness. yellowish in appearance. just dimmed out as it moved south. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21627,"landingOccurred":false,"latitude":25.9103472,"location":null,"logNumber":"US-01242010-0020","longitude":-97.4896838,"occurred":1264390080000,"potentialRelations":[21630],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere,   Star-like","source":"MUFON","status":null,"submitted":1264394505000,"summary":"Large sphere bright traveling from west to the east  then south no sound","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Brownsville, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152910"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop, Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover), Unknown","city":"Calgary","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On may 14 2006 i was on a road trip with my girl kim an her room martina.We were on highway 24 south west of blakkie. i was eating chips an talking then i felt the sofest feathers ever the next thing i know i was not in the truck no more i was in the wing of my angel. one min into the flight i felt a steady viberation from my tail bone to the center of my face,i was now in free flight i flew around an meet everybody that was their. i was brought before jah/allah/god an his council of embassadors an kings. i was then taken under the new covenant of jah/allah/god and appointed an embassador an king in waiting,( psalms 91 )i have all the skulls,(the chrystal skull)(the roman skull)(the mummy skull)(the black skull)(the white skull)(the gray alien skull)(the spanish soldier skull)(the cow skull)(the blue whale skull)(the dolphin skull)(the silver back gorilla skull)(the cow skull)(the goat skull)(the indean skull)( the kings skulls an more. i have the only real photo of jah/allah/god and jesus at his right hand,an my angel that bears the staff,the cross,and the scroll that i view an have a copy. my angel stands over twenty thousand feet tall. anyway no small talk ill send you a photo or two.I have the largest ufo jump on flim of the arival of everyone....... i have been to the following the mayores office/the army/to churches/the media/to the common man an beyond so here i am talking to you.\r\nyou tell me/","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s),  Patterned Surface,  Insignia,  Wings,  Other,  Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown","formattedAddress":null,"id":21626,"landingOccurred":false,"latitude":51.04744,"location":null,"logNumber":"CA-01242010-0019","longitude":-114.0516422,"occurred":1147645800000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Blimp,   Boomerang,   Bullet,   Missile,   Cigar,   Cone,   Chevron,   Circle,   Cross,   Cylinder,   Diamond,   Disc,   Egg,   Flash,   Oval,   Saturn-like,   Sphere,   Square,   Rectagular,   Star-like,   Teardrop,   Triangle,   Other,   Unknown","source":"MUFON","status":null,"submitted":1264393667000,"summary":"Largest meeting of embassador's an king's from acroos the solar system in cluding god,jesus,my angel,all the aliens ect.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21626_submitter_file1__PICKEDUPBYANANGEL.pptRecovered.ppt"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1351,"locationName":"Calgary, Alberta","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:152911"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"West Covina","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My dad called me out side to see what he was looking at and they were the same orbs that we observed several times at our home. i looked up and started watching them. than noticed that the one wasn't the only one. than i noticed more and more. in all i must have counted over 16 white orbs right over my house in all directions just hovering in place. than some of them began to move and i saw 3 of the orbs make a perfect triangle. the orbs started to disappear. i've never seen anything like what i just seen before. and there were several members of my family that seen what i did. after we watch two other in different locations fading in and out of sight but in the same path. ","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":21625,"landingOccurred":false,"latitude":34.0696808,"location":null,"logNumber":"US-01242010-0018","longitude":-117.9338826,"occurred":1264376700000,"potentialRelations":[21634],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1264389972000,"summary":"White orbs","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"West Covina, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152912"},{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (no cloudcover)","city":"Sprague","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" on or about oct.12,1958, around 4:35pm a ufo was observed from my neighbors back yard,for about 5 minutes by myself, friend ernest benoit and his mother.\r\n our game of football (pass) was halted when we became aware of an object in the sky. we became awestruck watching a large whitish cigar shaped object of about 100 yards in length and maybe 20 yards high. it was about 1 mile away and approached slowly and silently at between 800 and 1,000 yards above the north eastern wall of the valley treeline.\r\n  the ufo stopped and silently hovered about half a mile from us for about\r\n3 minutes. i asked ernest to have his sister bring out a camera and get some photos, but she was out of film. the ufo seemed to become brighter and flew\r\noff like a soundless bullet at about 4:41pm from the direction where it had originated, the south east. never to be seen by us again.                    (later i realized that the area over which it had been hovering was where the town drinking water supply was located. it was not a weather balloon!!)\r\n    \r\n   [this incident has never been reported or put into print before.]\r\n  \r\n \r\n ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":21624,"landingOccurred":false,"latitude":41.6172065,"location":null,"logNumber":"US-01242010-0017","longitude":-72.0850766,"occurred":-385601100000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1264383480000,"summary":" observed large cigar shaped ufo moving slowly and silently  about 1,000 yards above treeline. it hovered for 3 minutes, took off like a bullet.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":19097,"locationName":"Sprague, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152913"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Little Rock","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At around noon i was working inside a warehouse when i heard an unusual roar. i am in an area that has and air force base to the north (lrafb) and an arkansas national guard station. i am a fan of air shows and can generally identify an aircraft by the sound it makes. c-130 and blackhawk helicopters are the norm for this area, although we have an occasional visit by an a-10 warthog and once i heard the distinctive sound of an osprey going over. i learned that sound by visiting the marine corps naval air station at camp lejuene north carolina.\r\n\r\nthe day this occurred, i knew it was something unusual. it sounded to me like whatever it was was flying very low and i went outside to look. oddly, even though the sound was reverberating, i could not spot what it was and gave up after a minute of staring at the partly cloudy sky.\r\n\r\nthat evening, a good friend of mine called to tell me she had seen a trio of b-2 stealth bombers flying over north little rock, very high up, and trailed by something unusual that seemed to swing in a pendulum-like fashion behind the planes. i immediately suspected what time this took place and after she confirmed it, i wished desperately that i had tried harder to get a glimpse.\r\n\r\ni have known this person for over 25 years and i know her to be exact and meticulous in everything she does and says. \r\n\r\ni have heard a stealth bomber bofore, but never this loud. unless there was something unusual about the weather conditions that magnified the sound of these three planes, then there should not have been that much of a rumble from them at the height she was describing.\r\n\r\ni truly wish that i had taken more time to see what it was that was trailing them. perhaps that is the explanation for the loudness of the sound. i can tell you that it was so pervasive that i could not pinpoint a direction to look for them and knowing now where her vantage point was and where they actually flew, i can state that it was not anywhere near the direction i was assuming. i was searcing standard flight paths that the local bases tended to take. \r\n\r\ni would be most interested to hear if anyone else saw or heard anything ususual on that day.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21623,"landingOccurred":false,"latitude":34.7548609,"location":null,"logNumber":"US-01242010-0016","longitude":-92.2885848,"occurred":1263715200000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1264383115000,"summary":"Sound only.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":7,"locationName":"Little Rock, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152914"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Galloway","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving home from work 20 min ago, as i was driving down my wooded street a very black object about twice the size of my truck looking somewhat like a sheet of black paper?The way it was bending/flying just appeared at the top of the trees. i tried to chase it with my vehicle but i lost sight of it right away.\r\n","distance":"101-500 Feet","duration":"00:00:03","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":21622,"landingOccurred":false,"latitude":39.4969133,"location":null,"logNumber":"US-01242010-0015","longitude":-74.4692656,"occurred":1264377600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1264379629000,"summary":"Cloaking black object at tree line","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Galloway, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152915"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Last night, between 7-8pm, my friend and i observed two brilliant white lights, one moving s/sw, the second light moving e/ne. the first light seemed to be in the upper atmosphere or perhaps in earth's orbit. it appeared to be moving at the same rate of speed that satelites appear to be moving when viewed from earth. i noticed it because it was, briefly, about three times as intense as the other stars in the sky. as soon as i noticed it, the light began to dim out and was no longer visible within a 2-3 second period. a moment later another bright light moved over us, this one much brighter, apparently moving faster, and apparently much closer to the ground. there were no other lights on it, and what we saw could'nt have been the headlight of a plane (theyve gotten so bright these days). the second light was highly visible as it moved toward the horizon, and dimmed out abruptly rather than fading away. \r\n\r\ni have observed similar lights in the night sky in texas, oregon, and colorado over the years. i have also viewed shooting stars that move in sort of zig-zag patterns over austin. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21621,"landingOccurred":false,"latitude":30.269023,"location":null,"logNumber":"US-01242010-0014","longitude":-97.7367908,"occurred":1290499200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1264374298000,"summary":"Bright white lights flying over austin","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152916"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Marietta","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On jan. 6th at 8pm, i was on my way, along with a group of colleagues, to a meeting.  we noticed a very bright luminary in approximately the same place that sirius is in the sky at that time.  this luminary was behaving very differently than an ordinary star and appeared larger than sirius.  it was flashing color in a patterned way, red, blue green, white.  it moved vertically and horizontally as well.  we watched it for about 1/2 hour, and it was still in the sky when we left.  a video of the same luminary was made at 3:43am, 7 hours later about 50 degrees from the horizon in the se sky.  the enclosed footage will show clearly the behavior of this luminary.  the camera was on a tripod, as stated at about 3 minutes into the footage.  it was witnessed for about 45 minutes and remained there even after taping stopped.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":21619,"landingOccurred":false,"latitude":33.957282,"location":null,"logNumber":"US-01242010-0012","longitude":-84.5412427,"occurred":1262837700000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1264370817000,"summary":"Bright. luminary in the sky that flashed brightly the following colors: red, blue, green, orange and white.  it moved both horizontally and vertically.","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21619_submitter_file1__UFO_1_6_10_DVNTSCAnamorphic.wmv"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":17,"locationName":"Marietta, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152917"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I would like to ask u a question about mars and the moon. online i have been watching videos on mars and the moon, and they say as of right now there is life on mars and the moon. they have found little out post on the darkside of the moon and nasa has seen a smoke stack come out of the ground and release smoke up in the atmosphere, they say the stack releaseing the smoke had to be at least 700 feet in the air and also they say there are cooling tower on the dark side of the moon. what about mars, they have found pyrmaids on the landscape and they think alleins are dug into the ground and have a base there, underground. is any thing going to be done about this in the near future to vist this landscape, and well information going to be with held from us if this stuff is true. i would love to know if mufon think this is true and if so my u please post something about this in the near future.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21618,"landingOccurred":false,"latitude":40.0623638,"location":null,"logNumber":"US-01242010-0011","longitude":-74.3998912,"occurred":1253862000000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1264369003000,"summary":"Starship","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":121,"locationName":"New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152918"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Weymouth","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" coming out of a gathering of folks, at approximately 9:20-9:30 p.M. (non-alcohol music venue),i saw in the northern sky, a large glow of muted orange light. it was behind the treetops, and looked to be a few miles away. only the \"bottom half\" was showing, as a setting sun does when it sinks below a cloud, but it seemed perfectly stationary. the bottom edge was well delineated,perfectly round, but the top(if, indeed it was a sphere or disk), seemed shrouded in cloud. i walked along the walkway out front, finding a better place to see it between the trees, saying,\"what the heck is that? my boyfriend said,\"that's the moon\", whereupon i pointed to the actual half-moon, high, bright white, and to the left of us. i ran into the building to tell our host. he came out and said \"maybe it's the moon\", as did nearly everyone else who looked at it. my boyfriend said \"it's a planet\". i said. \"if that's a planet, we're in deep #%&*. it could have been mistaken for the moon, as it was just a bit smaller than the moon from our perspective. but like i said, the moon was already there. i was rather excited to be seeing such a mysterious thing, but nobody else seemed to be. one or two people sang the theme to \"twilight zone\" as they got in their cars and left, but that was about it. they all saw it when i pointed it out, though.  \r\n   we got in the car and drove around to find a place we could see it better, but we didn't see it from anywhere else. we came back to the building (it sits on a slight hill just barely away from the orange streetlights so prevalent here. in fact, i thought it could be one of those lights at first, but too high, much too large at the distance it seemed to be, and the wrong shape and not quite the right color). on the approach to the driveway, i could see the \"object\", and once we got up to where i had first seen it, i could tell it was in the same place as before. \r\n  i wanted to stay and see if this thing would move, or \"do something\", but it was late, so we left. i looked out the window the whole way home, and didn't see it again.  \r\n    could it have been an atmospheric reflection of the moon? (the positions/angles of the two objects wouldn't have matched in a reflection, in my opinion). could it even have been a large solid sphere reflecting the streetlights at the bottom and not the top?\r\n  oddly enough, i saw another sky phenomenon from the same place, in november or december 2009, a meteor, but not like any i've ever seen before, close and slow moving with twin tails, a bright spot in front and the trails were a golden color. i was the only witness to it that i know of. the reason i noticed the orange glow is that now i'm in the habit of looking at the sky from there after seeing the \"meteor\" back then. \r\n   by the way, my boyfriend is a real skeptic and even he thought the orange glow was bizarre. \r\n  i have had a few other odd experiences, dreams or sightings over the years, all different.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":21616,"landingOccurred":false,"latitude":42.2275833,"location":null,"logNumber":"US-01242010-0009","longitude":-70.9351184,"occurred":1264311000000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Circle,   Disc,   Sphere","source":"MUFON","status":null,"submitted":1264357766000,"summary":"Dusky orangehalf-visible orb or sphere in northern sky, very large, 1/4 inch at arm's length","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Weymouth, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152919"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mt. Judea","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was cleaning off the deck on january the 18th of 2010 near 6:30 pm when i noticed toward the east/southest that there was a very bright light. since i know little about astronomy i guessed it was something like mars or jupitor. there was little cloudcover just wind. i just dismissed it then looked up about 5 minutes later and it was much bigger and brighter. i knew it wasn't a star or planet and it didn't have a blinking light like every other airplane that goes over the house so i knew something was off. it looked like it was starting to morph into something else so i ran in and first got my camcorder and took a short look at it. weather and my health was not on my side. my camcorder would zoom in onto it but the wind was blowing, my hands we shaking, and it was moving at a pretty fast pace so i just couldn't get a good shot. i then decided to get my camera and took a few pictures. the first one looks kind of like a flying saucer. the other one shows how it morphed into a triangle like object. the colors at first was white, then yellow, then red, then orange, then green. it might as well been a flying rainbow. i know the quality is not the best but under those conditions, i was pleased and surprised to be able to even get anything on camera seeing as the camera doesn't work well at night (or i just suck at operating it, probably the latter). it was flying at around the same speed as a standard aircraft but was much bigger and lower. there was also no noise so that was really creepy. it took only about 10 minutes from going from one horizon to the other to lose sight of it. mt. judea has had several weird sightings before. we have c-130s from jacksonsville afb flying over a lot and some a-10 warthogs from fort smith. since we're near the highest point in the ozarks it is a great traing spot for the military to train for conditions in afghanistan. we've also had ch-47 helicopters fly over as well. i knew that this was not any of them. whatever it was, it took a lot of know how to build. i hope this helps in the quest for the truth. thanks again! ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21615,"landingOccurred":false,"latitude":35.9255962,"location":null,"logNumber":"US-01242010-0008","longitude":-93.058174,"occurred":1263867480000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Circle,   Disc,   Star-like,   Triangle","source":"MUFON","status":null,"submitted":1264344433000,"summary":"The oddest thing in the sky i've ever seen!","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21615_submitter_file1__DSC_0001.JPG","http://www.mufoncms.com/files_jeud8334j/21615_submitter_file2__DSC_0002.JPG","http://www.mufoncms.com/files_jeud8334j/21615_submitter_file3__20100118183010.mpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Mt. Judea, Arkansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:152920"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mt. Judea","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was cleaning off the deck on january the 18th of 2010 near 6:30 pm when i noticed toward the east/southest that there was a very bright light. since i know little about astronomy i guessed it was something like mars or jupitor. there was little cloudcover just wind. i just dismissed it then looked up about 5 minutes later and it was much bigger and brighter. i knew it wasn't a star or planet and it didn't have a blinking light like every other airplane that goes over the house so i knew something was off. it looked like it was starting to morph into something else so i ran in and first got my camcorder and took a short look at it. weather and my health was not on my side. my camcorder would zoom in onto it but the wind was blowing, my hands we shaking, and it was moving at a pretty fast pace so i just couldn't get a good shot. i then decided to get my camera and took a few pictures. the first one looks kind of like a flying saucer. the other one shows how it morphed into a triangle like object. the colors at first was white, then yellow, then red, then orange, then green. it might as well been a flying rainbow. i know the quality is not the best but under those conditions, i was pleased and surprised to be able to even get anything on camera seeing as the camera doesn't work well at night (or i just suck at operating it, probably the latter). it was flying at around the same speed as a standard aircraft but was much bigger and lower. there was also no noise so that was really creepy. it took only about 10 minutes from going from one horizon to the other to lose sight of it. mt. judea has had several weird sightings before. we have c-130s from jacksonsville afb flying over a lot and some a-10 warthogs from fort smith. since we're near the highest point in the ozarks it is a great traing spot for the military to train for conditions in afghanistan. we've also had ch-47 helicopters fly over as well. i knew that this was not any of them. whatever it was, it took a lot of know how to build. i hope this helps in the quest for the truth. thanks again! ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21614,"landingOccurred":false,"latitude":35.9313162,"location":null,"logNumber":"US-01242010-0007","longitude":-93.059054,"occurred":1263867480000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Circle,   Disc,   Star-like,   Triangle","source":"MUFON","status":null,"submitted":1264342942000,"summary":"The oddest thing in the sky i've ever seen!","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21614_submitter_file1__DSC_0001.JPG","http://www.mufoncms.com/files_jeud8334j/21614_submitter_file2__DSC_0002.JPG","http://www.mufoncms.com/files_jeud8334j/21614_submitter_file3__20100118183010.mpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Mt. Judea, Arkansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:152921"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"La Oliva","country":"Spain","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband was outside and called me.He had been watching an orange ball moving from the north east, going southwards. this object was much bigger than a star and became stationary for approx two minutes before disappearing. we heard on our local radio station the following morning that this object had also been seen by people on corralejo, our nearest town and also on the island of tenerife, the tenerife sighting is actually on 'you tube'. we had a sighting here last new years eve which we informed you about and are always looking !!! we were pleased to have seen something else - i can't wait for them to land and come and see us !!!!! believe 100%, know they have been here for ever and look forward for disclosure which must happen soon, the governments must stop covering up such an important fact !! what has happened to dr steven greer's letter to the president of the us regarding this ???","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path then hovering","formattedAddress":null,"id":21613,"landingOccurred":false,"latitude":28.610399,"location":null,"logNumber":"ES-01242010-0006","longitude":-13.9288029,"occurred":1262331000000,"potentialRelations":[],"rating":"Unrated","region":"Canarias","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1264344039000,"summary":"Orange ball moving south,stationary for about two minutes","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":23,"locationName":"La Oliva, Canarias","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152922"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mt. Judea","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was cleaning off the deck on january the 18th of 2010 near 6:30 pm when i noticed toward the east/southest that there was a very bright light. since i know little about astronomy i guessed it was something like mars or jupitor. there was little cloudcover just wind. i just dismissed it then looked up about 5 minutes later and it was much bigger and brighter. i knew it wasn't a star or planet and it didn't have a blinking light like every other airplane that goes over the house so i knew something was off. it looked like it was starting to morph into something else so i ran in and first got my camcorder and took a short look at it. weather and my health was not on my side. my camcorder would zoom in onto it but the wind was blowing, my hands we shaking, and it was moving at a pretty fast pace so i just couldn't get a good shot. i then decided to get my camera and took a few pictures. the first one looks kind of like a flying saucer. the other one shows how it morphed into a triangle like object. the colors at first was white, then yellow, then red, then orange, then green. it might as well been a flying rainbow. i know the quality is not the best but under those conditions, i was pleased and surprised to be able to even get anything on camera seeing as the camera doesn't work well at night (or i just suck at operating it, probably the latter). it was flying at around the same speed as a standard aircraft but was much bigger and lower. there was also no noise so that was really creepy. it took only about 10 minutes from going from one horizon to the other to lose sight of it. mt. judea has had several weird sightings before. we have c-130s from jacksonsville afb flying over a lot and some a-10 warthogs from fort smith. since we're near the highest point in the ozarks it is a great traing spot for the military to train for conditions in afghanistan. we've also had ch-47 helicopters fly over as well. i knew that this was not any of them. whatever it was, it took a lot of know how to build. i hope this helps in the quest for the truth. thanks again! ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21612,"landingOccurred":false,"latitude":35.9278962,"location":null,"logNumber":"US-01242010-0005","longitude":-93.054594,"occurred":1263867480000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Circle,   Disc,   Star-like,   Triangle","source":"MUFON","status":null,"submitted":1264340042000,"summary":"The oddest thing in the sky i've ever seen!","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21612_submitter_file1__DSC_0001.JPG","http://www.mufoncms.com/files_jeud8334j/21612_submitter_file2__DSC_0002.JPG","http://www.mufoncms.com/files_jeud8334j/21612_submitter_file3__20100118183010.mpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Mt. Judea, Arkansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:152923"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Understandably memory fades.I have been witness to three separate events.One very close. however this event was widely spotted across several counties and investigated by kwix radio out of moberly mo.\r\nthe exact year even escapes me now but it was early in the year,no leaves on the maple tree outside.1975-1977 mid to late winter.\r\nour house was situated 1/4 west of audrain co.Rd.989 (range line rd.),1/8 mile south of audrain co.Rd.946.\r\ni had used the bathroom,located on the west side of the house,getting ready for bed. a habit was to always look out the bathroom window every night,see if any clouds are coming in and to make sure all is well.\r\ni saw a red ball of light moving south to north at a leisurely pace.35 to 45 mph.I estimated it about over hwy. 63 probably 9 miles to the north of columbia.As i watched another light appeared,lined up neatly with good spacing behind the first,then directly came another,out of nowhere,this continued until there were 6 all running at the same altitude,equidistant from one another.I watched until i could no longer see them due to the limitation of the window.\r\n the following morning kwix radio had a couple of call in shows,party line and trading post.They were inundated with calls.The strange lights were seen apparently from all throughout the listening area.Kwix investigated the reports. according to kwix the military had no flights of any kind in our area and the airport at columbia never had anything on radar.\r\n i have never seen or heard anything more about it since that time.It was incredible.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":21610,"landingOccurred":false,"latitude":37.9714129,"location":null,"logNumber":"US-01242010-0003","longitude":-91.8281033999999,"occurred":194083200000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Fireball,   Sphere","source":"MUFON","status":null,"submitted":1264331818000,"summary":"Red orbs of light","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":12387,"locationName":"Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152924"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"West Chester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While returning from work one evening in early 1979, driving alone toward west chester on marshallton-thorndale road, a road familiar to me, i suddenly came upon a huge, illuminated, silent disk hovering above a field to my left, maybe 40-50' above field and the scrub trees that bordered the field.  i had driven that road regularly over the previous six months and knew that nothing was being built in that empty horse pasture.  the section of road where it appeared was, at that time, just a dark, narrow, paved, 2-lane country road with no berm, and with no streetlights nor houses anywhere nearby.  there was no oncoming traffic.  it was in the dead of winter, at a time when it was already almost dark when i left work in coatesville at 5pm.\r\n\r\nit was my habit to listen to the car radio while driving home, so the radio was probably turned on to the philadelphia 24-hour news station.  but when i saw the huge round/oval \"thing\" hovering above the field, i was auditorily aware only of silence.  i can only assume that at some point the radio went dead, but i had no awareness of the radio sound disappearing at the time, probably because my attention was riveted on that strange, bright disk in the air.  all i was aware of was that that that \"thing\" seemed very close to my car, too close for comfort, and that for as huge as it was, hanging motionless in the air there, it was absolutely silent.\r\n\r\ni am very bad at estimating sizes and distances without having something nearby with which to make comparison, but i would say that the disk was very large, but smaller than a football field.  i could only see the bottom, and had no sense of whether the sides were boxed or came down to a > on the edge.  the bottom of the disk was so evenly illuminated that you could not see bright spots where bulbs would have been.  it was just a huge solid, glowing white disk.\r\n\r\ni couldn't be sure if it was round or slightly oval, because i was looking up at it from off to the side.\r\n\r\nthe strangest part of all to me was that, although the bottom of the disk (the only part i could see) was completely lit in a pure white light of comfortable brightness, it cast no illumination upon the trees or ground beneath it!  \r\n\r\ni don't recall whether i accellerated or decellerated to the t-intersection about a 1/2 mile ahead where i had to make a left-hand turn, but i think i held my breath as i got there and made the turn onto strasburg road heading toward the town of west chester.  i remember somehow feeling \"safe\" that i made it to strasburg, which was a much more heavily travelled street than marshallton-thorndale road.  i do recall driving very slowly after i made the turn, crawling along so i could look at that field to my left from the vantage point of the other road.  but what i saw was -- absolutely nothing!  the field and the air above it were completely empty.  in a matter of a minute or less than a minute, the \"thing\" had disappeared, evaporated, gone.\r\n\r\ni continued my journey home, each mile of the way feeling more and more relieved to have \"escaped\" unharmed.  at that time ufos were not a big item in my life.  i had heard about them but wasn't sure if they were real or just figments of overactive imaginations.  i had never read much about the topic and was, quite frankly, not interested in them.  i had never imagined previously that i would ever have any type of encounter with a ufo, because i never thought about them at all.  however, immediately when i saw the disk, i thought it was a ufo from another planet.  it was the silence of it that seemed so unearthly.  \r\n\r\nmy overall feelings during the encounter were ones of excitement tinged with fear.  afterwards other emotions emerged, mostly embarrassment.  there was also a little bit of pride that i had been somehow chosen to see this revelation.  however, i told no one, not a single soul, about this experience for several years.  the main reason for my silence was that my work was in the mental health field, and i did not want to be seen or teased as \"crazy\" for talking about such an experience.  and, in addition, there was no one in my life at that time whom i felt deserved to learn about this special encounter.  \r\n\r\nthis event happened such a long time ago -- 31 years ago.  i've written here every possible aspect of the encounter and all my feelings about it.  it was a momentary event in my life, probably less than two minutes out of what is now going on 70 years.  but it did make a strong impression upon me.  the reason i looked up your website to tell you about this tonight is that this evening i just listened for the first time to a member of mufon on the renseradio.Com.\r\n\r\ni don't mind being contacted by a mufon, but i really don't want to talk to others about this.\r\n\r\n\r\n\r\n","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":21609,"landingOccurred":false,"latitude":39.9691643,"location":null,"logNumber":"US-01242010-0002","longitude":-75.6025182,"occurred":284866200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1264326715000,"summary":"Huge illuminated, silent disk suddenly appeared at roadside, hovering over field maybe 50' above bordering trees.   amazing part:  although itself well-illuminated, the disk cast no light on the ground below.","tags":["light","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":11336,"locationName":"West Chester, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152925"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Montreal","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hundreds ufo over the matawini sacred site  (2009 summer)\r\n\r\nfrom astraelia:  montreal, quebec, canada\r\nastraelia@gmail.Com\r\nvisit the sacred site of matawini:\r\nwww.Astraelia@piczo.Com\r\n\r\n\r\nthe galactic federation have showed up in great numbers at the matawini site during the whole of the summer of 2009...\r\n\r\nthe fireball across the horizon\r\nit started with a bang so to say...\r\nit was the first night that i was there after having rented a cottage for the whole season.\r\nafter having finished unpacking, i said to myself, now, i am gone to rest now and have a look outside, and then i told jokingly to myself: '' to see if i see some ufo ? ''\r\n\r\nthen i open the door to look outside, and then, right away, i see a huge ball of fire crossing at the speed of a meteorite from the right to the left of the sky, crossing the whole horizon in a split second, and following a perfectly straight horizontal trajectory !!!\r\nit left behind a bright fiery trace in a perfectly straight horizontal line that persisted a few second after the fireball like ufo had passed and continue behind the trees. \r\n\r\nthat was quite a starter !\r\n\r\nduring this summer of 2009, there was innumerable ufo showing almost every starry night . \r\n\r\nit started very progressively, every night i went to the circular landing area on the side of the road. after a few weeks of no ufo at all, then some started to appear, here and then, but in a very discrete and dissimulated manner. \r\n\r\nthen, night after night, there was more ufo that the preceding night.\r\nwith the many groups of people who came visit the matawini site for the first time in modern history, as i had expected, the ufo sighting would amplify. all these people where to some degree spiritually and ufo aware.\r\n\r\nthen, this progression in the number of sightings continued to the point, that every clear and starry night, there was an almost constant flow of ufo appearance, between 12 to 20 ufo appearing every nights, with a great variety of type and manner of appearance and behaviour. at a point, i had to go to sleep, but it certainly would have continued far in the night if i could have stayed outside all night. \r\n\r\n2012 countdown clock of ufo  over matawini site:\r\ni saw again the same 2012 countdown clock of ufo that was described in the book blue star prophecy of miriam delicado, and that i saw in montreal a few years ago.\r\n\r\nit was almost exactly the same, a series of 6 ufo's started to appear one after the other, in a perfectly precise circular configuration representing the left side of a clock from the 6 to 12 hour. the first ufo appeared starting at the bottom and then a second one at the 7h position and another following at the 8h. then 9h. and so on until a 6th. ufo appeared in the top position of the clock for the 12th. hour, representing the year 2012. then, i saw another ufo crossing the sky in a straight line at great speed and leaving a trace of light behind. the direction and angle of the trajectory of this ufo in the night sky, was pointing exactly toward the circular ufo lift off area that is located further away on the side of the road, and that is located where the spherical stone appeared in a powerful lightning strike spiritual experienced that happened with my girlfriend as we were coming back from a visit to the sacred cave of matawini...\r\n\r\nthe very numerous ufo presence at the site, for the first summer,\r\ntells me that the galactic federation is now  very aware of the matawini site and may have followed closely all the new discoveries that i have made. \r\n\r\ni consider their massive showing during all the 2009 summer season indicates that the matawini site is now officially under the protection of the galactic federation of light. \r\n\r\nthis is some real good news. i now remember that i had foreseen this in my prayers and seed-visions for the future. often i have given the permission to the galactic federation to use the sacred site as a safe harbour for them, and that as an ambassador of the aware civilization of earth, i called for their armada to come in great number and use this sacred site as they see fit for their operations. they again have answered my call and prayers.\r\n\r\nufo farewell message received  the last night at matawini:\r\nthe last night at the matawini cottage,  just after i finished packing\r\nthe car and i was ready to go back to montreal, i then lifted my head to the stars and asked: '' will you come pick me at the matawini landing site before the hard times start rolling, so i can continue my mission after 2012 ?''  and then, right away, instantly a ufo showed up clearly as an answer to my question, a positive one.\r\n\r\nthen i asked: '' will you pick me up at the parc close to where i live in\r\nmontreal where a crop circle appeared when the blue katchina comet exploded in size,  if i am there when things start to go difficult and i cannot surviv, and again immediately another ufo showed, in a positive answer.\r\n\r\ni feel it is the best possible outcome so my knowledge about the important discoveries that have been made at the matawini site is not lost, and that they can be fully put to contribution during and after the ascension of 2012.\r\n\r\n(the 3 photos annexed to this report, are of some of the megalithic dolmens that i have discovered on the matawini sacred site during the 2009 summer season. these dolmens are very ancient, and have been sculpted and brought on the matawini sacred site by celestrials civilizations, advanced spiritual extraterrestrial civilizations during an ancient colonization area of this planet. )\r\n\r\n\r\nmay the great spirit sun shine in our hearts\r\n\r\nastraelia\r\n","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":21608,"landingOccurred":false,"latitude":45.5173199,"location":null,"logNumber":"CA-01242010-0001","longitude":-73.5456925,"occurred":1251702000000,"potentialRelations":[],"rating":"Unrated","region":"Quebec","reportedWeather":null,"shape":"Sphere,   Star-like","source":"MUFON","status":null,"submitted":1264321001000,"summary":"Hundreds ufo over the matawini sacred site  (2009 summer)","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21608_submitter_file1__Astrea----Stonehenge.jpg","http://www.mufoncms.com/files_jeud8334j/21608_submitter_file2__ASTREA-DOLMEN-22.jpg","http://www.mufoncms.com/files_jeud8334j/21608_submitter_file3__ASTREA-DOLMENUFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":146,"locationName":"Montreal, Quebec","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152926"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":null,"country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Object was silent overhead, bright white light... no flashing, and no other lights, and traveled faster than a plane or jet, it remained in view, and as it got farther away, it dimmed quicker than expected, like it got faster... yesterday i saw a white light that at first i thought was a falling star, as it appeared to fly downward, then turned sharply 90 degrees and shot away and dissappeared.\r\nsighting 2 nights in a row!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21607,"landingOccurred":false,"latitude":31.9753088,"location":null,"logNumber":"US-01232010-0016","longitude":-99.8984131,"occurred":1264305600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1264316080000,"summary":"White starlike object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152927"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was taking out the garbage to the curb when i noticed a white light coming over the santa catalina mountains and it was approaching my direction. at the time this was the outskirts of tucson and it was dark and quiet in the area. i thought it was a search light from a hovering helicopter until i noticed that there was no sound but the light continued to move in my direction. the light eventually stopped roughly 200-300 feet away. the light remained in this position for 30-45 seconds, no movement just sitting in the same position. it suddenly excellerated straight up and disappeared in to the darkness.\r\n\r\n my heart was racing and the image has been burned in to mind ever since that day. i remember that i never noticed a sound nor did i ever see a distinct shape besides the white light, it was star-like in apperance.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":21606,"landingOccurred":false,"latitude":32.2292029,"location":null,"logNumber":"US-01232010-0015","longitude":-110.916779,"occurred":585030600000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1264306778000,"summary":"Floating light approached me and then excellerated in to space","tags":["floating","light"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21606_submitter_file1__ObservationDistance.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7861,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152928"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minneapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A big get together was going on in an apartment in minneapolis, 3 people were on the balcony, and i look up in the sky & say what is that? that doesn't look like a plain? my boyfriend & josh look up & all of a sudden these bright blue lights are alternating and making these weird shifts & the object is \"floating\" sideways & at the same time as if it was jumping up and down & side to side in straight lines extremely fast, we stood in aww then called everyone out saying there was a ufo & no one believed us until they walked out & immediately jaws dropped staring, like no one could think because we were just in shock not wanting to pull our eyes away even for a second. someone out of all of us had the sense of mind to record it on her phone & a few days later on facebook everyone there that night was tagged in the video. the girl who took the video on her phone would have the exact time & date recorded.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21605,"landingOccurred":false,"latitude":44.9884054,"location":null,"logNumber":"US-01232010-0014","longitude":-93.2570461,"occurred":-62117510400000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1264302074000,"summary":"We have footage.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":733585,"locationName":"Minneapolis, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152929"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Utuado","country":"Puerto Rico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were driving from utuado to bayamon using the #10 road, heading north to the #22 road at approximately 4:30pm. my aunt was taking pictures of the scenery and once we got home, i started to check them out, when i noticed something strange in one of the pictures. it looks like a rocket with 4 boosters, or something. the object is at the top right corner, and you have to zoom in, it may seem like a cloud from far away. we didn't notice this object while i was driving and she was taking pictures at all.\r\n\r\ni usually follow scifi shows and ufo stuff, so i was screaming with joy when we had caught one, and of course my aunt isn't a ufo buff, so she was playing it down. that is, until she saw the picture. she said, and i quote \"whoa..What is that?\" to wich i replied, \"thats an unidentified flying object, a ufo.\"\r\n\r\ncan you please explain me what this is? i know the picture is a bit fuzzy, but you can see something there. thank you!","distance":"Unknown","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21604,"landingOccurred":false,"latitude":18.2655095,"location":null,"logNumber":"PR-01232010-0013","longitude":-66.7004519,"occurred":1264293000000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Bullet,   Missile,   Cigar,   Cylinder","source":"MUFON","status":null,"submitted":1264301792000,"summary":"I was checking out the pictures we took in a trip, and saw this. top right corner.","tags":["none"],"timeZone":"America/Puerto_Rico","timeZoneName":"America/Puerto_Rico","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21604_submitter_file1__UFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Utuado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152930"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"West Terre Haute","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my wife were sitting in the parking lot on the east side of saint mary of the woods college waiting for my shift to begin. i was looking at the tree line when i noticed two opaque spheres just above the tree line circling one another top to bottom, during a very fast vertical ascent the two objects then split apart and descended very quickly below the tree line and a second or two later they both shot up in a 45 degree angle extremely fast and they were gone. i could tell they were spheres but they were almost see through with a slightly dark center. i am absolutely sure they were not birds or aircraft. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":21603,"landingOccurred":false,"latitude":39.4650363,"location":null,"logNumber":"US-01232010-0012","longitude":-87.450021,"occurred":1054364400000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1264300408000,"summary":"Two opaque spheres flying around one another in a very irregular fashion. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2429,"locationName":"West Terre Haute, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152931"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Anchorage","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am jim king, state director for mufon of iowa. i have a sister who lives in anchorage and had a sighting, but she doesnt like to use computers. therefore i will am typing out the report for her from my home in albia, iowa. my telephone number is 641-932-5788. \r\nsighting: on 12-9-09, wednesday, at 2 a. m., witness had just finished wrapping christmas presents and took the trash outside to the trash receptacle. she always looks up into the sky on clear nights to observe what stars or planets might be visible. she noticed a plane high in the sky, overhead, but above the normal flight patterns which sometimes take planes over her house. however, there was no noise, even as the light, which was traveling in a southeast direction, came lower and appeared to come within a mile or less of her and southwest of her. it stopped and hovered in line of sight of two spruce trees, which she used as markers. it was about 45 in altitude and stayed in the same place for 10-15 minutes, for the rest of the sighting.  then the witness, who was in her shirtsleeves, went inside to escape the cold, which was about 13. the light, which was steady and white, appeared to be  to  inch wide at arms length. there was no structure. her dog was asleep in the kitchen and never responded during the event. witness said she talked to the object. (it didnt talk or respond back.) she said such things as oh, youre a ufo. now i can tell my brother ive seen one. and good-bye. im cold now and im going inside.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":21602,"landingOccurred":false,"latitude":61.2225356,"location":null,"logNumber":"US-01232010-0011","longitude":-149.8947878,"occurred":1260353700000,"potentialRelations":[],"rating":"Unrated","region":"Alaska","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1264297403000,"summary":"Bright light moved from overhead to southeast, descended, and hovered for 15 minutes","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":45,"locationName":"Anchorage, Alaska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152932"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Detroit","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Caraco pharmaceutical laboratories located at 31060 oak creek, wixom, michigan and 1150 elijah mccoy drive, detroit, michigan is a hive of aliens.  these aliens are capable of esp and mind control through alien technologies that may be biological but appear to have electromagnetic and radio/microwave qualities.  they appear as human, but are decidedly anything but human: not unlike many of the aliens appearing in the movie men in black.\r\n\r\nyou must investigate.  check them out.  don't be afraid to ask many questions.  they will try to avoid you, although the closer you get the more you feel the effects of their mind control experiments against humans, enhanced by the generic pharmaceutical products they \"push\" onto innocent humans like you and me.","distance":"Unknown","duration":"06:06:06","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21601,"landingOccurred":false,"latitude":42.339277,"location":null,"logNumber":"US-01232010-0010","longitude":-83.0393238,"occurred":1263844800000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Square,   Rectagular,   Unknown","source":"MUFON","status":null,"submitted":1264292286000,"summary":"Alien encounter at caraco pharmaceutical laboratories.","tags":["none"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Detroit, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152933"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Seaside Park","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi   i am 18 years old and i saw something last night that i can not explain. at 11:15 last night january 22 2010  i was walking east on a street called porter avenue in seaside park new jersey, i just so happened to look up and very high up i saw lights. what i saw was 4 lights in a strait line spaced out evenly, they traveled to the north east at a constant speed they moved like that for about ten seconds then they came together extremely fast to were i could see the trails of light as they moved meeting in the center of the four lights, next the single light shot very fast in the same direction as the four were traveling and it had a trail much like a commet  it disappeared not on the horizon but obviously much farther over head to the north east.                                                                                                                        thank you                                        i spoke to a man named loran last night and he advised me to email this to you.                      ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":21600,"landingOccurred":false,"latitude":39.9267852,"location":null,"logNumber":"US-01232010-0009","longitude":-74.0770806,"occurred":1264230900000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1264286840000,"summary":"4 stars moving together and eventually changing shape.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Seaside Park, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152934"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dallas","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was taking pictures of airliners when thair was a black shape about 4 miles in frount of the airliner.I dif not see this thing untill i look at the pictures.I was outside taking pictures.I did not see the object.It was thair only in one frame .I did not se it.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":21599,"landingOccurred":false,"latitude":32.806565,"location":null,"logNumber":"US-01232010-0008","longitude":-96.767593,"occurred":1264406400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1264285620000,"summary":"My pictures tell it all.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Dallas, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152935"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Houston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was going to sleep,this was around 2:00am this morning.I had been lying there for awhile, i was at the point of drifting off.It takes me a while to get to sleep.. i opened my eyes and saw a round black object coming towards me . this was just in front of my night table- about 4ft. off the ground.It's overall size was about 12\" to 16\" -\r\ni could tell it was in motion-steadily.Not rotating just moving forward.\r\ni had no problem seeing it because i keep a lamp on in our bathroom that has a 40watt bulb glowing -so low light, but i could still see well.\r\nit was coming at me at a slightly angled direction.\r\nwhen i saw it -i gasped and sat up.It vanished when i sat up.\r\n\r\ni am an abductee,aware since 2004 - but have never seen anything like this before.\r\n\r\ndrawing is attached.\r\n\r\nangela hausinger\r\nlookingtothestars@hotmail.Com","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":21598,"landingOccurred":false,"latitude":29.7637327,"location":null,"logNumber":"US-01232010-0007","longitude":-95.3617396,"occurred":1264240800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle,   Other,   Unknown","source":"MUFON","status":null,"submitted":1264284569000,"summary":"Black circle object in bedroom","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/21598_submitter_file1__BlackCircle.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Houston, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152936"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Roslyn","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting at  the dinner table with my husband, uncle and aunt. i was looking over my uncles shoulder at what i thought was a really low plane. i realized it was not a plane! by now everyone turned around to see what i was looking at, and once we realized we all saw it, we ran outside to look. it was three red/yellow fickering lights (in a triangle shape) following what really did appear to be an airplane. we then noticed another one (this one was bigger) coming up behind the others. i was able to run inside and take a few pictures of these. i switched my camera to video mode and with the naked eye it looked as though they 3 in the triangle faded out. on film you can actually see them fade, then shoot off. these 3 were now gone, and the one that was following them continued to go in the same path. it was the craziest thing any of us have ever seen! we just kept saying how it was unbelievable. my aunt is a real skeptic and even she can't explain what it was. i called 2 local news staions, and nobody else had reported anything.I was checking the internet to see if anyone else had reported seeing it and came across a youtube video about a reporting in 2008 in bucks county, pa. i see that you had looked into a sighting in altoona, pa and it looked just like what we saw! i hope you guys have info. about what this was and can let me know!(like i said, i do have video and pictures, but have been advised not to just send them to people over the internet.) ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":21596,"landingOccurred":false,"latitude":40.1317765,"location":null,"logNumber":"US-01232010-0005","longitude":-75.137674,"occurred":1264213200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1264282880000,"summary":"Red and yellow flickering circles. there were 4. 3 of them in a triangle shape.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Roslyn, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:152937"}],"last":false,"totalElements":82759,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2093}
