{"content":[{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Dundee","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Went outside to smoke sitting on steps when i seen what reminded me of a ferris wheel\r\nin the sky in front of me it had all colors one set  blinking clockwise the others counter \r\nclockwise then three cone shape lights shot down  there was no noise at all i looked around to try and see if anyone else was outside or around to see what i'm seeing now it is after three o'clock in the morning i was in disbelief not understanding what i'm seeing it continued to go on slowly till out of sight  now this was about two to three times higher than the trees around me","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":53531,"landingOccurred":false,"latitude":41.96947319867884,"location":null,"logNumber":"US-01172014-0014","longitude":-83.67982258624711,"occurred":1339398000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1389998469000,"summary":"Looked like a ferris wheel spinning in two different directions with all colors of light then 3 cone like light pointing downward to ground","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"48161","daysBetweenOccurrenceAndSubmission":585,"locationName":"Dundee, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206445"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Cincinnati","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was smoking out on my back porch with my girlfriend. not pot but a cig.I was looking around at our land. then out of nowhere a very reflective stretched blimp showed up.Far to long to be a plane or blimp.It was far enough from the trees and the horizon for me too know that it couldnt of came from out of veiw because i was just looking in that direction a few seconds before it appeared.It was creeping very slow yet just enough that i could tell it was moving.Just like how a blimp moves. it seemed to be a mile or so away but the size it was must of meant it was gigantic.I first thought it must be a blimp but how if it appeared that fast in such a open clear sky. so i ran inside looking for my binoculars and maybe not even 10 seconds later i went back outside to view it and it was gone.A blimp could not of moved that fast to be out of view.I wasnt even thinking it was a ufo til i thought about its size,distance, speed and how it vanished from miles of open sky. it made me feel dumbfounded. i wanted to know wth it was and it still boggles my mind today. im happy to at least of seen something that confusing yet amazing. my girl didnt share the experience since she was on the computer at the time. her eyesight is bad but she agreed she seen it when i did but wasnt watching it when i went inside after my binoculars.A year later i found a 60 pound rock that looks like it had surface melting and impact features. it was thought to be a meteorite by yale university then later they said they cant identify it but it looks to be basalt. maybe even lunar basalt. the testing is expensive and the odds are overwhelming that its not lunar basalt. its features are amazing. i like to think me finding it is connected to the sighting i had. i know its probably not. but you never know. when i come up with 1000 bucks ill have it tested. maybe then the craft will return. ha ha ha!!!","distance":"Over One Mile","duration":"00:00:45","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":53530,"landingOccurred":false,"latitude":39.0200468,"location":null,"logNumber":"US-01172014-0013","longitude":-86.728891,"occurred":1337126400000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Blimp,   Cylinder","source":"MUFON","status":null,"submitted":1389998373000,"summary":"Huge object showed up from nowhere in clear sky.It creeped along.Went to get binoculars.Was gone 10 secs.When returned its gone.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"47040","daysBetweenOccurrenceAndSubmission":611,"locationName":"Cincinnati, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206446"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Detroit Lakes","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had a date with a young gentleman, who picked me up in his pick-up. when i realized that i had left my purse on the table, he volunteered to go in and get it for me. while he was inside talking to the babysitter, the disc descended from straight above me and hovered at the top of the tree under which we were parked. it made no sound, but displayed a sequence of lights, flashing red, white, green. i could make out the shape through the branches of the tree. it was a big tree, probably twenty five feet or more. the disc was about the same diameter as the tree's canopy, which i would estimate at about 25 feet. when my date came out, i said, \"i hope you don't think that i am crazy, but i just saw a ufo.\" this was our first date and so i was happy to hear him say, \"i have always wanted to see a ufo. which way did it go?\" i answered that it seemed to go toward the lake, so we took off after it. we went up onto  a bluff across from the lake, and there it was. i wish we had had binoculars. we watched it for a few minutes and then my date (stanley olund) said, \"we have to tell somebody.\" we went to the sheriff's dept, and told them what we had seen. they asked what we had been drinking. the womon at the desk said, \"there are warning lights on the sand bar out there, you know.\" i was born and raised there and certainly knew where the sand bar lights were, and that is not what this was. we drove back out to our vantage point, and watched it for a long time. we fell asleep watching it, and woke up a couple of hours later. ","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":53529,"landingOccurred":false,"latitude":46.8158467,"location":null,"logNumber":"US-01172014-0012","longitude":-95.8429221,"occurred":48409200000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1389995585000,"summary":"It descended from directly above me as i sat in vehicle under a tree. made no sound. i could see lighte sequencing around the disc, red, white, green. it went straight up and went southwest.I pursued it and saw it hovering over lake detroit,still displayi","tags":["sound","disc","light","hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"56501","daysBetweenOccurrenceAndSubmission":15527,"locationName":"Detroit Lakes, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206447"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Manistee","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My family and i went camping in the manistee national forrest at the campground.We have a screen ceiling tent.It was a clear night.Stars were clearly visable.I awoke approximately at 3a.M. from sleeping.I looked up into the clear night sky.I noticed the stars and treeline.I noticed a very bright larger star.I concluded the large brighter star wasnt a star when it began to move it glided slowly away from the stationary stars.It was a very bright white sphere and it just slowly moved across the sky and dissapered into the treeline.It didnt move like a plane or anything i have ever seen in the sky.It was slowly moving.It moved downward from the stars and to the right into the treeline.I watched it until i couldnt see it anymore.I was very disturbed by what i saw.It just was strange and i felt like i was frozen.I thought i should grab my phone.I just couldnt do anything but watch.It was very strange.I have seen shooting stars and aircraft in the night sky this was nothing like that.Very strange and very disturbing.I told my family the next day.My daughter and i also had a disturbing encounter at a costco store as well.We were leaving the store and my daughter noticed an elderly couple at the foodcourt.I ordered a pizza.We sat down next to the couple.We spoke with them i offered pizza they declined and said they already ate.The woman had an mri the doctors thought she had a brain tumor she said.We spoke about my daughter shes 24 she had a brain tumor and surgery when she was 11 yrs old.At this point the couple were getting up and the woman approched my daughter and told her she was blessed.I asked her what her name was as i told her i'd pray for her to get well.She stammered and paused,her face changed it was like a hologram glitch it had a wavey static apprearence.I saw a smaller dark shaped head with in her human looking head.At this pint she spoke\"ruth\" i said ok i will pray for you.They walked away.I dont remember seeing them walk away.It was a surreal experience.It haunts me to this day.My daughter saw only the holigram glitch wavey weird appreance to her face when i asked her name and did not see the small dark head within her human head.After this happened we proceede to leave we didnt speak.We were in a weird state of mind like a peaceful traance almost.We got out to the parking lot and i said did anyone notice ruths face get weird.Then my older daughter said \"yes,it was weird\".","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":53528,"landingOccurred":false,"latitude":44.2444704,"location":null,"logNumber":"US-01172014-0011","longitude":-86.3242225,"occurred":1377414000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1389994621000,"summary":"I was camping with my family.Our tent has a screen ceiling we can see the stars.I awoke at approx 3a.M. looked up in the sky at the stars.I noticed a large brighter star.I realized it wasnt a star when it began to move slowly across the sky.It was white ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":145,"locationName":"Manistee, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206448"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving looked up and notice a something int the sky not moving.  thinking it was a plane but i didnt hear a noise it was moving but not like it was looking for something  and i noticed it it start moving hoving not towards me or not away, like we was both watching each other, i was going to follow it but it  disappered before i could move.  i tried to take a video of it but i couldnt focus and the phone didnt have a clear shot. like it was blury. \r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"N/A","formattedAddress":null,"id":53527,"landingOccurred":false,"latitude":40.7205928,"location":null,"logNumber":"US-01172014-0010","longitude":-73.9975431,"occurred":1325750400000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1389994266000,"summary":"Werid night after work","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":743,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206449"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Sarasota","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was taking my trash over to the condo dumpster. coming back saw a very bright white light traveling out of the west towards the east, (towards me) moving at a good pace and steadily large object, very bright. i stopped to watch it and it flipped head over end twice. i was stunned. object kept moving during and after flips and came closer - then it just stopped above and in front of the street intersection. it just hung there. no noise at all. i stayed watching for about 4 minutes. one car turned into our street and i wondered if they had seen this object. thought they might stop to talk to me about it, but they just drove past. i began to feel like it was something personal. can't explain why. i went back to condo to get binocs but then it was gone. this was visible to the naked eye, too big to be a drone, not engine run, not the moon or a planet. object moved under intelligent control. star or cross like. very white with blue-white pulses all around it. longer vertically than horizontally. \r\nit has taken me some time to process this sighting. i am of a scientific mind and must see data or proof to agree with conclusions. i am a retired professional, 59 years of age. this has affected me profoundly. ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Path then hovering","formattedAddress":null,"id":53526,"landingOccurred":false,"latitude":27.358602,"location":null,"logNumber":"US-01172014-0009","longitude":-82.477019,"occurred":1387785600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Cross,   Diamond,   Flash,   Star-like","source":"MUFON","status":null,"submitted":1389993766000,"summary":"Traveled out from the west towards east, (towards me) very bright white, flipped twice then hung in front and over me. more verticle than horizontal. it felt personal-moved under intelligent control, not planetary object ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"34235","daysBetweenOccurrenceAndSubmission":25,"locationName":"Sarasota, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206450"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Muscle Shoals","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"501 Feet - 1 Mile, Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Other","formattedAddress":null,"id":53525,"landingOccurred":false,"latitude":34.7449117,"location":null,"logNumber":"US-01172014-0008","longitude":-87.6722894,"occurred":1389772800000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Other,   Unknown","source":"MUFON","status":null,"submitted":1389988338000,"summary":"Was looking twards","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"35661","daysBetweenOccurrenceAndSubmission":2,"locationName":"Muscle Shoals, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206451"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Rio","country":"Brazil","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my appartment watching tv whilme under insomnia. then i just looked at the window and saw a gray sky. i looked more to see if it would be a sign of rain for the morning, but i saw a weak light flashing like a star, but there were no stars visible due to the clouded sky and the city lights. looking for a little bit more of a time revealed something connected to the light that was darker if compared to the sky and had a triangle shape. it was static for the time and just disappeared, stopped flashing and i couldn't see it's form again. lost sight when i gave up observing and went back. when i tried to find the object again, i just missed it.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Stationary","formattedAddress":null,"id":53524,"landingOccurred":false,"latitude":-22.9133954,"location":null,"logNumber":"BR-01172014-0007","longitude":-43.2007101,"occurred":1389780000000,"potentialRelations":[],"rating":"Unrated","region":"Rio de Janeiro","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1389987350000,"summary":"Green-red light hovering - dark triangle shape","tags":["triangle","light","hovering"],"timeZone":"America/Sao_Paulo","timeZoneName":"America/Sao_Paulo","tweeted":0,"urls":null,"weather":null,"zipcode":"22430-190","daysBetweenOccurrenceAndSubmission":2,"locationName":"Rio, Rio de Janeiro","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:206452"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Maricopa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I don't know if this classifies as one sighting or multiple sightings so i will enter everything in this report. on today's date jan 17, 2014 i left with my son to drop him off at his high school at 6:50am arizona time. we live in a small town about 20 miles south of phoenix. as i was heading east on my street i noticed what appeared to be an extremely bright and larger then normal star at about 30 degrees off my horizon. it appeared to be pulsating. i take my son each morning to school at this time so it was different from what i normally see. the sun was still about 30 minutes from rising so still dark out. as i was driving on highway 347 going south to his school i noticed a second really bright large star to the east. it appeared to be about 30 degrees off the horizon as well.  i could see both bright stars. the one i saw earlier was at a bearing of about 45 degrees and looked like it was towards the superstition mountains which as the crow flies would be about 40 miles from me. the other bright star light was about at a bearing of 105 degrees. i dropped my son off at the back of his school by the gym which is the west side of the school and went out to the street that run east. i know longer saw the second bright star that was at a bearing of 105 degrees but i could still see the first star that was at a bearing of 45 degrees. it was still pulsating between bright and slightly less bright. as i am sitting about 5 cars back at the light on w.Honeycutt ave and highway 347 by his school facing due east watching this star it suddenly got really bright for about a second then it just completely disappeared. this was at about 7:11 am according to my jeep clock. i was searching the skies to see if it had moved and when i was looking at the area where the second star had been to see if it might have come back instead i saw what appeared to be three orange orbs at about the same bearing 105 degrees where the bright star light was a few minutes earlier.  two were at about the same height of around 20 degrees off the horizon and one was about 2 degrees lower. at this point i wanted to try and get a picture of them so i drove to an open farmers field about a mile south of where i was and parked by a school bus whose driver was waiting i suppose to start his middle school run. i was on the eastside of highway 347 on the southside of ferrel road looking at the three orange orbs that appeared to be 15-20 miles away at a bearing of 105 degrees. i took about four pictures with my iphone but the distance was too far away for me to see them on my phone. the orbs appeared to me slowly going south as i was using a telephone pole i the distance to see it was moving towards it. this was about 7:13am arizona time. i don't know if the school bus driver saw the orange orbs as he was facing due east on the side of the road but he left after a few minutes. as far as distance from me to the orange orbs i am guessing about 15 miles as it appeared to be somewhere by the city of casa grande and maybe the i-10 area. it seems like highway 84 going east to casa grande would have taken you right into the orbs from my perspective. i know from now on when i take my son to school i am going to make sure i have my hand held video camera with me as then i could have zoomed in on the objects. i am listing myself as the only witness but my son saw both stars as well as we commented on how bright they were compared to normal. he did not see the orange orbs. i am going to send the pictures i took on my iphone to my brother as he might be able to enhance the pictures better to see if you can see anything. i couldn't see the orbs on them due to dusk was occurring at the time of the orbs so they were right in the middle of dusk and a great distance away. i haven't looked at the video i took yet as i have to download it from my phone. if anything is worth posting i will make an additional report and add it. thanks.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":53523,"landingOccurred":false,"latitude":33.0290765,"location":null,"logNumber":"US-01172014-0006","longitude":-112.0476928,"occurred":1389971460000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere,   Star-like","source":"MUFON","status":null,"submitted":1389987211000,"summary":"3 orange orbs and  2 superbright large stars-saw star go bright and disappear","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"85138","daysBetweenOccurrenceAndSubmission":0,"locationName":"Maricopa, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206453"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Colfax","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in the yard around 2:00 pm and heard a jet overhead.  i looked up, saw the jet and something caught my eye.  it was beyond the jet, far into the atmosphere and it was an object that had the appearance of shimmering.  i would not have seen it had it not been that i looked at the jet.  the slight motion just to the left of the jet would not have been see otherwise.  it seemed camouflaged in that the metal? was a shiny silver white in color and it blended into the atmosphere.  the craft had a long body with a short arm off to the right at the top and then a longer arm that went completely across the body and was longer than the top arm, sort of like a cross.  at the bottom of the long body was what appeared to be arms to the left and right (like you would draw a stick man's legs.  maybe it was a satellite of some sort, don't know but i do know that i had never seen anything like it before.  i just disappeared into the atmosphere.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":53522,"landingOccurred":false,"latitude":44.96251269411915,"location":null,"logNumber":"US-01172014-0005","longitude":-91.63615816367565,"occurred":1371279600000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Cross,   Unknown","source":"MUFON","status":null,"submitted":1389981491000,"summary":"Shimmering object ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"54730","daysBetweenOccurrenceAndSubmission":216,"locationName":"Colfax, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206454"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lawton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My mother, her friend and myself were traveling east on highway 49 in the wichita mountain wildlife refuge. we had entered the park from the back side coming off of highway 54. we were traveling to elk mountain to meet a friend for a day hike and lunch. only a few minutes into the park i noticed a bright object in the sky. it looked like a star because it was shining so bright, but was way to big to be a star. it was hovering below a the chem trail of a plane that was going by and seemed lower in elevation than the plane. i pointed to it as i was driving and said \"what the heck is that?\"\r\nmy mother's friend in the back seat who has a loss of hearing didn't hear me but asked the same thing right after me. we all three were looking at wondering what we were seeing. it looked to me as if it was a little to the southeast of us, over ft. sill. we went around a curve and you could see it shining through the branches like the sun would do and when we got around the curve it was gone. just vanished. we didn't any sign of it the rest of the day but the plane that was leaving a chem trail could still be seen. i know it was almost right on the dot around 11:00 am, because my mother had commented i was driving too slow and we were going to be late meeting my friend. i looked at the clock and it was 11:00 and i told her not to worry because i told my friend to meet us at 11:15, so we had plenty of cushion time. it was right after this conversation i noticed the bright object in sky.\r\n","distance":"Unknown","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":53521,"landingOccurred":false,"latitude":34.6660367,"location":null,"logNumber":"US-01172014-0004","longitude":-98.3817564,"occurred":1388343600000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1389981058000,"summary":"Round object below military plan shining like a star during the day","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":18,"locationName":"Lawton, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206455"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was leaving a relatives house at 5 pm located at top of a mountain\\hill at dusk which offers an excellent vantage point to see all the horizons and hills in the distance. i put my bags and my dog in the car, looked east as i noticed a full moon was coming up over the horizon.  at which point, i noticed 3 bright lights hovering stationary just to the right and slightly above the horizon.  they were brighter than the moon and easily visible, as it was dusk and not completely dark yet.  they just stayed there for about a minute, then one by one they vanished.  \r\n\r\nthe formation and pattern they were in, looked exactly like the phoenix ufo light caught on video a few years back, but brighter.  appeared to be 3 separate objects.  the one closest to the horizon vanished first, followed by the next one above it, and lastly the one above that one.  each one vanished a couple seconds after prior one.\r\n\r\nat first i thought they were flares, but there were no planes, and the objects were not falling, just stationary.  then i thought maybe meteors, however i am very familiar with what meteors look like when coming through atmosphere, but these had no trail and were extremely bright.  tried to get them on video if they came back, but they did not.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":53520,"landingOccurred":false,"latitude":44.5680028,"location":null,"logNumber":"US-01172014-0003","longitude":-72.5727615,"occurred":1389834000000,"potentialRelations":[],"rating":"Unrated","region":"Vermont","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1389979970000,"summary":"3 bright lights over horizon","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Vermont","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206456"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Edmonds","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were sitting out in my porch with windows all around. i saw these three yellow/gold lights traveling slowly past my condo. the color was what made me look more at it. it was traveling low in the sky. the three lights were connected somehow as one of the lower lights came forward as if to look at something and the other two lights remained steady. the top light was like the leader, holding them all together. it went slowly past us as if investigating the area. the space between the lights was maybe 200 feet. it remained shaped like a triangle the entire time. the lights would intensify and turn more golden than yellow. i felt they were doing a \"drive by\" looking into my window and listening to us.It kept going until it was out of sight, slowly. i felt no harm.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":53519,"landingOccurred":false,"latitude":47.808183,"location":null,"logNumber":"US-01172014-0002","longitude":-122.381196,"occurred":1389686400000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1389975188000,"summary":"There were 3 lights. the top one was the one that hoovered. the other two seened like they were connected but one was stretching out further as if searching. it traveled north on the west side of my building. it was going slowly. it had yellow to golden l","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"98020","daysBetweenOccurrenceAndSubmission":3,"locationName":"Edmonds, Washington","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:206457"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Shailer Park","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the 16th january 2014 at 8:40 aprox i was on my  balcony (we live 97mtres above sea level with nothing blocking our view ) looking for a decent  constellation to view through my telescope . it has been patchy cloudy  no rain so i  have been using binoculars instead as it was patchy but clear parts as well. i was looking towards the area known as \" chamaeleon constellation\" ( not with binoculars at the time). just to the right and down a bit i noticed a very distinct flash of light, no cloud at that time and it wasnt stormy so it wasnt lightning either, it was unusual because it was very high in the sky. to me it seemed outside our atmosphere i cant give a distance, suffice to say it was well above commercial traffic. ( we do have planes in the area sometimes as many as 7 at one time ). i mean really high and very far. it wasnt a trick of light, i had not been drinking or taking drugs, nor was it a shooting star, meteorite, satelite or other normal event. it was one flash only. i instantly thought wow that is very strange and very big to my eyes it was bigger than a pin head but at a great distance and i was was very excited because i know i witnessed something out of the ordinary. i stayed outside for quite a while using my eyes and the binoculars but it did not occur again. on the 17th of january (tonight) at 8:30pm i started looking to the same spot in the event that it came again. after a bit of time i changed direction and was looking south at 40 degrees. i was watching a few planes  and i noticed an object higher than commercial traffic but inside our atmosphere ( i think, i cant be sure it was not as high as the previous night but still higher than usual) the object moved from left to right not towards brisbane airport direction but rather an arc style away from myself and the airport. it started at around 40 degrees and the last sighting was at about 50 degrees it lasted for about 7 seconds and there was no tail or bits breaking off. i  wanted to grab my binoculars but i knew it would be gone. i watched and lost it above, not behind the cloud cover. i followed the trajectory but it didnt appear again. last night i was excited, tonight i was somewhat disturbed by the sighting i am not crazy but my thought was \"that shouldnt be there\" there was no blinking lights and it was not as fast as meteorites rather a continuous flight of light. i know the difference between planes and satelites and helicopters. this was not any of those. i was searching the internet in case someone else saw the 16th january event and i came across this site. im hoping someone else saw something. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":53518,"landingOccurred":false,"latitude":-27.6467084,"location":null,"logNumber":"AU-01172014-0001","longitude":153.1867895,"occurred":1390019400000,"potentialRelations":[],"rating":"Unrated","region":"Queensland","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1389971549000,"summary":"Observed object move from south to west with a slight upwards direction ","tags":["lights"],"timeZone":"Australia/Brisbane","timeZoneName":"Australia/Brisbane","tweeted":0,"urls":null,"weather":null,"zipcode":"4128","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Shailer Park, Queensland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206458"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My father, 4 year old son and i were in the hot tub in my parents backyard. the stars were just starting to come out and we were talking, watching the sky. i pointed out a satellite that was moving overhead quickly towards the mountains to the east. as we watched it pass through the constellation orion, a very bright stationary white light appeared out of nowhere very close the passing satellite.  it was about the size of a pencil eraser and stayed lit for approximately 5 seconds. it then dimmed to about the intensity and the size of the stars and accelerated in a northeastern direction out of sight. we sat there shocked trying to decide what the heck we just saw. initially my dad thought the satellite we were watching had exploded, but i specifically saw it dim and fly to the northeast. we were just trying to be logical about the situation and come up with an explanation. the object was so bright, that we could not really come up with anything.  as we continued to sit in shock, watching the sky, we watched what we thought were more satellites flying in multiple different directions, pointing out each as we saw them. then, in the southeastern sky another stationary object lit up intense white, exactly as the previous one had and for approximately the same amount of time.  however, this time as the object dimmed, there were two stationary lights left in its place that were actually brighter than the stars which went completely out within approximately 2 seconds.  we yelled for my wife and my mom to come out and see what we were seeing, and as they made it out onto the back patio, they too saw the lights begin to appear just to the northeast of the previous 2 lights that had gone out. then, the lights began to light up and blink out at a faster rate,  perhaps every 1 or 2 seconds. we believe that this may have been the second object now on the move, but each time that they reappeared they had moved much farther than they should have. each time, super bright white and the size of a pencil eraser. we all watched in amazement as it crossed the sky, until finally it did not reappear again. my wife tried to get a picture on her phone, but her flash was on and nothing can be seen except a black screen. we were just shocked, in awe, i asked multiple time what on earth we were looking at. we watched the sky for approximately 30 more minutes, and one more object appeared, in the same manner as the first (lighting up super bright white for approximately 3 to 5 seconds and then going out). there were helicopters and planes to our west, which were easily identified and nothing like what we had just watched. ","distance":"Unknown","duration":"00:15:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":53517,"landingOccurred":false,"latitude":34.0531481,"location":null,"logNumber":"US-01162014-0026","longitude":-111.0871611,"occurred":1389925800000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1389943241000,"summary":"Multiple objects lit up super bright white and blink out to dim or gone completely. one object appeared to skip across sky as it blinked. ","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206459"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Medicine Hat","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Attached are some pictures my 13 year old son took with his cell phone when he witnessed some strange lights in the sky over kin coulee park in medicine hat, alberta, canada on october 13, 2013 at approximately 10 pm. he said at first he saw 5 orange circle lights. he ran in the house and got his cell phone and came back out and took pictures of what he saw. he said there were then only 3 lights which moved slowly away and up into the clouds and disappeared. he was with his father and younger brother who also witnessed the same. we have no idea what it is but we would love to know! \r\n \r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":53516,"landingOccurred":false,"latitude":50.0256868,"location":null,"logNumber":"CA-01162014-0025","longitude":-110.6956008,"occurred":1381726800000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Circle,   Sphere,   Triangle,   Other","source":"MUFON","status":null,"submitted":1389938777000,"summary":"Strange lights/object in sky over kin coulee park medicine hat, ab, canada","tags":["lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/53516_submitter_file1__skyobject.jpg","http://www.mufoncms.com/files_jeud8334j/53516_submitter_file2__skyobject2.jpg","http://www.mufoncms.com/files_jeud8334j/53516_submitter_file3__skyobject3.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":95,"locationName":"Medicine Hat, Alberta","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:206460"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover)","city":"West River","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Walking dog in front yard had a feeling to look above me silent craft three white lights and red center that pulsates in a pattern moved slowly and angelic at same speed for whole ten minutes i followed nd watched craft from backyard as it continued at same altitude 1000 ft approx as it flew towards the water it made a beautiful slight tilt where i can see it's shape of an isosceles triangle and possible pyramid as the geometric lines could be seen in a sparkling greyish black surface gleamed while reflecting from lights below from homes etc.  it made no sound and continued north over the water.  it continued ascending slightly but not much.  i've seen this craft before up close a couple years ago not more than ten miles away from this location.  ","distance":"101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":53514,"landingOccurred":false,"latitude":38.81877461062763,"location":null,"logNumber":"US-01162014-0023","longitude":-76.54728947084784,"occurred":1389930300000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Triangle,   Other","source":"MUFON","status":null,"submitted":1389932421000,"summary":"Angelic moving triangular/pyramid shaped craft seen flying above home and continued towards over the water made an slight tilt which showed its shape and changed direction slightly white lights on each tip red blinking in center","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"20778","daysBetweenOccurrenceAndSubmission":0,"locationName":"West River, Maryland","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:206461"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Gilbert","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 9:15pm i watched a red/yellow/orange, glowing thing drifting toward a friend and i. we watched it and initially thought it was a lantern balloon. it seemed to stop suddenly and float. there was no sound.  within seconds, it shot straight up as fast as a bullet and disappeared.  very weird.  we were really excited, it was weird to feel excited but we kept looking to see if we would see it again to try to figure out what we saw.  \r\n\r\n\r\nlater, around 9:50 a group of friends arrived to celebrate nye.  as they got out of the car, we witnesses another red pulsating light near the superstition mountains. this time, the light appeared different. much lower and brighter.  it was the same colors and pulsating only it looked like it was dropping lava like sparks below it over many miles.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":53513,"landingOccurred":false,"latitude":33.3548064,"location":null,"logNumber":"US-01162014-0022","longitude":-111.783757,"occurred":1388555400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Fireball,   Oval","source":"MUFON","status":null,"submitted":1389929085000,"summary":"Saw 2 differnt types of pulsating objects, multiple wittnesses","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":15,"locationName":"Gilbert, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206462"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Patterson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"January 1, 2014, 12:10 am   i stepped out onto the back patio to hear the music from a neighborhood party. i immediately saw two red spheres in the night sky. i came in and got my camera and started taking photos. a third sphere joined the other two.  they remained evenly spaced and in a horizontal line. i continued taking rapid photos, 15 in all. the spheres appeared to ���fade��� one at a time  but looking at the photos with zoom, they were still in the pictures and seemed they had left ���away��� from me to a greater distance. the photos are time stamped from 1:12 am thru 1:16 am because my camera was still set on daylight saving time. the photos are very interesting when enlarged. i don���t have television so i didn���t hear of other reports. my daughter sent me the activity from your site and so i thought i should report what i had seen and photographed.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":53512,"landingOccurred":false,"latitude":37.468138886862114,"location":null,"logNumber":"US-01162014-0021","longitude":-121.12910487297077,"occurred":1388563200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Oval,   Sphere","source":"MUFON","status":null,"submitted":1389928190000,"summary":"3 red/orange spheres ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/53512_submitter_file1__002.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file2__003.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file3__004.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file4__005.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file5__006.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file6__007.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file7__008.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file8__009.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file9__010.JPG","http://www.mufoncms.com/files_jeud8334j/53512_submitter_file10__011.JPG"],"weather":null,"zipcode":"95363","daysBetweenOccurrenceAndSubmission":15,"locationName":"Patterson, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206463"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Montpellier","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Seen by my 9 year old son and my wife, driving in a car, could not stop... definitely strange and abnormal, sent shivers...","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":53511,"landingOccurred":false,"latitude":45.8548959,"location":null,"logNumber":"CA-01162014-0020","longitude":-75.163574,"occurred":1389887100000,"potentialRelations":[],"rating":"Unrated","region":"Quebec","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1389928585000,"summary":"2 rectangular hovering objects, pulsating, gold colored","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"J0V 1M0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Montpellier, Quebec","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206464"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Santa Cruz","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were coming down santa cruz mountain at midnight. there were 4 of us,and i am the 1st one to see it. its was on my right side,and i looked out the window from the back seat. it was a large red /orange  orb. very bright it was next to us going thought the trees as we went down the curved roads. i told my friends to look at it, and everyone turned there heads to look at it, and we all said what the hell is that. its following us thru the trees like they weren't there. i told my friend to stop the car,and he did so did the orb. we did it again,and the orb did the same. we decided to get down the mountain because we felt it wanted to get lots closer to us,and we got a bit scared. as we went down the mountain it was right in front of us, we stopped. that's where i don't remember what happen because all we remember was we got to the bottom of the mountain and,no one was talking. we were like in a daze. we got home at 5:30am it should of  been home at 2:30am so what happen to 3 hours we lost. we done this routine a bunch of times before so i know. funny thing we didn't talk about at all, like it never happened.","distance":"101-500 Feet","duration":"00:10:10","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":53510,"landingOccurred":false,"latitude":36.9812671,"location":null,"logNumber":"US-01162014-0019","longitude":-122.0279963,"occurred":329900400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval,   Sphere","source":"MUFON","status":null,"submitted":1389926174000,"summary":"4 of us were going down santa cruz ,when we saw an orange/red orb it was following us down the mountain. ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":12268,"locationName":"Santa Cruz, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206465"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Bude","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at my home and walked outside for some air. i noticed a bright reddish-orange light over a little drive in up the road a bit. at first  thought it was a low plane but did not see aircraft strobe lights. i watched it for a bit and saw that it was just hovering and seemed to be spinning. there were yellow light tips on the outer edges of the object. it would pulsate and flash three times, stop and repeat. it reminded me of a beautiful christmas flashing light. i ran back inside to get my camera and when i got back out was fiddling with the settings, it stopped flashing, got brighter and brighter and then shot straight up at a high rate of speed and was gone. i hated that i couldn't get a pic or video. my smart phone is new and am still learning about it.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":53509,"landingOccurred":false,"latitude":31.448573559190404,"location":null,"logNumber":"US-01162014-0018","longitude":-90.86951535954894,"occurred":1389756600000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1389920790000,"summary":"Walked outside, noticed a bright orange-reddish light in sky hovering over local eaterie right up the road from me. ","tags":["light","hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"39630","daysBetweenOccurrenceAndSubmission":1,"locationName":"Bude, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206466"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Deer Park","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"N/a","distance":"N/A","duration":"","entityEncountered":true,"favorited":0,"features":"None,  Unknown","flightPath":"N/A","formattedAddress":null,"id":53508,"landingOccurred":false,"latitude":29.708411,"location":null,"logNumber":"US-01162014-0017","longitude":-95.128085,"occurred":161251200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Other,   Unknown","source":"MUFON","status":null,"submitted":1389917592000,"summary":"N/a","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":14220,"locationName":"Deer Park, Texas","triangle":false,"type":"Alien Encounter","$$hashKey":"object:206467"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hoover","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At roughly 7:45 pm central time, i was walking my dog behind the publix at highway 31 and valleydale road. we were on the zigzagging road that leads up to combat fitness and several car shops. in the western sky i viewed 5-7 lights moving linearly in the same direction at the same pace. at first i thought they were the blinking red lights on radio towers with a bright star in the middle, but their movement made that impossible. all of the lights were the same distance apart. if they were planes at that distance, i feel like noise would have been heard, however, there was no noise heard. i couldn't tell the exact distance but they seemed to be no higher than a plane's flight altitude but perhaps closer to a helicopter's flight altitude. in the center of the line was a bright white light, steady but somewhat pulsing, and occasionally flashing red. on either side of that light were red lights, all blinking sequentially. i observed their flight (southwest direction) for a couple of minutes before they went behind a low tree line. they appeared on the other side of the trees, however, the bright white light was gone and only the red lights remained. they had broken their linear formation and now traveled in a cluster that resembled a z shape. they still blinked sequentially as they moved. this event did not seem to have any effect on time or surrounding objects. i did not feel personally effected in any way, and my dog seemed normal though hyper. i do not have any suggestions as to what this event may have been. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Other","formattedAddress":null,"id":53507,"landingOccurred":false,"latitude":33.4138267,"location":null,"logNumber":"US-01162014-0014","longitude":-86.8055381,"occurred":1389843900000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1389916206000,"summary":"Collected lights in formation flight","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Hoover, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206468"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Alexandria","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking my dog on sunday afternoon at the school across the street from my home. as i turned to head back in the direction of my home i just happened to look up and saw what appeared to be a sphere gliding silently across the sky. i couldn't tell what it was and took my eyes off it for a few seconds to get my cell phone out of my pocket to record it. i managed to film a brief video of the object and i even managed to zoom in a bit for the final few seconds but im still unable to recognize what the object is. i kept walking my dog and as i walked beneath a part where trees overhang i lost sight of where it went. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":53503,"landingOccurred":false,"latitude":38.77841163412869,"location":null,"logNumber":"US-01162014-0012","longitude":-77.08677820388422,"occurred":1388957400000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1389910326000,"summary":"I happened to notice a small sphere moving in a straight line as i was walking my dog at the elementary school across the street from my home.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/53503_submitter_file1__20140101163149.mp4"],"weather":null,"zipcode":"22303","daysBetweenOccurrenceAndSubmission":11,"locationName":"Alexandria, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206469"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Wolcott","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My dog woke me up around 2:30 am and wanted to go out. while outside, a very fast moving light caught my eye. at first i thought it was a meteorite or shooting star. it was traveling very fast then slowed down quite a bit at which point i noticed it was pulsating white to a light red color. the rear end of it would glow white then as that faded out the front end would glow a light red color. then the red would fade out & the white would get brighter. it came to a complete stop and hovered for about 5 seconds while pulsating white to light red, then just completely disappeared while it was hovering.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering,Other","formattedAddress":null,"id":53502,"landingOccurred":false,"latitude":41.619142378515015,"location":null,"logNumber":"US-01162014-0011","longitude":-73.00964599687178,"occurred":1389267000000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1389905008000,"summary":"Red & white pulsating oblong light","tags":["hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"06716","daysBetweenOccurrenceAndSubmission":7,"locationName":"Wolcott, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206470"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hoover","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At about 7:30 pm local time i was parking my car after returning home from grocery shopping with my boyfriend.  we live in hoover.  as we parked i noticed several red lights in the sky infront of us (to the north over birmingham).  i did not count but estimate that there were 4-6 red lights in a perfect line, followed by a white light, then 3-4 more red lights.  there may or may not have been a red light below the main line of other lights.  (i seem to remember, but was more focused on the main string of lights.  \r\n\r\nthe lights were moving west at a speed consistent with what i have seen with airplanes in the area.  looking north i can often see airplanes in a holding pattern to land at bhm.  at first, i thought this was several airplanes, but as i watched, i observed that these lights appeared to be connected, as they were remaining at a uniform distance from each other and were moving at the same speed, etc. i could not see any vehicle or lines or anything of that nature.  only the lights.  they appeared to be the size of stars and were not blinking or pulsing.  i did not hear any sounds.   the lights must have been bright because we were parked in a carport with a light overhead and i could observe the lights very well, unlike dimmer stars, for instance. \r\n\r\nthe full moon was out and low on the horizon at that time and in my estimation the entire string of lights was 4-5 full moons accross, so if it was one object with the lights, it appeared to be large.  it would be bigger than any airplane or blimp.  my assumption is that it was far away from me because i heard no noise and the lights were star sized.  but again, it was dark and if the object was closer to my location, it would be smaller than what i am guessing.\r\n\r\nthe lights were observed for about a minute before they disappeared behind a tree line. \r\n\r\nmy boyfriend and myself saw the lights. one other neighbor was parking at the time and likely heard our conversation, but did not comment on seeing or not, so i assume they did not see it.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":53501,"landingOccurred":false,"latitude":33.33410157465884,"location":null,"logNumber":"US-01162014-0010","longitude":-86.79476931367108,"occurred":1389843000000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Star-like,   Other","source":"MUFON","status":null,"submitted":1389904229000,"summary":"Lights observed over birmingham","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"AL","daysBetweenOccurrenceAndSubmission":0,"locationName":"Hoover, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206471"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Brewster","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Date & time:  approx 2 a.M. on 1st saturday in february 1967 (feb 4th) the two of  us who were and are still good friends were out for a walk on a snow covered country road just north of a dairy farm.  weather: crystal clear skies, temperature approximately mid 20s with a light wind. location of viewing:  approx. 900 feet south of the junction of tommy thurber lane and bullet hole road (currently named holmes road) in brewster, ny in putnam county. orientation of sighting:  facing south and looking up at not quite a 45-degree angle. mars was in the east-southeast and jupiter was in the south-southwest not too far west of the object which initially appeared as a twinkling bright star with a bluish-white hue almost as bright as jupiter. object initially appeared to be an exceptionally bright, large star in what was a crystal clear winter night sky. object than did a zig-zag laterally along a slight arc or saddle which got our attention immediately. it then began to get bigger and zigged vertically up-and-down a distance about twice the diameter of the object. it then got noticeably bigger and seemed to zoom in towards the two of us (ages 17 and 18). this spooked us (we felt as if the object knew that we were there on the road) as it now winked and blinked at a low frequency and would get closer and larger with each wink until it was approximately the size of a closed fist at arm���s length and now oval in shape. the two of us then took off running up the snow covered dirt road to my parent's home and woke up my brother who was just out of the air force. we lost sight of the object as it zipped away at high speed to the west. duration of sighting was not more than five minutes total to the time it disappeared off to the west. there was no noise of an engine. note that this was before i-84 had been built which now runs just to the west of what was then bullet hole road and is now named holmes road. \r\n\r\n","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":53499,"landingOccurred":false,"latitude":41.3995563,"location":null,"logNumber":"US-01162014-0008","longitude":-73.6074821,"occurred":-91728000000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Oval,   Star-like","source":"MUFON","status":null,"submitted":1389901961000,"summary":"Bright star-like object that zigged-zagged and zoomed in so it was oval and the size of a fist at arm's length and then disappeared to the west.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"10509","daysBetweenOccurrenceAndSubmission":17148,"locationName":"Brewster, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206472"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Newport","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the morning of christmas. i was sitting in my car parked, drinking a coffee. i had on sunglasses, which combined with my window tint, allowed me to see the sun clearly, without squinting. it was 0900 a.M.. i observed two stationary objects, very close to the sun. they were yellowish-red. after about a, minute, one would dissapear, and reappear in another section of the sky. then, the other stationary object would dissapear, and reappear in a different spot. they seemed to be close to airplanes, which i could also see. it appeared the objects were playing with the airplanes. i watched for about ten minutes, then they both vanished.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":53498,"landingOccurred":false,"latitude":41.4912824,"location":null,"logNumber":"US-01162014-0007","longitude":-71.3036285,"occurred":1387990800000,"potentialRelations":[],"rating":"Unrated","region":"Rhode Island","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1389899528000,"summary":"Two glowing objects, stationary, toying with airplanes.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":22,"locationName":"Newport, Rhode Island","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206473"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Farmerville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was going out to watch the moon with telescope ..Observed 8-10 bright red star like objects in a straight line with a larger white object in the middle..The red objects alternated flashes..Looked as bright as a becon light on a tower..They moved in a straight line from east to west..Watched for atlest 3 min then went out of sight. it looked like something was escorting the white object that did not blink. but red objects alternated blinking..Way cool..Never seen anything like it..It was higher than any plane can go.  have some video but will need to upload them please contact me later in the day ..Video is kinda jumpy but have something we can work with","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":53497,"landingOccurred":false,"latitude":32.7734728,"location":null,"logNumber":"US-01162014-0006","longitude":-92.4056985,"occurred":1389772800000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Flash,   Star-like,   Other","source":"MUFON","status":null,"submitted":1389898272000,"summary":"8-10 bright red objects whith larger white object in the middle aletrnating becon type lights with the red objects traveling in a straight line","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"71241","daysBetweenOccurrenceAndSubmission":1,"locationName":"Farmerville, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:206474"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1163}
