{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I'm telling this story, in the even that others may have experienced something like this or similar:  this happened quite a while ago, i've told family about this but no one else.  i was with my then boyfriend, we went to a burger king on arlington st. in akron.  it was a warm summer day and we had the car windows down, enjoying the weather.  for some reason, when we arrived at burger king, my then boyfriend decided that he was going to go inside the restaurant and purchase our food.  i should have been slightly surprised by this because he hardly ever went inside a fast food restaurant but on this occasion he said he was going to go in.  there was a line a the drive thru but it wasn't significantly long, just a couple of cars.  anyway, what struck me odd about what happened, as i reflect is that, even before i saw the big ball of fire in the sky, i was aware that it seemed like my boyfriend was taking to long in the restaurant.  i had that thought.  well, my eyes noticed the big ball of fire in the sky, i looked at it, i wondered what the heck it was, i got out of the car and continued to look at it.  it looked like it was flying.  it wasn't descending, it was flying through the sky.  i can't give you distances because i'm not good at that, but, i could see it very clearly.  i have no idea how long i looked at the ball of fire, but i know that my next thought was that my boyfriend had been in burger king way too long.  it seemed like i had been waiting for him for about 30 minutes to an hour.  just really long.  i was mad.  i had made up my mind that i was going to first, tell him off for taking so long, and then tell him what i saw in the sky.  needless to say, when he came out of burger king and i was fuming, he couldn't believe that i was accusing him of taking so long in burger king.  i was like \"what took you so long?\"  he was making excuses and saying he had only been in there for like 10-15 minutes.  it seemed way longer than that.  he asked me why i was standing outside the car.  i told him i saw something in the sky.  we went back to my house in west akron, turned on the t.V. and ate our food.  i was convinced that something would be on the news about the big ball of fire, but no.  i did call the then local news station, which was 23 akron news, but they said that they had gotten calls and that the object was a meteor.  i said no way.  that big, flying, not falling.  it as almost like it was on a certain course.  and i can't explain why time for me seemed longer than for my boyfriend.  i can't explain how that happened.  i never looked a the clock to actually see how much time had elapsed.  this is not my norm, usually i'll pay attention to things like that so i can have proof before i start belly-aching about something.  i never checked the clock.  so i have to believe that he really was only in bk for 15 minutes even though it seemed like close to an hour.  i'm not saying what i saw was an alien ufo or anything, i'm saying that i experienced an usual event and it's worth sharing.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4704,"landingOccurred":false,"latitude":40.4245771,"location":null,"logNumber":"US-04202006-0005","longitude":-82.904713,"occurred":679474800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":679474800000,"summary":"Fireball in sky, time confusion","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525489"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in my jaquzzi","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"","formattedAddress":null,"id":4703,"landingOccurred":false,"latitude":36.785981,"location":null,"logNumber":"US-04202006-0004","longitude":-119.4119624,"occurred":1145508000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1145508000000,"summary":"Extremely dim round lights at each corner of the triangle very high up  i woundered how other planes would ever see its lights then it sped up within seconds it was atleast 10 miles qway then went up and disapeared","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:525490"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"El Paso, Texas","country":"US","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband just arrived home and yelled for me to come outside quickly - he pointed up and we watched as the ufo approached silently just slightly higher than the rooftops of the 2-story homes on our street.  it stopped 2 houses away and hovered silently for over 3 minutes.  i was afraid that if i left to grab the camcorder that i would miss it.  there was no sound - not even birds chirping.  there was no breeze.  it was still daylight and the object was between us and the bright sunset.  we were paralyzed with excitement, astonishment and awe.  we were looking up at the underside.  the point was toward us and under the front point was a large round orange \"light\" that appeared to have a slow swirling movement within it.  the light was like the bright orange of a flame.  the bottom appeared black to us and had a linticular shape.  after it hovered, the point of it very slight and slowly turned toward the north and it began to bank to its left slightly and moved to the north past the rooftop of our neighbor's house.  i ran as quickly as i could back inside to run upstairs to our backyard balcony.  by that time it had already moved many miles north over the desert toward las cruces, new mexico.  after it moved away it appeared to release a large clear teardrop shape from the center.  there was no side to side or swinging movement in this teardop shape as it moved slowly from the bottom of the object to the end of it's \"tether\".  we have estimated that if it were on the ground it would measure approzimately 25 feet from the front point to the rounded back and approximately 18 feet across at the widest part of the rounded back end.  we have both seen many weather balloons from many angles and during various stages from release to flight.  we have both also seen many hot air balloons from many angles and various stages from take off to flight.  this was not a weather balloon and it was not a hot air balloon.  i have avoided reporting anything due to fear of ridicule.  then after watching a show on ufos on the history channel and seeing all the reports on your website i finally feel compelled to report it.  ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":4702,"landingOccurred":false,"latitude":31.8039824,"location":null,"logNumber":"US-04202006-0003","longitude":-106.2051484,"occurred":971317800000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":971317800000,"summary":"Approached toward us from west moving east - hovered silently overhead over 3 minutes then silently moved north","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"El Paso, Texas, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525491"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Redding","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My family and myself were on a mountian nere shasta dam , watching the peresus meteor shower , when we spoted a large meteor fall on a mountian across from our veweing area , it didnt explode on impact just went out , then we noticed colums of light moveing around like a huge doors opening and closing suddenly a large triangle of lights apeared between us and the mountian seven lights tottal , i turned the car headlights on high and low beam several times at the object , then it started moveing twords us to check us out when a car pulled up , the object just disapeared. we have gone back to the spot many times after that and have seen the lights on the mountian i think there is a base inside the mountian but we never saw the triangle of lights again ... ps i do have a photo of a nother object from years ago up nere susanvile thats whole different story . i cant email it to you because i dont have a scanner  ...","distance":"Unknown","duration":"04:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4701,"landingOccurred":false,"latitude":40.5952896,"location":null,"logNumber":"US-04202006-0002","longitude":-122.3901454,"occurred":797482800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,  Triangle","source":"MUFON","status":null,"submitted":797482800000,"summary":"We were watching the perseus meteor shower when a ufo aproached us.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Redding, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:525492"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mulberry","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling east on state road 38 just east of mulberry,indiana approx. 9:10pm my stepdaughter and i both noticed an orange light inthe sky which separated into three then faded out.....Similar to a cheap firework ....But much to high in the sky.The objects were slightly larger than the the stars in the east sky.I noticed an orange light moving northward which split into 3 orange lights approx. the same size as the original.....It split off in a forked like pattern.My step daughter and myself both said\"did you see that?\"...She asked me what it was .......I said it looked like a firework....But i told her it was much to high in the sky....We speculated a ufo......We drove approx. 3 more miles toward our house, as we approached the house i was continually looking upward and i saw the same orange \"fireball\" in the same general location moving northward again.....This time it shot out into two then three then faed out one at a time starting with the first in the series......Very similar to a cheap firework......But entirely to high up in the sky.....At this time we were astonished by a second sighting....We watched for several minutes with no other sightings......It was a very eerie sight......Like none ive seen before in the indiana skys.Sadly i was not able to get a picture...But my stepdaughter and i both saw it vividly","distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":4700,"landingOccurred":false,"latitude":40.3444804,"location":null,"logNumber":"US-04202006-0001","longitude":-86.6652821,"occurred":1145506200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1145506200000,"summary":"Two sightings:1 orange fireball separates into 3 then disappears","tags":["fireball"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mulberry, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525493"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hop Bottom","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were fishing at lomis lake its briteness and speed dont know came across the horizon very fast stoped dead in its tracts hovered for a few seconds then it speed away at an incredable rate of speed my dad said holy shit i dont belive what im seeing then he got real nervous and said lets go i dont like this so we left then he told me not to tell anybody what we saw because they will think were nutswe lost sight of it when it sped away","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4699,"landingOccurred":false,"latitude":41.7059106,"location":null,"logNumber":"US-04192006-0001","longitude":-75.7663017,"occurred":-458675400000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":-458675400000,"summary":"Cigar shape glowing","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hop Bottom, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525494"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hauser","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my family were driving into the parking lot at howser lake.I was looking at the lake,andi then spotted a massive disc-shaped object hovering over the lake. my mom said afterwards that she had seen something above the lake and assumed it was an ariplane. it was dark grey mettallic with a bright light at one end. i turned my head no more then 2 seconds away from it to tell the others. i looked back and it disappeered. i was eleven and i am now tweleve. i dont just see things it was real. ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4698,"landingOccurred":false,"latitude":47.7729561,"location":null,"logNumber":"US-04182006-0004","longitude":-117.027979,"occurred":1129359600000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1129359600000,"summary":"Dark grey with a bright light at one end.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hauser, Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525495"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is an update to the report i filed on tuesday, april 11, 2006. i took a photo on april 17, 2006 from the location the sighting was witnessed. this is a daytime photo, and i used editing tools on my computer to mark the approximate location of the objects, and to blank out the identity of a co-worker( the whited-out area.) the photo is from a motorola razr v3 cameraphone, zoom size is 4x. unfortunately i didn't get photos of the objects as they appeared, so the photo is sort of a \"fix\" to give viewers a general idea of location and elevation. ","distance":"Unknown","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4696,"landingOccurred":false,"latitude":32.1637651,"location":null,"logNumber":"US-04182006-0002","longitude":-82.901493,"occurred":1144812600000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Circle,  Disc,  Sphere","source":"MUFON","status":null,"submitted":1144812600000,"summary":"Please see report filed on 04/11/2006","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4696_submitter_file1__04-17-06_1933B.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525496"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Carp","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and a friend were walkin down our desearted blacked out small town streets...We were having a smoke just enjoying the nice peace and quiet...Coming up to an intersection a bright object popped out of the clouds to our right ..This thing was bright...We froze and just starred at the luminous obect just sitting there...I whispered this is number 2 in two months. then just as it popped out it popped back into the clouds...To our left was a helicopter heading in the objects direction right after it moved behind the clouds... for the rest of the night we were a little shaken but mostly excited about our siting. for the rest of the night we watched the skies for any more activity.I am a firm believer in unknown intelligent craft not of this world...Who knows what is out there...Or more like on our doorstep.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Path then hovering","formattedAddress":null,"id":4695,"landingOccurred":false,"latitude":45.3490139,"location":null,"logNumber":"CA-04182006-0001","longitude":-76.041407,"occurred":1061013600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1061013600000,"summary":"Bright ufo pops out of the clouds ...Lights up the blacked out streets","tags":["ufo","lights"],"timeZone":"America/Montreal","timeZoneName":"America/Montreal","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Carp, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525497"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Pensacola","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" aproximately 11pm, april 15, 2006. outside walking dogs around house.\r\n\r\n how i noticed the object? i felt as if someone were watching me and what i was doing (this esp sense rarely fails me, family and friends can testify to this). for two minutes i looked around, to see if it was my neighbors or a cat. eventually i looked to the sky... nothing north... west... south... then i turned around sharply, i laid eyes directly east, on a cloud. the following happened intensly fast.\r\n\r\n i noticed something in the split second i had turned, i thought it was a star for a moment. i saw a bright circular object, it was pure white, mabye a hint of orange. my mind did not have enough time to register exact colors, and/or any other lights on it.\r\n\r\n then this object, less than a moment after i saw it, accelerated south, through a cloud, and on up into the atmosphere. it left a wake in the cloud. in about two seconds this object traveled from western zenith (directly behind and above me, aproximately 5,000 feet above me) to the southern horizon. i've lived most of my life in this heavily military used airspace (near eglin air force base) and i can promise you, nothing accelerates from 0 to well over mach 4 in less than two seconds. judging by the distances guessed by the cloud base, i estimate the object to be half the size of a boeing 747 liner.\r\n\r\n my first reaction was the fact that i had seen another ufo (this is the 3rd in my area, each was different than the last, some time inbetween them), then my second reation was... i was being watched. i paniced, ran inside. i did not want to stand out in the open night air. \r\n\r\n later i exited the safety of my home armed with my glock. nothing appeared this time. i refuse to leave my house at night without being armed now. not after being spied on by a craft...\r\n\r\n if you have any opinions on what i should do in the event of it returning or actually bothering me, please let me know.","distance":"501 Feet - 1 Mile","duration":"00:00:02","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":4694,"landingOccurred":false,"latitude":30.423309,"location":null,"logNumber":"US-04172006-0004","longitude":-87.2079649,"occurred":1145167200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1145167200000,"summary":" ufo spying on house/area until i spot it, it accelerates out of view in 2 seconds.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4694_submitter_file1__joey7nova.doc","http://www.mufoncms.com/files_jeud8334j/4694_submitter_file2__joey7nova.doc"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pensacola, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525498"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Amman","country":"Jordan","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was standing at my flat balcony on the top flour in a very high bulding at amman center,i was loking over the city and sudenly a big ball of light like star appear flying just over the city in a low level,for about 3minets and then disappear.I was surprised didn't know what was it and i thought i may find out the next day from the press but it wasn't mentioned!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4693,"landingOccurred":false,"latitude":31.9565783,"location":null,"logNumber":"JO-04172006-0003","longitude":35.9456951,"occurred":1129000800000,"potentialRelations":[],"rating":"Unrated","region":"Amman","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1129000800000,"summary":"Very big ball of light like star flighing in low level over the city of amman the capital of jordan.","tags":["none"],"timeZone":"Asia/Amman","timeZoneName":"Asia/Amman","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Amman, Amman","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525499"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Millville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Coming out of garage, daughter looked up and said \"what the heck is that??\" i looked up and saw an orb moving underneath\r\nclouds against the wind direction of clouds in east sky.\r\ncalled wife and other daughter out ,they also saw it.It was moving between the cloud bottom and above tree line in forest, casting  a glow on the tree line as it moved. we live near millville airport,are familiar with aircraft. this\r\nmoved independent of wind and rapidly faded away in a straight line. we all had never seen anything move across sky in that manner except conventional aircraft.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":4692,"landingOccurred":false,"latitude":39.4020596,"location":null,"logNumber":"US-04172006-0002","longitude":-75.0393438,"occurred":1122793200000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1122793200000,"summary":"Windy day , orb seen under clouds","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Millville, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525500"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Burlington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving down rose ave. eastbound when i noticed the bright reflection off the object to my northeast. i stared at it as much a i could while driving, noticing it was not moving at all. at first i thought it was a commercial airline, but realized it wasnt moving, left no contrail, and was huge. i alternated between watching the object and the road, and after  a minute and a half it wasnt there when i looked back up. i then turned north to try and locate it but there were no aircraft or other objects in the sky. the sky was clear and sunny.\r\n","distance":"Over One Mile","duration":"00:01:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":4691,"landingOccurred":false,"latitude":39.3100782,"location":null,"logNumber":"US-04172006-0001","longitude":-102.2681163,"occurred":1145303100000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1145303100000,"summary":"Large shiney silver elongated object  bigger than commercial airliner near powerstation","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Burlington, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525501"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Durango","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside walking from a building to my apartment. i live in an area with no light polution and it was a very clear night and the moon had not yet risin. looking north i saw what i thought was mars the i noticed it was moving slowly from east to west.  i then thought it might be the space station but afterward i checked j-track and there were no significant satelites in the area at the time (hst or the ss).  the object moved slowly from east to west and was to my north.  it had no visible navagation lights.  an air liner passed overhead at the same time and displayed navigation lights i was looking for.  it was to far away to have any disernable shape.  but the best way i could describe it was it looked like mars would but moved. its movement did not seem natural or i would describe it as not quite moving in a straight line.  but this may have been due to my own eyes focused on it.  i eventually lost sight of the object behind the wall of the valley i live in.  ","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":4690,"landingOccurred":false,"latitude":37.28521,"location":null,"logNumber":"US-04162006-0003","longitude":-107.8762067,"occurred":1145246700000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Other,  Unknown","source":"MUFON","status":null,"submitted":1145246700000,"summary":"Orange object moving east to west","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Durango, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525502"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Golden","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving north on highway 93 coming from golden heading towards boulder.(coming back from taking pictures and walking my dog at red rocks amphitheater.)\r\nsaw a group of reflective objects making different (odd unnatural)formations (very high up) in the sky slightly nw (started out n.)of my vehicle. they were moving in what i can only describe as a liquid type motion. kind of like mercury or oil in water. they moved in unison. i kept my eye on them while driving for about a minute or two. it struck me as very strange, so i pulled over on the side of the highway to get a better look. i wasn't sure what they were because i had never seen anything move that way.\r\nthe very first thought that went through my head was \r\n\"those don't look like hang gliders or birds.\" \r\nthey were too large to be birds at the altitude they were at and they were shiny. they were too high up to be hang gliders. they were far above any mountain peak visable in the area. \r\nthey were moving very slowly, but the motions they were making didnt mesh w/either of those things.\r\n\r\nthe group split in half, w/one half of the group mirroring the other half's motion. \r\nthey were very reflective and all seemed to be identical. the objects were slowly \"dancing\" in that liquid motion overhead for about 5 min's. (i took a few pictures of them from my vehicle.)they then made a formation of a triangle (not a v) and jetted off very quickly headed nw(more west than north) and were gone. they left no visable trails and i did not hear any noise other than that of the traffic on the highway.\r\nhwy 93 is a well traveled road. there were many people on the road that day. i seemed to be the only one who actually stopped to take further notice of these.\r\ni'm definitely interested in finding out if anyone else reported seeing these objects. they were hard to miss.\r\ni have photos and will attatch the clearest one. you will need to zoooom way in on the cluster of objects. \r\nonce you do you can make out their shape and tell that they are metallic and seemingly identical.\r\ni'm sending the pic unformatted/unoptimized, so it is a large file. i would love to know what these were. i've tried to come up w/an explanation. \r\ni only wish i had a video camera to capture the motion of them - the pics i took don't do them justice in that way.\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Wings,  Other","flightPath":"Hovering then path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":4689,"landingOccurred":false,"latitude":39.761343,"location":null,"logNumber":"US-04162006-0002","longitude":-105.2122797,"occurred":1144875000000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Saturn-like,  Other","source":"MUFON","status":null,"submitted":1144875000000,"summary":"Several reflective flying objects moving like liquid in sky over hwy 93 in jeffco co. near rocky flats.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4689_submitter_file1__2006_0412dodo0058.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Golden, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525503"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Fort St John","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just entering a friends house when i looked up and noticed a bright white object floating by. at first i thought it was a bag but after a few seconds i noticed it was higher than i first thought.I grabbed my camcorder to get a closer look and zoomed out to 22x (optical). then around 30-40x digital. camera has no image stability system so video is rather wobbly.The object seemed to be rocking up and down but keep one end facing in the direction it was going. there was no sound and it was moving at a cross angle to the wind.After a few minutes it went behind a cloud and i never saw it come out.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":4688,"landingOccurred":false,"latitude":56.255463,"location":null,"logNumber":"CA-04162006-0001","longitude":-120.836489,"occurred":1144798200000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Boomerang,  Other","source":"MUFON","status":null,"submitted":1144798200000,"summary":"Backwards \"c\"","tags":["none"],"timeZone":"America/Dawson_Creek","timeZoneName":"America/Dawson_Creek","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4688_submitter_file1__041106.wmv","http://www.mufoncms.com/files_jeud8334j/4688_submitter_file2__unknown-0000005_0007.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort St John, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525504"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Indianapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In my front yard smoking a cigarette and looking at airplanes on final to a local airport. the sky was extremely clear and blue. the object's bright reflection first caught my eye. at first i figured it was a plane, but it was small, didn't move and seemed to be at medium to high altitude. (i could gauge altitude by the 4 or so planes that flew by the object with no apparent idea it was there). i watched the object remain in the same spot for near 10 minutes. i grabbed my binos and tried to zoom in on the object. i couldn't focus on the object and could not discern the exact shape. the reflection didn't seem steady, but shimmered at times, but not pulsating. i watched the object slowly, very slowly move easterly towards the downtown and then stop. it remained in that position for a time. i looked around and saw that no one else was watching the object and the planes that flew by (all commercial airliners) at different altitudes seemed oblivious to the object. at this time i became intriqued because if it was a balloon...There would be strings below it, there was not. also, the object held in a hover at medium altitude and was uneffected by upper level winds. i still could not focus on the object because the reflections were to bright. the object began moving again towards the southeast slowly, then mildly fast, then it stopped and hovered. the movement to each position took 5 to 10 minutes and the hovering time was near the same. the object grew distant and then came back and to the northwest. after 40 or so minutes it became hard to see it, but it was far off. i came back a few minutes later and it was gone. \r\nafter the sighting i dismissed it as a weather balloon, but i asked this question? balloons move with the air, this did not, why release a balloon in the middle of air traffic lanes? my roomie laughed me off saying it was a balloon. i'm really not sure what it was, but it acted much differently than conventional aircraft and it was no helicopter, too high and there was no sound.\r\n\r\ni don't know why, but i didn't take a picture. i recently moved here and my digicam is in a box somewhere. next time, if there be one, i'll get the camera. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":4687,"landingOccurred":false,"latitude":39.7753855,"location":null,"logNumber":"US-04152006-0003","longitude":-86.1488036,"occurred":1145139600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Cigar,  Egg,  Flash,  Sphere,  Teardrop","source":"MUFON","status":null,"submitted":1145139600000,"summary":"Object was small, reflected sunlight, thus an exact shape was hard to discern even through binos.","tags":["disc","hovering"],"timeZone":"America/Indianapolis","timeZoneName":"America/Indianapolis","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Indianapolis, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525505"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Louisville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  was looking north out my door about midnight on april 12th. when a bright orange light from a slowly moving aircraft/object came into view. \r\nas the object moved closer overhead i could tell that it was triangular shaped. \r\ni believe it was some type of experimental aircraft as it was completely triangular shaped. the first craft proceeded due south. within 5 minutes a second craft appeared. it banked southeast. they were moving slower than a jet and flying at low altitude. there were clouds and they were flying under the clouds. their altitude was 1,000 to 2,000 feet. the craft looked about 40 - 80 feet long. about the size of a jet but was clearly triangular.  havent seen any jets or aircraft like it before! i have worked at an airport and i know different aircraft when i see them. i photographed it but only got the running lights. \r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":4686,"landingOccurred":false,"latitude":38.3964426,"location":null,"logNumber":"US-04152006-0002","longitude":-85.4375574,"occurred":1144869300000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1144869300000,"summary":"Was watching the northern sky when two triangle aircraft slowly zoomed overhead about 5 minutes apart heading south.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Louisville, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:525506"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was loooking out my top-floor window.\r\n\r\ni saw a star -like  light moving in level flight from\r\nnorth to south, about 10 degrees in elevation from the\r\nhorizon. then about 10 minutes later, i saw another one.\r\nthen about 10 minuted later, another one. then 10 minutews\r\nlater, another one. they were in level flight, separated\r\nfrom each  other.\r\n\r\n\r\ni was in shock.\r\n\r\nthey moved north\r\n to south till out of view.\r\n\r\nyhey were not blinking planes or choppers. i see them alll\r\nthe time and i know what they look like.  \r\nand they were bright steady lights. like nothing i have ever\r\nseen before. and in formation but separated-like.\r\nand not satallites, or stars.  they moving in a straight\r\nline, but not like a plane or jet, which i see  all\r\nthe time.L\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4685,"landingOccurred":false,"latitude":40.0646138,"location":null,"logNumber":"US-04152006-0001","longitude":-74.3968912,"occurred":1144825200000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1144825200000,"summary":"Train of lighhts . one right after the other; elevation 10 degrees from horizxon.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525507"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was playing tactics arena on the internet. then i looked put my window and i saw 2 flying objects then i went on to my porch. they were moveing faster than an airplane. the suddenly vanished at really high speeds.   ","distance":"Unknown","duration":"00:10:08","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4684,"landingOccurred":false,"latitude":39.5538607,"location":null,"logNumber":"US-04142006-0003","longitude":-105.7747674,"occurred":1050292440000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1050292440000,"summary":"It was round and liggts and the lights looked red and blue","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525508"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tinton Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Wayside, nj 1950 on our farm. i was flying a kite. the ufo suddenly appeared over head. it was motionless and made no sound. i knew it was nothing i had ever seen before. i was and still am interested in aviation. i was 11 at the time. i had no idea what it was. it was not a disc but rather a cigar shape. dull metal, no windows or lights. i looked up since i had a funny feeling i was being observed. the kite was flying forward of me and the ufo was over my head. i looked at it for quite sometime. it did not move. the sun did not reflect off it, there was not bright area though the sun was very bright from behind me. i was about 5 or 6 acres from the house and after watching for 5 minutes or so i wanted to inform my mother. just as i was about to run in the object moved from south to north. i had a clear view of both horizons. it traveled across the north horizon in less than a second. it did not begin slowly. it was at high speed instantly. i could not believe my eyes. how could it go so fast with out a build-up of speed. i ran home and told my mother and later my father. they told i was dreaming of airplanes and it was my imagination. looking back i feel the ufo was around 2 to 3000 feet up and probably 100 feet long.   ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4683,"landingOccurred":false,"latitude":40.25667,"location":null,"logNumber":"US-04142006-0002","longitude":-74.075,"occurred":-622137600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":-622137600000,"summary":"Hovered over me at 2-3000 ft.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tinton Falls, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525509"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lahaina","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were on the beach making sand castles.  my mom said hay whats that.  i said mom call the cops its a ufo she said no ill miss it.  it floted right over us and went eay over the ocean.  my mom said go tell dad and i said you.  it was very scary.  it floated to far up and to far away.  after it dissapeared we ran in and told my sisster anc came out it was not there.","distance":"Unknown","duration":"00:08:16","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4682,"landingOccurred":false,"latitude":20.8783333,"location":null,"logNumber":"US-04142006-0001","longitude":-156.6825,"occurred":1074211680000,"potentialRelations":[],"rating":"Unrated","region":"Hawaii","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1074211680000,"summary":"Black object going over ocean","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lahaina, Hawaii","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525510"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Bakersfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. i was playing a computer game in the living room of my house.\r\n2.The sliding door was open for a breeze. my neighbors dog was barking unstopably. i saw the dog walking in circles wagging it's tail. it frequently looked towards the sky so i was curious as to what he was barking at.\r\n3. to tell the truth it felt like i fainted. it was all too strange. i knew it was a ufo right off the bat.\r\n4.This is where my heart began to jump...I witnessed a black,(fiber glass looking) triangular craft. it had 3 lights on the bottom. one at each point. there was a ring in the middle of the craft that was a luminous purple. over the 9 minute period it was calmy revolving. \r\n5. i lost my breath for a couple of seconds. then i forced myself to stay calm. i looked at it for about a minute before yelling for anyone to come outside. it was hard for me to get the words out. a couple from nextdoor came outside and instantly looked at the craft. there was an awkward silence in the air. the couple from next door went inside to get a video camera. the craft hooverd slowly over my house and out of my veiw. i ran through the house and out the front door. although there was nothing for miles besides a few flikering street lights. i took a few steps when i noticed a light to the left. the ufo had traveled about 300 yards in a matter of seconds. it had landed. there appeard from around the craft a small gray figure with an abnormally porportioned, egg-shaped head...\r\n6.The being re-entered the aircraft. the ufo then suddenly shot out into the sky. i waited around for a couple of hours sitting on my lawn speaking with the couple from next door. we saw no more of the craft that night.","distance":"501 Feet - 1 Mile","duration":"00:09:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":4681,"landingOccurred":false,"latitude":35.3828821,"location":null,"logNumber":"US-04132006-0004","longitude":-119.0163525,"occurred":1145067780000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Egg,  Triangle,  Other,  Unknown","source":"MUFON","status":null,"submitted":1145067780000,"summary":"I saw an alien appear from a craft.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4681_submitter_file1__Project1.png"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bakersfield, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:525511"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Montrose","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was getting ready for bed. it was a very windy night-trees bending in the wind. and it was cold. i turned to face the windows,which face the south east, when i saw 2 bright lights moving in the woods, one following the other. at first i thought it was a car, but then i quickly realized that it could not be a car as there are no roads in the woods. the area is heavily wooded, very dark, a ravine, very steep. the lights moved slowly, one after the other. then they disappeared, only to reappear in the opposite side of the woods, in a few seconds. then i see 3 lights-intense white color-amazing-like a star-twinkling, back in the first area.\r\n  i am amazed at the quality of light that they are. they cross the ravine, towards my apartment. they stop. i grab my old binocculars and believe i see one bronze colored object hovering about 20 feet above ground, right near the road. then it gets confusing-the movement, that is-the lights roll over and turn toward the hill and disappear out of sight. i believe i saw red light below the white ones. i am real scared and close the lace curtains and back away from the window-hide. a few seconds later, i see 2 small orange lights bounce up the grassy hill nearer my apartment.  two days later the lights came back, then again on new year's eve-in a snow storm. my cat was on the bed when they came. suddenly she ran to the window, looked up at the sky and then slowly walked to the window sill and looked down at the ground below. a friend witnessed the lights one evening. i continue to look for them, but they have not come back to date.","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4680,"landingOccurred":false,"latitude":41.2524538,"location":null,"logNumber":"US-04132006-0003","longitude":-73.9318659,"occurred":1135666800000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1135666800000,"summary":"2-3 star-like objects travelling in wooded area above ground:returned 5 times","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Montrose, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525512"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"South Boston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" 1. i was driving home late from state park training.\r\n 2. i saw some lights out the side of my window as i was driving.\r\n 3. i didn't know what it was. i thought it could be a huge helicopter are first. but it wasn't like any chopper or any hover craft i have ever seen. (i was in the navy for 6 years and i have spent alot of time around vertical take off aircraft; harrier jump jets, helicopters,etc.)\r\n 4. it looked about 1 mile away slowly hovering over the treetops.I couldnt really make out the shape but it was big. it did have depth though. i could see what looked like running lights around the edges. it could have been triangle shaped but i really could not tell. it seemed to match the night sky in color, save for the lights.\r\n 5. i pulled over in my car and turned of the engine to see if i could hear it. i could not hear anything. i got out of my car to see if i could hear it better but i still heard nothing. \r\n 6. after about 5 minutes of watching it i gave up tring to figure it out and got back in my car and went home. \r\n ps:   after working around military aircarft for 6 years i am not ashamed to say that i still don't know what it was. any ideas ?Please contact me.\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":4679,"landingOccurred":false,"latitude":36.7046393,"location":null,"logNumber":"US-04132006-0002","longitude":-78.8938987,"occurred":1053147600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1053147600000,"summary":"It appeared to be a silent flying craft of large size hovering and slowly moving at about 1mile distance . it had lights around sides and was over tree top level.","tags":["lights","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"South Boston, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525513"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sousse","country":"Tunisia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wif and myself were walking down the drive way towards the hotel hanibal palace in port el kantoui sousse tunisia when i noticed a long  object 4 - 6 feet long just slightly higher than the hotel moving towards me at roughly 50mph with a row if not consistant light running the full length of the object, the light / lights were very dim and as the object got vurtualy overhead the lights went out. the object made no sound at all it was very silent and moved fairly quickly. i noticed the object first and said nothing to my wife whilst i studied what i was seeing, she then in a split secong asked me if i could \"see that object in the sky\" i told her i was already looking at it. we then followed the object visualy go over our heads and then dissapear into the night. the object we saw didnt appear to be a man made craft. the object i would say was roughly 1 foot in diameter or there abouts. after the encounter we discussed what we both saw and our descriptions and events were the same. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4678,"landingOccurred":false,"latitude":35.8333333,"location":null,"logNumber":"TN-04132006-0001","longitude":10.6333333,"occurred":1143090900000,"potentialRelations":[],"rating":"Unrated","region":"Sousse","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1143090900000,"summary":"4 - 6 feet long rod style object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sousse, Sousse","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525514"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Where i live in eastern nc there is an abundance of commercial north south airliner traffic overhead most every day. i noticed some other strange objects mixed with this overhead traffic today. i took about 60 photographs and picked out two photos to post here today, one original of each and an enlargement of each.","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4677,"landingOccurred":false,"latitude":34.2348555,"location":null,"logNumber":"US-04122006-0004","longitude":-77.9356202,"occurred":1144866000000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1144866000000,"summary":"Objects among airline traffic","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4677_submitter_file1__4.12.06dark.JPG","http://www.mufoncms.com/files_jeud8334j/4677_submitter_file2__4.12.06darkenlarg.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wilmington, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525515"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Where i live in eastern nc there is an abundance of commercial north south airliner traffic overhead most every day. i noticed some other strange objects mixed with this overhead traffic today. i took about 60 photographs and picked out two photos to post here today, one original of each and an enlargement of each.","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4676,"landingOccurred":false,"latitude":34.2337255,"location":null,"logNumber":"US-04122006-0003","longitude":-77.9347502,"occurred":1144865700000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1144865700000,"summary":"Objects among airline traffic","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4676_submitter_file1__4.12.06white.JPG","http://www.mufoncms.com/files_jeud8334j/4676_submitter_file2__4.12.06whiteenlarg.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wilmington, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525516"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at home 3813 vigilante drive great falls mt, i was taking my dog out after supper about 8:00 pm.As soon as we got out in the yard, i noticed a black triangle at 10:00 in the sky.I knew it was an unidentifiable flying object as soon as i saw it.It was a black triangle. it was \"hanging\" vertically in the sky in one place. after watching it for about 30 seconds it moved quickly and erratically up and to the left(south), then back down in the same manner to the original position. i kept expecting it to disappear, but when after a short while it was still there, i figured i had nothing to loose by running to get my neighbor to witness it with me.She agreed that i was seeing what i thought i was seeing, and i left her and got my neighbors on the other side, husband and wife. there was no sound, it definitely wasn't a plane, jet or helicopter, or a bird. i did get my camera and took pictures, but when the light flashed to turn on the flash, i did, and all that did was reflect off my white fence and you can't see it(the object) in the sky. only one picture, the first, came out. it looks so much smaller in the photo than it did looking at it in person. my neighbors and i are the only ones that know what that photo actually looked like when i took it. then it started moving west and north, vertical, then horizontal, almost disappearing when it did this, then vertical and so on until it disappeared beyond the horizon. i am at the library and have no way to attach the photo.   ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4675,"landingOccurred":false,"latitude":46.8876822,"location":null,"logNumber":"US-04122006-0002","longitude":-110.3576458,"occurred":1144811700000,"potentialRelations":[],"rating":"Unrated","region":"Montana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1144811700000,"summary":"Took the dog out, looked up and saw black triangle \"hanging\" at 10 o'clock.  it moved quickly and erratically up and to the left, then back to first position. i ran and got neighbors to witness.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Montana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:525517"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Augusta","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on a short break at work in the company smoking area when 2 lights appeared , first one \"faded\" in, then another. they hovered without moving, then one object \"faded\" out, then the other. it was also witnessed by a co-worker. the duration was @ 30 seconds. we continued to watch the area, but no more activity was detected from our viewpoint. from my point of view it appeared as if they were hovering over fort gordon military installation, but i can't verify this, as i couldn't determine the exact distance. ii only have the other witnesses' name and don't actually know her personally, only by acquaintance on the job.","distance":"Unknown","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":4674,"landingOccurred":false,"latitude":33.481456,"location":null,"logNumber":"US-04122006-0001","longitude":-82.00079,"occurred":1144816200000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1144816200000,"summary":"2 glimmering reddish/orange objects appeared in southwest sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Augusta, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:525518"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2613}
