{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was about 24 yrs. old, staying for awhile at my parent's house in chula vista, ca.  i was in the den wathing johnny carson show that starts at 11pm.  i was sitting in the middle of the couch and happened to pull back the curtain - it was very quiet outside at that hour.  i closed the curtain and continued to watch johnny carson - it bothered me that the big light i saw up in the sky was too high to be a street lamp and too low to be a star - so i pushed the cutain back again to take another look.  the big light was so interesting i left the den and opened up the front door facing east.  it was an enormous light just hanging there in the sky with no noise.  i ran to the bathroom and hollared at my mother to come look at it - it was a ufo.  she wrapped a little towel around her and we stood on the front porch watching the light dim and then we could see the circular craft.  it was so clear that night and it was so close we could see the port holes.  in the middle on the right side was three port holes and each port hole you could easily see red light in each of them.  on the left side in the middle were two port holes that shone white light from the port holes.  it just stood there and made no sound.  i was so excited i wanted to get a flash light and signal it, but mom was so scared she was making the sign of the cross - and my little two year old sister was in the background.  because she was so scared i didn't get the flash light but i did call the chula vista police dept. but they didn't believe me - i tried to convince them but they would take me seriously.  i then called a radio station and they wouldn't believe me either.  it was so frustrating and it just stood there near the hospital on the next block.  we watched the enormous light grow all around it one more time and after a while the light dimmed.  it was just incredible - then we watched it float off effortlessly noisless heading north.  i wanted it to come back - it was so amazing - i wasn't afraid of it like mom was. i went the to the star newspaper the next morning and told them the story.  they found it interesting but you could see they too didn't know whether to believe it or not.  this is the first time i have ever sent my story of this occurrence to anyone-it has stayed on my mind all these years and i would just like for once to tell someone like you about it.  seeing it is indescriable in words.  now i can have some peace that i finally was able to tell someone.  thank you for that.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":13999,"landingOccurred":false,"latitude":32.7183492,"location":null,"logNumber":"US-11252008-0006","longitude":-117.1555551,"occurred":155115000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":155115000000,"summary":"See attached-","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298074"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Grand Rapids","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"To whom it may concern ,\r\nmy name robert j white of muskegon on sept  25 , 2008, i decided to take some photos of the stars messing around with my cousins. so i went outside and started taking photos of the stars. as i looked threw my camera i really didn't see anything at all., so after taking nine photos i headed in. but when i got in the house to view the photos. i found them too not only have stars on them, but also it held photos of quite abit of circle discs. if my eyes is not failing me it must be about (12) disc shaped objects or more, my camera is a fujifilm fine pix digital 2600zoom 3x optical zoom 2.0 mega pixel. so i decided to go out every chance i get, i went out the sept 25, 26, and 27 , of  2008. all togehter i took 35 photos and 12 of them have something on them. i don't want to stick my chip in this computer and lose the photos by error. however, if you send the directions to and how to down load the imformation to you , i will do that as well. my email address is alvera.Atkinson@yahoo.Com, you could send your response robert of  muskegon county. \r\nthe photos was taking outside of my home in the back yard of muskegon mi,and yes i felt petty weird i showed everyone i could.I also have more photos and film of something undescribe-able in the skies of muskegon michigan.So these first photos was the beginning of a line of photos and film.\r\n      p.S thank you for giving me the opportunity to share what i saw the night of sept 25,26,and 27 2008. robert of muskegon","distance":"Unknown","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13998,"landingOccurred":false,"latitude":42.9694599,"location":null,"logNumber":"US-11252008-0005","longitude":-85.6618363,"occurred":1222369200000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc,  Star-like","source":"MUFON","status":null,"submitted":1222369200000,"summary":"It was just a unbelieveable event and it lasted for acouple of days so it was exciting.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13998_submitter_file1__Robert005.JPG","http://www.mufoncms.com/files_jeud8334j/13998_submitter_file2__Robert026.JPG","http://www.mufoncms.com/files_jeud8334j/13998_submitter_file3__Robert018.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grand Rapids, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298075"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hovered, speed up, complete stop, fast fast fast gone\r\n i have a clear pic!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":13997,"landingOccurred":false,"latitude":36.779351,"location":null,"logNumber":"US-11252008-0004","longitude":-119.4098124,"occurred":1227575700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,  Disc","source":"MUFON","status":null,"submitted":1227575700000,"summary":"Actual picture taken on iphone. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298076"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Junction City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my brother was walking north on our street. onpon reaching the corner  we observed 2 very bright objects in the sky we took to be  stars.  they were odd because they were extemely bright and very low. one of the objects was smaller than the other sitting at about a 11:00 position above the very large one. we jokingly say  to each other that they are probably some ufo's and begin to say how bright they are. we turn around to go back home because no one was outside. about 40yd from the corner of my street  in front of a neighbors house. we look up to observe a fast star like object headed north very fast. 3x or 4x faster than a plane.  a plane or jet was in close  persuit of the object.  we kept walking just a few feet furher we see another object going estremely fast being chased by a plane.  we see this all the time, so we joke they are chasing the ufo's tonight.  we keep about another 40yd then we see  a very bright starlight object just to our left just sitting still. it wasnt very high or very far away. we still pay not much attention, we see it all the time.  it's nothing, and keep walking.  about 10 yards later my brother notice lights were coming from behind us say, \"here come a car, get out the road\".  i tell hime, \"i dont hear a car.\"  my brother then turn around and then says,\"oh sxxt! oh sxxt! it fixing to get us!  its fixing to get us!  im going through the woods.\" next i turn around and look  then say, ahh aahhh.  i was trembing with fear at what i saw and couldnt say anything. what i saw was the bright star like object coming at us with a white beam/light on the ground. i  grab him from running through the bushes and tell him, \"hell nawl, we are togethter.\" in less then a second the light was from the corner of my steet to about 20feet from us. by then he bolts and take off running full speed to the house.  i follow behind running for my life. neiher one of us looked back.\r\nwhen we went back up the road with more people. the 2 obeject were still in the sky where we first notice them. it is now around 6:22  we go out stay till about 7:40. then we notice both object were gone.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path","formattedAddress":null,"id":13996,"landingOccurred":false,"latitude":33.0179901,"location":null,"logNumber":"US-11252008-0003","longitude":-92.7167243,"occurred":1227513600000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Star-like,  Unknown","source":"MUFON","status":null,"submitted":1227513600000,"summary":"Very bright light/ spotlight in sky.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Junction City, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298077"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Connellsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is the latest ufo ive seen..Ive seen a lot of ufos and i know for a fact when i say they was ufos...Ive seen 2 ufos up very close and one of those ufos i could have hit with a rock..That one was back in 2000,but its a story that must be told.Id rather talk than type about that one...Anyway here is the latest ufo i seen...I was walking up my driveway and it was almost 11 at night..I got about half way up my driveway and i lit a cigarette..When doing that my head was facing the ground with my hand covering my lighter..Also i had a hat on...I lit the cigarette and looked in front of me and i thought..Its daylight...Then i took two steps and i realized..Its daylight!!!..So i looked at the sky to see why it was daylight at 11 oclock at night and there was the most massive white ufo i had ever seen..At its smallest it was 2 football fields side by side and 2 football fields long..The ufo sat still for just under 20 seconds,then it burst towards scottdale at unbelievable speed..When it first appeared it flashed like lightning..I seen the flash while i was lighting my cigarette,then when it burst away it also flashed like lightning..Like i said it was daylight and when it burst away it was brighter than lightning..Also when it flew away it was just a streak it went so fast...It didnt make any noise..What was wierd is that you could feel it in a sense...My mother was on here way home when i seen it..She was a little over 1 mile from our house and she said she could see the trees around her lit up like daylight and then she said she seen a very bright flash..She told me that she thought a transformer blew up over top of her car...I gotta go for now..Id like to talk if you care to hear about many things ive seen since i started paying attention to the sky..Its very important i tell atleast a few of the more amazing ufos i seen due to the detail i can tell you...Also i would be glad to take a lie detector test if you have any doubts about what i have said or will say...I gotta go though so good luck with your searches for the facts...Bye","distance":"Unknown","duration":"00:00:18","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13995,"landingOccurred":false,"latitude":40.0178522,"location":null,"logNumber":"US-11252008-0002","longitude":-79.5894828,"occurred":1186984200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1186984200000,"summary":"Massive white craft about 2 football fields width and length. i have 2 partial witnesses.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Connellsville, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298078"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kansas City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live in an apartment complex in the city.  i was on my balcony having a cigarette and looking at the sky.  i was looking east/southeast towards orion.  i saw what looked like a flock of birds, which seemed weird for night, but i kept looking and it was moving way too fast and there was no noise at all.  completely silent.  only in my field of view for about 7-10 seconds.  i would guess it covered a half mile in that time.  was very smooth moving.  it wasn't lit up though.  that's why i thought it was birds.  looked like 10-15 birds flying in a v (more like a boomerang.  wider angle than a v) formation and the underbellies were lighter in color.  like a whitish color.  i see birds all the time flying in formation right now because of migration, but never at night and never moving that fast.  and birds tend to move closer and further from each other.  this was in perfect symmetry.  weirdest thing i ever saw.  was about 400'-500' off the ground i'd guess.  i believe in ufo's but never thought i'd see one.  neat!","distance":"501 Feet - 1 Mile","duration":"10:45:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":13994,"landingOccurred":false,"latitude":39.1022765,"location":null,"logNumber":"US-11252008-0001","longitude":-94.5723767,"occurred":1227595500000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1227595500000,"summary":"Saw what looked like a flock of birds at night, but moved moved way to fast and didnt make a sound","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kansas City, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298079"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hammonton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Same object that has been reported before in case number:13806/05 \r\n\r\nlocation about 2 miles from route 206 \r\n\r\nobject slowly moving towards the north  not a plane did not look like \r\na low flying plane once again had red lights and cyan lights \r\n\r\nsingle witness this time unless someone else on the roads \r\ntonight.\r\n\r\nwas driving and it was raining very hard to keep a track on its location \r\nwithout being a danger. \r\n\r\nlost sight after a number of mins .. as i turned the final corner \r\nit was lost behind the trees \r\n\r\n\r\n","distance":"Unknown","duration":"00:07:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13993,"landingOccurred":false,"latitude":39.6460756,"location":null,"logNumber":"US-11242008-0072","longitude":-74.7929653,"occurred":1227594240000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Flash,  Other","source":"MUFON","status":null,"submitted":1227594240000,"summary":"Continued sighting of same object in case number 13806","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hammonton, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298080"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mission","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This took place on 11/18/08 between 18:00-18:30.It was just after dark and i was standing on my front porch smoking a cigarette. i was standing in the middle of my front porch entry way between two trees that i have planted on both sides. i normally stand in spot this so that the street light posted near my residence does not shine directly into my eyes. what i usually do is just look at the sky and watch the stars. well on this evening, a bright orbe/sphere looking object flew over my house from the south and was headed north. as i noticed the bright sphere object, i could not help that notice that it appeared to be moving very fast, but made no sound. at first, i thought i needed to watch this thing,just to see if what i was seeing was real. i then turned and opened my front door and yelled for my wife. this took maybe 5-8 seconds for her to come running down the stairs. as she made it outside to where i was standing, we continued to watch the object that still appeared to be traveling at the same speed. what really caught my attention was the fact that it appeared to be at an elevation of i will guestimate between 5000-7000 ft. as i watched it, i knew that it could not have been jetplane,helicopter,ect..Due to the fact that i am also a pilot and i did not hear any sound at all coming from this object. i knew it was no falling star or meteorite, due to the fact that they fall very fast and last only a second or more. i have never seen any thing fly this great length of distance, move that fast and not make any noise at all, especially at the altitude i am estimating it to have been traveling at.The object was a bright,round sphere like object that had the appearance of a bright star. it seemed to just glide across the sky and as it got further away, it went into a small clump of low flying clouds in the distance. as the sphere went into the clouds, the light slowly faded and was just gone. the spheres trajectory did, however, seem to angle just a bit kinda like a a whinding down curve in the sky.My reactions were what the hell was that i just saw, what could fly like that,at that speed and make no sound,yet still seem to just glide across the sky with ease. i did feel concerned,due to the fact that i am also a police ofc. and wanted to call and report the sighting,but did not want to be called crazy. i then initialy, wanted to call the mcallen int. airport and ask them if anyone had reported seeing anything on radar, due to the fact that there is a steady amount of commercial air traffic inbound from san antonio,houston,ect. in fact, there was a commercial airliner that did come into the airspace here in the same area that i saw the object,maybe 5-10 mins afterwards.But it was south bound, where as the object was flying northbound.We do own a digital camera that is capable of filming video clips and to be honest i did not think i would make it inside and back outside in time to catch this thing on film,due to how fast it seemed to fly. i will admit that i was excited and felt uneasy at the same time.I was basically in awe that what i was actually seeing could be what we all want to believe exist and that is \"ufo's\". after i witnessed this thing, i did run back inside my house after i was sure the sighting was over and turned on my police radio to see if anyone else in the city was calling my police dept. to report any unusual sightings in the sky. after i listened for a short while, it then dawned on me that maybe noone else saw it and if they did maybe they were as dumbfounded as i was an felt stupid to call and report it. this has been bothering me since it occurred for the simple fact that i can not come up with any reasonable explanation as to what it was. i am not looking to get famous or anything like that, but if you guys do research this in anyway, shape or form please try and contact the mcallen airport communications tower and try to obtain any radio chatter from pilot to pilot, pilot to ground or vise versa in regards to anything that was reported to them or by them and also see if you can review the radar recordings as well. i would just really like an educated explanation in to what it was that i witnessed. i enjoy flying and am somewhat afraid to go public or contact the f.A.A. due to the fact that i like being a pilot an want to keep my license.I also realize that i have no physical evidence and the only person that can cooberate my story is my wife.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":13992,"landingOccurred":false,"latitude":26.2159066,"location":null,"logNumber":"US-11242008-0071","longitude":-98.3252932,"occurred":1227061800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere,  Star-like","source":"MUFON","status":null,"submitted":1227061800000,"summary":"It was a bright sphere like object that moved across a large amount of sky in a short duration w/o any sound at all. it then disappeared into a small clouds just above the horizon.","tags":["sound"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mission, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298081"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Asheville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"First of all i dont spell very good ok   now i was walking home one night and i got the feeling i was being wached and i stoped walking and looked up at the sky and saw a starlike circl in the sky  and when i would move it would move if i moved fast it would to  so i kind of got very very  skard when i saw  this  so i stared talking out loud and i said i know im noty crazy  then i stoped and shinded my flashlight at it  and then it started down to me slowlee and then stoped and i sad out loud to it i know you know i see you folling me so i said out why dont you just come down and talk to me and all of a suddun it came very fast right at me it got as close to me as the power lines was and i said oh [pd] and i took off runnig and gotin  the house when i got in i could not see it any more  i dont want my face on tv but i dont mind to talk to you and show youwear it happend sorry about my spelling   ","distance":"Unknown","duration":"00:15:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13991,"landingOccurred":false,"latitude":35.6045352,"location":null,"logNumber":"US-11242008-0071","longitude":-82.547895,"occurred":944553600000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Circle,  Star-like","source":"MUFON","status":null,"submitted":944553600000,"summary":"It was starlike. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Asheville, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298082"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Wellston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My sighting took place while harvesting hay in a field north of twin bridge rd. i was working for a farmer. he had returned to the barn to retrieve another hay wagon. myself, my brother, and the farmers son were talking. they were sitting on the hay (stacked 5 high) talking down to me. i was leaned back talking to them when i noticed something out of my peripheral vision. i turned my head to see an object which was disc shaped and looked to be about 80 to 100 feet across. the object was not more than 200 feet in the air and traveling in a straight smooth line in a westerly direction. it didn't make a sound. at first it seemed to travel slow but as i stuttered and pointed (trying to get the other boys to look) it picked up speed. i could see a dome on its top as it was traveling away from us. i lost sight of the craft as it traveled west and trees obscured my view. years later i saw the same object in a video and pictures dated aug 6, 1997 of a sighting made in mexico city. what i saw can be seen at the following address:\r\n\r\nhttp://images.Google.Com/imgres?Imgurl=http://www.Rock-hill.K12.Sc.Us/teachers/stms/sfinley/webquest/images/ufomex3.Jpg&imgrefurl=http://www.Rock-hill.K12.Sc.Us/teachers/stms/sfinley/webquest/mexicoufositing.Htm&usg=__gaiu41plz19b34ujsavimsp5z60=&h=460&w=615&sz=24&hl=en&start=3&um=1&tbnid=dbqltyhbamliom:&tbnh=102&tbnw=136&prev=/images%3fq%3dmexico%2bcity%2bufo%26um%3d1%26hl%3den%26sa%3dn\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":13990,"landingOccurred":false,"latitude":39.1234054,"location":null,"logNumber":"US-11242008-0070","longitude":-82.5329377,"occurred":49831200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":49831200000,"summary":"Classic flying saucer shape with domed top.","tags":["saucer"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13990_submitter_file1__scan0001Wellston.jpg","http://www.mufoncms.com/files_jeud8334j/13990_submitter_file2__scan0002Wellston.jpg","http://www.mufoncms.com/files_jeud8334j/13990_submitter_file3__scan0003Wellston.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wellston, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298083"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lebanon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approx. 11:00 pm i was sitting on my patio enjoying the night......I happened to look over my right shoulder and saw what i first thought was a very bright star......As i watched it i realized it was moving.........It was traveling in a n/w to s/e direction and was moving fairly slow......As it came closer i realized that it was in the shape of a triangle......It had 3 very very bright lights on the underside that looked like ceiling \"can\" lights shining down.......Also there were a few other lights on the underside.......The object had sides on it.......I could make out the side and rear of it.......I could see the shape of the object with the naked eye........It didn't emit any sound and just drifted slowly in a south east direction......I watched it until it was out of site.....The sky was very clear with the stars being out.....It appeared to me that there was a slightly visible \"cloud like\" \"vapor\" around it......As i live approx 5 miles from scott air force base i called for the control tower but was told it was closed.....I then called where i work (st. clair county) and asked our dispatcher if anyone else had called about it and was told no......I've been a police officer for many years and have never seen anything like this before......","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":13989,"landingOccurred":false,"latitude":38.6039375,"location":null,"logNumber":"US-11242008-0069","longitude":-89.8073195,"occurred":1153119600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1153119600000,"summary":"Sighting of flying triangle at night.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lebanon, Illinois","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:298084"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was this video ever reported to you?\r\n\r\nhttp://www.Youtube.Com/watch?V=nspqw21z0ak&feature=related\r\n\r\nit is very interesting since the author has asked for help. i have never heard of him.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13987,"landingOccurred":false,"latitude":40.6398049,"location":null,"logNumber":"US-11242008-0067","longitude":-89.3963583,"occurred":1199174400000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1199174400000,"summary":"Unknown","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298085"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Port Huron","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at a stop light, facing in a north direction, i looked up towards the sky, in the same north direction, when all of a sudden, there was a streak of silver, it looked just like a meteor (shooting start), but there was not traces of fire, or smoke, just plain silver, just like a comet but all silver.  ever since then i been trying to make sense of what i witnesed, and i have all kinds of questions but no one to ask.  i,m not saying that this was a ufo, because there's no way to confirm that, the object was too far away and too quick, to make a positive id.  my question is: is it possible to see a meteor during the day and should it be silver, could of been a satellite, or even space junk?  please reply to my e-mail address, maybe i could get an answer to this.\r\n\r\nthanks.  ","distance":"Unknown","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13986,"landingOccurred":false,"latitude":42.9735334,"location":null,"logNumber":"US-11242008-0066","longitude":-82.4179142,"occurred":1213560000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1213560000000,"summary":"Silver streak, like a meteor going across the sky for a few secods.","tags":["none"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Port Huron, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298086"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Casa Grande","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Standing in back yard. looked up to the south west and saw white ball with tail heading east to eastwest. it was there and then was gone.I live by small airport and i watch the airplanes. i thought it might be a shooting star. but now i read that you can only see them after dark.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":13985,"landingOccurred":false,"latitude":32.8834022,"location":null,"logNumber":"US-11242008-0065","longitude":-111.7490721,"occurred":1227317280000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Fireball,  Flash","source":"MUFON","status":null,"submitted":1227317280000,"summary":"White ball with tail following.","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Casa Grande, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298087"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Plano","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had come out of my house and was headed across the street to corner store.I happened to look up and saw a silver cigar shape object and it had what looked like at least one fin. it was not moving at all .I saw it close enough that it looked like black stripe on the side . it was not a blimp.The date today is nov.20-08.What brought it to mind again was that i did see a blimp today and it was nothing like what i saw before.As i rode my motor cycle across the street i watched it with amazement and wondered at just what it was,it was not an airplane,or any aircraft i have ever seen. .As i went across the street the view was blocked by a tree that had come between me and the object.When i got past the tree to the point that it should have been there, it was gone!!!I combed the sky every where and there was not one single cloud in the sky , and the thing was just gone!!!I continued to the store and was excited and sure that it saw a ufo,so i told the lady in the store all about it.When i came out ,10-15 minutes later, i continued to look for it all over the sky.   then ;due east,i saw it again (i think) except it looked different now .It was longer ,or at a different angle.It had gotten darker and was moving fast and moving farther away.It was getting blury or fuzzy and while i was watching it, my eyes tuned to it, watching in amazement, the thing just disappeared!!!Not a cloud in the sky to restrict the view ,,,just  vanished!!!It was there , and then it was not there.I watched the area where it was for a few minutes thinking it might come back... but it was gone. ....I called the police the ffa and home land security to report it. ( if you can believe this)   they told me that i was lucky because not very many people ever got to see \"one of those\".... i said do you believe me? was i the only person to see this? was i going crazy? they said no ,not at all.   many people have seen \"his kind of thing\"(she never said ufo)  , and the people that she was talking about (she said)were state troopers,  city police,   comercial air line pilots and co-pilots.(she then used this term)and \"professionals\"  ....................\r\n    this is true!!!","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Insignia,  Appendage(s)","flightPath":"Stationary,Hovering then path,Straight-line path","formattedAddress":null,"id":13984,"landingOccurred":false,"latitude":33.0213431,"location":null,"logNumber":"US-11242008-0064","longitude":-96.6897856,"occurred":1223670600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Bullet,  Missile,  Cigar","source":"MUFON","status":null,"submitted":1223670600000,"summary":"Brownish cigar shape fuzzy texture. moving similar to an airplane.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Plano, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298088"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Seminole","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approx 7:40 - 8 pm range, my fiance and i were heading to the store that night when we noticed what looked to be a fairly low flying plane, but it had a light kind of going around it with the part directly pointed at us almost flashing like a strobe light it was so bright.  not sure how to explain it.. there were two stationary red lights and a white light that rotated with another dimmer light off to one side.  i tried to do a simple drawing in paint to help visualize it. \r\n\r\nmy fiance is the one who first saw it.. it was almost directly over our house.  the flash is what got our attention.  it was really bright.  when i first looked up, i thought it was maybe a mediflight or helicopter.. then realized there was no noise.  it wasn't really windy.. so there should have been noise..\r\n\r\nwhen we first saw it.. the side light was almost up against the other lights, then it moved off to a fairly good distance and stayed in that spot.. maybe like it turned slightly then went on a straight path heading east.  like it was heading southeast then changed to straight east. it seemed to be about the height of a helicopter when doing a mediflight run.. but there was no noise.  nothing that sounded like a plane or a chopper.  and i don't know of any planes that have lights that bright that strobe around it, or for that matter.. planes and choppers have red on one side, green on the other, and white to the front.. right?  this had no green light that we saw. \r\n \r\nif you take into account the side light as maybe wingspan.. it would have been rather large.. maybe about the size of 1 1/2 commercial airliners plus the wing(?) light off to the right.  guess that is all relative to how high it was and if that was a wing or tail or something.\r\n \r\nanyways, we watched it while standing in the driveway of our house for about 3 minutes then it was where the trees were blocking it.. so we got in the car and went along our route to the store.  the road we drive down heads straight east and we had a clear view of it for about another minute and  a half.  then it blinked behind a tree.. and was very far away and a few seconds later it was out of view. \r\n \r\ni don't understand how it would take so long to fly over the small patch of sky we can see from our driveway then in such a short peroid of time be so far away.  and it appeared to be flying really low, but we didn't hear anything.  i really don't think it was a plane or chopper.  i am really confused.  have never seen anything like this before.\r\n \r\ni feel kinda silly writing this, but i had to tell someone.  i'm not trying to get attention.. not trying to elaborate.. i just had to tell someone.  not too sure how the cops here would treat us if we started calling in ufo reports.  small towns aren't exactly nice to you aren't a 4th or 5th generation. and i've only lived here for about 3 1/2 years now..  you get the idea.","distance":"501 Feet - 1 Mile","duration":"00:06:30","entityEncountered":false,"favorited":0,"features":"Wings,  Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":13983,"landingOccurred":false,"latitude":35.2292801,"location":null,"logNumber":"US-11242008-0062","longitude":-96.665853,"occurred":1227066000000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Oval,  Unknown","source":"MUFON","status":null,"submitted":1227066000000,"summary":"Ufo heading east over seminole ok on nov. 18th","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13983_submitter_file1__UFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Seminole, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298089"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dowagiac","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The  babyseter  call us  over  she  herd a noies . as we  walk back home. me & mom  saw lightes  in  sky. they  were four of them . the colores were  red , blue , green & yellow. the lightes  were about  a 100 yard away from us i think . about  the some high  we saw a  airplan  light  stop in the air. the four lightes  some to hold the  airplan . my mom had flashlight. she put the light on the ufo two time. like a flash it was gone. the airplan take off.We were scad  of it. i did my best to it righ","distance":"Unknown","duration":"01:10:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":13982,"landingOccurred":false,"latitude":41.9842123,"location":null,"logNumber":"US-11242008-0062","longitude":-86.1086228,"occurred":266808000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Diamond,  Disc","source":"MUFON","status":null,"submitted":266808000000,"summary":"It was spring with some cloud in sky it was clear to see.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Dowagiac, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298090"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My sighting was many years ago, not sure if it will mean anything now but, while watching your show on the discovery channel i felt compelled to finally tell my story.\r\n\r\nunfortunately, the one detail i���m not 100% sure about is the date.  it was summer of 1983 or 1984 and i know for sure it was the 15th of the month.  i���m pretty sure it was either july or august.  at that time there was a late night tv show a local channel called \"e.T. monitor\", and according to my dad (from watching the show) there were similar sightings reported in the area that summer���all on the 15th of the month.  there were 4 months involved���june, july, aug & sept and the only month (of the 4) that there was not a report was the month of my sighting.  i���ve always felt like i���ve left a break in the chain.  i���ve tried to research these dates/reports on the internet but, have never found anything.\r\n\r\nwhat happened:\r\n\r\na friend and i were \"cruising the circuit\" in downtown york, pa (that means driving the \"loop\")  we were stopped at a red light 1 block from the square, i���d say about 9-10pm, and i happened to look up.  there was a huge disk-shaped object with probably hundreds of lights covering the entire bottom of the craft.  these lights were all different colors and the closet description i could give was it looked pretty much like the craft in the movie \"close encounters of the third kind\".\r\n\r\nthere was no sound coming from the craft and it was hovering right over the tops of the buildings.  york is not a high-rise city, i would say the craft was about 15 stories from the ground.  i wanted to get out of the car, i was kind-of \"flipping out\"���not in a crazy way���more one of awe and amazement with a twinge of fear.  the light turned green and everyone started to move, like noone else saw it and my friend and i couldn���t understand why people weren���t getting out of their cars to look!\r\n\r\nas we proceeded down the street the craft seemed to just disappear and we thought \"where is a large place this thing could land if it were going to?\"  york college came to mind so we drove there and sure enough it was hovering over the track/football field.  suddenly, as if it knew we found it, it rose up  to about 15 stories again and started moving.  we followed it as far as we could keep track of it, as we were in the city but, lost it within a few blocks.\r\n\r\nwe drove around the \"loop\" another time or two and decided to head home.  we took a different route than we usually did that night.  and as we talking about it, saying it would be cool to see it again, we neared a sharp corner in the road, and my friend said \"my god, there it is!\"  i nearly crashed the car!  it was much farther away this time but, close enough that we could see it was the same craft.  we got to the nearest parking lot, about 1-2 miles away from where we spotted it and pulled in to get a better look.  as soon as we got out of the car it moved extremely fast���to what seemed to be over wrightsville (2 towns away) and went straight up and disappeared!  that was the last time we saw it.\r\n\r\ni got home and told my dad and he stayed up till about 4am and watched the sky but, saw nothing.  i���ve never made a report because my friend didn���t want any part of it���.She was afraid everyone would think we were nuts and made me promise not to report it or get her involved.  we were only 16-17 at the time.  personally, i���ve always felt a little \"nuts\" about it myself but, i know what i saw!  and remember it like it was yesterday.\r\n\r\nis there anything you can tell me about sightings in york, pa in the summer of 1983 or 1984?\r\n\r\n\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":13981,"landingOccurred":false,"latitude":39.9647184,"location":null,"logNumber":"US-11242008-0061","longitude":-76.718785,"occurred":427100400000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Circle,  Disc","source":"MUFON","status":null,"submitted":427100400000,"summary":"City sighting...Seemed to be interactive","tags":["none"],"timeZone":"America/Nome","timeZoneName":"America/Nome","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13981_submitter_file1__UFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"York, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298091"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Myrtle Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the last night of our vacation in myrtle beach. \r\ni was standing outside, alone and facing the east tracking the flight path of an airplane, watching while it moved from north to south. i was following the red blinking light of the plane. i stop following the plane for moment, after a few seconds i tried to locate the plane again. to my right i saw an egg shape object. it was at least an inch thick and and inch long and it was much lower than the plane. it did not move. the light coming off of it was a dull grayish light and it stood still for roughly 2 sconds or so. all of sudden it got very bright. the same type of brightness that a light bulb would give off if you were to turn it on while your eye was inches away from the bulb. it was the brightest light i have ever seen.  the egg moved across the sky in a southerly direction after it lit up and was only visable for a second but it left a trail of light, a thin beam, the egg dissappered but the beam continued and then there was a bright star like burst at the end. \r\nif i put my hands up to measure the lenght that it traveled, from hand to hand i would say the ufo traveled only a foot to a foot and a half before it was completely gone.  \r\nthe egg itself dissagpeared shortly after it lit up and traveled for about an inch. it moved so quickly. i'm sorry i can't give you a better discription.Maybe there is proof on radar.  \r\n ","distance":"Over One Mile","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":13980,"landingOccurred":false,"latitude":33.6967603,"location":null,"logNumber":"US-11242008-0060","longitude":-78.8856943,"occurred":1215153000000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Egg,  Oval","source":"MUFON","status":null,"submitted":1215153000000,"summary":"Oval but more egg like shape, i would say it would have been below the clouds if it was cloudy out.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Myrtle Beach, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298092"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Washburn","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This ufo is seen in barry co. mo on a regular basis. it has records going back to civil war. the first time i saw it, i was seated on my back steps looking south west toward washburn mo. at first i thought it was a planet or other space object. then it started going up and down like a yoyo i figured it was not a moon or stationary space object such as a satalite. i have observed this object on a regular basis for almost 20 years. i have been interested in ufos since the 1970s when one landed in our back yard when i was in high school. when i moved to barry co. mo i did not realize i had moved to the most populated county for ufo sightings in us outside of area 51 when it was active. this is according to readers digest of all things. it has been observed as far north as monett mo 17 miles away. it seems attract to activity and is a observer of some sortl. because it reacts to the surrounding. i will give you an example of this activity. when they built a new wal-mart supercenter in our area, the object seemed very interested in what was going on. i did not see much reaction out of it until they turned the lights on for the first time, it moved from its typical station (as i call it)in the sky to the southeast part of the sky. also when they built a new water tower behind the new building and turned its warning becon on, the object apeared to try to stare it down. i saw it paralell to the new tower and it stayed that way for several hours. the object has been said to based out of an old rock quarry around washburn mo. though i have never seen it come out of there personaly. i have observed it comming out of the prarie around washburn on several occasions. if you mufon people want to see the real thing come to barry co. mo. we have them all the time. also along with the object that i described there are several other ones, one red one, a green one and a larger craft that i call the mama ship. i have observed it on many occassions. it is large enough that the smaller crafts can be seen entering and leaving from it. the only reason i can think of these crafts are attracted to radio active minerals found in the area. they have also evidently built a series of underground caves as well i have observed one such tunnel above my house on the same street, they were putting in new water lines and dug up the tunnel while excavating the ditch. i do know they were require to fix the tunnel where it was still open by putting a culvert in (a large metal tube). if this sounds like something you would be interested in investigating, contact me by phone or email.","distance":"Over One Mile","duration":"12:27:29","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":13979,"landingOccurred":false,"latitude":36.587014,"location":null,"logNumber":"US-11242008-0059","longitude":-93.9660351,"occurred":1227585600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1227585600000,"summary":"When this one is seen in daylight which is occassionly it is a silver sphere, at night it appears as a bright light in sky","tags":["light"],"timeZone":"America/Boise","timeZoneName":"America/Boise","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Washburn, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298093"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hudson Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was baby sitting at my mother's house, she used to run a day care. there were several children in the living room watching tv. for no reason the tv started to turn on then off a few times, i think the channels changed as well. i figured one of the kids had the remote and was just goofing on the rest of us. no one had the remote , i found it on top of the fridge where my mother would keep it so no little hands would get it. i remember my mother had a huge picture window in the living room, for some reason i went to it as well as one of the little boys. that is when i saw a greyish cylinder just hovering over the junk yard across the street from my mom's, it wasn't much higher than the telephone pole. it might have been there  a minute maybe two then all of a sudden it took off and was gone in like a half a second. i can remember not even hearing all of the little kids that were in the living room, it was really weird. i just looked at petey,he was just as shocked as i was.I think we tried to tell my parents we saw a ufo, of course they never believed us. years later when i was about 21 i told my boyfriend who is now my husband. every once in a while i tell the story, some believe me and some do not. i can still see it as if it were yesterday. i didn't hear any sounds coming from it either. unfortunately i do not have photos,just my memory.Whenever there is a show on about ufo's i am always very interested, i always watch just to see if there are any similarities.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":13978,"landingOccurred":false,"latitude":43.3037381,"location":null,"logNumber":"US-11242008-0058","longitude":-73.5804987,"occurred":227088000000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":227088000000,"summary":"I saw the ufo when i was about 14, i am now 45","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hudson Falls, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298094"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Madisonville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I'm sorry that this has never been told to someone like you.  it happened when i was 14 and i am now 50.  however, all people (5) in the car who saw this event are still living today.  my family and i were coming home from bible study in bedias, tx. on a wednesday night in september of 1974.  the only reason that i can remember the date and year is because it was during the beginning of football season and i was a sophomore on the team, therefore i can deduce the approxamate date.  in the car was myself (14 at the time, now 50), my father (now 79, my mother (now 72, and my two younger sisters (11 and 8 at the time).  we saw a light about a mile and a half ahead of us as we aproached the bedias creek bottom heading north on hwy 90 toward madisonville.  (bedias is a small town of about 650 people and madisonville had a population of around 2850 at the time).  there had been talk of ufo sightings in texas and we joked that the light we saw in front of us was a ufo as well, never dreaming about what was about to happen to us.  as we came closer to the light, we realized that it was moving very slowly from our left towards the hwy that we were on.  as we drove down a hill placing us in the bedias creek bottom, the light had come from what was far enough to joke about, to right before our car.  all we could see were 4 lights all of the same color in the shape of a very flat diamond.  the craft landed on hwy 90 right in front of us and spread across the entire hwy, causing my father to come to a complete stop to avoid hitting it.  everyone in the car except my father was either crying or screaming for him to turn around.  my 2 little sisters were in tears.  i tried as hard as i could to get my father to turn around and my mother tried as well.  i'll never know how he knew to do this, but my father pressed down on the gas pedal as hard as he could.  we were driving an oldsmobile 98 that could fly.  it was a heavy car, but we were going 110 before i knew it and the ufo had managed to hop up off of the road and to our right, staying just above the tree line yet exactly even with our automobile.  our home was about 2 miles up the road and the town of madisonville was about 7 miles up the road.  after staying even with us for a little over a mile, we lost it in the trees and could no longer see it as we cruised well over 100 miles per hour heading north.  just before reaching the drive to our house (our house was out in the country) there was an open pasture where the heavy trees that we had been watching to our right came to an end.  thinking that when we came to this opening we might see what had happened to the ufo, well...We were right.  it was landing in our back pasture...Basically our back yard.  now the crying and screaming was at a peak.  we all begged my father to go to madisonville and then come back, but don't go into our drive with this thing sitting just feet from our back door.  again, i don't know why, but my father turned into the drive despite the screaming and begging, pulled into our car port, then with all of us still in the car and the car running, he ran into the house and grabbed his m-1 carbine with a 15 round clip.  before he could even get out of the house, the craft made a right turn due east and went over a hill just as slowly as it travelled when we fist saw it.  as we stepped out of the car we could hear the craft as it \"hummed\" and went out of sight.\r\n\r\nevery word of this is true.  i told everyone that would listen the next day, and as i am no lier and was not then, i know that everyone i told knew that me and my family had seen something that scared the bejesus out of us.  the craft absolutely was picking us out for some reason.  the craft made us come to an absolute stop on a big hwy.  there was no going around it.  we could not see the craft, only the lights that gave us an indication of it's form.  it follwed us almost all of the way home avoiding, what seemed to me at the time, my father's attempt to crash into it, then stayed up with us no matter the speed of our car.  then, as we reached our peak speed of probably 120, it dissappeared then reappeared settling far ahead of us at our home.  it knew where we lived!  it knew my dad was going to hit it in the hwy or it couldn't have moved so quickly to av oid the crash.  it knew my dad was going to shoot at it when he came out of the house or it wouldn't have left before he made his way out of the house.  in 1974, this was nothing like we had been hearing as to the sightings of ufos.\r\n\r\nmy dad and mom would not and still will not speak of this unless they are directly asked about the episode.  they don't like to talk about it and never have.  they will talk about it if directly asked.\r\n\r\ni am now 50 and my dad 79.  i still think it was the bravest thing that i ever saw him do and don't believe many grown men would have reacted in the same manner.  if the 5 of us were put on a polygraph, we would not fail.  this happened.  i've never had anything like it happen since.  my parents still live in the same house on hwy 90, 5 miles south of madisonville. ","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":13977,"landingOccurred":false,"latitude":30.9570111,"location":null,"logNumber":"US-11242008-0057","longitude":-95.9065988,"occurred":147240000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Diamond,  Disc","source":"MUFON","status":null,"submitted":147240000000,"summary":"1st saw as my family and i were coming home from bible study.  ufo landed in hwy stopping us from going forward, then picked up off of hwy, stayed even with us, dissappeared, then reappeared landing in our back yard.","tags":["landing","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Madisonville, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298095"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Moore","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"That night i was outside goofing off when i looked to the south and saw a bright light. i called my mom and told her i was seeing a bright light she told me to get my phone and take a picture so i did. i then went outside again and waited. i watched it and when it flew over it had two bright orange yellow lights on each side of it. two lights on the bottom one was a light blue color the other red the lights phased slowly back and forth. the craft moved slowly at the time it was a triangle arrow head shaped craft. it did not make much noise it made a buzzing noise we live near alot of airports so i know what a plane sounds like a plane makes a loud rumbling noise and this was just a buzz. at first i thought it might be a helicopter but it made a buzzing noise not a loud fluttering noise like a helicopter. so when i took a picture of it it was not a very good picture so i watched it go by it disappeared when it went a little farther away i could not see it after like two minutes because i was surrounded by houses. after i saw the aircraft i was astonished i saw one but i did. i have always kind of beleived they existed now i know they do. i was not scared but interested in it i wanted to come forth with this information as soon as possible to let people know they aren't the only one's out there who see strange things and give them confidence to come forth and tell their stories.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13976,"landingOccurred":false,"latitude":35.3461979,"location":null,"logNumber":"US-11242008-0056","longitude":-97.4821928,"occurred":1227254400000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1227254400000,"summary":"It was a interesting moment not one you get to experience to often.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Moore, Oklahoma","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:298096"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minot","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My parents were stationed at minot afb, nd. our residence faced another complex. behind that complex was a field, then north plains elementary school. to the right of the school was the base chapel. it was about 9pm, my father was upstairs sleeping as he needed to get up early for work in the morning, and my mother was in the living room watching tv. as i stood by the front screen door wanting to go outside to play, i looked across the field. there i saw a silvery, metallic type,round, rotating object. it was silently, slowly circling behind the school, then gliding towards the chapel. there was a row of red, flashing lights circling at the base beneath the circular object. it was hovering for quite some time to the left of the chapel. i was so terrified i screamed so loud i woke up my father. my mother and father both came to the door, pushed me aside, then never spoke about the incident again. \r\nmany years have come and gone and i think about the incident, and have even shared it with a few people.It is now 11/24/08 and as i sit in my home in ga. 45 years later i happened to come across the show \"ufos over earth\". this episode was about ufos over mexico. not paying too much attention to it i happened to glance over to the show when it was showing photos of pictures taken by a mayan indian may 12, 2007. as soon as i saw it sheer panic and fear came over me, even bringing tears to my eyes as i relived the same thing i saw when i was 6 years old. the pictures shown in that story looked exactly as the object i saw when i was a child. i will ever forget the fear and terror of seeing this object. more than that, the silence my parent maintained pretending they never saw it, nor did they ever speak about it again. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":13975,"landingOccurred":false,"latitude":48.42744,"location":null,"logNumber":"US-11242008-0055","longitude":-101.3425298,"occurred":-205347600000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":-205347600000,"summary":"July 1963 sighting over minot air force base","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Minot, North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298097"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Folsom","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 11pm, i looked in the sky and saw what looked like a flashing star. but it was too big to be a star. i looked at it, brought my friends out, and they looked at it. we didn't really know what it was and still don't, but we got binoculars out and looked at it and it was spinning and flashing red, blue and green. since i was at my friends house, i came home immediately to look at it through my telescope(i was about 15-20 minutes away from my house). i couldn't find the correct lenses but from what i could see, it looked exactly as i described. it wasn't moving for about 2 hours then it started to travel slowly across the sky. \r\n\r\ni tried to debunk it by comparing it to other stars. it occurred to me that it could be a plane or helicopter but it stayed in the same spot for too long. planes even flew under it and then i was positive that it wasn't either. i got this gut feeling that it was a u.F.O. although, the pictures i have really don't do any justice, i'd like to mention that the camera was completely still, for it was on a tri-pod. we kept track of it through the telescope for about 4 hours, but we decided to go to bed. it was gone the next day\r\n\r\n ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13974,"landingOccurred":false,"latitude":38.6791291,"location":null,"logNumber":"US-11242008-0054","longitude":-121.1670483,"occurred":1226908800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,  Star-like","source":"MUFON","status":null,"submitted":1226908800000,"summary":"5-9 small circles spinning around emitting blue, red, and green lights.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13974_submitter_file1__November2008002.JPG","http://www.mufoncms.com/files_jeud8334j/13974_submitter_file2__November2008013.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Folsom, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298098"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Paterson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I moved from new york city to new jersey about 18 months ago. in new york city there are many lights that obscure the night sky, unlike here. anyways have always been intersted in anything having to do with science, astronomy, physics, and all that, and i'm well inform about many ufo cases that have been reported, and also many of such  cases as the lazard, and many others that claim about how aliens such as,the greys,alfadraconians, lyrians and the plaidians are here on this world,and that some have bad intent.\r\n\r\nfirst, i have been seing orbs for about 4 months now, i see them moving throght the clouds, sometimes there are about 4 or five at a time just hovering . these objects stay motionless for 20 to 30 minutes at a time i have also seen them fly towards each other against the wind.I have never seen them at night only during the afternoon hours.I have also noticed that when there is airplane trafic coming towards them, they just seem to desapear, and then appear at the same place, they are very shiny and gray in color,but when they see airplanes come by them they thin out.\r\n\r\ni have seen other peoples video about this orbs,but the main reason for me to report this is that a few days ago i saw the most amazing ufo i ever seen. \r\n\r\ni had just finish smoking a ciggarete in the back porch of my house. i was about 4pm, when i happen to look up at the sky, when  i dirctly saw(not periferal) a triangular object moving at low speed from north to south, a  don't know how big it was because there wasn't a single cloud in the sky to determine its size,to the nake eye it was the size of a thumb nail with arms held straight. the object was grey in color, and had round lights, or windows around its perimeter.What amazed me so much is that this object was cloaked, i could see the sides clearly, but the bottom part of the craft would  was invisible,but not completely, there was like somekind of wave around the  craft.The best description i have, is that this thing was cloak.The object moved slowly across the sky, and i lost sight of it when i  came inside the house to tell my wife to come out and see what i'm watching.I hope that my description can help in some ways, i am now planing on getting an infrared camara so that i will be able  to record them .","distance":"Unknown","duration":"00:01:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13973,"landingOccurred":false,"latitude":40.9216154,"location":null,"logNumber":"US-11242008-0053","longitude":-74.162871,"occurred":1227226500000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1227226500000,"summary":"Triangle shaped object with round light or windows around the perimeter.","tags":["triangle","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Paterson, New Jersey","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:298099"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cardwell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The day was perfectly clear, the sun very low in the west, but hadn't quite set yet. i had stepped out to get the newspaper, and when i turned back facing the house (facing south), i noticed the object in the distance in the southeast. it was approaching, and at first i thought it was a jet; but i quickly realized that it was too low. i can't be specific about the altitude, but i'd say a few hundred feet - maybe where smaller aircraft usually fly. as it neared, i observed that it appeared as a long rectangular, or possibly cylindrical object. again, i can't be clear about the object's size. i don't think it was as large as a jetliner, though. it was shiny,  a little more so, i'd say, than  typical aircraft metal would be. at first it appeared to have no additional features, but as it appeared at it's closest point, \r\noverhead (though to my left), i could make out what appeared to be two very small appendages of some type, one on either side of the object, rather more near the front of the object than the center. they were very small, much too small to be considered any type of \"wings.\" the surface was smooth metallic, with no images, windows, etc at all. although the day was very quiet and still, the object made no sound that i could detect. it was going too fast to be a blimp, in my opinion; and i could observe no basket or passenger area underneath as it passed over. it moved in what appeared to be a perfecty straight course to the north, when i lost sight of it. i'd say the whole episode lasted no more than 3 or 4 minutes. one oddity was that i got the distinct impression that the object was almost imperceptibly speeding up and slowing down as it proceeded, rather than remaining perfectly uniform in motion; but i couldn't swear that this was so.\r\ni've seen a few oddities in the sky before, but this is about the only one i really can't explain, except as possibly some kind of experimental craft. i felt at the time that i was experiencing something unique. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13971,"landingOccurred":false,"latitude":36.0470133,"location":null,"logNumber":"US-11242008-0051","longitude":-90.2928776,"occurred":1227054900000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Cylinder,  Square,  Rectagular","source":"MUFON","status":null,"submitted":1227054900000,"summary":"Shiny long rectangular/cylindrical object at fairly low altitude, soundless ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cardwell, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298100"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Gig Harbor","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  my two sons and i witnessed a solid bright white light moving north, north west at high altitude. we are in the gig harbor wa, area. the light was brighter than a normal airplane light. we heard no sounds. the odd thing was that the light started to fade gradually, then dissapear. the light was moving faster than a normal aircraft we have seen in our local area. my son stated that he reaquired the light and that it stopped in a stationary position in the sky. we watched that light for approx. 10 minutes without it moving.","distance":"Unknown","duration":"00:00:31","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":13970,"landingOccurred":false,"latitude":47.330314,"location":null,"logNumber":"US-11242008-0050","longitude":-122.5754093,"occurred":1227580200000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1227580200000,"summary":"Bright singular light","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Gig Harbor, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298101"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Pittsburgh","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just watching tv and went outside for some fresh air at night, then i saw this white round orb in the sky near a tree in front of me. the thing that made me notice it was it moved from right to left and then disapeered behind the tree. then it came out again, the same way and it happen about 3 times, then i went inside and got my camcorder and recorded it, then it happen a couple more times but my batteries were dead so i couldn't get any more video. when seing this i thought it was a light from either a plane or helicopter but there was no noise of any kind from the light. the next day i was going to upload the video on youtube but when i uploaded it on the computer, i couldn't see nothing since the video was so blurry. the video im uploading is a 19  sec video and the orb of light is going in the middle of the screen at the 17 and 18 sec. mark. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":13969,"landingOccurred":false,"latitude":40.4451648,"location":null,"logNumber":"US-11242008-0049","longitude":-79.9919464,"occurred":1222758000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1222758000000,"summary":"Small recurring orb like. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/13969_submitter_file1__MPEG0026.AVI"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pittsburgh, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:298102"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bethlehem","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I just seen the show ufos over earth, about the bucks county pa area,myself, im 41,my daughter 16,and my son 15 yrs old, definetly saw two ufos in the sky,we know they were not planes because the planes fly over our house at least 20 times aday and night to the abe airport.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":13968,"landingOccurred":false,"latitude":40.6319116,"location":null,"logNumber":"US-11242008-0048","longitude":-75.3608579,"occurred":1218783600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1218783600000,"summary":"Three lights.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bethlehem, Pennsylvania","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:298103"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2326}
