{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lewiston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my deck, i looked up and saw the object moving from nw to se . i called my girlfriend to look at it also . i thought it was a satellite but it was bright and it was to low . it made no noise . this is the second time i've seen this . i observe the same thing back in june at about 6:00 pm . i've seen otherthings over the past couple of years also.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":19839,"landingOccurred":false,"latitude":44.104521,"location":null,"logNumber":"US-10062009-0013","longitude":-70.2129164,"occurred":1254277800000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Circle,   Saturn-like","source":"MUFON","status":null,"submitted":1254884253000,"summary":"Looked like a bright low flying satellite.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7,"locationName":"Lewiston, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181840"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We had just had the first front of the season and the night was very clear and free of humidity.  there was a full moon in the east.  my girlfriend and i were walking our dogs in the side yard (double lot) i was looking up and to the west at the stars, as i said it was a super clear night when movement caught my eye...It looked almost like a wisp of a cloud or mist.  i focused on it and realized i was looking a a craft of some sort.  i watched it all the while trying to get my girlfriend to come over and see it.  by the time she had, all she saw was a white hue (she also did not have her contacts in)..Which at that point is what it looked like to me.  it was moving north to south. i got a very good look at the craft, it was a triangle, of that i am sure.   if i had not been looking right at it, it would have been hard to see ...No lights, it was illuminated by my guess from the full moon and the ambient light from below...It was clearly defined and a triangle..Moving fairly slow..Also quiet, not a sound,  the corners seemed to have a bit more illumination.  this was not a glimpse of something far off.  it was just west and almost above.  i watched it for a good 10-12 seconds..I of course looked up this sort of thing online and thought it important to note that our house in approx 200 yards from i-75, because it was traveling parallel to it, seems to be a trend.  also would like to note that even though i'm 41 i just had on eye doctor visit and my vision is still 20 20. an amazing experience and i feel very lucky to have witness such a thing. if it was ours...We have some very advanced technology.  but i truely feel it was something else, as crazy as that sounds...It just had that feel.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":19838,"landingOccurred":false,"latitude":27.6713774,"location":null,"logNumber":"US-10062009-0012","longitude":-81.5140935,"occurred":1254459600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1254882197000,"summary":"Triangle.  slight illumination at all three points","tags":["triangle","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":4,"locationName":"Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181841"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bayside","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was saying goodbye to a friend in my driveway on the outskirts of milwaukee when we both noticed a very bright light approaching from the north/northwest. at first i thought it was a plane as we kept on talking but we soon both realized this was a strange object. the object steadily kept its path and glided 500 feet above us and kept going. the object had a very bright light forward and aft, and had two red lights in the middle-one on each side. the object could have been anywhere from 100-200 feet\r\nlong, it was hard to tell. what struck me the oddest is that the craft had no visible signs of a fuselage, yet all the lights moved together as one. we both were speechless as it glided away and didn't make any sound. it almost seemed like a cloaked silent helicopter. i was very excited and wanted to talk to my friend on what had just happened but he changed the subject right away and after repeatedly asking him about it did he respond to my questions. turns out he did see the same thing i did but had a hard time talking about it. we lost site of the object as it went over the tree line and headed south/southeast towards milwaukee.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19837,"landingOccurred":false,"latitude":43.1805645,"location":null,"logNumber":"US-10062009-0011","longitude":-87.9006421,"occurred":1194063120000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1254880723000,"summary":"Saw a craft that was cloaked with one bright light forward, one aft, and two red lights in the middle. you could not see any visible outline of a craft as it glided above us.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":703,"locationName":"Bayside, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181842"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":null,"country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Saw this is the sky... it was fast, and i was lucky to have my camera in my purse","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19836,"landingOccurred":false,"latitude":27.6662874,"location":null,"logNumber":"US-10062009-0010","longitude":-81.5080635,"occurred":1159599600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Fireball,   Flash,   Sphere","source":"MUFON","status":null,"submitted":1254879771000,"summary":"Saw this is the sky... it was fast, and i was lucky to have my camera in my purse.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1102,"locationName":"Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181843"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Carmel","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside smoking a ciggerate at work and saw a white object flying over very slow. i went inside, came back out, and it was flying over again even slower. then i kept looking for it and it came much closer, then veered to the right and backwards about 20 miles within 2 seconds. it then proceeded to hover in one spot for a half an hour and started to slowly move away and finally disapear. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":19835,"landingOccurred":false,"latitude":40.0028944,"location":null,"logNumber":"US-10062009-0009","longitude":-86.1261102,"occurred":1254726000000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Oval,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1254869576000,"summary":"White ball flew in different directions, then stopped in sky for half hour","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Carmel, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181844"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Port Huron","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went out my back yard to a field that is an old golf course. i had my camera with me as i usually do. i noticed a bright white round ball in the sky. i began shooting pictures and then took some video footage of this object as it went from right to left (west to east). i would estimate this object as being over a mile away. i continued taping until the object could not be seen as it passed behind the trees. there was no noise that i could detect.  it also looked to be shimmering, or reflective. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19834,"landingOccurred":false,"latitude":42.9757134,"location":null,"logNumber":"US-10062009-0008","longitude":-82.4186442,"occurred":1254795000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1254866733000,"summary":"White sphere moving west to east","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/19834_submitter_file1__DSC05982a.jpg","http://www.mufoncms.com/files_jeud8334j/19834_submitter_file2__DSC05979.jpg","http://www.mufoncms.com/files_jeud8334j/19834_submitter_file3__MOV05989.MPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Port Huron, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181845"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Canton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My dad is 82 and this is what he told me just recently. he seemed excited and this was his first ever sighting. on approx. tues, weds or thursday of late sept or early oct of 09 he saw an object. he can give you better details if contacted. he was not going to call or write but i told him that i would. at about 9:30 am he was sitting in living room of condo and saw odd lights thru skylight in roof. it was a fairly sunny morning and he wondered what this could be. it was not a reflection thru skylight. he watched the lights and decided to get out binoculars. looking up he saw a triangular shaped object, tilted at and angle with lights at the corners. they were very bright. the object appeared to be gray in color and it remained in the sky above his home for approx. 1 hour. he told me that it was cloud level, fairly high up but he could definatley see the object pretty well. he watched on and off over the hour and eventually it was gone. said it wasn't a plane, blimp or anything else he'd ever seen. too high for most smaller, known aircraft. no vapor trail or movement, just stayed in one place. he made a drawing of this. he is 82, pretty level headed and a smart man. he seemed kind of excited for seeing this. i looked on internet and asked around but nobody else seems to have seen this that day. thanks-doug (son)","distance":"Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19833,"landingOccurred":false,"latitude":42.3152444,"location":null,"logNumber":"US-10062009-0007","longitude":-83.475476,"occurred":1254414600000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1254863921000,"summary":"Hovering triangle shaped object at cloud level with lights at corners.","tags":["triangle","lights","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Canton, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181846"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On this particular night .I was pretty scared about driving from abilene texas back to stamford texas where i had just moved .But i was still traveling back and forth trying to finish getting my things out of my mothers house.My brother who was trying to help me stay strong with all the things that had already been happening to me said don't be afraid just call me if you need me on the phone okay.You see strange things had already been happening even before this night.I said okay brother i am going to  make myself believe that i will make it to stamford texas with out being afraid that something is going to happen.So i started out towards anson texas that is in direct route to stamford texas you pass through anson to get to stamford.Well it was pretty quite out side a little bit of dark clouds but not many. i was driving along the highway scared to death but reassuring myself i would make it up there safe.As i was thinking this to myself to the right of my right side window i saw this flashing redish orange light appear .I thought it's probabley just an airplane or a weather balloon.I was barely getting close to anson texas  but i could still see it as i drove through anson.As i passed through anson i headed out towards stamford there is just a stretch of highway of total seclusion before you get to stamford well as i drove out of anson i saw something happenning in the sky with that orange bright light i had been seeing.As i was driving to stamford from abilene.It started to move up then down then across then side ways fast......Then it would sit real still in the air .I said to myself oh my god what is that ....It crossed slowely in front of my car but up high but where i could still see it ...Then it came around to my left side of the car. i was still driving i was not stopping for anything or anyone i was that scared... i tried to call my brother but i couldn't get through to him ..My nephew at the time was on the phone talking to his girlfriend so he didn't switch over on the phone line to see who was calling .So i was all alone with ever was about to happen to me....I just kept remembering what my brother would say to me when things were  occuring to me stay cool sister don't panic just let it occur see what it wants.....So i tried to stay calm but my heart was beating fast as it came closer and lower from the sky ...It looked orange and like a very bright star.But as it got closer i could see it was a space ship an unsual shaped space ship.It drifted to my left but low enough so that i could see it and slow enough so that i could observe the  inside of it and it was not human.. it was an intity not from here ...It's energy was breathtaking that is how strong it felt being that close to my car.The energy level was so strong...It felt like if it were going to lift my car and take me off this highway it could easily have done it.But it  didn't. it came close enough for me to feel it's presense and to see the ship that it was traveling in was like no other ...At close range .I felt like it was putting in my heart and mind.....A message {this is who we are tell somebody about this about what you are seeing.}......I could feel pressure in my body i was having trouble breathing but most of all i was afraid i would never be seen again .I started to pray within myself for it not to take me away from my grandaughter because she only had me in her life .I was the only one taking care of her...I started to cry for it not to take me. i was praying so hard i didn't even relize that i was almost close to stamford this incident happened inbetween anson and that small stretch inbetween on the highway that leads you in to stamford tx. it felt like i was out there for hours like time stopped during this time on the highway but as i turned to look again to my left side to see if it was still there it was traveling away from me towards abilene jumping in differnt directions appearing in one section of the sky and then reappearing in a another part of the sky then it dissappeared completly ...I couldn't see it anymore and i thanked god for what ever this was ...Not taking me off the highway and away from my grandbaby.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":19832,"landingOccurred":false,"latitude":31.9768988,"location":null,"logNumber":"US-10062009-0006","longitude":-99.8980331,"occurred":1236736800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cone,   Chevron,   Diamond,   Flash,   Star-like,   Unknown","source":"MUFON","status":null,"submitted":1254863671000,"summary":"Ufo sighting  traveling towards anson texas","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":209,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181847"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Chapmanville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As a thirteen year old kid,i was waiting at the edge of the woods(still to dark to enter the woods) with father and brother to squirrel hunt. it was a clear and cool morning. looking up(had been an amateur astronomer for 3+ yrs)i saw a round object moving north to south in a straight line.  it was quiet, and pulsated with obvious bright to dim light. it moved across the sky in approximately 15 seconds after first viewed. due to a mountainess region, there was obviously limited area to view the object. my father and brother watched with amazement as well.  it moved across the mountain tops out of site but within about 20 seconds a jet aircraft with engine(s)screaming came out of the west and traveled in an arc like trajectory veering to the south. it was obvious that it was chasing the ufo. no other reports were noted regarding the siting. my father just turned 90 yrs of age and still remembers the incident.","distance":"501 Feet - 1 Mile","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":19831,"landingOccurred":false,"latitude":37.9737114,"location":null,"logNumber":"US-10062009-0005","longitude":-82.0173502,"occurred":-133437600000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1254841223000,"summary":"Round in shape, pulsating bright to dim, noiseless.","tags":["none"],"timeZone":"America/Kentucky/Louisville","timeZoneName":"America/Kentucky/Louisville","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":16068,"locationName":"Chapmanville, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181848"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Road E95(?) ","country":"UA","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I believe it happened in 1998 as it was long ago and i can't simply remember the exact year, but it was in the late 90s.\r\nmy parents and me were going from kiew to odessa, on the road which i believe is named e95. it is hard to say what could be the nearest town or village because there was just nothing around there: no houses, no trees, simply nothing.\r\nmy dad was driving a car and mom sat next to me. i remember she talked to him and i turned my head and looked at the window as i always do during any travelling (just like pretty anyone i guess). and then i spotted this. it was approx. 11.00am, summer, awesome weather, blue clean sky (not a single cloud),  so it could be nothing else but ufo. there was nothing else around... i've seen this object which looked like a gray saucer. it didn't look flat, not 2d-like, it looked absolutely 3-d. it wasn't that high in the sky. somewhat at the same hight like you usually see a  helicopter but i would say it looked much bigger than that, so i've clearly seen the shape which was very sharp, btw... no lights, nothing like that. \r\ni shaked my mom's hand and said \"look!\" then she saw it and we understood we have seen the same exact thing (i just wanted someone else to see it as well). my both parents have seen it with me. it was in a sky for about 20 min \"hanging\", just not moving at all. i remember that we sat smiling but reaction was very calm while we were observing it. i didn't turn my head a single time, i couldn't... i wanted to remember every single moment. then after 20 min it moved higher which was so fast... about a second, def. not longer. then it stopped for a few seconds and moved much higher even faster... it was something beyond my vision abilities, i must say, i felt like it wasn't even a second... then it became really tiny (size of a small pearl) and just disapperead. we discussed our emotions about it afterwards. since then there was a tiny amount of people who knew that we have seen it. we had no pictures of it, no tape, so no avidence... who would believe that? i know def. what it was, me and mom still remember this moment. at the time i lived for a long time next to the airport so i know how planes look like, ive seen them very often in a day time and at night. and this object was nothing like i've ever seen before. i didn't know where could i report it and was rather scared to do so, because people might think i'm crazy... i must say i don't say that ufos are all about aliens. who knows what is that. i'm afraid we will never know and it will always stay a secret, but that \"event\" sort of changed my life...","distance":"Unknown","duration":"00:20:03","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":19830,"landingOccurred":false,"latitude":51.100582,"location":null,"logNumber":"UA-10062009-0004","longitude":31.166437,"occurred":880876800000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1254840491000,"summary":"\"saucer\" in the sky above the field, day time (ukraine)","tags":["saucer"],"timeZone":"Europe/Kiev","timeZoneName":"Europe/Kiev","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":4328,"locationName":"Road E95(?) ","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181849"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Denver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on the highway in north denver, turning northwest on hwy 36 (between denver and boulder) from northbound 1-25.  i believe it was either may 13 or 27, 2007.  the sun was behind me and the weather was sunny and mostly clear.  as i made the turn, i immediately noticed about 12-15 objects glinting in the distance ahead.  at first it appeared to be a squadron of jets.  i kept looking and it struck me as odd that the formation was so many planes so close together.  \r\n\r\nas i approached, the formation appeared to be stationary, just ���hanging��� in the sky.  the objects were all pointed in the same direction (south) and i could begin to make out that they were sharply chevron or triangle shaped; they had no fuselage or tail.  after two or three minutes (i was going about 60 mph), i drove under the formation, which was still static in the sky, now directly above.  the formation as i passed under it was in roughly a shotgun or scattershot pattern, about one to two object's distance between each object.  the objects glinted in the sun, and appeared to be mechanical/metallic and not organic.  the individual objects at the closest were probably about 1-3 miles above the ground based on the angle from the horizon that i could first see them through my windshield, how fast i was driving, and how long it took for me to pass under them.  at arm���s length, individually about the size of a thumbnail, the formation about the size of a palm or hand.  \r\n\r\nat the time i saw the formation, i kept trying to put it in a frame of reference of something that i had seen before: a squadron of jets, or a flock of birds, but neither scenario matched what i was seeing.  i briefly looked over at other drivers going in the same direction to see if anyone was seeing what i was seeing, but i didn't see anyone who was looking skyward.\r\n\r\ni intended to take the next exit so that i could stop the car and have a better look, but i was in the left lane and it wouldn't have been safe.  the next exit was several miles ahead, i could not spot the formation in my rear view window, and i was running late, so i kept going (which i regret now).  \r\n\r\nin the time since the sighting (about 2.5 years ago), i have observed many small and large aircraft, and i am convinced that it could not have been a formation of conventional or military aircraft, since the formation was so stationary in the sky, and too many of the objects were surrounded completely by other objects (which i believe would be an unsafe flight formation, especially in a populated area).  \r\n\r\ni also don���t think it was a flock of birds catching the same thermal as there was no movement at all of the object's \"wings\", the \"wings\" had no body, head, or tail, and there was zero movement between objects, no rotation, nothing.  and it was definitely not a reflection off my windshield.  \r\n\r\ni recently saw a tv program that showed a tape of ufos over mexico, it gave me the same impression as to what i saw that day, though the mexico tape had more objects, the formation was less round, and the objects had less detail.  \r\n\r\ni have a mechanical engineering b.S. and worked on space launch vehicles for more than 10 years.  ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary","formattedAddress":null,"id":19829,"landingOccurred":false,"latitude":39.7418236,"location":null,"logNumber":"US-10062009-0003","longitude":-104.9802834,"occurred":1179039600000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Chevron,   Triangle","source":"MUFON","status":null,"submitted":1254823103000,"summary":"Multiple triangle- or chevron-shaped metallic objects in late morning suburban sky.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/19829_submitter_file1__FormationShape20090513Denver.txt"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":877,"locationName":"Denver, Colorado","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181850"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Utica","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I've seen this ufo a handful of times around 2001-2002 and i was a fairly light sleeper due to this first encounter. i was 14 or 15 yrs old when it first happened. in this particular encounter i woke up around 3 am and noticed the radio station i was listening to was tuning in and out so i got out of bed to adjust the tuning. i noticed that there was a light outside my bedroom window and i thought it was probably from the headlights of a car coming down the hill. after i realized the light wasn't going away i looked out the window to notice a large sun colored object above the horizon. it was slightly smaller than the moon and was the same color as the sun. it hovered on the horizon staying in the same place for a half an hour to 45 min. during that time the radio was just static. i had no idea what it could have been, the closest military base was legitimately decomissioned over five years prior, and having previous experiences with ufo's i was partialy biased to assume what it could have been. it did not move the entire time and was not changing color or making any noise. the interference from the radio was the only other marker of its presence. after 45 minutes the glowing object was gone. i did not witness how it left, i was just happy that it was gone. i was terrified by the sighting. there were several times after this that i noted a similar bright light outside my window for and extended period of time in which i suffered from sleep paralysis and was fully concious but unable to move or look out the window. these episodes occured around the same hour of the morning with the same effect on the radio but i was physically unable to move and i could barely open my eyes. i felt extremely drowsy but was still aware of my surroundings.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":19828,"landingOccurred":false,"latitude":43.104603,"location":null,"logNumber":"US-10062009-0002","longitude":-75.231164,"occurred":1000894500000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1254819456000,"summary":"Fireball over the horizon in clinton, ny","tags":["fireball"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2938,"locationName":"Utica, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181851"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Huautla","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"En varias ocaciones en la sierra de huautla e tenido avistamentos de objetos que al parecer son esferas metalicas y en otras veces se ve claramente las naciones unidas metalico plato volador es una espedicion por el lugar al estar lloviendo y salir con el sol el arcoiris se escucho un sumbido y de repente se aparicio de la nada un ovni volando a no mas de 20 mts aproximadamente me par���lise al verlo y de repente tube una sensacion de mareo y un bomito constante me sentia muy mal me dolia la cabeza y sentia mi cuerpo demaciado adolorido mis oidos tenian las naciones unidas estra���o sumbido tirarme al suelo y al volver la mirada al lugar donde estaba el ovni descubr��� que ya no es y estava ocaciones he tenido la sensacion de mirar al cielo como si alguien me avisara descubro y al parecer esferas u objetos que no he podido identificar porque se ven muy altos mi experiencia la he mantenido en secreto por temor a la burla de la sociedad pero jamas olvidare a ese plato metalico que medios de comunicaci���n como unos 18 o 20 mts de largo como tenia tres esferas en su parte de abajo de un color entre gris oscuro o gris verdusco tenia unas como en los ranural costados y emitia de las naciones unidas sumbido tan fino que lastimava mis oidos tambien recuerdo que en el lugar se sentia un ambiente como denso como si faltara la gravedad como si fuera todo muy pesado o no como se explicarlo lo que si se esqu��� me senti tan mal que me senti y morirme aterre un poco y todo esto fue como en minuto y medio aprox.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":19827,"landingOccurred":false,"latitude":18.443638,"location":null,"logNumber":"MX-10062009-0001","longitude":-99.017466,"occurred":1250990520000,"potentialRelations":[],"rating":"Unrated","region":"Morelos","reportedWeather":null,"shape":"Disc,   Sphere","source":"MUFON","status":null,"submitted":1254815242000,"summary":"Aparecen en la sierra de huautla ","tags":["none"],"timeZone":"America/Moncton","timeZoneName":"America/Moncton","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":44,"locationName":"Huautla, Morelos","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181852"},{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (no cloudcover)","city":"Brazil","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home from class at about 9:30 pm on october 5th, 2009.  as i was driving on highway 340, i saw what looked like an airplane in the sky.  about a minute later, i was getting closer to it and it looked to be unusually low flying.  like perhaps only 150-200 feet in the air.  it was triangle shaped, had green and red flashing lights, and one bright white light.  as i looked at it, the white light got brighter and brighter.  i did not hear any type of engine.  then it floated slowly behind the tree line so i couldn't see it.  i then drove about a mile down the road and parked at the local middle school.  i sat there for about 5 or 6 minutes and observed several of these objects on the horizon.  they were farther away than before so they were not as bright.  i observed one of them increase its altitude by a few hundred feet in a short amount of time and then disappeared.  it may have just turned its lights off.  i then continued on my way home on some back roads.  about 5 minutes later, i was driving down a back road when i entered a clearing.  i then observed the same thing i saw back on highway 340.. although i assume it was a different object since there were several in the sky.  it was triangle shaped, green and red flashing lights, and a bright white light.. only a few hundred feet in the air.  i also saw another car parked on the road with two men looking at the same object.  after a few minutes, it floated off and i drove a few more miles home.  at home, i saw a few more objects in the distance but nothing as close as before.","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":19826,"landingOccurred":false,"latitude":39.524772,"location":null,"logNumber":"US-10052009-0017","longitude":-87.1223154,"occurred":1254803400000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Flash,   Triangle","source":"MUFON","status":null,"submitted":1254812093000,"summary":"Saw multiple triangle shaped ufos with green/red/white lights.  some were low flying and very bright.","tags":["triangle","ufo","lights"],"timeZone":"America/Indiana/Indianapolis","timeZoneName":"America/Indiana/Indianapolis","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Brazil, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181853"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my break from my job at a movie theater in what used to be a big empty desert that backed up to where i used to work. i was sitting in my car eating my lunch and i noticed a light in the distance that was brighter than the rest of the stars.  it slowly moved from far off in the distance and got closer to where i was. other people who were leaving after a movie got over were parked next to me and when they saw the object, they stopped with their doors open and watched with me.  as it got even closer, it must have been less than a quarter mile a way and slowly made its way above us and we watched as it went overhead. it was a large black triangle that moved too slow to be a aircraft.  it made a slight humming sound as it got overhead.  it continued above and turned slightly to the north. i remember the next day i was channel surfing and while flipping through the channels, i saw a story coming on the local news with a picture of what i saw.  i was flipping channels so fast that i missed the story. i tried to go back and find the channel but it was too late, i had missed the news story.  this has always made me angry that was unable to catch the news story, as i know i am not the only one who saw this.  as the object traveled overhead, i got in my car and followed it around a little.  other people did the same, we drove around real slow just starring at it and each other.  i am not a crazy person and i believe that most of the sighting are actually explainable.  this however, i don't believe can be explained away. as years went on, i saw news reports and shows on television that show what i saw. ","distance":"501 Feet - 1 Mile","duration":"00:06:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":19825,"landingOccurred":false,"latitude":34.0580681,"location":null,"logNumber":"US-10052009-0016","longitude":-111.0910611,"occurred":645773580000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1254809950000,"summary":"This was a black triangle which made a slight humming sound.","tags":["sound","triangle","light"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7049,"locationName":"Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181854"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking on del monte beach, when i noticed what i thought was a tent, or some other canvas object that was lit from inside with a bright red light. the light ascended rapidly, to a high altitude, then hovered for several minutes, at times it would zig-zap in sharp angles from point to point. it was witnessed by five of us. then, the object moved rapidly high and out of sight. the light was gone. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":19824,"landingOccurred":false,"latitude":36.781921,"location":null,"logNumber":"US-10052009-0015","longitude":-119.4167624,"occurred":1254708900000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cylinder,   Fireball,   Oval,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1254809575000,"summary":"A bright red light was low, and acted as if it was launched. then rocketed upward, and hovered, occasionally zig-zagging. it was very bright red. there were multiple witnesses. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181855"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Norwich","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 7:45 pm it was rather dark out, in baltic ct.  [eastern central connecticut] near the city of norwich.  my friend and i are both pilots and aviation maintenance technicians.  just before we quit working on my rv.,  we watched this object for about 2 minutes.  it continued on its path and disapeared behind the hills. \r\nit is possible the object was the iss, moving from west to east.  if not,  altitude appeared to be low in around 1500 to 2000 ft.  no sound, no contrail.  object traversed slower than aircraft and seemed very large as in a large jet at low altitude.  color was bright yellow white.  there were no nav lights or pulsating collsion strobes. one early conclusion of mine and my first thought was,  if this was the iss., it now appears incredibly larger than it did 3 years ago.  i admit it should appear larger but it seemed much larger than i expected.  additionaly,  i have some rather more interesting sightings, from over the last 42 years,  however this is first official report since that time.  i hope ill have that opportunity to share my other sightings in the near future.  ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":19823,"landingOccurred":false,"latitude":41.5302649,"location":null,"logNumber":"US-10052009-0014","longitude":-72.0727105,"occurred":1254365100000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Cross","source":"MUFON","status":null,"submitted":1254808687000,"summary":"Similar to a tic tac toe design flew west to east ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/19823_submitter_file1__BALTICUFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Norwich, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181856"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Stamford","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My name is sylvia .Villarreal i hope that you can handle what i am about to reveal some will say it didn't happen ...I have asked myself did it happen .And then i listen to the recordings my brother made as the events happened ...That's when i know it was real.I have pictures.I have recordingsi have an alignment that was passed on to me by the intity that i don't know how to read it would take a math scientist or a professional to explain it to me......I have a mini video that i captured on my cell phone where this intity revealed pictures that i shouldn't have .They gave me a message that i need to pass on to somebody that knows what to do about all the information they have passed on to me.At times in some of the events the intity almost paralazed me sometimes i couldn't move sometimes i couldn't breath correctley as it sent it's message through my body.My brother was and has been a witness to almost all my incounters rather it be by phone or him standing in the same room with me as these things happen.If it were not for my brother being by my side telling me to hold on and not to be afraid and to stay strong i do not think that i would be standing here today .He kept me strong enough to let them relay all the pictures and events that have occured to me.There was one time when i was living in stamford texas .I had just moved up there from abilene,tx.I was  still not completley moved in so i had a moving truck parked out in front of the property in stamford tx.The wind started to get very violent and i was in the house i thought there was a bad storm coming .So i went to our bedroom window to look outside to see what was happening outside....What i saw overwhelmed me.I saw like a dome shape grey black cloud.You know i felt like i was under something it was huge and it covered all of stamford or it looked like that to me.It settled wright over the house i was in.Then all of a sudden all these things started coming out from under it it looked like 10 or more different lights just swarming in different directions some came out together and some came out alone behind the rest they were different shapes and sizes there were many of them...My brother was allready on the phone with me at this time i had somehow managed to call him even though i was having chest pains i could hardly move...By the time i knew it i was in so much pain i had to sit down....My brother kept trying to calm me down asking me to relax and to take it all in so that whatever was out there could show me ...What they wanted to show me..I said brother i can do this ..As i said that all of a sudden one of the small ships started to come down towards me side ways it looked like it wasn't coming straight down in a straight form it was coming down in an angle but towards me .I said brother it's getting close to me ...He said stay cool just relax it's not going to do anything just keep describing what you are seeing so i can have it on this recording.All of a sudden the ship stopped. i could see it well it was staring at me the intity was staring at me i was scared to death the pain in my chest was at a max by this time .It just stood still in the sky staring at me..I was so scared ...Then all of a sudden it went straight up ...Back towards the others passing up above......And the dome started to lift and the trees were standing straight up that's how forcefull the wind and the energy was ....The trees were straight up... the wind was everything was violent like a tornado...Was about to occur.My brother said sylvia sylvia go outside see if you can see where they are going....I said okay i felt the release on my body when the ship that was looking at me went back up i knew that what ever was in that ship wanted me to feel this pain and to see who was doing this to me......I ran outside .,and i stood on the bumper of the moving truck out front i looked up as the darkness was lifting ...And then i saw this huge ship space shipe something i had never seen ever in my life it had to be two football fields long and one football field wide..And under it had four ships connected to it in different sections underneath it.....It had a c shape at the end of it it looked like to letter c's facing each other......Then more ships strated coming out across the sky i mean alot of them ....All of a sudden it split and formed like 15 big balls of lights and it went in different directions and the whole dark black dome that was covering everything in the sky lifted and disappeared.All the ships that i saw that day were crossing together they were almiost transparent...But i got to see them i got to witness them crossing ...Can some one help me understand all the messages they have given me ....Some one needs to see what i have.......The pictures i have the recordings my brother took as it happened to me.The aliegnment that was given to me that i do not know how to read......  ","distance":"21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other,  Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":19822,"landingOccurred":false,"latitude":32.9453874,"location":null,"logNumber":"US-10052009-0012","longitude":-99.8028709,"occurred":1234231200000,"potentialRelations":[19821],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,   Cone,   Chevron,   Circle,   Diamond,   Disc,   Egg,   Flash,   Oval,   Saturn-like,   Sphere,   Square,   Rectagular,   Star-like,   Other","source":"MUFON","status":null,"submitted":1254801975000,"summary":"Several events ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":238,"locationName":"Stamford, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181857"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My name is sylvia .Villarreal i hope that you can handle what i am about to reveal some will say it didn't happen ...I have asked myself did it happen .And then i listen to the recordings my brother made as the events happened ...That's when i know it was real.I have pictures.I have recordingsi have an alignment that was passed on to me by the intity that i don't know how to read it would take a math scientist or a professional to explain it to me......I have a mini video that i captured on my cell phone where this intity revealed pictures that i shouldn't have .They gave me a message that i need to pass on to somebody that knows what to do about all the information they have passed on to me.At times in some of the events the intity almost paralazed me sometimes i couldn't move sometimes i couldn't breath correctley as it sent it's message through my body.My brother was and has been a witness to almost all my incounters rather it be by phone or him standing in the same room with me as these things happen.If it were not for my brother being by my side telling me to hold on and not to be afraid and to stay strong i do not think that i would be standing here today .He kept me strong enough to let them relay all the pictures and events that have occured to me.There was one time when i was living in stamford texas .I had just moved up there from abilene,tx.I was  still not completley moved in so i had a moving truck parked out in front of the property in stamford tx.The wind started to get very violent and i was in the house i thought there was a bad storm coming .So i went to our bedroom window to look outside to see what was happening outside....What i saw overwhelmed me.I saw like a dome shape grey black cloud.You know i felt like i was under something it was huge and it covered all of stamford or it looked like that to me.It settled wright over the house i was in.Then all of a sudden all these things started coming out from under it it looked like 10 or more different lights just swarming in different directions some came out together and some came out alone behind the rest they were different shapes and sizes there were many of them...My brother was allready on the phone with me at this time i had somehow managed to call him even though i was having chest pains i could hardley move...By the time i knew it i was in so much pain i had to sit down....My brother kept trying to calm me down asking me to relax and to take it all in so that whatever was out there could show me ...What they wanted to show me..I said brother i can do this ..As i said that all of a sudden one of the small ships started to come down towards me side ways it looked like it wasn't coming straight down in a straight form it was coming down in an angle but towards me .I said brother it's getting close to me ...He said stay cool just relax it's noot going to do anything just keep describing what you are seeing so i can have it on this recording....Then the ship stopped i could see it well it was stareing at me the intity was staring at me i was scared to death the pain in my chest was at a max by this time it just stood still in the sky staring at me..I was so scared ...Then all of a sudden it went straight up ...Back towards the others passing up above......And the dome started to lift and the trees were standing straight up that's how forcefull the wind and the energy was ....The trees were straight up... the wind was everything was violent like a tornado...Was about to occur.My brother said sylvia sylvia go outside see if you can see where they are going....I said okay i felt the release on my body when the ship that was looking at me went back up i knew that what ever was in that ship wanted me to feel this pain and to see who was doing this to me......I ran outside and i stood on the bumper of the moving truck out front i looked up as the darkness was lifting ...And then i saw this huge ship space shipe something i had never seen ever in my life it had to be two football fields long and one football field wide..And under it had four shipds connected to it in different sections underneath it.....It had a c shape at the end of it it looked like to letter c's facing each other......Then more ships strated coming out across the sky i mean alot of them ....All of a sudden it split and formed like 15 big balls of lights and it went in different directions and the whole dark black dome that covering everything in the sky lifted and disappeared.All the ships that i saw that day were crossing together tyhey were almiost transparent...But i got to see them i got to witness them crossing ...Can some help me understand all the messages they have given me ....Some one needs to see what i have.......The pictures i have the recordings my brother took as it happened to me aliegnment that was given to me that i do not know how to read......  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19821,"landingOccurred":false,"latitude":31.9697988,"location":null,"logNumber":"US-10052009-0012","longitude":-99.8938831,"occurred":1234166400000,"potentialRelations":[19822],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,   Cone,   Chevron,   Circle,   Diamond,   Disc,   Egg,   Flash,   Oval,   Saturn-like,   Sphere,   Square,   Rectagular,   Star-like,   Other","source":"MUFON","status":null,"submitted":1254801973000,"summary":"Several events ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":238,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181858"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lone Pine","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The evening of september 26 at 19:17. four friends and i were at a cabin in the whitney portal area 10 miles west of lone pine ca. we witnessed a bright blueish light traveling south east, or parell to the eastern sierra mt. range.  i saw it first and mention to my friends \"i see satalite\" as it was traveling as fast as many of satalites that we have seen from the same location. we all looked and commeneted on how bright it was and said that it was because the sun had set an hour before and was really getting a good refelection off of it.  we all agreed that it wasn't an airpane because we could not see any id lights. jets that normaly cross the sky in that area are very identifible by the flashing lights on the wings and then the sound as they pass over going east or west.  some one said that the object looked to be lower than a commerical jet but made no noise. i made a comment that it might be the space station. at that moment it made a course change to the east. the change was slight enough that we had to asked each other it it had changed direction.  we watched it for about 1 minute until it went out of our sight behind 12,000' ridge.  \r\n\r\nthe speed didn't change at all.  by the time i got the camera the object was gone.  to me the object was 2x brighter than venus and had the same glow as venus. no shimmer as with a star.  the light did not fade as it turned to the east.       ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":19820,"landingOccurred":false,"latitude":36.6150944,"location":null,"logNumber":"US-10052009-0011","longitude":-118.0532454,"occurred":1254017820000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1254800002000,"summary":"Very bright satrun-like object traveling se  over whitney portals then turned to the east.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":9,"locationName":"Lone Pine, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181859"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in new dorp plaza on staten island when i noticed three clouds in a triangle formation heading in a south west direction which would bring them almost over my head. these three clouds were blood red on the bottom, and what appeared black smoke on the top. they were about 400 feet in alittude.\r\nther sky was mostly blue with a wisp of white and gold clouds, which made these \"clouds\" stand out. i could see they were leaving small puffs of black behind them.\r\nfortunately, i had my camera with me as they approached. i took three photos one right after the other. two as they approached me, and one after they passed me. unfortunately, i gave someone the last of the pictures years ago, and then lost the negatives. i would like to send you copies of these pictures. as i took them, i made sure i had some ground references showing\r\nwhen they were almost overhead, i could feel tingling on my arms as my hair stood up. not from fear, but from static. i was too happy to be scared that i got the pictures.\r\nthe bottom of the three clouds was a frightening blood red, and it churned from the outside, into itself in the middle. the speed at which it churned was violent(very fast) but the tops of these clouds had very little movement. there had to be something in those clouds to slow down the upper part of the clouds. try to imagine a big gas explosion where the vapor cloud as it climbs folds in on itself. these clouds were not climbing, they were straight and level. when they passed over hylan blvd, they made a slight change in direction, turning a little more to the south, following along side of hylan blvd. i believe the speed limit on hylan blvd was 45 miles and hour and as it followed hylan blvd, i could see it was traveling slightly faster then the cars on the blvd or 50 to 55 miles an hour.\r\ni told friends and family, but i got the usual disbelief. years later, when i saw the movie independence day, i almost fell out of my seat, knowing i had seen a ufo that appeared to be a cloud. the ones i saw werer about 150 feet wide, and cigar shaped.\r\ni am sending you copies of the two photos i have. look at the \"clouds\" and notice how they changed slightly in various places, and this was within seconds of each photo being taken. also, look at the puffs of black behind and in the distance.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change","formattedAddress":null,"id":19819,"landingOccurred":false,"latitude":40.5805517,"location":null,"logNumber":"US-10052009-0010","longitude":-74.1440907,"occurred":586393200000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cigar,   Fireball","source":"MUFON","status":null,"submitted":1254798740000,"summary":"Three unusual clouds traveling at about 45 miles an hour.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/19819_submitter_file1__UFOphotos.rtf"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7736,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181860"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rosebud","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside smoking a cigarette on my back deck at night when i saw something bright coming above the trees. it looked like a moving star about the size of jupiter that started rising aboving the trees going faster than an airplane that was a solid white light. it had no blinking lights that indicated it was an airplane or helicopter. i know there was an airforce base east of where i was, but it couldnt have been a jet or stealth bomber. it left my eye sight as it moved past our house going in the opposite direction of the moon.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19818,"landingOccurred":false,"latitude":38.3915703,"location":null,"logNumber":"US-10052009-0009","longitude":-91.3975896,"occurred":1254639600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1254796943000,"summary":"Watching a star like object shoot fast above the trees past the moon.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Rosebud, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181861"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Yarnell,pa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the day after the remnants of hurricane ivan came through central pa,possibly 2 days after.I was sitting in my sisters hottub alone,looking up at the stars towards the east.There was no moon and the skies were mostly clear.The disc stopped over a nearby ridge apprx 1/2mile or less from my location.It was dull red with no other lights.I knew instantly what i was seeing,because i watch and read everything i can about ufos.I felt the dull red was the heat of the craft from going through the atmosphere very fast.The size is hard for me to determine since i couldnt be sure of the altitude,but i estimate at least 1/4 mile in diameter.The craft was larger then the largest full moon,when its on the horizon.It stopped on top of the ridge for 15 or 20 seconds,then accelerated from a dead stop due west faster that i could turn my head to follow. i lost sight of it when it went over the house.There was no sound. as a christian i clearly remember feeling that i was meant to see it and at that instant i doubted all my beliefs in god,etc.That feeling only lasted a second,then that feeling went away.Personally i believe they are half human and half fallen angel hybrids and they have been here for possibly millions of years.(ephesians-6-12)(revelation-16-13)through the bible evil spirits seem to want to inhabit living creatures.We have the account of jesus casting out demons from a man and the demons asked if they could go into a herd of swine.They did and the pigs ran headlong off of a cliff into the sea and drowned.I know most people desperately want to believe the beings are from outer space and they have good intentions for man.Maybe,but we cant count out any possibilities.The next time you are abducted,mention the name of jesus and see how they react.(my date in the info is probably wrong,but could be checked, by checking weather records for hurricane ivan)","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":19817,"landingOccurred":false,"latitude":40.9978372,"location":null,"logNumber":"US-10052009-0008","longitude":-77.8108369,"occurred":1160969400000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1254792565000,"summary":"Huge disc glowing dull red,no flashing lights","tags":["disc","lights","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1085,"locationName":"Yarnell,pa, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181862"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Shawnee","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just before 3 a.M. i looked out the window to check for skunks that had been bothering our house. i looked up into the sky just above the roof line of neighboring house (but in the distance maybe a mile to the north/northest) and saw a jellybean shaped object that was flat on the bottom.  it was glowing pure white, but no haze around it like from car lights or street lights.  it sat there a few seconds and then zipped straight east as if being pulled along the edge of a ruler.  never saw anything move like that. it had no lights except that internal glowing of the whole object.  i moved quickly to the next window to the east in my  house (5 feet away), but by then it had disappeared.  it was not a car, as i observed for quite some time on several occasions to compare what i saw to car lights.  definitely different.\r\nwhen i first saw it, i thought it was a ufo.  i told my husband about it.  later that year or next year, we were watching a ufo show and one wasa featured that looked exactly like what i saw.  it was not an airplane, no blinking lights.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":19816,"landingOccurred":false,"latitude":35.3272928,"location":null,"logNumber":"US-10052009-0007","longitude":-96.9253004,"occurred":1159004700000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1254774868000,"summary":"Bright white internally glowing flat bottomed oval zipped across sky just above roof line","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1108,"locationName":"Shawnee, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181863"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Jose","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At the time i was at work, and was getting ready to take lunch. as i was walking to my car i looked up as i always do, and saw something in the sky,at first i thought it was just a balloon. but i decided to take a second look, and it no longer looked like a balloon, it was spinning, and flashing a light, moving very slow across the sky. i saw a co-worker and called out to him, and asked him want is that? he said that he was not sure what it was, but it sure looks strange. after watching for a while, i was walking back to my car, and another one of those things showed up, and by the time i reached my car there was a third one. they all faded away from my view.\r\n\r\nlater on during the day i called my husband and informed him of the incident, he then told me that he was in the area, and saw 4 apache helicopters circling the exact area where i saw the 3 objects. i don't have any pictures to prove my story, but my husband has pictures of the helicopters. i was wondering if any one else might of seen these 3 objects?\r\n\r\n\r\nthank you  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":19815,"landingOccurred":false,"latitude":37.3479957,"location":null,"logNumber":"US-10052009-0006","longitude":-121.8875255,"occurred":1253995560000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Flash,   Unknown","source":"MUFON","status":null,"submitted":1254771882000,"summary":"It had flashing lights, and kind of a dull grey color, and spinning.","tags":["lights","flash"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":8,"locationName":"San Jose, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181864"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving east on rt. 150, outside st.Joseph. seen craft hovering o ver field.  brightest lights i've ever seen and could not stop looking. i tought at first it was a plane. i got scared and left.","distance":"101-500 Feet","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":19814,"landingOccurred":false,"latitude":40.6407249,"location":null,"logNumber":"US-10052009-0005","longitude":-89.3904683,"occurred":1196488800000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1254759763000,"summary":"Small craft, bright lights, hovering over cornfield","tags":["hovering","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":674,"locationName":"Illinois","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181865"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Pesotum","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the same night it was spotted in the st louis, mo area and southern illinois.  i was outside in front of my house having a smoke and i felt it above me.  i looked up and it was a huge black triangle that moved very slow.  there were no lights and a very low (right above the tree tops) and a almost vibration sound. i knew it was a ufo.  it was heading south. i was scared and i ran in the house.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":19813,"landingOccurred":false,"latitude":39.9147532,"location":null,"logNumber":"US-10052009-0004","longitude":-88.2733827,"occurred":946710000000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1254758411000,"summary":"Huge, low, slow, low humm, no lights.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3565,"locationName":"Pesotum, Illinois","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:181866"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out with a female friend of mine at a park in north long island called caumsett.  we were there  to view the persiads meteor shower.  it was probably just after 12am when a bright large light caught my eye.  i was laying on my back and i viewed it just for a moment; as soon as i saw it i yelled look at that! before i could get my friends attention it vanished.  it was the manner in which it had vanished that has me writing about it now.  it was transmitting light smaller than the size of the moon but much larger than a star.  in addition i could see the light glare that made the object look probably bigger than it was.  it genuinely felt as if i had scared it away.  that it was my bringing attention to it that provoked its disapearence.  lastly but most importantly....... it seems that it was somehow vacuumed out from the inside out.  this will take explaining.  it didn't vanish by a sudden burst of speed, at least not seemingly, imagine looking up through a glass ceiling with a circular napkin placed on it and directly over your head, than drawn through a circular napkin holder which is centered on top of it.  to the viewer below you would see the napkin being pulled up and out through the center, than imagine it being done in less than an instant.  i believe that evening i was under observation.  just recently i was back there with my fiance  and i meet three individuals who were at the same location as my initial siting and they had explained to me that a good friend of their's had seen a similar thing at the same park twice before.\r\n\r\ndaniel jackman ma,.","distance":"Unknown","duration":"00:00:01","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change","formattedAddress":null,"id":19812,"landingOccurred":false,"latitude":40.7218728,"location":null,"logNumber":"US-10052009-0003","longitude":-74.0003331,"occurred":1155625200000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1254730738000,"summary":"Circular bright light suspended what seemed to be about ten thousand feet in the air","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1147,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181867"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rollin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Full moon, mostly clear sky.\r\n\r\ni went out on the balcony of the cottage overlooking round lake to smoke a cigarette.  as soon as i stepped outside i noticed a bright tall box shaped object moving accross my view from the left.  i saw it very clear.  it had three sets of multi color blinking lights.   it suddenly mad a sharp right turn and the lights went out and i could not see it.  i went inside to tell my wife what i had saw then grabbed my cellphone to use its camera in case i saw it again.  i went back onto the balcony and almost instantly noticed another very bright object moving in the night sky towards where i was at.  this object was a bright white disc shaped object that had a round center.  i was able to get a picture of this object before it turned and then went straight up and at a high rate of speed.  i have attached the picture i took.  please let me know if anybody else has reported seeing these objects. i have seen many airplanes in the air and can tell you that these were not planes or helicopters. thank you","distance":"101-500 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change","formattedAddress":null,"id":19811,"landingOccurred":false,"latitude":41.969722,"location":null,"logNumber":"US-10052009-0002","longitude":-84.308333,"occurred":1254722580000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc,   Square,   Rectagular","source":"MUFON","status":null,"submitted":1254726489000,"summary":"Two distinct objects, one rectagular & one disc","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/19811_submitter_file1__RoundLake11PM10-4-09.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Rollin, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181868"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Broadstairs","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My father was in the us airforce stationed at mansfield.\r\nmy parents would go out in the evening leaving me with a sitter.\r\ni would be asleep when they returned. \r\n\r\none such night, i awoke to my ceiling light being on in my room.\r\ni got up to turn off the switch and noticed all the lights upstairs\r\nwere on. i walked out of my room to the upstairs landing and turned\r\nto see a figure in front of me. i was afraid but the figure mentaly\r\ntold me not to be afraid, everything was alright, and to turn off the\r\nlights and go back to bed. i turned to my parents room to turn of the light and my parents were sprawled across the bed like they had been thrown there. they drank alot so who knows. i turned off the light and noticed the downstairs lights on and the front door wide open. i didn't see the figure anymore. i went downstairs, turned off the lights, closed the door and went back to bed. \r\n\r\nin the morning i tried to describe what happened, my mother thought\r\ni saw a mouse. i was frustrated at her not understanding me. a few\r\ndays later we found out that a close relative, also in the af had been\r\nkilled in a car accident in alaska. from then on i always assumed that i had seen a ghost. the figure looked like a ghost but had bright blue eyes. i was 5 years old at the time.\r\n \r\nin the past few years i have wondered if this was an alien encounter.\r\nwhen my dad was alive i asked him about ufos. he never saw any but did\r\nsay he had made a delivery to area 51. he was at that time stationed at\r\nnellis afb near las vegas. he was a chief master sargent. he and another\r\nguy delivered an aircraft engine. they were surrounded by armed guards and\r\nnot allowed to dismount. the engine was unloaded and they left.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"","formattedAddress":null,"id":19810,"landingOccurred":false,"latitude":51.360163,"location":null,"logNumber":"GB-10052009-0001","longitude":1.432038,"occurred":-455562000000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1254726136000,"summary":"Encounter","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":19795,"locationName":"Broadstairs, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:181869"}],"last":false,"totalElements":82759,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2149}
