{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover), Unknown","city":"Denver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was working at home on my computer. i live in a 4 story bldg that faces north near...Just a few blocks nw of wash park. i saw something flash out my sliding porch doors that caught my eye. i got up to see what it was. outside on my deck i could see in the distance a grey/black really small ball...Floating...I kept blinking because it seemed to disappear every few seconds... when it moved it would reflect light and the light was a flash and then i could see the shape of it...Then it would disappear again. it was kind of circular and seemed to pulse. i saw a plane in the distance. it was much smaller than the plane. a helicopter was in the distance as well and this was smaller than the helicopter.(i would guess it would be the size of a le car or one of those new hybrid electric 2 person cars) the object dropped lower and then started to float (like a balloon or a bird) like it was gliding in the wind. i could see almost like a field around it...Like air...Pulsing out...\r\n\r\nthen it moved up higher and higher - traveling south above and past my building until it was out of my vision. (i had been watching it for about 10 mins). \r\n\r\ni put on my shoes and ran outside to see where it went. i couldnt find it. i walked around w/ my dog for about 10 more mins before coming back into my building. when i reached the top of my stairs (the lobby has windows that face west) i saw the flash again! this time it was west - almost to lakewood i would guess. i only could see it for about 10 more seconds and then it disappeared and i went back to work.\r\n\r\nfeelings & reactions....Wow! is this really what i am seeing? i felt like what ever it was...It was having a fun trip and was enjoying the scenery. reminded me of the movement of surfing...But in the air. it looked like it was having fun...Like a balloon.","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":5856,"landingOccurred":false,"latitude":39.7436736,"location":null,"logNumber":"US-12022006-0001","longitude":-104.9810234,"occurred":1165011000000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Circle,  Diamond,  Disc,  Egg,  Flash,  Oval,  Sphere,  Star-like","source":"MUFON","status":null,"submitted":1165011000000,"summary":"Flash disc globe over n. wash park 12.1.06 - 2:10pm","tags":["floating","pulsing"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Denver, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489216"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salem","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Sat outside early last evening to breath and look around. moon was out 2/3 full. some stars were out. saw what i thought was jupiter but i was looking due south and object was 35 degrees up from horizon. then i realized jupiter should be in the east. but hey, i'm no expert. continued to look at object. saw a airliner off to the left of the object and to the left of my sight of the moon, that had not yet reached cruising altitude. moon was about 30 degrees off horizon to the left of the \"star\". then suddenly the \"star\" got very bright and continued to get extremely bright and got about 1/4 size of moon or a little more, and i,m thinking, ok, what the hell is this. no landing lights no other lights, absolute silence. my mind is going over everything i know and nothing fits. then the super large star shrinks down to nothing and disappears. i sat there, then ran into the house and told my son. he said start writing it down. i did. later that evening (last night) when i put on my face cream, my skin burned and i noticed it looked a little red, but i didn't think anything about that at the time. i was using i drops as my eyes burned. i didn't think anything about it until i woke up this morning and light hurt my eyes so bad that i had to keep them shut. it was foggy this morning, and the oncoming headlights driving my son to school were painful. i wore sunglasses most of today. it is getting better. i feel strange and a little out of it. i told my husband, and he asked if i was missing any time, i'm sure i haven't but i don't feel like myself. i have felt sad and angry today. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":5855,"landingOccurred":false,"latitude":44.9469375,"location":null,"logNumber":"US-12012006-0001","longitude":-123.0267963,"occurred":1164938100000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1164938100000,"summary":"Bright planet expanded to quarter size of moon then shrunk to nothing","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salem, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489217"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. where were you and what were you doing at the time?\r\n\r\ni was outside my front door in my apartment complex smoking a cigarette looking up at the sky - looking at orion.\r\n\r\n2. what made you first notice the object?\r\n\r\ntwo things made me notice these objects; first they came right into my field of vision, the second, there was a very strong buzzing (electrical?) sound coming from the objects.  it sounded like bees.\r\n\r\n3. what did you think the object was when you first noticed it?\r\n\r\ni was stunned by what i was seeing - first a bird, then the lights, sounds and shape ruled that out, then i thought i was seeing a stealth bomber or like craft but because there were 2 of them and they were flying so fast and so close together, i couldn't see how pilots could fly that fast and that close.\r\n\r\n4. describe the object and its actions and motions.\r\n\r\nthere were 2 of what appeared to be identical triangle shaped objects with triangular wedges removed from the rear so they looked like 2 big black boomerangs. each apparent craft had 2 smaller white lights on either side of the \"underneath\" towards the rear and a larger light blue light in the center of the \"underside\".\r\n\r\ntheir movements were very fast but the acceleration was unique, almost like they were pulling on a rope in successive bursts of speed.  one of the objects appeared to be \"playing\" with the other - getting closer & buzzing by the other, going faster.\r\n\r\nthey basically moved straight across the sky for approximately 30 secs...\r\n\r\n5. describe your feelings, reactions and actions, during and after sighting the object.\r\n\r\nawe, my reaction was and is awe - i have never in my life seen anything like that - it was not a bird, it could have been some government test plane or unmanned drone or something but it was not your usual craft and the unique sound signatures they carried really solidified this feeling.\r\n\r\n6. how did you lose sight of the object?\r\n\r\nit went over the roof of our apartment.  when i ran inside and upstairs to look out our balcony in the direction they were going but they were gone.\r\n\r\ni made the attached sketch immediately after i witnessed these objects because they had such a profound affect on me.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":5854,"landingOccurred":false,"latitude":34.1599316,"location":null,"logNumber":"US-11302006-0003","longitude":-118.4421766,"occurred":1164888000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Boomerang,  Triangle","source":"MUFON","status":null,"submitted":1164888000000,"summary":"I saw 2 large black triangular / boomerang shaped objects with 2 white lights and 1 larger center light blue light literally buzz over our apartment at roughly 4am pst in los angeles, ca","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/5854_submitter_file1__SketchOfSighting.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Angeles, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:489218"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Adelaide","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went out to my back yard at midnight to put out my rubbish bins for the morning collection. i noticed an reddish amber ball of light above trees in the distance that seemed to be stationary.I went in to my house to obtain binoculars to have a better look at it.When i looked at it through binoculars i could see a small white light to the left and right of the object that seemed to pulse slowly.I was watching it for about ten seconds when i saw a shaft of white light beam down to the ground from it on two occasions a few seconds apart. the light beams were a faint soft white light even in width from top to bottom. this struck me as very odd because i have seen helicopters flying often at edinburgh military air base near my home on many occasions and there searchlights are very bright and the light beam projected fans out from the source. the object seemed either stationary or moving very very very slowly for about half a minute. the object increased in size slowly coming in my direction.As it drew closer i could see a black triangular object with a small slowly pusing white light at each point and the reddish amber light was in the middle of the objects underbelly.As it became more visible i also noticed a very soft glow behind its rear edge that appeared to illuminate the sky behind it but the illumination was unusual to the only thing i can compare it with is when i have seen a laser projected and the illumination is paper thin in the air.When it drew closer i did not need the binoculars as the object when it was close to passing my house was huge.I am familiar with orion submarine tracking aircraft taking off from the military base regularly day and night and this object was far bigger than those.As it passed overhead it blocked my view of the big dipper star group and other bright stars completely.I raised my binoculars again as it was passing overhead and noted the large reddish amber light seemed to shimmer like like the heat haze you see in a desert mirage.I suddenly realised then it was making no noise whatsoever and i could not get over how it seemed to glide so very slowly.It was travelling at a much slower speed than i normally see light planes fly at.\r\n\r\nalthough huge it seemed very flat there were no exhaust trails and i felt more and more dumbfounded by what i was seeing particulary because of its sheer size.As it passed travelling to the south east dogs started barking all over the neighbourhood until it was diminishing in size in the distance.When it was diminishing in size i noticed through the binoculars there appeared to be a lot of small sparkles of light appear its rear edge for a few seconds and then i lost sight of it behind a large tree.\r\n\r\ni talked with my wife about it after not being able to sleep all night.I felt sure many people would have seen it and checked the tv news in the morning as well as buying the newspaper.Nothing was mentioned but i feel many people must have seen it as i did. i am a fifty five year old retired \r\nguy and i have never seen anything unusual in my life until that night.People who see such things are automatically the subject of ridicule etc but the reality of what i saw was mesmerising and left me feeling totally astonished.My father was in the air force most of his life and i have lived beside air force bases in many countries where he was stationed over the years. i am very familiar with all types of commercial and military aircraft and i know what i saw was not of this earch unless the military have a craft that is gigantic in size fitted with engines that make no sound and can fly at about 50 mph without stalling.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":5853,"landingOccurred":false,"latitude":-34.9211064,"location":null,"logNumber":"AU-11302006-0002","longitude":138.6039453,"occurred":1164791100000,"potentialRelations":[],"rating":"Unrated","region":"South Australia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1164791100000,"summary":"Huge black triangular craft three small white lights + large reddish amber light.","tags":["lights"],"timeZone":"Australia/Adelaide","timeZoneName":"Australia/Adelaide","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/5853_submitter_file1__UFODRAWING.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Adelaide, South Australia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:489219"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Loudon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"November 28, 2006 \r\ni went to my mobile home park to fixed a stopped up sewer pipe on one of my trailer.\r\nwhen i got there i got my sewer snake and went under the trailer to see if i could fixed the stopped up pipe. after i came out from under the trailer, i was walking to my truck to put my sewer snake in the back of my truck. i was walking i notice a strange object moving slow it was moving less then 5 miles per hour it was about 15 feet off of the ground it was about 3 feet long, on each end it was blue and in the middle it was lit up with a bunch of small lights and it was glowing. i was about thirty feet away from the object. i could not hardly believe what i was seeing. then the object flew about fifty feet. then it started to fall apart. i watch the object fall apart and vanish. and it never hit the ground. this happened around 8pm on tuesday.\r\n     written by  eddie moore","distance":"Unknown","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5852,"landingOccurred":false,"latitude":35.7374541,"location":null,"logNumber":"US-11302006-0001","longitude":-84.3240312,"occurred":1164773040000,"potentialRelations":[21036],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1164773040000,"summary":"I saw a strang like that look about 3 feet lond it was blue on each end of it and in the middle it was lit up with a bunch of small lights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Loudon, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489220"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fernandina Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting outside on my porch when three ships appeared in the sky and remained stationary for some time.About a minute later,three beings appeared in my yard and spoke to me for an hour or so.They said i was psychic.Always had been and would keep in touch.They also agreed to submit to a picture next time.I have pictures,audio and video from past events in my life already.I emailed the c.I.A. immediately,wondering if there will be a response.I would like your opinion.Thank you","distance":"Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":5851,"landingOccurred":false,"latitude":30.6780918,"location":null,"logNumber":"US-11292006-0008","longitude":-81.4582219,"occurred":1164519900000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1164519900000,"summary":"Three beings and athree ships","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fernandina Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489221"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Boone","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A friend and i were driving us421 north from wilkes to watauga county when we both at the same time noticed an extremely bright green light coming from the back and over a mountain top.  it illuminated the entire top of the mountain.  it was rising very slowly and then began to come in the direction that we were in but shot immediately to the right and up into and above a cloud. the cloud glowed green when it was within the cloud and the light did not seem to go away but simply vanished as quickly as we had seen it.  i am a registered nurse and have seen medivac helicopters flying at night and this without a doubt was not a helicopter.  we were both speechless!","distance":"Over One Mile","duration":"00:00:20","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":5850,"landingOccurred":false,"latitude":36.216795,"location":null,"logNumber":"US-11292006-0007","longitude":-81.6745517,"occurred":1164768000000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1164768000000,"summary":"Green luminescent","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Boone, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489222"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cookeville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my way to the cafeteria with a group of friends when i looked up and saw a ball of light shoot across the sky. it was so brilliant that it showed through the clouds. it seemed to be like a shooting star because of it's speed and how quickly it vanished but was much more brilliant. it was heading approximately northeast and seemed to be above the tennessee technological university's campus. i was the only one among a group of four that spotted it, but later i found someone on facebook who had also seen the ufo, in fact he claims to have seen two headed in the same path, traveling the same distance apart from each other.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5849,"landingOccurred":false,"latitude":36.166179,"location":null,"logNumber":"US-11292006-0006","longitude":-85.4944023,"occurred":1164763680000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1164763680000,"summary":"Two balls of light shooting across the sky. very brilliant. showed through the clouds.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cookeville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489223"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Trenton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was taking my dog outside before going to bed at 10:30pm on the night of august 6th, 2006.  that night, the moon was full in the northeast sky, with no clouds.  it was a very quiet and still night.  as i walked to one section of my yard, i observed a bright circle in the north sky (about the size of a quarter held at arms length).  it made no sound at all. \r\n\r\ni originally thought it was a planet, but then realized that no way would a planet look so large or so close.  after watching this circle for approxiamately 4 to 5 minutes, it suddenly pulsated twice, and made an arching movement in the sky.  as it made this quick arching movement, the circle got smaller and smaller until it disappeared (which only took about 5 seconds).\r\n\r\nas far as my feelings during this event, i guess it would be best described as \"exciting and exhillerating\".  i went inside to tell my wife what had just happened, and she just laughed it off.\r\n\r\nthere were no other witnesses.  i am a quality manager by profession, and i also umpire college and high school baseball games.  so with that being said, i am a stickler for details, with excellent vision, and consider myself very level-headed with good judgement.  \r\n\r\nthis sighting has been on my mind almost continually since that night in august.  please let me know if you have any idea on what i seen that evening.\r\n\r\nthanks,\r\nrich scranton  ","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":5848,"landingOccurred":false,"latitude":40.2259534,"location":null,"logNumber":"US-11292006-0005","longitude":-74.7347084,"occurred":1154928600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1154928600000,"summary":"Pulsating circle in yardville, nj 8-6-06","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Trenton, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489224"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Pasadena","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This happened the evening of november 19, 2006.\r\n\r\ni am an amateur astronomer.  i was in the back yard at my house in pasadena, making visual estimates of variable stars through my telescope.  i am accustomed to seeing satellites cross my field of view & don���������t think anything of it.  at about 6:15 pm (+/- 1 min), however, as saw a fuzzy object cross at about the same speed as a satellite.  i tracked it for about 30 to 40 degrees & it kept a straight trajectory as far as i could tell.  after that, i had to move myself in order to slew the telescope & i lost it.  i did not have time to defocus & make a magnitude estimate, but i would say it was comparable to a bright globular cluster or telescopic comet, but moving.  at the time, i estimated the diameter to be about 5 minutes of arc.  it took a few seconds to cross my approximately 1 degree field of view.  the direction of motion was west to east.  it was circular & had no blinking aircraft lights on it.  the color was white.  i did not notice any sound, but there are always noises in pasadena.  none of my dogs were disturbed.\r\n\r\nmy telescope is a 10-inch f4.5 newtonian on a dobsonian mount.\r\n\r\nat the time i thought it might be city lights reflected off something in the atmosphere, perhaps a bird, balloon, or something (a craft?).  i think its circular nature makes it unlikely to have been a bird.  unfortunately, i did not have the presence of mind to notice which way the wind was blowing.\r\n\r\nthen, at about 8:10 pm, i saw another one!  this one was not really circular, but had two projections.  i would describe it as a very fat ���������v������? but with pointed projections.  it was also moving west to east, at about the same speed as the first one.  the direction of motion was not aligned with any features of the v.  it was slightly smaller than the first one.  i also followed this one in a more or less straight trajectory for 30 to 40 degrees.\r\n\r\ni would say i had them in the field long enough to get a good look.  i asked one fellow amateur astronomer if he���������s ever seen anything like that & he said no.  i asked him what he thought it could be, he said ���������aliens������? (tongue in cheek, i think).","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Other","flightPath":"Straight-line path","formattedAddress":null,"id":5847,"landingOccurred":false,"latitude":34.1501849,"location":null,"logNumber":"US-11292006-0004","longitude":-118.1425155,"occurred":1163988900000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Chevron,  Disc","source":"MUFON","status":null,"submitted":1163988900000,"summary":"Moving fuzzy object in telescope field","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pasadena, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489225"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in my car that was facing north in the crowded best buy parking lot near the pv mall waiting for my wife and a friend at about noon or a few minutes after. the sky was crystal clear and no visible clouds. as i waited, i noticed a cylindrical object that was high in the northern sky. i thought that it was a balloon, but noticed that it seemed motionless. i would guess that it was well above 5,000 feet in altitude. the object was whitish/ silver and seemed to be the size of an airliner, but it was difficult to judge, since it was so high up and there was no other reference points in the clear blue sky. this object stayed in the same location for about 3 minutes. i was distracted briefly by a phone call and when i returned to the sky, i noticed that the object had disappeared. i searched the sky and there was nothing. i then noticed two high flying jets and their contrails, their flightpath took them directly through the same area where the object was hovering previously.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5846,"landingOccurred":false,"latitude":33.4508371,"location":null,"logNumber":"US-11292006-0003","longitude":-112.0709973,"occurred":1164571200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1164571200000,"summary":"A white/ silver cylindrical object that seemed to hover high above the paradise valley/ north phoenix  area.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489226"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Simpsonville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was coming back from louisville, ky heading towards lexington, ky on i64 and very close to the simonsville, ky exit. when at 5am i saw a streak of green floresant colour come down from space in approx 2 to 3 seconds with no explosion...It was about 200 feet loog.\r\nit was a clear night and there were no clouds.\r\nit startled me.\r\nthere was no one else near me on the highway at the time...But at the gas station at the exit someone might have seen what i saw also..\r\n\r\n\r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":5844,"landingOccurred":false,"latitude":38.22257,"location":null,"logNumber":"US-11292006-0001","longitude":-85.3552349,"occurred":1163941200000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1163941200000,"summary":"Saw floresant green light streak down from space in 2 or 3 seconds..No explosion","tags":["none"],"timeZone":"America/Kentucky/Monticello","timeZoneName":"America/Kentucky/Monticello","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Simpsonville, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489227"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Indianapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking out to my car after work today around 5pm and looked up to see 2 black triangular shaped objects flying over downtown indianapolis at a height of approximately 10k to 12k ft (just above the clouds).  then about 20 seconds later i noticed a 3rd triangular craft fly out from the clouds and follow behind the first 2.  my first rational thought was that they were some type of ultralight aircraft, but they were flying over the city which i believe is against faa regulation for ultralights or gliders.  all three objects were flying in a single file line, and appeared to be seperated by about 1000ft.  i also thought perhaps they were f117's or b2's, but there was no sound coming from them that i could tell.  i also don't think that military would fly in a single file formation like that.  i tried to take pictures with my cell phone, but the resolution is to low to make out anything.  it was definately one of the strangest things i've ever seen!   ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5843,"landingOccurred":false,"latitude":39.7736555,"location":null,"logNumber":"US-11282006-0013","longitude":-86.1520136,"occurred":1164762960000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1164762960000,"summary":"3 triangular objects flew over downtown indianapolis","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Indianapolis, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:489228"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Atlatongo","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Afuera de mi taller mecanico en direccion al noroeste habia  mas de tres testigos de los cuales empezo a gritar uno por lo sorprendente que se veia","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5842,"landingOccurred":false,"latitude":19.6681652,"location":null,"logNumber":"MX-11282006-0012","longitude":-98.9011826,"occurred":1164700800000,"potentialRelations":[],"rating":"Unrated","region":"Mexico","reportedWeather":null,"shape":"Fireball,  Sphere","source":"MUFON","status":null,"submitted":1164700800000,"summary":"3 luces girando muy rapido y se unian","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/5842_submitter_file1__ovni1.JPG","http://www.mufoncms.com/files_jeud8334j/5842_submitter_file2__ovni2.JPG","http://www.mufoncms.com/files_jeud8334j/5842_submitter_file3__ovni3.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Atlatongo, Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489229"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Woodinville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approx. 15 minutes after noon i was in my home when i noticed a bright light in mid sky to the wsw of my home.  the light was very bright like it was reflecting sun light.   it got brighter and dimmer with high clouds passing in front of it.  i thought perhaps it might be a planet as it was stationary and did not twinkle.  i got my 10x50 binoculars and looked at the object and could see a definate dark shape behind the lights that i could not see with my naked eye.  after approx. 10 minutes the object disappeared.  i never saw it move, it just was not visible any more.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":5841,"landingOccurred":false,"latitude":47.7617951,"location":null,"logNumber":"US-11282006-0011","longitude":-122.1600682,"occurred":1164745020000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1164745020000,"summary":"Bright orange lights in front of dark diamond shaped object","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Woodinville, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489230"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Merced","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi -\r\ni don't know who else to report this to, but i saw a bizarre object at about 7:45 pm pst this evening (nov. 9) in atwater ca.  i was in my back yard looking up at the cloud of the milky way when a blur caught my eye, moving in a se direction.  at first i thought it may be a meteor streak, but was stunned to see it was a silhouette of a rectangular object, dimly lit at the outer part with individual lights, roughly the shape of a triangle moving sideways.  it seemed to be several hundred feet off the ground, gliding rapidly and without sound.  after being somewhat mesmerized by it i ran to get my wife so she could see it.  by the time i did that and ran back to the yard, it was out of site.  it would seem to me it would have been seen by others, as other aircraft were in the air at the time.  i don't what i saw, whether it is experimental craft or what, but it seems strange to me that experimental craft would be zipping down the central valley without strobes with other planes in the air.  regardless of what the explanation is, what i saw was really quite stunning.\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":5840,"landingOccurred":false,"latitude":37.3065132,"location":null,"logNumber":"US-11282006-0010","longitude":-120.4813977,"occurred":1163130300000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Square,  Rectagular,  Triangle","source":"MUFON","status":null,"submitted":1163130300000,"summary":"Appeared out of nowhere","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Merced, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:489231"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sparks","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Well it was a cold night, up ontop if john ascuagua's nugget to see the metor shower with my supervisor. i saw two stars wink out and minutes later saw an object a way above us floating to the west, just before the horizen it appered like christmas lights on the eve on a house. then shot up about a thousand or so feet looking like a pumkin seed gold in color did a flip and shot into no wear from southwest position to north east at blink of the eye. no sonic boom and no noise at all. i dont know what the heck that thing was, but it moved! my boss asked me what in the hell that thing was?  i think the year was 2002. scott ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5839,"landingOccurred":false,"latitude":39.5359112,"location":null,"logNumber":"US-11282006-0009","longitude":-119.7427586,"occurred":1038211200000,"potentialRelations":[],"rating":"Unrated","region":"Nevada","reportedWeather":null,"shape":"Boomerang,  Chevron,  Flash","source":"MUFON","status":null,"submitted":1038211200000,"summary":"Sunflower shape, gold in color","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sparks, Nevada","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489232"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Oradell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving north on forest avenue from paramus, nj to oradell, nj (just before the midland avenue light) at about 9:15pm on november 27, 2006 i couldn't help noticing a very peculiar object rather motionless in the sky ahead, over forest avenue, with 2 sets of blinking lights.  there was (1) a set of 3 outer perimiter lights and (2) another set of perhaps a cluster of lights, on what appeared to be an underbelly, definitely encircled by the 3 lights forming the triangle.  each set blinked together on its own rhythm.  the triangle's lights were colored a very light-bright bluish-white.  i am not certain of the lights on the underbelly.  the individual lights were not large in any way - rather pinpoints instead. the triangle was tilted upwards from the horizontal toward the south, and so it was facing my direction at a slightly upraised angle.  it seemed as though it was positioned over forest avenue well to the north of the midland avenue intersection.  i opened my window to listen but heard no noise\r\n\r\ni could not study the object as i was driving and so decided to pull off the road immediately to get a better look (as soon as i determined that it was very unusual, ~20 seconds into the \"event\" for me).  i took no more that 3-5 seconds to pull into the first available driveway and, with a clear view of the entire sky as i got out of the car to get a better look, i saw that it had completely vanished from the sky.  i stopped my observation for only 3-5 seconds and it simply vanished.  how could it be motionless, not to mention silent, and then vanish from sight in under 5 seconds???  mind you this object had been motionless in the sky, roughly 500 feet ahead and between 100-200 feet in the air.  there was overhaging thin clouds but you could easily see lights through them.  soon after i noticed other \"regular\" planes in the sky, probably coming and going from teterboro airport, and they were all passing by quite noisily and rapidly, as things must when they fly close and low - like this object was.  the difference is that i never saw it move.  i opened my window as i still observed it before pulling into the driveway and never heard it making any noise, as any conventional aircraft must in order to stay motionless and in the air.  it simply vanished from the entire sky in 3-5 seconds.  vanished.\r\n\r\nthere may be a very common explanation for this sighting, however i am submitting it in the hope that somehow there may be further corroboration from another witness in the area.  the truth of the et presence must become public knowledge and we can only further that end by submitting testimonials such as this one whenever we feel it may be warranted.\r\n\r\nthank you for this opportunity.","distance":"501 Feet - 1 Mile","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":5838,"landingOccurred":false,"latitude":40.9587093,"location":null,"logNumber":"US-11282006-0008","longitude":-74.0368064,"occurred":1164690900000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1164690900000,"summary":"Motionless/silent triangular & central group of lights blinking 500 feet ahead 100-200 feet in air dissappeared in under 5 seconds","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oradell, New Jersey","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:489233"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Started viewing it in the north west. presumed it was a star because it was a bright night with a bright moon. noticed object at 2:45 am and viewed it for another 20 to 30 minutes until it flew directly overhead without any sound and then dissapeared. there was also a light in the north east that joined the other to the south east. \r\n\r\ni believe that i read a report that was filed by another person that witnessed the same thing. have never seen anything since. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5837,"landingOccurred":false,"latitude":41.2076116,"location":null,"logNumber":"US-11282006-0007","longitude":-77.1885147,"occurred":174639600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":174639600000,"summary":"Various levels. shaped like a pyramid","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489234"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hazlet","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"     i work the night shift at a national retail store.  at exactly 3:30am i went outside the front of the store for our 15 minute break.  another coworker followed about a minute later.  two of us who had gone out a few minutes earlier had noticed a couple of dogs wandering around the edge of the parking lot about 250 feet away.  we lost sight of one dog and were watching the other until it disappeared out of sight to our right.  we continued looking for the other dog.\r\n     i remembered one night about a couple of months ago 2 deer had appeared along the same route, but coming from the right and moving to the left until they disappeared around a building bordering our parking lot and to the left so i turned my attention there.  as soon as i did so i saw a bright, flashing, multi-colored set of lights at about 30 degrees up from the horizon and pointed it out to my coworkers.  my first thought was \"holy smoke, a ufo!\" and one of my coworkers made a couple of jokes about it.  we were all transfixed and i could't believe i was seeing this since i've never seen anything like this before (i'm 47).\r\n     the lights all appeared to be of the same size and intensity.  it appeared that there were 2 lights on the top tier, 4 on the middle tier, and 3 on the bottom tier giving it an almost round shape but more like an oval shape being slightly wider in the middle.  the lights were flashing brilliantly and quickly and seemed to be stationary in the air.  there were reds, greens, blues, and pinks, all very beautiful to see.  over the next few minutes they would dim for a second or two then return to its former brightness several times.  they appeared to fixed to an object and never moved away from or closer to one another.\r\n     after a couple of minutes we noticed the object slowly moving towards our right.  then it seemed to turn as the lights slowly faded and pretty much disappeared but we could still see them.  at this point i could make out a dim, smaller white light trailing the others at a fixed distance about 1 1/2 times the width of the original lights.  as it moved i could tell that it had passed through some clouds.  then it turned again and seemed to be heading away from us until only the white light was visible.  soon that also disappeared either from distance or clouds.  so ended the event.  we never did see the other dog.\r\n     i had never seen a sight in the sky like it before.  it made no sounds, but we were also very close to a highway.  it was very \"christmassy\" as one of my coworkers mentioned.  but as soon as it turned my thoughts changed completely.  given the time of year (just after thanksgiving and starting the christmas season) and considering our proximity to newark, jfk, laguardia, and numerous smaller airports i am pretty sure that this was a helicopter or blimp outfitted with a light show.  perhaps it someone with the christmas spirit and alot of money or some sort of promotional stunt, or even a trial run for such.  i don't know, but the little light on the back and the lights on the front and the fact we could tell it was turning were the giveaways.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":5836,"landingOccurred":false,"latitude":40.4194235,"location":null,"logNumber":"US-11282006-0006","longitude":-74.1856769,"occurred":1164627300000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1164627300000,"summary":"Group of flashing, multi-colored lights in 3 tiers, dimming then brightening.  probably a helicopter but for the lights.","tags":["lights","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hazlet, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489235"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Indianapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have sent many reports like the last one and i looked in my pictures developed and it turns out that there is a picture.","distance":"Unknown","duration":"00:14:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5835,"landingOccurred":false,"latitude":39.9163333,"location":null,"logNumber":"US-11282006-0005","longitude":-86.0427071,"occurred":1163314800000,"potentialRelations":[5834],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Egg","source":"MUFON","status":null,"submitted":1163314800000,"summary":"Shiny and big","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/5835_submitter_file1__46moonufo.jpe"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Indianapolis, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489236"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Indianapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I heard a loud boom and woke up to see a egg with legs fly rigght across my lawn. i went outside and the ufo hover for about 3 minutes. i took a picture but nothing was on the film. then it flew around in circles i looked at my clock inside and it was 10 minutes and it was still out there for about a minute then flew off very fast","distance":"Unknown","duration":"00:14:04","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5834,"landingOccurred":false,"latitude":39.9069833,"location":null,"logNumber":"US-11282006-0004","longitude":-86.0522071,"occurred":1163315040000,"potentialRelations":[5835],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Blimp,  Egg,  Other","source":"MUFON","status":null,"submitted":1163315040000,"summary":"Shiny and big","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Indianapolis, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489237"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  i have been skywatching on my lunch breaks at my office parking lot for some time and i have been seeing these flying \" objects \" over the past several months. they usually appear with company a few minutes from each other. due to very clear skies and the irregular shape of the objects it is very difficult to estimate the actual size and altitude of these objects. \r\n\r\n the first one appeared today at almost exactly 2pm in the afternoon about 1 mile due northeast of the northeast corner of the east end of the north runway for skyharbor intl airport in phoenix. my office is located right on the tempe / phoenix border off the main intersection of priest and washington. object # 1 was black and irregularly shaped, about peasize when you hold you hand out at arms length. flight could be described as a very slow drift with a tumbling action. at times the object would be definite saucer shape and flat, with a white reflective top. not a blinding reflection as the aircraft nearby would show when the sun hits them, but reflective and white nonetheless. the bottom jet black. no sound, and a slow steady drift towards the north. i stopped a security guard where i work to view the object but he had no idea what it was. we both speculated .Perhaps ..A balloon. the object appeared ( only a guess ) to be several hundred to a thousand feet up.\r\n\r\n within 2-3 minutes as the black object faded from view, another similiary shaped and sized white object appeared at almost the exact spot the black object appeared. our security guard had just left before the 2nd object appeard.  it tumbled as well, but was moving much faster and to a more northeast direction. again this was about pea size from an arms length view. no sound. the wind at ground level was blowing the opposite direction as the object. the object did pass through a small low cloud, but since both were white i couldn't tell if it was behind or in front of the cloud. i think it was under the cloud though, again 500-1000 feet. \r\n\r\n neither object in my mind could have been a balloon, but neither did they appear to be any defined craft. \r\n\r\n  i have seen these objects 8-10 times over the last several months. they are almost predictable. they are almost always followed by one , two , or even three more like objects, but not traveling together. i only go out to view for one hour..Perhaps there are more at other hours, i can only speculate. \r\n\r\n  if any other readers are in the e phoenix/ w tempe/ or s scottsdale area and have seen these items..Please make a comment. i will attempt to procure some decent binoculars and if my sightings continue to be regular, i will attempt to photograph or videotape. \r\n\r\n  due to the proximity of the airport takeoff and departure paths, i am surprised these are not more of a local air traffic issue. if they are in fact smaller balloons of some sort ( a possibility but i just can't believe these are balloons ) then perhaps no air hazard is warranted.   \r\n\r\n  i will post again here upon future sightings, this is my second posting, but there have been a least 6 other days of similiar sightings on my part.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5832,"landingOccurred":false,"latitude":33.480782,"location":null,"logNumber":"US-11282006-0002","longitude":-111.988798,"occurred":1164614400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle,  Other,  Unknown","source":"MUFON","status":null,"submitted":1164614400000,"summary":"Two objects, one black and one white within 5 minutes of each other over skyharbor intl airport","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489238"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Greenville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was not alone; a freind saw this too; this object was above the clouds ;(( it was cloudy; tht am)) but it made a \"design light that  rotated in a geometric shape)) over and over  ;it made no sound  ; even now; i can draw a picture of the design it made; four curved lines rotating in a perfect circle; we watched it for at least  an hour; for some reason i was reminded of the design described in the book of ezekiel; chapt; 1, also i dream abut this; please reply to ---georgencrymesjr@yahoo.Com---","distance":"501 Feet - 1 Mile","duration":"01:20:07","entityEncountered":false,"favorited":0,"features":"Insignia","flightPath":"Path then hovering","formattedAddress":null,"id":5831,"landingOccurred":false,"latitude":34.8526176,"location":null,"logNumber":"US-11282006-0001","longitude":-82.3940104,"occurred":1161084000000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1161084000000,"summary":"Object rotated very fast;;   made geometric design in clouds","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Greenville, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489239"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My girlfriend and i were approaching a traffic light.  i was looking east and noticed a cigar-like object hovering.  it seemed large and distant. it was a very clear day.  i asked my girlfriend what it was and she had not reply.  the traffic light turned yellow, then red and we came to a stop.  the object remained stationary then moved from right to left(south to north) suddenly.  not incredibly fast but fairly quickly.  the light turned green and there was traffic behind me so i had to move.  i noticed a clearing in the trees down about one third of a mile so i hurried down to that spot and pulled over.   i then had a clear view of the sky in the area that the object appeared but could see nothing of it.  i turned around and went back to the previous spot where we had viewed the object but could see nothing. it appeared to have vanished.  \r\n\r\n  the object was cigar shaped and seemed to be several miles away.  i would guess it's length to have been six or seven hundred feet in length, with a height of eighty feet and several miles away.  again, it was a very clear day.   the object seemed to have four or five bands of darker colors running vertically.  my girlfriend did not notice the variations in the shading.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":5830,"landingOccurred":false,"latitude":32.1611151,"location":null,"logNumber":"US-11272006-0007","longitude":-82.905103,"occurred":1164676200000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Cigar,  Cylinder","source":"MUFON","status":null,"submitted":1164676200000,"summary":"Cigarlike object hovers then moves left to right and disappears","tags":["none"],"timeZone":"America/Nipigon","timeZoneName":"America/Nipigon","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489240"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tlaltenango de Sánchez Román Municipality","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Trabajo en un taller mecanico y me he dado cuenta que desde hace 2 a���os tengo avistamientos frecuentemente y el de hoy fue igual de repente se aparece y se queda estatico y hasta lo he filmado me gustaria mandarles el material ,la forma del ovni es como una esfera que con el sol brilla mucho y luego parece soltar algo,en el buscador escriban tepexpan y encontraran mas detalles de mis observaciones,la direccion que tomo es del sur al norte mis reaaciones han sido de sorpresa y casi siempre preciento que estan ahi ,tambien los veo de noche quisiera mandarles el material me podrian decir como y selos mando por correo gracias ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5829,"landingOccurred":false,"latitude":21.782139,"location":null,"logNumber":"MX-11272006-0006","longitude":-103.2708022,"occurred":1164614400000,"potentialRelations":[],"rating":"Unrated","region":"Zacatecas","reportedWeather":null,"shape":"Diamond,  Sphere","source":"MUFON","status":null,"submitted":1164614400000,"summary":"Es como una esfera plateada  y brillante","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tlaltenango de Sánchez Román Municipality, Zacatecas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489241"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On  my way to work on the date above, i was waiting for the train at the\r\nstation. it was a clear day but there were some clouds when i noticed a disc object\"metalic silver\" in color coming from the east and going in an\r\nnorthwest direction. i took what you would call a double take at the object\r\nbecause it did not make any sound and to my surprise was not moving very fast, it was just cruising at an altitude of lets say below the clouds but\r\nhigher than most city buildings. since i had just missed my train no one was on the platform at the time to my knowledge. also the object did not have any \"flashing lights\" neither left any trails of smoke at all. seeing\r\nthis object was exciting as opposed to having any fear whatsoever. when the train arrived at the station i kept looking at the object until the doors began to shut, i jumped in the train and as the train left, i watched\r\nthe object continue its movements towards the northwest riverdale section of the bronx. again i was excited to see this. when i got to work i told my\r\nco worker but like always no one believes you. i would also like to mention\r\nthat i served in the military in the navy and i was stationed on an aircraft carrier and on base and i \"know\" what aircraft look like in the day and night!!!  what i saw was no aircraft that looked civilian or military. thank you for allowing me to write this info on your website.\r\n\"raymond gonzalez\"","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":5828,"landingOccurred":false,"latitude":40.7834345,"location":null,"logNumber":"US-11272006-0005","longitude":-73.9662495,"occurred":803286000000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":803286000000,"summary":"Was on my way to work taking the train when object appeared from  east to northwest direction it was below the clouds but higher than a 30 story building.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489242"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Tallahassee","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On november 23, 2006, approximately 9:30 p.M. or so, while driving back to walnut hill, florida from uriah, alabama, i saw an object that looks like a half-circle--like the upper half of a wedding ring.  the top is bright white, and red and green appears to blink on either side of the top.  i called my brother in law and sister from a cell phone.  they went outside and saw them, too.  when i arrived home at walnut hill, florida around 10:30 p.M., i called my other sister and she and four of her kids, and i and my two kids, went out to look again.  my sister's daugther videotaped (they have the tape).  there were at least seven or eight of these objects in the sky, and they were all over the night sky.  the brightest one was to the right of where the big dipper is in the evening.  there was another one to the left of the big dipper, and at least three over the big dipper.  if you were to turn around, you saw one in the night sky to your right, and one to the left.  i have seen at least three of these every night and morning since i left walnut hill, florida 11/25--in tallahassee, florida.  one is to the left of the big dipper, one is to the right, and the other--if you turn around--is to the right in the night sky.  they seem to be higher in the sky since 11/23--almost as if they moved higher to be out of commercial airspace.  they are stationary.  for instance, in the morning the big dipper has moved from the east to the west, but the objects are in the same place at 5:00 a.M. as they were at 7:30 p.M.  \r\n\r\ni have never lost sight of at least three of the objects as soon as it is dark enough to see them.  my reaction is \"what are these?\"  i called my cousin on 11/24, who was in foley, alabama.  he is an engineer, and worked on the stealth airplane.  he went outside, saw them, and told us there were too many of them to be a communication satellite, which is what my younger sister wanted to think they were.  i feel terribly curious, and am surprised i have seen nothing in the news although i have certainly looked.  my younger sister is very religious, and believes these can be explained.  she has possession of the videotape, but i will ask her for a copy if you want to see it.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary","formattedAddress":null,"id":5827,"landingOccurred":false,"latitude":30.4466959,"location":null,"logNumber":"US-11272006-0004","longitude":-84.2742929,"occurred":-62107493400000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":-62107493400000,"summary":"Event continues from 11/23 to 11/27 can be seen from south alabama to tallahassee perhaps elsewhere","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tallahassee, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489243"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Naperville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My brother was following me in his suv and i was driving south on a busy road. the light came from behind us and went straight over the top of the line of traffic in front of us. every vehicle (about 20) slammed on their breaks and came to an sudden stop. my brother had to go the right side of my van in order to avoid hitting me. he immediately called my cell phone and asked if i had seen something strange. i screamed, wow! did you see that. it was the stangest thing i'ver ever seen in the sky. i've observed hundreds of shooting stars, the slow moving space shuttle, and the international space station. this was nothing like them at all. the object appeard to be as big as a light bulb moving at the speed of a shooting star. if i had to guess, it was between 1000 to 3000ft above the ground, and moving at thousands of miles per hour. in what seemed like only a second or two, it was out of sight. it was very bright and didn't leave any sort of trail like comets do. i'm very curious if anyone else reported this last wednesday night, nov 22nd, int the naperville/lisle area.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":5826,"landingOccurred":false,"latitude":41.7858629,"location":null,"logNumber":"US-11272006-0003","longitude":-88.1472893,"occurred":1164245400000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1164245400000,"summary":"Similar to a shooting star, but much larger and closer to the ground.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Naperville, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489244"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ocean Shores","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Three police officers were parked in a parking lot, talking.  chris iversen said, \"look at that!\" and pointed to the sky. we saw a white star-like object passing high overhead, going south to north.  it appeared to be very high.  it was travelling faster than any satellite any of us have seen before, but slower than a meteorite.  the light was steady white, and it had no tail.\r\n\r\nmy first impression was that the object was a satellite, but i think it was going too fast to be a satellite.\r\n\r\nit disappeared behind clouds after a few seconds","distance":"Unknown","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":5825,"landingOccurred":false,"latitude":46.9736986,"location":null,"logNumber":"US-11272006-0002","longitude":-124.1562852,"occurred":1163230200000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1163230200000,"summary":"White light passing overhead","tags":["police"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Ocean Shores, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:489245"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2578}
