{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Georgetown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving east on rte 32 through brown county.  saw 2 large rectangular vertical rectangles, yellow/yellow red in color. pointed away from direction of objects travel.   it had no running lights and was traveling in erratic pattern in a north by north east direction.  i and the driver followed it over disappear over the horizon.  first sighting was over the road (in the air) at between 3000-5000 feet (guess assuming the large rectangles were 8ft high).  \r\nafter this vehicle left sight over the horizon there was a sighting of a 2nd object approximately 5-8 miles later with similiar direction but only one rear rectangle.    the duration of event includes the time between the 2 sightings.  first object approximately 2 minutes, second sighting approximately 20-30 seconds.  \r\n\r\nany further questions or desire clarifications feel free to contact me via email.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Path with directional change","formattedAddress":null,"id":4957,"landingOccurred":false,"latitude":38.8702738,"location":null,"logNumber":"US-06172006-0005","longitude":-83.9028144,"occurred":1149919800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1149919800000,"summary":"Driving east on rte 32, saw \"aircraft\" without running lights moving in erratic pattern, travening nne","tags":["lights"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Georgetown, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515505"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I took this picture about 9:45am this morning. i reported an object similar to this several days ago but this one is a somewhat different shape. the sky was clear and no other objects were anywhere around as can be seen from the original i attached. i also attached an enlargement.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4956,"landingOccurred":false,"latitude":34.2313855,"location":null,"logNumber":"US-06172006-0004","longitude":-77.9427202,"occurred":1150562700000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1150562700000,"summary":"White object in clear daytime sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4956_submitter_file1__6.17.06ref.JPG","http://www.mufoncms.com/files_jeud8334j/4956_submitter_file2__6.17.06refen.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wilmington, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515506"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Yongzhou","country":"China","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1 i was walking on the top of a mountain in a early morning.\r\n2 i was attracted by the flash object against the cloudy sky\r\n3 i thought it would be the ufo \r\n4 when i saw it it was moving towards the horizon and few seconds later it dispeared from my eyes.\r\n5 i was amazed then and soon took the camera and shot the scene\r\n6 the object moved towards the horizon and the dispeared.\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4955,"landingOccurred":false,"latitude":26.420394,"location":null,"logNumber":"CN-06172006-0003","longitude":111.613445,"occurred":1149424920000,"potentialRelations":[],"rating":"Unrated","region":"Hunan","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1149424920000,"summary":"A flash object flew across the sky in few seconds","tags":["ufo"],"timeZone":"Asia/Shanghai","timeZoneName":"Asia/Shanghai","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4955_submitter_file1__ufo3.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Yongzhou, Hunan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515507"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Terre Haute","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. heading west on chestnut @ 2nd ave. on my way home from work.\r\n2.It was very bright and moving in a starlit night sky.\r\n   ( i know what a meteorite looks like)\r\n3.Aircraft or meteorite.\r\n4.About the size of a pea taped to the inside of the windsheild,very bright blue green no tail or trail moving in a straight line to the n.W. it seemed to be gaining altitude and speed.\r\n5.Driving my car stopped in the middle of the road,tried to point it out to another person (passenger) but they missed it was gone in about 4 seconds\r\n6.It was up and out of sight quickly not sure where it went tried to relocate but it was gone\r\n ","distance":"Unknown","duration":"00:00:04","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":4954,"landingOccurred":false,"latitude":39.4687634,"location":null,"logNumber":"US-06172006-0002","longitude":-87.4125192,"occurred":1150532700000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle,  Star-like","source":"MUFON","status":null,"submitted":1150532700000,"summary":"Lbright blue-green object \"light' traveled north - west at extreme velocity, seemed to be gaining altitude.1","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Terre Haute, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515508"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lansing","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am a current michigan mufon field investigator trainee. i have included here only the 1st picture...Plus 2 still frames i took out of the 2 videos i took. i have sent all the pictures & videos to john c. i have also reported this to john c. state section director field investigator for clinton county in michigan.\r\n\r\non wednesday evening, (6-14-06), my daughters & i, volunteered to run the delta lions club concession stand at erickson park, so the lions/lioness could all attend their yearly awards/banquet night. (the girls & i run it on this awards night every year.) approx. 10pm...We were all closed up and headed home. erickson park is located on canal rd. just south of the old gm plant 5 building. we took canal rd all the way to saginaw hwy (m-43)....(light at horrocks). we turned west onto saginaw hwy, so as to get onto the freeway (i-96 westbound), to head home. as i entered the freeway on-ramp, i noticed this brilliant white light in the western sky. it appeared as a spotlight. it caught my attention, so i watched it as we proceeded down the freeway. i noticed it did not appear as a normal planes light...It was much larger. i kept saying to my daughters...Look at that light.....Tell me what you see...What is it?...Is it a plane?..Is it a helicopter?....As the light even seemed too big to be a helicopter spotlight. as we neared where i-96 & i-69 seperate, we all noticed a 2nd light suddenly appeared...The girls are watching this closely as i drive. then just a few seconds after the 2nd light appears....A 3rd light suddenly appears. these are brilliant lights...But you could see each one individually...In a horizontal row. there are no other lights...Nothing blinking...Just these 3 lights. i noticed all along how unusally slow this object was moving towards the east. it was in the normal airtraffic route, that would come in to capital city airport. now it appeared to be barely moving. i knew normal crafts could not move that slow...It should have fallen out of the sky...It was just way too slow.\r\n \r\ni had planned on stopping to get gas, so i was going to pull into the flying j truckstop...On the grandriver/i96 intersection/exit...Which is the exit i take to go to my house. it is by the tv-6 wlns doppler/weather radar tower.\r\n \r\nas i turn off the exit ramp (west) onto grand river...I notice this object is just sitting there in the sky. now...It is not moving at all. as i started to pull into the driveway at flying j...It was obvious this was no normal airplane. i pulled over into the parking lot...As close to grand river as possible. both girls said almost in unison...Mom...Its a triangle! they were yelling at me to hurry up pull over & get out & take pictures of it. they were so excited. i grabbed my camera....Which is always next to me now...(i never leave home without it anymore!) .....As i jumped out of my truck, a semi truck that had pulled out of the truckers parking lot....Now also pulled over on the southside of grand river and he too was now looking at the object in the sky. it was now directly across (south) from the truckers parking lot. it is just sitting there...All you can see is a dark black outline of an elongated triangle. now a blinking red light appears, then suddenly all these other lights start...Red ones,  ones and white ones. i took a picture first...Then it started to move...Ever so slowly, so i switched it to video mode, and started filming it. as i was videotaping it...It started to accelerate..Ever so slowly. then i stopped the video (to zoom in closer)...And started it again...And now it had more lights that changed...They were now...White, blue, red, green, and yellow. then i took another still shot of it. then it just took off. this whole time...It too was not any higher than an 8-10 story building. it was low. in the first picture i took, you can see the semi truck, the power lines, etc for height/size/distance comparison. the area is all lit up with all the lights from flying j, so there is ample light. the girls immediately drew what they saw. in the last picture i took, there appears to be a light at the far rear of this, as though now there is an extended \"tail end\". but i tell you...There was not one. this was an elongated trianglar craft. it may have been military...Not sure. there was no boomerang. the video and pictures turned out this time...Which i am so grateful for. the video was on auto focus, as i did not have time to reset it for manual focus, so the video shows it trying to constantly re-focus, because of the changing lights. (i wish i had my regular camcorder with me.) \r\n \r\nthe girls are now hollering...\"follow it mom!...Hurry up!...Follow it!\". so i jumped back into the truck and turned east onto grandriver...And we tried to see it. it was totally gone. you could not see anything at this point..Just all the stars. visibility going east down grand river is fairly clear and unobstructed where we were at...But it was just gone....So we headed towards capitol city airport...Hoping it would land there...I drove around the airport, and even drove/sat on the back roads hoping to see it...But nothing. then i turned back around and headed back to flying j. i pulled in/got gas/and left to come home. to anybody else...It would have appeared as a plane in the sky...But it wasn't. \r\n\r\nwhen i returned...The semi was gone. i was hoping he was still there, so i could talk to him. the gas station/truckstop was very busy. i'm sure others had to have seen it. \r\n\r\nwhat was weird, is the craft we just saw the other night...When all the other lights came on, they kept changing. like i said...Maybe this was a military craft...It was just \"different\". in the pictures/video...You can see absolutely no \"body\" to the craft...Just lights...And the sound was the same as the triangle i had in feb. for it being sooooooooooo close and soooooooo low...The sound was very low. it should have been deafening. like i said...Most people would have just thought it to be a regular plane. i just regret not staying and talking to the truck driver...It was strange. also...To prove my point of it not moving...And then barely moving....The pictures and all the video....Is all taken in about 1-2 minutes time....Now...That is slow. the whole time it was right there in front of us. i do not know of a craft that can do that, without falling out of the sky. maybe a military craft...But nothing conventional that i know of. also...In the first picture of this craft...There are so many orbs in the picture. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":4953,"landingOccurred":false,"latitude":42.739325,"location":null,"logNumber":"US-06172006-0001","longitude":-84.5473147,"occurred":1150348440000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1150348440000,"summary":"I am a current mufon field investigator trainee in michigan...Noticed huge white light in west...Then 2nd light appears...Then 3rd light appears...Much bigger than a helicopter spotlight...It was an elongated triangle","tags":["triangle","ufo","light"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4953_submitter_file1__DSC099591stPictureOfTriangle6-14-06.JPG","http://www.mufoncms.com/files_jeud8334j/4953_submitter_file2__cap001.bmp","http://www.mufoncms.com/files_jeud8334j/4953_submitter_file3__cap002.bmp","http://www.mufoncms.com/files_jeud8334j/4953_submitter_file4__2ndTriangle-1MOV099601stof2Videos6-14-06.MPG","http://www.mufoncms.com/files_jeud8334j/4953_submitter_file5__2ndTriangle-2MOV099612ndof2Videos6-14-06.MPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lansing, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:515509"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Altoona","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 14:40 (2:40 p.M.) cdt, monday june 12, 2006, i was outside my office at 927 loring street in altoona, wisconsin to have a cigarette.  as usual, there were a number of jet airliners at high altitude heading in a westerly direction (bound for the twin cities international airport in st paul, minnesota).  i also observed a number of birds flying in the area.  at 14:46, i noticed another white object directly east of my location.  at first, i thought it was another airliner, but then i noticed that it was not moving.  i continued to watch the object as it began to move very slowly westward (toward me).  this was a white disc shaped object with no apparent appendages, about 20 to 30 feet in diameter, and it occasionally \"glinted\" as though it were reflecting sunlight due to an orientation change.  i estimated the range at 1 to 1 1/2 miles.  when first seen, the object (which i estimated to be the angular size of 1/4 inch at arm's length) was approximately 50 to 55 degrees in vertical angle.  the object moved toward me at a speed of approximately 5 to 10 mph.  after a few seconds, it again stopped and hovered.  it remained hovering for approximately 45 seconds and then began slowly moving westward again.  at a vertical angle of approximately 65 degrees, it again stopped and hovered for about 30 seconds.  when it began moving slowly again, it began to slowly circle to the south (to my right).  it continued south for another 20 seconds before it again stopped and hovered.  at this point, i yelled to other workers who were inside the building to come out, but with a tv, a radio and a fan on, they did not hear my calls.  i didn't think to use the cell phone to call them.  when i looked back toward the object, it had again moved slightly west and was hovering again.  at this point, the object was southeast (approx. 130 degrees), and with a vertical angle of 85-88 degrees (nearly overhead).  the object then began moving southeast again very slowly, stopping two more times for 30 - 40 seconds and hovering.  when the object began to move the last time, it moved away to the south at an estimated 100 - 150 mph (accelerating slowly) and was lost from view behind some pine trees at the south edge of the company's property.  when last seen, the object was south-south-east (165 - 170 degrees compass) and at a vertical angle of approximately 20 degrees.  during the sighting, i listened for a sound, but heard nothing from the object.  there is a u.S. highway (hwy 53) 2 blocks south, and there was the usual level of traffic noise from the cars and trucks which may have interfered with any sound from the object.  this sighting lasted 14 minutes (14:46 - 15:00 cdt).  the only camera i had with me was a polaroid spectra which we use to photograph property.  the camera had 4 pictures left in it, and during those 14 minutes, i shot all four photos.  although i couldn't see the object through the camera's tiny viewfinder, i aimed at the direction where it should have been according to its relative proximity to the few clouds in the area.  the first picture's image was degraded by an emulsion or developing flaw.  the other three pictures are clear, but the camera was able to capture anything but clouds (i need a better camera).  copies of the images were sent to the mufon sd, the ssd, and to the director of investigations.  i can't justify posting pictures that only show clouds to this report.\r\n\r\nwhile this observation was going on, several birds were seen flying in the area of this observer.  the birds appeared to be completely disinterested in what was happening.  in addition, there were two dogs tied out.  the first was approximately 80 yard north of my location facing west.  the second was across the street, 70 - 80 yards south of my location facing the object to the east.  neither dog showed any signs of concern or upset (however, the dog to the south is known to be extremely old and may have impaired senses).\r\n\r\nclouds:  there were scattered high altitude cirrus clouds to the north, east and south with a few scattered fair weather cumulus clouds mixed with the cirrus to the west.\r\n\r\nenvironmental:  the temperature was 75 degrees (f).  the wind was from the n.E. at 2 mph (steady).  the humidity was 32 %.  the pressure (altimeter) was 30.16 inches (falling).  the dew point was 43 degrees (f).  the visibility was 10.0 miles and the uv index was 5 (moderate).  the ceiling was not determined.\r\n\r\nin the nearly 36 years of ufo investigations, this is the first one i've actually witnessed in person.  when i realized that i was watching something in the air do things which are contrary to the laws of flight and aerodynamics, i felt a sense of awe.  it was as if my mind was saying, \"wow.  these things really do exist.\"  each time the object stopped and hovered, that feeling was renewed.\r\n\r\nwhen i went back inside, i told everyone what i had seen, and, of course, they all had a big laugh about it.  it gave me a new sense of appreciation for what others have had to endure.\r\n\r\ndavid j. watson\r\nfield investigator\r\nmufon - wisconsin\r\n","distance":"501 Feet - 1 Mile","duration":"00:14:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":4952,"landingOccurred":false,"latitude":44.8046825,"location":null,"logNumber":"US-06162006-0005","longitude":-91.4432148,"occurred":1150148760000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Disc,  Flash","source":"MUFON","status":null,"submitted":1150148760000,"summary":"Extremely slow moving object, hovered repeatedly before moving away","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Altoona, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515510"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Millwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On thursday june 15th my friend had invited me over to camp in a tent in his back yard. later that night his mom had told me to go home so i packed up my stuff and started walking home.(i live a block down the road from my friend.) as i was walking about 50 feet from my friends house i saw what appeared to be a really big star about 125 feet in the air. at first i thought it was a planet or a star so i kept walking. i walked about another 50 feet and stopped, i looked up at it again and i saw two round headlights on it that were pointed at me. i also saw a straight line of red, blue, and green lights on the bottom of it. the shape of this object was rectangular. it was about 4-6 feet long and about 3 feet tall. the object was hovering and was making no sound at all. then when i saw the two headlights pointed at me i started running and i looked back and it had started to move towards me quite fast. when i looked back it was a little higher than a two story house. i first noticed the object when i was looking in the sky for shooting stars. when i first saw this object i thought that it was a helicopter but then i realized if it were a helicopter i would here the noise of the engine. the object at first looked like a really close star then a few seconds later when i looked at it again it looked like a rectangular box with two headlights on the front of it. the object was hovering when i first saw it then when i looked back as i was running after i saw the headlights it was moving towards me at a very fast speed. when i first saw the object i was like cool a big star, but i knew it wasnt the north star because it was in the southeast. when i saw the headlights i took off running as fast as i could and made it to my house which was about 4 houses down. i lost sight of this object after i looked back and saw the headlights pointed at me and it was moving towards me. when i got to my house i told my dad what i had seen and we had to go to the store so we got in our suburban and on our way there we saw an object that was zigzagging around in the sky. he asked me if that was it and i said i dont know it is to far away but the lights on it had the same yellow color to it. after we had came back we had seen an object hovering really high in the sky by our house. i could not get the sketch that i drew onto my computer","distance":"21-100 Feet","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":4951,"landingOccurred":false,"latitude":47.6812828,"location":null,"logNumber":"US-06162006-0004","longitude":-117.2827102,"occurred":1150437600000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1150437600000,"summary":"Saw what appeared to be a close star then it turned and i saw two bright headlights pointed at me and the object was moving towards me very fast","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Millwood, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515511"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop","city":"Canterbury","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Witness was sitting on front lawn watching lunar eclipse when his cat which he did not know had followed him outdoors, began to \"wail\". turnig, he saw a bright light behind his house which rose from behind some trees.  didn't know what to make of it at first.  object had irregular shape, coppery color with mixed colors, bright white across bottom, vibrational field of motion, silent, hovering over the trees.  witness felt intrigued, calmness, a sense of wonder and connection.  he wanted to \"engage\" it.  in his recorded description he siad he could see the outline of a figure inside but due to \"vibrational\" conditional of object could not make out any details.  object sped away very quickly.  estimated distance from witness 100 feet.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s),  Appendage(s),  Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":4950,"landingOccurred":false,"latitude":43.3372738,"location":null,"logNumber":"US-06162006-0003","longitude":-71.5652802,"occurred":841550400000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":841550400000,"summary":"Watching lunar eclipse, light rose frm behind trees at  range of 100 feet","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Canterbury, New Hampshire","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515512"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Egelston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Camping, observing sky with binocs. looks like they are building something up there is what i felt like. there were many of them. i could go look for them again this summer. they are there. never seen nothin like it. i am a amateur astronomer. they went back and forth and all around, many of them, aprox 10. moving in a certain area of the sky. someone or something is building something out there. i want credit for my discovery be it manmade or space alians.  keep this top secret. i dont want no visits from men in black. mycodename is bravo25-141 use it please","distance":"Unknown","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":4949,"landingOccurred":false,"latitude":43.254739,"location":null,"logNumber":"US-06162006-0002","longitude":-86.1097779,"occurred":1024124400000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1024124400000,"summary":"Seen many objects going back and fourth in area of sky with binoculars","tags":["none"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Egelston, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515513"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I took this picture thursday (6/15/2006) about 2:15pm. it is a very strange looking thing. i am enclosing the original, an enlargement and an enhancement enlarged. it was taken from my yard.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4948,"landingOccurred":false,"latitude":34.2287255,"location":null,"logNumber":"US-06162006-0001","longitude":-77.9408502,"occurred":1150406100000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1150406100000,"summary":"Strange looking object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4948_submitter_file1__6.15.06bk.JPG","http://www.mufoncms.com/files_jeud8334j/4948_submitter_file2__6.15.06bkl.JPG","http://www.mufoncms.com/files_jeud8334j/4948_submitter_file3__6.15.06bken.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wilmington, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515514"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Modesto","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1<cleaning the inside of house.2<i saw them on the tape hi-8.3<this was like the third time i caught this objects on tape.4<some were white and some were dark, moving very quickly and some errictic.The dark ones looked like the one that hovered for 18 secounds.5< glad i caught the dark objects.6< they moved off the screen.","distance":"Unknown","duration":"00:00:57","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":4947,"landingOccurred":false,"latitude":37.6483572,"location":null,"logNumber":"US-06152006-0004","longitude":-120.9927982,"occurred":1150227000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,  Sphere,  Square,  Rectagular,  Star-like","source":"MUFON","status":null,"submitted":1150227000000,"summary":"For the last few days i have been pointing my camcord to n-e, and getting white objects and 1 dark object that hovered for 18 secounds, today i caught more dark objects 4 moving either stright or errictic. white objects are two following each other.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Modesto, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515515"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Portland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just outside of portland oregon, july 5th, circa 1964. it was a rainy morning, as is typical in that region, so i and two of my siblings were playing upstairs in our two-story home. the entire second floor was being remodeled, so there were no curtains on any windows and there was a lot of construction debris. i know that the date of july 5th is correct, because we had assembled chunks of drywall construction debris into makeshift fireworks stands \"selling\" our used products -- that were lit off the night before -- to one another. my older sister had noticed the object first. she summoned my brother and i to the window. the three of us peered through the south-facing window near the top of the stairs and watched the object for several minutes before attempting to tell our parents. the dark-gray orb was flat in color; no lights or sound were discernible. it would come out from behind a cloud and freeze in midair ... then it would zig-zag in various directions and freeze again for a few seconds -- only to shoot behind a cloud out of sight and pop back into view after a short wait -- then repeat the zig-zag/freeze pattern. somewhere from 10-15 minutes had passed before my sister decided to tell our stepfather of what we had observed. he arrived at the top of the stairs just as the sphere was making an exit behind a cloud. the parent did see the object make, what then proved to be, it's last visual contact with us. from his perspective, it was a weather balloon (that explanation sounds familiar!). to date, i have never seen nor heard of a weather balloon that dances in the sky and freezes in one spot for any length of time. i do not know what it was we saw that overcast morning, but it was no weather balloon!\r\ni've another, earlier dated, story including the sighting of a being and a possible abduction which occurred in so. california. this one is pending contact from a mufon investigator ... according to my taking of the test.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":4946,"landingOccurred":false,"latitude":45.5310215,"location":null,"logNumber":"US-06152006-0003","longitude":-122.6663271,"occurred":-173206800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Circle,  Disc,  Sphere","source":"MUFON","status":null,"submitted":-173206800000,"summary":"The gray orb erratically darted in and out of view from behind low clouds in an overcast oregon sky.","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Portland, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515516"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Carson City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My cousin (same age within a month,we were abt 8)\r\nand i were in the field behind my grammas ( think its elm st) in the south west corner of carson city by the fish creek. we saw a silver shimmery object and thought it was a piece of metal of some kind so we ran toward it. about 50 feet away i stopped and could see it was a disc then but wasn't afraid. it suddenly \"jumped\" from the ground to the sky and was the apparent size of a coaster, then jumped again and was the size of a dime then again and was a speck then gone. it went up in a zig zag real fast like zip zip zip gone. my mother found a burned circle in the grass. \r\ni found out may years later that a family south of town had a ufo come down over their house at night and make the shingles slap up and down. the children saw it but the mother wouldn't look. i can't give you the name ( i know it) because i never talked to them about it.\r\nthe odd thing is that everything about it is clear except running back. it was summer when we saw it but when i try to remember running home i see my cousin cutting his lip and blood on the snow. sounds nuts but that's what i remember. my mother says we came back all excited and scared. that's why se looked and found the burned spot.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":4945,"landingOccurred":false,"latitude":43.1769772,"location":null,"logNumber":"US-06152006-0002","longitude":-84.8463945,"occurred":-128966400000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":-128966400000,"summary":"Silver disc about 30 ft wide 15 ft high shimmered like heat waves","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Carson City, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515517"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Colorado Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The witness used opera glasses to view some of this.\r\n\r\nthe witness happened to glance out here bedroom window and saw a \"landed starship\".  the object was a \"seaweed green\" color.  sort of silvery with white lights.\r\n\r\nthe ship had a set of steps built into the hatch that lowered down to exit the ship.\r\n\r\nthe ship was round with an \"octagon dome\".  the lights were turn down and went to a \"dark blue\" color.  she said three entities walked across the street and stood by a tree and street lamp.  they seemed to be talking to each other.  she isn't sure all three were actually from the \"starship.\"  the number varies as she tells the story.  sometime 3 and sometimes 5.\r\n\r\none male was apx. 5'7\".  he had dark hair.  wore a count drakla type cape, with a pointed color.  wore all black with a red shasa across the front.  he had black boots which came way up almost to the thigh.\r\n\r\nthe female had a pink sequence type jumpsuit, with shorter boots.\r\n\r\nthe other male had a bad case of skin rash or burn.  he had \"worry lines\" in his forhead.  one side of his face was covered with an eyepatch of some sort.  he was dressed in tan colors with tan thigh length boots.  he wore a chocolate vest with pens on it.\r\n\r\nthe witness became frightened and closed the curtins.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Patterned Surface,  Other","flightPath":"Stationary","formattedAddress":null,"id":4944,"landingOccurred":false,"latitude":38.8368816,"location":null,"logNumber":"US-06152006-0001","longitude":-104.8186634,"occurred":1147068000000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1147068000000,"summary":"Witness looked out bedroom window and saw landed ufo and three \"entities\"","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4944_submitter_file1__Blank.doc"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Colorado Springs, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515518"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Portland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in oregon in vacacion in a  near a beach on the coast. me and a friend are loking to the full moon outside with a telescope. after look at the moon for a time, i let the telescope to my friend and when i raised my head to the sky. i saw 2 very bright stars that keep my attention immediately. after 2-3 seconds, it begins to be less and less bright. i told to my friend to look at the direction's in the middle of the sky. he saw the 2 star-like objects seeming going away into space. my friend tell's my that he saw the two objects decreasing in brighness, he tell's me that they seem to going together.\r\ni loose the objects, after 10-15 sec. \r\n i was looking for a period of time to the sky that night and i did'nt saw something brighter in the sky than this and needer after.\r\nwhen i first noticied the two objects, i thinked that these objects were'nt there before and that they are bright, 2-3 time others stars in the sky that night. (enless the moon)","distance":"Over One Mile","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":4943,"landingOccurred":false,"latitude":45.5278015,"location":null,"logNumber":"US-06142006-0007","longitude":-122.6674171,"occurred":1149922800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1149922800000,"summary":"2 star-like objects seems going in deep space, they dont move but rapidely their brigthnees come down.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Portland, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515519"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Littleton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in pine junction, colorado.  sitting in living room watching tv. \r\ni first noticed out of the corner of my left eye, a bright green thing shooting through the air above the mountains.\r\nit looked just like the same thing i saw in texas back in 1990, and though it was a ufo.\r\nthe object was not exactly like a fire ball, but was bright green and seemed to be transparent, it flew very fast over the mountain line, until it reached a cloud, and them illuminated the whole cloud with a flash of green, then all traces were instantly gone.\r\nmy reaction was to jump up and look out the window at the thing, and blink a lot in amazement.\r\ni lost sight of the object after it entered a cloud and did not exit.","distance":"501 Feet - 1 Mile","duration":"00:00:07","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":4942,"landingOccurred":false,"latitude":39.621681,"location":null,"logNumber":"US-06142006-0006","longitude":-105.0088598,"occurred":1113877800000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Fireball,  Sphere","source":"MUFON","status":null,"submitted":1113877800000,"summary":"Green fireball like object streaked across sky into cloud.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Littleton, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515520"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fort Worth","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my bed asleep. the time had to be somewhere around 3am. i awoke with a bright red light shining into my bedroom window. i thought that something had happened outside, i thought that it was either a fire or emergency lights from a vehicle. when i got up to open my curtain to look outside, the light completely went away as soon as i opened the curtains. i also remember it being a little windy. i thought it was weird and it took about a minute for me to take it in that a light so bright could go away in a matter of seconds. as soon as i closed the curtains back up and turned to lay back down there was a man standing by my bed. this wasn't any ordinary man, this man was very tall, dressed in black. i don't know if it were regular clothes but i do know that he was covered in black all the way up to his neck. but what i'm about to say was what scared me. he had pale, almost white skin. weither it was skin or not is the question, and he didn't have any hair anywhere on his head or his face. let me change that...He didn't have a face. thats what frightened me. he didn't have a face. no eyes, no nose, no mouth. i started to scream but it was as if i became mute. i know my mouth was open and i was trying with all my might to scream but nothing would come out. he just stood there and looked at me. i also recall not being able to move. i don't remember what happened after that. i only remember waking up in the morning not being able to breath through my nostrils as if i had a very bad case of sinuses. after that night i continued to have dreams of a ship hovering in my backyard and as it hovered it had a sucking action and my dreams would be of me always trying to hold on so that it wouldn't pull me in. the dreams never stopped. and on another occasion after that night my boyfriend and i were sitting out in the street in his car and all we seen was a bright light over our car. we thought that it was a helicopter that had it's spot light on us but there was no noise that a helicopter makes. it shined on us for about a minute then when it stopped we looked out the window towards the sky and all we seen was this huge strike of fire going slow towards the east but the fire wasn't red, it was green. the car then wouldn't start afterwards. and i did come inside and call a news station but i don't remember what news channel it was but i remember them telling me that they did have numerous other calls about seeing something in the sky at that same moment that we had that experience. and the next morning i went outside and noticed that the car was completly drained of oil. we never told anyone else.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":4941,"landingOccurred":false,"latitude":32.731099,"location":null,"logNumber":"US-06142006-0005","longitude":-97.3172596,"occurred":562676400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":562676400000,"summary":"A pale white man dressed in black standing near my bed","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort Worth, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515521"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Rafael","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in bed, looking out my window when i saw a weird star. i soon realized it wasn't a star, both because it was too close to be a star, and because it was moving. but it wasn't moving slowly in a horizontal direction, it was shooting vertically like a hellicopter. after a moment, it changed direction, this time flying horizontal towards my house. after it was out of my eye sight, i still heard it (or some kind of air craft) for about thirty minutes. it was as loud as when i hear an airplane in the sky, but it was a much lower sound. i always thought that if i saw something paranormal, i would be freaked out. but when it was happening, i was rather calm. it was only after it disappeared that i started to wonder if i had actually seen it at all, even though it seemed as real as anything i've ever seen.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4940,"landingOccurred":false,"latitude":37.9735346,"location":null,"logNumber":"US-06142006-0004","longitude":-122.5310874,"occurred":1150277100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1150277100000,"summary":"Disc shaped with lights on either side of the craft","tags":["lights","disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Rafael, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515522"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Newark","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was leaving my grandmothers house with a friend and walking to my car. i took a quick look at an airplane flying by when a smaller dark orb shaped object caught my eye going the opposite direction of the plane and moving a lot faster. i quickly got my friends attention and said \"bro look at that plane move\" he then said that���s not a plane. in my head i knew that already but i wanted to see what he thought of the object before i stuck the thoughts of ufo in his head. the object disappeared behind some buildings, so we got into my car. as we drove down the street i continued looking for the object between the houses and that���s when we both notice an even bigger object with lights with the orb dancing around it. at first i thought the larger object was a small private plane. i had said to my friend \" check that out man, its going nuts\" and he had responded \" it looks like its changing shapes\". the larger object was sort of morphing and the smaller was dancing around it. i tried to pull over but their wasn���t any space because of parked cars and the traffic behind me was going crazy with their horns so i was forced to continue down the street and lost sight of the object.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path then hovering","formattedAddress":null,"id":4939,"landingOccurred":false,"latitude":40.740517,"location":null,"logNumber":"US-06142006-0004","longitude":-74.1694667,"occurred":1150083000000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1150083000000,"summary":"Black orb with lights moving with great speeds then interacting with another unknown object","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Newark, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515523"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Colorado Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The witness, her friend george and ex-husband arlan carlson were sitting on the poarch after a barbaque.\r\n\r\nthe object was octagon shaped and about the size of a nickle held at arms length.  it was glowing brighter tnan a star and white.\r\n\r\nthey contacted the shreiffs office and a deputy came by.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":4938,"landingOccurred":false,"latitude":38.8368516,"location":null,"logNumber":"US-06142006-0003","longitude":-104.8176734,"occurred":1122868800000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1122868800000,"summary":"Witness claims that she saw an octangon shaped ufo that was bright white in color","tags":["contact"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4938_submitter_file1__IGNORE.doc"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Colorado Springs, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515524"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pueblo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The witness was driving north on i-25 about 3 miles north of pueblo.  she glanced of to the ne and notice three lights behaving an a very odd fashion.\r\n\r\nthey were wrilling around each other somewhat like lights in a laser light show.\r\n\r\nthe distance was apx. 45 miles away at an altitude of 20000 ft.  she estimates the location as over schriever afb.\r\n\r\none object shot of to the west. the other two shot of to the east.\r\n\r\nthe total time of this sighting was less than ten seconds.\r\n\r\nshe tried to show her boyfriend what she was seeing, but they were gone before he saw anything.\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":4937,"landingOccurred":false,"latitude":38.2544472,"location":null,"logNumber":"US-06142006-0002","longitude":-104.6091409,"occurred":1149745500000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1149745500000,"summary":"The witness sighted three white lights.  the were wirling around each other like a laser light show,","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pueblo, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515525"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Object a long way off but enlarged well and clearly with some color. taken tuesday (6/12/2006) around 11:30 am from field by my house.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":4935,"landingOccurred":false,"latitude":34.2300255,"location":null,"logNumber":"US-06132006-0001","longitude":-77.9376802,"occurred":1150137000000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1150137000000,"summary":"Object a long way off but enlarged well and clearly with some color","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4935_submitter_file1__6.12.06.JPG","http://www.mufoncms.com/files_jeud8334j/4935_submitter_file2__6.12.06en.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wilmington, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515526"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Taylor","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While watching a ball game i noticed some odd lights passing by in a straight line. they made no noise and passed quickly.They passed the hills near by and were gone.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":4934,"landingOccurred":false,"latitude":56.15897,"location":null,"logNumber":"CA-06122006-0006","longitude":-120.687793,"occurred":1149737400000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1149737400000,"summary":"3 orb like objects 1 blue 1 orange 1 white","tags":["none"],"timeZone":"America/Dawson_Creek","timeZoneName":"America/Dawson_Creek","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4934_submitter_file1__red2.jpg","http://www.mufoncms.com/files_jeud8334j/4934_submitter_file2__red.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Taylor, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515527"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Modesto","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The first time i set up the camcord in the morning about 8am, but didn't get anything in the backyard. then tried again at 4pm in the backyard.2< while looking at the tape on the t.V screen.3< the same objects i saw on 6-09-06.4<white objects that move very fast and erratic and 1 moved very slow and some had the dark edges on the ends. and small. one object was dark and small i thought it was a bird at first intill it stop and hoverd for 18 secounds. i was watching one of the white objects move up and out the top of the screen and i saw a dark small object moving from east to west it past under the whit object then it just stopped and hovered for about 18 secounds then just started going again and moved out to the east.5<very glad i have it on tape.6< they would move off the screen. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":4933,"landingOccurred":false,"latitude":37.6472372,"location":null,"logNumber":"US-06122006-0005","longitude":-120.9881282,"occurred":1150066800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,  Star-like","source":"MUFON","status":null,"submitted":1150066800000,"summary":"All white, small, quick moving, and some have dark edges on the ends, moving very errictic, and some moving at a steady pace, some glow brighter then are gone then come back for a few secounds then get brighter again and are gone while still in the screen","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Modesto, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515528"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Modesto","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1st object was like a line across the screen, when i hooked it up to the t.V set and freeze frame the object it had a good size gap between the two. it went across the screeen in 1 secound. (zoom was at it widest). and pointed n-e approx 70*-80* degrees. (this object was dark in color)\r\n\r\nmost of the objects were white in color and very small if  i didn't have it on t.V i wouldn't have seen them, about 10. most object moved errectic except for 1 it moved steady across the bootom of the screen,which lasted 1 minute and 16 secounds. another looked like it had a dome on it and darker on the both ends.2> when i looked at the tape. 3> at first it might be a ballon, intill i freeze a frame and could see 2 objects flying next to each other.5>glad i had them on tape.6< they would zip out, or slowly move off screen.","distance":"Unknown","duration":"00:00:02","entityEncountered":false,"favorited":0,"features":"Dome,  Other","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":4932,"landingOccurred":false,"latitude":37.6483672,"location":null,"logNumber":"US-06122006-0004","longitude":-120.9913382,"occurred":1149877800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Bullet,  Missile,  Circle,  Sphere,  Star-like,  Other","source":"MUFON","status":null,"submitted":1149877800000,"summary":"White ,small, round, stright line, dome shape with dark edges on both ends. all objects mostly white (except the edges on some)","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Modesto, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515529"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A bunch of us kids (1 my cousin) were playing outside during the afternoon on wild street (front lawn/street was u-shaped so no traffic much) in north-central austin during the summer probably as i visited my cousins then (from mesquite/dallas area) when i noticed out of the corner of my eye an object moving toward me about 10 or 15 feet up, (to my left & i was facing west approx.)so i stopped playing and just watched the thing glide by right in-front-over my head!  i stood surely with my mouth open staring at it gliding from south-sw down the neighborhood street to north-northeast in a leisurely manner--no sound or maybe a soft whirr?  the most amazing minute of my life--was only about 10+ years old.  as it sailed (reminded me of a sailboat gliding on water!)on down the street until it disappeared, all us kids ran into the house screaming we saw a ufo which is about all i knew of the subject until many years later when karla turner was on the radio talking about her book and other weird things which when connected with ufos just about shocked me like being hit on the head!!!  my cousin and i through the years talked about remember the ufo we saw? but never in detail.  so after reading karla's book, and other books, i asked my cousin what exactly did he see? (i never forgot the image!) he insisted it was a helicopter, but i don't see how--i don't believe him.  how could he have forgotten???  anyway, he may have been trying to get me off ufos.  what he did remember on the same street was a time he was wrestling with the boy across the street when a huge perodyctal (sp?) flying dio fit the description best, but that's the thing my cousin remembered most about wild street! the bird was swwoping down on them like they were food, claws extended!  it scared the pants off both boys, and i guess as they jumped up the bird realized it wasn't a rodent or rabbit but two large boys, they ran & got the boy's dad and they went to the library to research birds in tx that big!  i forgot which one they decided it was, but i wonder now esp after reading keel, etc.....Although we never reported the ufo, i have never forgotten it and it's weird how children put those things away in their minds, how there was just no explanation, now i wish i had thought to reach down and get a rock to see if it \"pinged\" or at least to write down the date, etc. etc. but the image was never forgotten, it was real, no way that close that it was an screen or projection because the bottom was fascinating, maze-like, intricate.  i will never, ever forget that minute or so in my life when i saw something!  oh, i have never seen another drawing, picture of one that looked even close to this one.  the plates just wasn't at all what its shape was, it was round yet squarish compared to the thin plates together if you know what i mean.  no windows, no lights just dark gray, yet could see the bubble on top and the very intricate bottom.  wow, huh?  right over me, whoa!  (i don['t believe in the abduction stuff although i suppose it's possible given other strange things in my life that karla put in the same category and it was like an awakening for me,like yea, you're right, it has to be connected... i shoulda known before hearing her...Then i met in dallas: t. good at cheyennne turners' meetings eclectic viewpoint and i offered to typeset for her...She told me that karla had talked with her (mufon director) and she was the lady in the introduction to karla's book...It's a trip isn't it?  although i have very little to add after all my studies of ufos, i know something is out there, i don't know how people who have never seen one can believe.  i suspect navy and i don't believe the et hypothesis is right, but that's about all the conclusion i have come up with.  thanks for listening-sorry to go on so....& thanks for your hard work in the field. finally, officially recorded & reported!","distance":"20 Feet or Less","duration":"00:01:30","entityEncountered":false,"favorited":0,"features":"Dome,  Other","flightPath":"Straight-line path","formattedAddress":null,"id":4931,"landingOccurred":false,"latitude":30.272203,"location":null,"logNumber":"US-06122006-0003","longitude":-97.7358208,"occurred":-160452000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle,  Disc,  Oval","source":"MUFON","status":null,"submitted":-160452000000,"summary":"All dark gray w/buble; 2 feet approx; intricate on bottom; no lights/sound","tags":["sound","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515530"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Detroit","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This event happened approximatly august 15, 1979 in roseville, mich. a suburb of detroit mich. i had been on a fishing trip with my father all weekend and had arrived back at his house. i was waiting in the car for my wife and kids to come out so we could go home. i observed a single bright light in front of me a few miles away coming directly toward me. i tried to determine whether it was a plane or a helicopter, but i couldnt because it was traveling too straight for a helicopter and only had one light, unlike planes. when my wife and kids came out to the car i headed straight for the light which was still coming straight toward me, slowly. when i reached the light i was shocked at what i saw and stopped the car in the middle of the road (which was a 4 lane road) and got out of the car with my wife and we both watched as this ship crossed over above us about a thousand feet high. it looked exactly like the underside of a star wars battle cruiser with three blue lights at the end of the ship just like in star wars. because it looked exactly like a star wars battle cruiser my first thought was that it was some sort of rich persons remote controlled toy. i also thought it might be an experimentsl craft from a nearby air national guard base. but as i struggled to come to grips with what i was seeing i realized it was neither a toy or an experimental craft and was in fact a ufo. as my wife and i stood in the middle of the road watching the object glide soundlessly overhead we both looked at each other and got in the car and tried to follow this craft through the subdivision but as it was travelling diaginally through the neighborhood we were unable to keep up with it and it finally moved away and disappeared in the distance","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":4930,"landingOccurred":false,"latitude":42.340657,"location":null,"logNumber":"US-06122006-0002","longitude":-83.0444538,"occurred":303548400000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle,  Other","source":"MUFON","status":null,"submitted":303548400000,"summary":"Observed bright light coming toward me. upon investigation it looked exactly like a star wars battle cruiser.","tags":["light"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Detroit, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:515531"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Pecos","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband and i were driving back from san antonio, tx, i was bored and the sun was in my eyes.  i started to play with my camera phone, and took a picture of the sun to see what it looked like.  when i looked at the the picture there was an object in the middle of the sun.  the object was shaped like saturn.  i thought it might be a mistake so i took several more pictures from different areas, even pulling over and taking a picture.  the object could not be seen with the naked eye.  after several miles, (almost to carlsbad, nm) the sun went down and the object could no longer be seen, even with the camera.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Unknown","formattedAddress":null,"id":4929,"landingOccurred":false,"latitude":31.4229124,"location":null,"logNumber":"US-06122006-0002","longitude":-103.4932293,"occurred":1150075680000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1150075680000,"summary":"Taking pictures of the sun (to be funny) when pictures came out they had a image in the middle that could not be seen with the naked eye.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pecos, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515532"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at dana landing marina fishing off the dock\r\nmy friend said \"hey what do you think that is up there\"\r\ni thought it was a vapor trail\r\nthe object hovered over the marina making long slow side to side motions and north and south movements. at one point it seemed to desend. towards the end of the encounter the object moved slowly towards the sun and was gone.\r\nmy reactions during and after the event were very up beat.\r\ni lost sight of the object when it moved towards the sun","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":4927,"landingOccurred":false,"latitude":36.781581,"location":null,"logNumber":"US-06112006-0008","longitude":-119.4166924,"occurred":1150052400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1150052400000,"summary":"Observed cigar shaped white object with possible light extending from sides/ends","tags":["landing"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4927_submitter_file1__UFO61106.mpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515533"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop","city":"Lawley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We spend a lot of time filming the sky and on march 30, 2006, we caught something unusual on film.  on the viewscreen on our camcorder, we saw what we thought was a series of lights descending into the woods behind our house.  we zoomed in on one of the lights and followed it down until losing sight of it in the underbrush near the forest floor.  it was only when we reviewed the tape that we realized there was more to it than just lights.  screenshots taken from the video are attached.\r\n\r\nwe have no idea what it is or why it would be landing(?) in the forest behind our house. we filmed it while standing on the second floor deck in the backyard, looking directly west through the trees.  we waited for over an hour for whatever it was to ascend, but never saw it again.\r\n","distance":"101-500 Feet","duration":"00:07:17","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":4926,"landingOccurred":false,"latitude":32.8595702,"location":null,"logNumber":"US-06112006-0007","longitude":-86.9513796,"occurred":1143774900000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Egg,  Oval","source":"MUFON","status":null,"submitted":1143774900000,"summary":"Unknown lights spotted and filmed when vanishing into trees","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/4926_submitter_file1__egg1.bmp","http://www.mufoncms.com/files_jeud8334j/4926_submitter_file2__egg2.bmp","http://www.mufoncms.com/files_jeud8334j/4926_submitter_file3__egg4.bmp"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lawley, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:515534"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2605}
