{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dunedin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Walking up hill after going to get some 'midnight' snacks (11.48pm was the time of the sighting), i was alerted to the ufo because whilst eating and walking up the hill i began to feel sick which was strange as we normally eat whilst walking up hill so anyway we stopped at the side of the footpath to take a break. i had my back towards town and was facing up hill, my boyfriend who i was walking with at the time was facing me so looking down towards town when suddenly he exclaimed \"omg what is that!!\" \r\n\r\nupon turning around to look towards town to see what he was talking about i saw a red light. at the location we were in you can see out to the hills and over the water. above the quarry where there are always two white lights on at night time, there was a red light which was larger than the two white lights, maybe twice the size. the red light was moving in a fashion similar to a sine wave (but with a very small amplitude - so it was as if it was doing small zig zags almost but smoothly and roundly not sharp jagged movements) as well as this movement, it appeared to move further down in the sky --> so whilst moving downwards slightly it was sine wave like but only moving downwards at a tiny angle to parallel. \r\n\r\ni thought it was an asteroid at first as it looked like it was dropping down in the first instance that i saw it, but after a split second i noticed that it was moving as stated above in a sine wave like pattern across the sky. it appeared to move from the position it started in from around the area above signal hill right over the harbour out towards south dunedin. it was making a very strange noise for an object its size, i say it was odd because there was no noise, it was dead silent! my location was behind the shopping centre in the middle of town which is near the hospital so that was the second thought, is it a helicopter as there are often helicopters flying into the hospital. but no it did not make any noise, also the light was significantly larger than what you would expect from a helicopter and larger than the light of a plane(the flight path is different also, planes do not fly over that area and the light did not stop at the hospital but continued out past it) also the light was not flickering like plane lights do, it was red the whole time. \r\n\r\nafter about 2mins of watching the light move across the sky, it started to decrease in size slowely (whilst still remaining lit in red light the whole time) then suddenly it appeared to pop out of the sky, disappearing quickly.It was there one minute and then completely gone the next.\r\n\r\nfor the first time my boyfriend had forgotten to bring his celephone which has an amazing camera in it, we tried to use my cellphone camera to take a pic or video but it is only 2mega pixels so did not pick up anything (it was interesting to note that the lights from houses on the hill were able to be seen and the large red light / ufo was not)\r\n\r\ni felt like i had to try and explain the event off to myself, i went through a checklist in my head, is it a plane, no too big of a light, its not flickering and is moving at a different rate than a plane would and planes do not take that flight path as the airport is not in that direction. was it an asteroid, no it was not dropping in the sky and was moving a lot slower than an asteroid would. was it a helicopter, no it was not making any noise, for an object that size it should have made a noise there was no noise. was it a laser, no, a laser would not be able to make that size light in the sky. was it my imagination no boyfriend could see it too. was it erie yes it was!!! i had to pinch myself to make sure that i was not dreaming!\r\n\r\n-after sighting the light we walked further up the hill to try and spot if we would see it from higher up. we could not. there was a fear that the light may come back closer to us so we quickly went home.\r\n\r\nas soon as we got home, we looked it up on the web and there appears to be no other sighting of this from today,as a side note, whilst walking down the same hill, on another occasion around 2months ago at a similar time (closer to 11.20 maybe) i saw a very similar red light, it appeared above the two white lights that i described above and bobbed up and down 4-5 times and then again popped out of sight but did not diminish in size like the red light that i witnessed today (at the time i thought it must have been a person shooting flares at the quary, i went back during the day to stand at the same position on the hill and noticed that the quary was far to the right of where i had seen the light so it definitely was not flares\r\n\r\nwe had not consumed any drugs or alcohol (we were studying and took a break to get some food, event occurred whilst walking home) - both my boyfriend and i saw the red light / ufo and thought it was very strange!!\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":29281,"landingOccurred":false,"latitude":28.0280604,"location":null,"logNumber":"NZ-05282011-0003","longitude":-82.7678284,"occurred":1306651680000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1306601063000,"summary":"A red light moving across sky, not flickering like a plane and also bigger than the lights of a plane","tags":["lights"],"timeZone":"Pacific/Auckland","timeZoneName":"Pacific/Auckland","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Dunedin, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56284"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Forest Park","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I saw two other mufon reports of something similar in the chicago area recently so i will try and share the video and photos i have of it on this site. i have seen this gold, copper, orange sphere ufo several times during the day over the past month; 4/29, 5/22 and again yesterday may 27,2011 at 315pm cdt. i have also recorded this type of craft a few times before since 2009. i watched the slow moving sparkling gold morphing sphere of light noiselessly glide over the city for about 4 minutes. my camcorder is brand new hd sony but for some reason when i tried focusing in on the object the screen blurred or possibly the object was disapearing and re appearing. it started as a small point of light, it was east over the city then came west towards forest park. maybe this is what the other witnesses saw. *(moved to additional information section -- cms/sg). thanks for reading. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29280,"landingOccurred":false,"latitude":41.8809958,"location":null,"logNumber":"US-05282011-0002","longitude":-87.80555,"occurred":1306479600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Diamond,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1306579173000,"summary":"Gold sphere over chicago 27 may 2011 ufo hd video + photos uploaded on youtube","tags":["photo","ufo","video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29280_submitter_file1__ufochicagomay272011guttergawkeryoutube5.jpg","http://www.mufoncms.com/files_jeud8334j/29280_submitter_file2__ufochicagomay272011guttergawkeryoutube4.jpg","http://www.mufoncms.com/files_jeud8334j/29280_submitter_file3__ufochicagomay272011guttergawkeryoutube3.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Forest Park, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56285"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Covington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me, and five other friends were laying out on the back of a truck and noticed a small, pin-shaped object slowly move across the sky. we thought nothing off it, and then noticed several planes, shooting stars, etc. actually, we thought it could have been a satelite at first, but realized a satelite could not be stationary, then begin to move. next, we all noticed another one and began to watch for more. we saw at least six or seven of the same type object. the last one we saw began to slowly move as all the others did, then it dissapeared, and reappeared a hands length to the right, and dissapeared again. we then immediatly decided we should report the sighting.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":29279,"landingOccurred":false,"latitude":35.5669574,"location":null,"logNumber":"US-05282011-0001","longitude":-89.6387672,"occurred":1306560600000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1306568330000,"summary":"Series of small, pin-shaped objects slowly moving across the night sky.","tags":["none"],"timeZone":"America/North_Dakota/Center","timeZoneName":"America/North_Dakota/Center","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Covington, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56286"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"What can i sat these web cams are catching great ufo evidence...Mufon please look into this...There here all the time...What are u waiting for..???","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29278,"landingOccurred":false,"latitude":40.7167428,"location":null,"logNumber":"US-05272011-0015","longitude":-73.9969731,"occurred":1306479600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cigar,   Cylinder,   Disc,   Egg,   Flash,   Oval,   Other","source":"MUFON","status":null,"submitted":1306562769000,"summary":"Look at these ufos there not planes or helicopters","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29278_submitter_file1__WhatsThis.jpg","http://www.mufoncms.com/files_jeud8334j/29278_submitter_file2__MotherShip1.jpg","http://www.mufoncms.com/files_jeud8334j/29278_submitter_file3__BestUfoPic.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56287"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Terre Haute","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On saturday, march 13, at approximately 1:30 p.M., my brother and i observed a rather large silver colored round object hovering just below the clouds at the ft. harrison and lafayette avenue intersection area in terre haute, indiana, which in the north/northwest part of terre haute. it had what appeared to be a large, black antenna like object on top of it. i saw what i thought was a red streak against black on the side of the object. this object hovered below the clouds, moved forward a bit, in the direction toward where my brother and i sat in my car watching it, then it started to move back and up, becoming smaller as it disappeared behind the thick, dark clouds. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":29277,"landingOccurred":false,"latitude":39.4750634,"location":null,"logNumber":"US-05272011-0014","longitude":-87.4122392,"occurred":1268515800000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Blimp,   Cylinder","source":"MUFON","status":null,"submitted":1306562437000,"summary":"Object hovered, moved toward us, then went back and up, into the clouds","tags":["none"],"timeZone":"America/Indiana/Indianapolis","timeZoneName":"America/Indiana/Indianapolis","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":440,"locationName":"Terre Haute, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56288"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As usual the wrb cams are catching many strange objects. people make me laugh when they say the pictures & ufo.S i capture are airplanes or helicopters...Look at these objects...They are not planes or helicopters...There not allowed in the air space over nyc...??? come on get real...There ufos, alien space craft...There not from earth...Face it !!!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29276,"landingOccurred":false,"latitude":40.7193228,"location":null,"logNumber":"US-05272011-0013","longitude":-73.9985831,"occurred":1306560780000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cigar,   Cone,   Circle,   Cylinder,   Disc,   Oval,   Other","source":"MUFON","status":null,"submitted":1306562055000,"summary":"Ufos on wired nyc web cams right now...Look !!!","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29276_submitter_file1__GreatUFO.jpg","http://www.mufoncms.com/files_jeud8334j/29276_submitter_file2__UfoCylinders.jpg","http://www.mufoncms.com/files_jeud8334j/29276_submitter_file3__BrightUFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56289"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As usual the wrb cams are catching many strange objects. people make me laugh when they say the pictures & ufo.S i capture are airplanes or helicopters...Look at these objects...They are not planes or helicopters...There not allowed in the air space over nyc...??? come on get real...There ufos, alien space craft...There not from earth...Face it !!!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29275,"landingOccurred":false,"latitude":40.7200728,"location":null,"logNumber":"US-05272011-0012","longitude":-74.0032731,"occurred":1306560780000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cigar,   Cone,   Circle,   Cylinder,   Disc,   Oval,   Other","source":"MUFON","status":null,"submitted":1306561748000,"summary":"Ufos on wired nyc web cams right now...Look !!!","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29275_submitter_file1__MotherShip.jpg","http://www.mufoncms.com/files_jeud8334j/29275_submitter_file2__UFO_and_Cylinders1.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56290"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"College Station","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"One morning, around 2 a.M. in early march of 2011, i walked into my backyard to have a cigarette before going to sleep. before i proceed, i want to state that i am an avid observer of the sky, particularly in the city of college station. i can therefore attest that i am very familiar with seeing planes (commercial and military), stars, meteors, cloud formations, and just about anything else you would see if you spent a lot of time sky-watching. going back to 2 a.M. early march of 2011, i had just walked outside and looked up like i always do facing southwest. about 45 degrees off the horizon, i noticed a rusty orange colored object flying from south to north (my left to right). this object was close (less than 200 feet off the ground and less than 250 feet away from me) and made absolutely no sound. it was shoebox shaped (cubic) and appeared orange-ish in color but only because it was reflecting the orange hue of street lights it was flying over. had there been no streetlights, this craft would have appeared black. the craft was not very large, maybe only several cubic meters in volume. my immediate reaction to explain how it moved so straight at constant speed and constant elevation, made no sound, and was so close to me was that it had to be a glider. this can not have been the case however, as a glider would have a very visible wing structure, which this craft definitely lacked. eventually, this object flew out of my sight bearing north. i have never seen an object fly like this before or after this event. \r\nseveral days later, standing in the same backyard and looking in the sky northwest, i noticed an even stranger event. a few days later (no more than 4) right around sunset (approx 7:30 pm), i was sitting in my backyard and noticed a white, vertically oriented cigar shaped object, relatively far away, about 15 degrees off the horizon, that appeared to be moving. this object was brilliantly white, in stark contrast to other clouds in the sky that were painted red and orange by the setting sun. as i stared, this object appeared to be changing and moving as i could see the object crossing below and then going back above a non-moving power line that happened to be in the same line of sight between me and this object. i watched this object for about a minute, and during that time its color remained this odd white, but its shape changed from vertical cigar, then shrunk into a sphere maybe a quarter the size of the cigar, then elongated into a horizontal shaped cigar, and then shrunk back into a sphere. when it shrunk back into a sphere the second time, a bright orange point of light began shining from within this cloud-like sphere. the light was not moving, was colored bright orange, and was not any star or planet i have ever seen. it was still daylight out and maybe a few other stars or planets were even visible at this point in the evening, but this light was 10 times brighter than any other object/light in the sky. this convinced me to run inside and get out a half broken telescope and viewing the object through the starfinder of the telescope (similar angular resolution as a rifle scope). looking through the starfinder at the still shining sphere revealed something incredible, and something i will do my best to describe in words. the orange light appeared star-like (a point source) and was very bright. it was orange, and its color stayed constant. its position remained constant with regards to the \"sphere\" and in my line of sight, making it seem as if both the orange light and the cloud-like sphere it came from were not moving with regards to each other or me. the orange light was coming from under what looked like a mushroom cap that was colored this cloud like white. the best way i can describe what the cloud-like shapes (that turned into the mushroom cap) looked like would be very similar to the vapor cone that forms around a jet as it breaks the sound barrier. very similar in texture and color. eventually, both the orange light and the cloud-like mushroom cap disappeared into invisibility. they more or less faded from sight as i was looking at them.\r\ni have not seen anything unusual since these two sightings, but because of them i find myself constantly watching the skies with an undying anxiety of seeing something similar. i know what i saw and i know it was no object, natural or man-made, that i had ever seen before or have ever seen since.","distance":"101-500 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Stationary,Straight-line path,Other","formattedAddress":null,"id":29274,"landingOccurred":false,"latitude":30.636697,"location":null,"logNumber":"US-05272011-0011","longitude":-96.3262868,"occurred":1298975400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cigar,   Sphere,   Square,   Rectagular","source":"MUFON","status":null,"submitted":1306560246000,"summary":"Low-flying box object seen several days before strange cigar shaped object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":87,"locationName":"College Station, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56291"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lake Orion","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was after we my husband and i had gotten out of our truck  and i don't know why but for some reason i looked up to sky and across the sky to the right of us came this disc- we watched as it came closer to us i could not believe my eyes- for it hovered above us for a few mins. with it lights circling on bottom -it was a gray color metal with a dome no sound i thought why doesn't it take me aboard i would like to see inside for i am a believer maybe that's why because i wasn't afraid it was about 20 feet above us in the center of our driveway so surprised we just stood still and watched the circling lights of many colors and as quick as it came it zoomed off to the right of us it left as fast as it had came no sound---i called the newspaper next day to see if anyone else had reported it and yes there were-it was in the library on record for awhile -i tried to open file again without any luck after all these years-my husband would never admit to it so i just let it go--for we know people look at you strange if you say anything about seeing it--but i know what i saw that night and it is not make believe it was a real saucer as i have described----","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Other","flightPath":"","formattedAddress":null,"id":29273,"landingOccurred":false,"latitude":42.7938552,"location":null,"logNumber":"US-05272011-0010","longitude":-83.2348712,"occurred":81414000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1306559931000,"summary":"Just like the pic on this page","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":14179,"locationName":"Lake Orion, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56292"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking out my window when i saw this object. in the past, when i see something strange, it goes away quickly. however, this particular time the object hovered back and forth for about 20 minutes. it was in the sky for about 10 minutes before i started filming. prior to filming, the object blinked red and orange. while i was filming, the object was only blinking two red lights. once, i thought the object was out of view i stopped filming. unfortunately i did not get on tape something very strange that i saw. i live in the fly zone of o-hare airport. so there are planes landing and taking off that fly by my condo. after i had turned off the camera, the object got close to an airplane. when it was close to the airplane the lights on the objected widened. this was a pretty strange occurrence. if you have seen something similar or would like to comment please do so on the youtube video. you may view the video at [link moved to additional evidence section/cms/tg]","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29271,"landingOccurred":false,"latitude":41.8854736,"location":null,"logNumber":"US-05272011-0008","longitude":-87.6250982,"occurred":1306209600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1306550182000,"summary":"Flashing light over chicago","tags":["flash","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56293"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Francisco","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Between 2 and 3 a.M. this friday morning a couple friends and i witnessed a small glowing light appear out of a group houses near the red + white radio tower by the twin peaks. it very quickly elevated and traveled out of sight, while seemingly close to us, and made no sound. we then witnessed 3 more of these appear out of the same spot, and follow more or less the same 'flight pattern', except one that hovered, blinked, and lost elevation, before rapidly going up again. we were on a rooftop and could see these would leave from a neighborhood not very far away, and would be out of sight within a minute. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29270,"landingOccurred":false,"latitude":37.7833295,"location":null,"logNumber":"US-05272011-0007","longitude":-122.4137655,"occurred":1306488600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1306548622000,"summary":"Small orbs rapidly travel low over the city","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"San Francisco, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56294"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On saturday, may 21st at approx 12am i noticed a glowing ball of light above our heads as i sat on a friend���s outdoor deck.  he lives on malden just north of wilson in chicago. four of us were there and someone thought it looked like a balloon.  this seemed inconsistent as to the way it was traveling, in my opinion.  the ���balloon��� was approx 100 ��� 150 yards above our heads traveling due north in a straight and steady pace.  it was traveling approx 20-30 mph.  i would say it resembled a chinese lantern in terms of the glowing, soft light.  it appeared smooth in texture.  i watched it travel until i couldn���t see it anymore and when i was losing sight of it the sky had a glitter effect where i thought the object should have been in the distance.  i was very impressed and curious about the sighting, whereas my friends just sort of dismissed the event.  (!!)","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29269,"landingOccurred":false,"latitude":41.8829136,"location":null,"logNumber":"US-05272011-0006","longitude":-87.6256482,"occurred":1305961200000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1306543588000,"summary":"I was sitting a friend's outdoor deck when we saw a glowing sphere traveling in the sky in a straight line due north until i couldn't see it anymore.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":6,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56295"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Judson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just typical behavior of the entities/ufos i've filmed for the last six months.  i had up to 15 around me, at a given time-very close.  i am editing that video for youtube.  some months back, your director called authorities on me, for sending in videos, or at least his email confirms that.  his name was \"dm\".  i am wondering why he would do that, since i am only trying to solve the ufo mystery as are you.  since then i have been stopped numerous times by authorities while filming, and am not confortable taping unless taping in a secluded spot. one time i felt my life was threatened by authorities, and they threatened to confiscate my equipment. i am afraid mufons calls to authorities have caused me distress.  my videos are all real.  it saddens me to think reporting a ufo to mufon, can result in getting in trouble with authorities who are seeing the same anomalies.  very sad.  please do not call the cops again, as they have been letting me be for a bit.  thank you. ufozmankato.  \r\n\r\n[[link moved to additional evidence section/cms/tg]  this is a brief portion of last night.  i an another witnessed 41 ufos, in one hour on 5/26/11 and videotaped a potion of them, soon to be on youtube.  thank you. ufozmankato","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29268,"landingOccurred":false,"latitude":44.205129,"location":null,"logNumber":"US-05272011-0005","longitude":-94.1875,"occurred":1306393200000,"potentialRelations":[29324],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1306540113000,"summary":"Link moved to additional evidence section","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Judson, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56296"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marmaris","country":"Turkey","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have just come back from holiday in marmaris, turkey. i was in my appartment on the balcony looking at the night sky when i thought i saw something moving slowly from east to west in the northern sky, after straining my eyes, because it was very faint i could see 3 orange lights in a triangular pattern, at first i thought it was a plane but then they started moving in an irregular pattern. at this point i called my friend who was in the room to come and have a look, i pointed them out to him which he also found very hard to see due them being very faint, but he did see them, they then formed a triangular pattern again but this time the distance between each point grew larger and then came closer again,they then became too faint to see with the naked eye. weather coditions were a clear starry night but the lights were nearer to the horizon against a lighter blue blackground as opposed to the darker blue higher up. we discussed what we saw and threw ideas up in the air as to what it could have been, there was no sound or fume trails like you would see with some sort of aircraft, so we thought how about lasers from a night club or hotel, but there were no clouds in the sky or sea mist or anything like that and we never saw it agin for the rest the holiday.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":29267,"landingOccurred":false,"latitude":36.863411,"location":null,"logNumber":"TR-05272011-0004","longitude":28.27504,"occurred":1306296600000,"potentialRelations":[],"rating":"Unrated","region":"Muğla","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1306537352000,"summary":"3 lights forming triangle","tags":["disc","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Marmaris, Muğla","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:56297"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Edmond","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Large cloked ufo burning through atmosphere as it look like, this very large circle ( full circle) came up all at once and move acrosse the sky and then went away, it was very high in the sky way past the clouds, this thing was very large as you can see by the tower, i am sure others saw this, it was there only for a few minunts, very weird, looks like a \"mother ship\"? just guessing there. are they comming or what?\r\nsee my picture","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":29266,"landingOccurred":false,"latitude":35.6626723,"location":null,"logNumber":"US-05272011-0003","longitude":-97.4748054,"occurred":1306090800000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1306535678000,"summary":"Very large ufo moving in upper level of sky","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29266_submitter_file1__ufo.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5,"locationName":"Edmond, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56298"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phủ Lý","country":"Vietnam","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"9/2001  theo toi ufo la no toi da tung thay lan 1 da goi bao cao thang4/2000,lan nay ufo xuat hien phat sang nhu ngoi sao mau neon sang hon ngoi sao khac ben tren day nui da xanh cach thi xa phu ly khoang 10 dam doc theo duong phu ly toi ninh binh khi do toi ������ vi tri ������oi dien ������ tren nui phia ������ong.No xuat hien phia tay kha lau va anh ������en cua no t������ t������ sang toi khi toi h������������ng tam nhin no moi lan nhu vay.Khoang thoi gian sau no dich chuyen t������ t������ ve phia nam khoang 22 m va toi hieu no dang co giang noi chuyen voi toi bang thong tin anh sang den va, ve phia do la nh������ the nao,(lien quan chuyen lan truoc cua ufo)khoang h������n 30 phut no an mat truoc khi toi dinh goi nguoi co the thay no,khi do toi rat binh thuong va su nhin nhan ra do la rat chac chan,nhung toi dien ta no chua chi tiet nhieu.Ufo theo toi no moi xuat hien o chau a va cung mot loai ma toi da thay truoc do.Toi khong noi no nhieu va khong noi chi tiet voi ai toi nghi noi ho cung kho tin.Den nay s������ viec ufo van bi an khoa hoc quan sat nghien cuu,toi goi bao cao nay neu co thac mac toi co the giai thich,(toi khong dua len bao luc do vi ly do ca nhan).5/27/2011 pm","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29265,"landingOccurred":false,"latitude":20.5411111,"location":null,"logNumber":"VN-05272011-0002","longitude":105.9138889,"occurred":1000450800000,"potentialRelations":[],"rating":"Unrated","region":"Ha Nam","reportedWeather":null,"shape":"Fireball,   Flash","source":"MUFON","status":null,"submitted":1306501822000,"summary":"9/2001 phat sang sao di chuyen ","tags":["none"],"timeZone":"Asia/Karachi","timeZoneName":"Asia/Karachi","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3542,"locationName":"Phủ Lý, Ha Nam","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56299"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Temecula","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. i saw a very bright light in the night sky, off the big dipper pan, in the direction of las vegas.  the light was like a halogen going out.  then i saw a pin light crossing the pan of the big dipper at a very fast rate, then it was gone.\r\n\r\n2.  i went out to my back yard to have a smoke.  i looked up and saw my event.\r\n\r\n3.  i always look at the night sky and that's when i noticed the bright light, followed by the moving pin light.\r\n\r\n4.  the object that got my attion was the bight light going on/off and it was followed by the pin light crossing the big dippers pan.\r\n\r\n5.  my reaction is one of \"what the hell did i just see?\".  that was during the event and after.\r\n\r\n6.  the way that i lost sight of the pin light was that it went into the night sky.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":29264,"landingOccurred":false,"latitude":33.5013491,"location":null,"logNumber":"US-05272011-0001","longitude":-117.1404648,"occurred":1306470000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1306483661000,"summary":"I saw a bright light go on/off from the big dipper's pan. then i saw a pin light cross the pan of the big dipper and it disappear.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Temecula, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56300"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Durham","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have been outside looking at star's one night and cought a lot of ufo's and they started to make me very nervous..Because i have gotten all of these saucer ufo's and they have a special interest in me for some reason..Here is the blog that has some of the photo's and some classified info..That the gov.Doesn't want you to know about..Goto\r\n   \r\n   [link moved to additional evidence section/cms/tg]\r\n\r\n\r\n     i have had experiances of waking up after i was dropped into the bed and stuff started to fall off of my bed headboard. i started to get really worried about the visit's..I still think something big is sstarting to happen. i just hope that from sending this out that my computer will stop being messed with the gov. who else would cause so many problem's???I have never had any problem's with my computer because i have online backup and the only way to delete my stuff like it did was a government opperative..\r\n      \r\n    i did get a call from the areospace company in nevada,in the desert...? i have never been there and they said that they were with mufon itself and mufon has never gotten in touch with me...Never !!! i just wish someone would come and veryfy what i have had to make several coppies of files and hide them with all my friend's and family..But they don't even know where they are hidden..For safety sake..Trying to save my own butt! \r\n   \r\n     on a lighter side...These ufo's are near as 25 feet from my front potch and are invisible due to the same technology that the government has stollen from the alein's...I have promminate knollege of such thing's and how to fly the ship..I was trainned in it..There are 2 ball's like in a mouse inverted into both sides of the navagation chair, along with control's to set window's, door's, light preferences ect..All are controlled by the navagation chair...I remember this from one of my night's and remember seeing fibreoptical cable in the wall of the ship..One of the pannel's were taken off to let me see and remember..Key word...Remember...Then all went black and i was once again in my bed...And i woke up after i felt myself fall into the bed. that is what woke me up.Hitting the bed on my belly.. it was atleast 6 inches off of the bed..You will know if you are good enought to niotice..Most people don't even wake up..I just wanted to let other's know that if they wanted to hurt us. it would be very easy to do be their mean's..\r\n      my blog photo's were uploaded from a simple digital camera and i had 3 of them and thet is why they disallowed them because other's might see ufo's and they dan't want that. it might cause a pannic..Thank you, mr. keith\r\n      pss...The mother ship broke throught the cloud's last night and looked like as big as the football stadium..I was sooo in awe, and fell backward's. i didn't have time to get my camera out when it shot off like a bullet, from a dead stop !!!! i thought that it was going to fall out of the sky  onto me...????? and that is when i got really nervous about doing this and i like ufo research... i couldn't get that photo because it was gone as fast as it broke throught the cloud's...It burned the cloud's and left an outline of the mother ship outline in the cloud's, dropped to just above the biggest tree's across the way, turned left,from facing north,still not flying around..Stationary.. imediately and didn't accellerate..It just shot off like it was mock 9 or faster...I am reporting this and giving up the information to higher sources...This is getting too big to keep to myself now...I have ufo video's that show a radar screen on my camera photo's and it doesn't have a way to do this...The program has limited resourses..But obvoiously someone has this radar screen showing all other alien ship's in the space around us and in the sky..I have wanted to work with the government but they have ignorred me even now !!! \r\n        \r\n     i just hope that i can get someone to veryfy this  on my computer so that this can get into the propper authorities..This is radar photo's of my camera that have had their(alien/ufo)imprint of their radar and where there ship's are in the sky...By singullarities that show other ship's and where they are established or where they are at. also showing our ship's and what we have in orbit !! i have proof of this and if you go outside and use a digital camera you can see this too..Thank you sir(s) and have a good day..I will have to do some work to photograph the radar video's to know the massive ship's that are in our outer orbit of space. \r\n                             mr. \"h\"","distance":"Unknown","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29263,"landingOccurred":false,"latitude":36.0024029,"location":null,"logNumber":"US-05262011-0011","longitude":-78.889509,"occurred":1296079800000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1306458085000,"summary":"Ufo's have been buxxing my home for year's now...Watching me and my dog..","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29263_submitter_file1__005UFOslightsmoving.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":120,"locationName":"Durham, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56301"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tempe","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have been recording these events and sightings for nearly a year now and the latest is documented and published on youtube as well as my own personal blog *(link removed--cms/sg).  i have many such tapes.  the story behind my sighting on saturday 5/21/11 and my associated video are as follows:\r\n\r\nwe begin posting again today after over a month off from writing and posting. this post will also be seen in the next few days as the lead post on my new site *(link removed--cms/sg) as it opens. i mention in the introductory remarks on this video that i believe it to be one of the most significant videos on the subject of ufos or extra terrestrials that i have ever seen. i believe that to be true for one reason and one reason only: this video proves that the objects that can be seen by anyone hovering over us at night in phoenix are not easily dismissed or explained away as some have done as \"stars\" or \"satellites\". these orbs/ufos align themselves in formations (in this instance a triangular one) and they move. this is not a happenstance of nature but requires some degree of intelligence in order to do so. purposeful alignment and motion are not mere accidents, those acts require thought which is without question what this video proves.\r\n\r\nthis video was shot late saturday night on may 21, 2011 as i was showing a new friend of mine the orbs that hover above us up close with my night vision camera. after capturing a few minutes of tape i decided to point the camera at a triangular alignment which is always in the sky to the east of my house and let it roll thinking that i would come back in about 10 minutes and shut it off. well, i started the tape and went inside and forgot that i had a camera rolling until several hours later when i went out and discovered that i had left the camera on and that it had used up the entire hour of tape that i had. i took the tape inside and reviewed it and couldn't believe what i was seeing. these are my observations after viewing this tape:\r\n\r\norbs in a triangular alignment that appears stationary but in reality is moving very slowly.\r\n\r\nthe orbs in the formation (and indeed all that i have captured on tape thus far) move at an incredible rate of speed. they actually spin in a circle creating a whirling effect. this can clearly be seen as you observe each of the three orbs in this night vision film. all of them have a whirling energy that encircles them and is in fact created by them.\r\n\r\nmany other smaller orbs can be seen almost as a clustering of objects near the triangular alignment. you can clearly see flashes of light, movement, traces of very fast flying objects etc. some of which could be created by these smaller orbs or they could be something else, namely rods.\r\nabout 2/3 thru the tape a very strange thing appears. a very close flying rod appears for just seconds on camera. you can clearly see the details of the rods body as it flies past my lens. rods for those of you who are unaware of them are creatures that exist on earth that no one has ever captured for examination hence we really don't know what they are. they appear to be flying insects as they look like centipedes. they are often called flying fish. they are unable to be seen with the human eye as i understand it because they move too quickly for our eyes to perceive them flying at what some estimate to be speeds over 1,000 miles per hour. no rods have ever been caught or examined alive or dead and typically they are only viewable with camera equipment. they are often seen in association with alien craft and orbs.\r\n\r\nthis video is an edited version of the 59 minute tape. we are also posting the entire 59 minutes on youtube today along with a time elapsed version which boils the entire hour of footage down to approximately seven minutes and another that further time elapses the film to only seven seconds. i hope you find this video to be as profound and fascinating as i do. it certainly resolves some open questions for me and it raises far more. enjoy.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":29261,"landingOccurred":false,"latitude":33.4272104,"location":null,"logNumber":"US-05262011-0009","longitude":-111.9359454,"occurred":1306038600000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1306457097000,"summary":"3 orb objects in triangular formation near my home in tempe az","tags":["none"],"timeZone":"America/Phoenix","timeZoneName":"America/Phoenix","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29261_submitter_file1__otc0511.wmv","http://www.mufoncms.com/files_jeud8334j/29261_submitter_file2__Snapshot3(5-23-20119-27PM).jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":4,"locationName":"Tempe, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56302"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hayward","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We returned to station after a call on our 24 hour shift. as i exited the ambulance to back my partner into the building i noticed a bright red star in the eastern sky. i noted to my partner to take a look, he exited the vehicle and noticed the same star. we talked about it for a second and thought it to be mars, but neither of us are very adept in astronomy and were unsure. as we looked at the star, we noticed that a second star. this star was fairly dim compared to the red star and we noticed that it was moving towards the red star. as we watched the smaller object moved north towards the red star, then descended underneath. it passed the red star completely traveling northward, then ascended upwards as if it was circling the red star. at this point the smaller star just faded from view. as we watched the red star had 3 pieces break off and drop towards the ground in three different directions and the main body of the red star faded from view. this event lasted approximately 3-5 minutes. \r\n\r\n ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":29260,"landingOccurred":false,"latitude":37.6744905,"location":null,"logNumber":"US-05262011-0008","longitude":-122.0794064,"occurred":1306404600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1306438368000,"summary":"Red star like object breaks off into smaller pieces and disapears with another object circling.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Hayward, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56303"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Newberry","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"These are simply intended for wildlife.Entire evening is on disk\r\n\r\n1.  sleeping in my house\r\n2.  looking for wildlife pix\r\n3.  un identified flyinf bird/insect\r\n4.  possibly searching for food.  lots of mayfly looking insects around in \r\n    morning light, but not so aparent after dark.\r\n5.  i was looking at wildlife as every morning. then sprinkelers, then i \r\n    see colors not previously seen.  then exactly what you will see.  im\r\n    contacting you for clarification.\r\n6.  turned canera off","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29259,"landingOccurred":false,"latitude":34.2745833,"location":null,"logNumber":"US-05262011-0007","longitude":-81.6187178,"occurred":1301079780000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1306437854000,"summary":"Photos self explanatory","tags":["contact"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/29259_submitter_file1__PICT0014.JPG","http://www.mufoncms.com/files_jeud8334j/29259_submitter_file2__PICT0015.JPG","http://www.mufoncms.com/files_jeud8334j/29259_submitter_file3__PICT0025.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":62,"locationName":"Newberry, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56304"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St George","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On 4/26/11 i happened to be having trouble sleeping so around approximately 0345 hours i decided to go outside and sit on my back pourch since the weather was so nice.  the sky was very clear with an occasional cload which could easily be seen.  i was laying on my back looking straight up at a particularly bright star (the moon was off to my left)and just basically relaxing and star gazing. i started to get stiff laying down so i sat up facing south.  i happened to look straight up over my head again and noticed what appeared to be a very bright star which i thought was the same star i had just been looking at but this one was much brighter and i noticed it was moving at what appeared to be a fairly high rate of speed towards the south.  i observed the star i had been looking at before which was stationary and less bright.  i then noticed the very bright light directly above me was followed by another bright light (much brighter than the surrounding stars).  the two lights were off set and then i noticed the third light almost immediately to the west of the first light and the entire formation appeared to be moving as if it were one object. the lights formed a triangular shape (the sides longer than the base)and appeared to me as if it were a triangle flying backwards (leading with the base).  the object appeared to be extremely large and traveling at a much higher rate of speed than any satelite or aircraft i observed before or after.  the triangular shape was heading south south east.  i watched as the first light(east side) of the object appeared to reflect the moon light and got brighter and the dimmed as it traversed the sky almost directly away from me to the south. there were no visible clouds in the path of the formation and it was completely silent.  the lights did not blink or change color.  i watched the formation for about three or four seconds and then reached down for my cell phone which was on the ground next to me to try and take video of the lights.  i looked down for a second to retrieve my phone and when i looked back to photograph the object, it was gone.  i was very disappointed to not get a video.  i took two photos with my cell phone of the area of the sky i expected the object to be but nothing turned out.  the time on my phone was 0402 after i tried to take the video.  i am not sure if it was a formation of three seperate lights or if it was a triangular object.  all the lights appeared fixed in relation to each other.       ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":29257,"landingOccurred":false,"latitude":37.1027278,"location":null,"logNumber":"US-05262011-0005","longitude":-113.5714256,"occurred":1306407720000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1306421492000,"summary":"Three brite white lights which appeared to be a triangular shaped object traveling south south east ","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"St George, Utah","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:56305"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salt Lake City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside behind my aprtment having a cigarette at exactly 12:13 am, sitting in a foldable camping chair looking at stars in the east/northeast area over slc ut. as i was watching a few satellites traveling in their normal pathways, a triangular object with a light in each corner caught my eye traveling at high speed (no sound) from west to east. its line of travel was in a straight line for about 4 seconds and it suddenly shifted to the south on a 20 degree angle very quickly, as though it was making a course adjustment or such. it made another shift to the south a moment later and continued very quickly to disappear from sight to the east over the wasatch mountains. \r\n\r\ni have seen a video of a triangle object with a light in each corner on youtube... though wasnt convinced it was legit... i now know it is. at least the object i saw tonight was real... it made no noise i could hear, traveled at an extreme speed, and made course corrections which no known in-flight vehicle can perform to my knowledge.\r\n\r\nit was by far the most amazingly tantalizing visage of my 38 years. i was astounded, and thrilled by my experience. unfortunately i was unable to photo the object... though i can say with certainty, i did not have enough time to even unlock the screen on my phone nor would it have done justice to the object because of the speed at which it traveled through the air space over salt lake. \r\n\r\nif you dont look... you'll never see.","distance":"501 Feet - 1 Mile","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":29256,"landingOccurred":false,"latitude":40.7638793,"location":null,"logNumber":"US-08022011-0045","longitude":-111.8875574,"occurred":1306393200000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1312344774000,"summary":"Triangular with light in each corner ufo traveled west to east over salt lake","tags":["ufo","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":68,"locationName":"Salt Lake City, Utah","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:56306"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cabo San Lucas","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on vacation in cabo san lucus sitting and relaxing in a hot tub with my wife. i happened to look up into the sky and saw a bright object moving slowly from the west. i am an amateur meteorologist at home so i am used to viewing objects in the sky. it was daylight and i used some cirrus clouds that it crossed and so i realized that the object had to be more then 30,000 feet high as it was in back of the clouds. the light was bright and strobe like pulsating very fast. both my wife and i watched the object for quite a while. i also used part of the building as reference as it approached from the west then drifted off to the west-southwest. the object never rose any higher then say 60 degrees above the horizon. i wish i had my camera!\r\n\r\nthis is not the first time i have seen a ufo in cabo san lucus. a time before\r\nsome 5 years ago in october both my wife and i saw an object when we were having dinner one evening on the beach at a popular taverna called the office. there i saw a soft orange object moving very slowly from the east to a point at about 75 degrees above the horizon then turned north. again we both watched the object for probably 30 minutes. i called on the waiter and jokingly asked him what he thought about the object. he told both my wife and i that it was the gold returning to la paz. my wife and i have been to cabo some 7 or 8 times. i can tell you that i will not be without a camera again there!\r\n\r\nhave you had many reports of ufos there?\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":29255,"landingOccurred":false,"latitude":22.8954927,"location":null,"logNumber":"MX-05262011-0003","longitude":-109.9115271,"occurred":1304146800000,"potentialRelations":[],"rating":"Unrated","region":"Baja California Sur","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1306399740000,"summary":"Bright object in the western sky moving from the west then heading sw","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":26,"locationName":"Cabo San Lucas, Baja California Sur","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56307"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Winchester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Friends have told me that i should contact mufon with my stories. i have had several events in my life. the one above is just one of the most recent. the most dramatic was in about 1974 spring or early summer. i came home from a date and arrived home at about eleven o'clock. i got out of my car and walked to the front of the car and all of a sudden the area around me for about twenty feet or so lit up like daylight. i looked up and i saw a light coming down at me. i ducked and the next thing i knew it was gone. \r\nnow when i got home my mother was still up. i could see the light on in the living room when i pulled into the driveway and she said she thought she heard me pull in. \r\n but when i got into the house i found it was about an hour and fifteen minutes later. and my mother was not up and the house was dark.\r\ni never told anyone about this event for many years. except for my mother and she told me she heard me pull in that night but wondered why i didn't come in right away.\r\nthe next event took place in broad daylight on rout 81 south outside of chambersburg pa. the traffic on the highway came to almost a stop and many people pulled over. i and my wife at the time also pulled over. what we saw was an orange disc shaped light passing up and down through the clouds. we watched this for about ten minutes and then moved on. we where heading into maryland to the cumberland area. when we topped sideling mountain, the sky was full of military jets criss crossing the sky, i have never seen so many jets in such a small space of sky in my entire life.\r\nthen comes the story above. i used to have to go outside to smoke. i went out about three in the morning. this took place the same year that we could see the space shuttle pass through orion. so im guessing at all these dates. but this took place after the shuttle event. where the place i worked at was on the approach to two airports. one was a local public airport in winchester va. and the other was a miitary airport in martinsburg wvs. planes would pass over the place where i worked and then tern right or left to the airport they where going too. \r\nthis particular time this light come over and it seemed to move slower than usual and the light didnt radiat as i thought it should at first i assumed it was a landing light but it was round and landing lights at that angle would not be exactly round and it was a bit larger. it moved out about forty five degrees from me and i realized i heard no engine noise. at that moment it shot straight up and out of site in less than a second. now it was a clear night and i could see clearly the stars. and this thing went from a large light to nothing in a flash.\r\ni have also seen a cigar shaped object south of winchester in the strasburg virginia area at about 5 in the evening. \r\nas i said i dont have exact dates or times or witnesses except for my ex wife for the event in pa. and i cant see how this information would be of any benefit. but because my friends said i should still report the events i now have. also for many years i would have experiences where i know i was awake but could not move. i had what i thought where dreams of flying around the house and through the walls and ceiling etc. and i have had experiences where i dreamed i was in the wall and could hear my mother and father talking and the next day found out that what i though i heard was what they where talking about. i have not had those experiences for many years however.\r\nsorry to waste your time with all of this. but now i can tell my friends i contacted you all.\r\n\"d\".","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Other","formattedAddress":null,"id":29254,"landingOccurred":false,"latitude":39.1924197,"location":null,"logNumber":"US-05262011-0002","longitude":-78.1563641,"occurred":830847600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Cigar,   Disc,   Other","source":"MUFON","status":null,"submitted":1306396094000,"summary":"Light moved slowly overhead, and suddenlty shot straight up in less than a second it was out of sight","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":5504,"locationName":"Winchester, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56308"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mandaluyong City","country":"Philippines","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am 17 years old/ first year college student going second year. i live in the philippines. i'm completely sane and in the right state of mind. i don't do drugs nor drink alcoholic beverages. i don't have any mental illnesses. i wasn't hungry nor was i thinking of any personal problems at that time. in short, i was very very sure and certain of what i saw and i was not imagining things nor am i making things up (why would a teenager like me spend time here if i was making things up). \r\n\r\nanyway, here's what happened (may 25, 2011, summer time/vacation time in the philippines). we were on our way home. starting approximately 8:30pm, i was with my mom just sitting in an immobile car(in a parking space of san miguel corporation in mandaluyong city, philippines) with the doors all open(the car's engine hasn't been started) because we were waiting for my sister. i was sitting in the left side of the backseat beside the open door with earphones only on my right ear, listening to the radio while my mom was in the front passenger seat trying to get some sleep. south of our position was a building being constructed (at that time workers are still busy working at the top floor and i could tell from the lights and sounds of hammering, drilling, etc.). it was almost finished so it was very high. that building is a condo called \"sonata\" with address san miguel ave cor lourdes st mandaluyong city, philippines. then at approximately 8:45 pm, a worker yelled and i don't know what that worker was yelling about so i looked up at the direction of \"sonata\" (at the top floor where the workers at) and at that moment i saw what i first thought was smoke or some gray cloud high in the sky moving at my west direction of our car. it was located between the position of our car and and the building of sonata and was moving towards the direction of sm megamall. but then as i stared at it and concentrated, i was beginning to think and see that it wasn't a puffy gray smoke or cloud. it actually has a distinct solid shape-- v shaped and i began to notice some very faint yellowish lights (that just looked like far away stars covered by a thick cloud since it's faint) underneath its cockpit/head (vertex of the letter v). it was as slower than the speed of a passenger airplane in flight. it is flying very high (i could tell because at my view it, flies higher than the tall buildings around it---namely sonata and san miguel properties which happen to be beside each other) but it was as huge as my view of an international airplane flying 10 feet above me. what's weird is that at it's size, i don't hear any sound from it -- no sound of wind nor engines. then with all that information, my mind processed that it's nothing normal so i my heart started to beat fast and i feel adrenaline rushing through my body (same as feeling of anxiety), my eyes opened wide but i was in a state of great shock (my body was temporarily paralyzed and stuck in my position as i stared at the moving object)-- i was just sitting there and i wasn't even focusing/listening to the radio on  my right ear anymore. then, approximately 5-10 minutes later still in that state of shock/not moving, i began to move and wake my mom up and pointed at it's direction. as my mom was bending backwards to my door (while she is still sitting at the right passenger seat of the car), my mind gave me the thought to get a photo or video through my phone. i was trembling as i handled my phone and pressed buttons just to get to its camera function (because my mind was panicking, i was even able to click the wrong applications and resulted in delay time). but at that very moment, the object was already approximately above st. francis road and then it smoothly turned left towards the direction of st. francis of assissi church -- so it began to be covered by the building of san miguel properties. it was now covered by the building before my mom could even see it and before i could even get to the camera function of my phone. i wasn't able to think of running towards it (at that time) because i can't believe what i just saw. i then  started to tell my mom what it was and i pondered about what that could be. i was forcing myself to think that it was just some man-made, possibly military air craft but i couldn't think of any man-made craft that fit my description (especially my description about its silence in moving and it's unbelievable size). then, 3-5 minutes after i lost it, my sister arrived and we went on home. as we arrived home i told my family about it then i quickly rushed to my laptop and searched in google.Com and found i was shocked to find these, when i was hoping to find man-made air crafts:\r\n\r\nhttp://www.Ufocasebook.Com/2009/californiatrisightingnov2008.Html\r\nhttp://www.Examiner.Com/ufo-in-national/v-shaped-ufo-under-1-000-feet-smoothly-gliding-over-grandview-missouri\r\n\r\nthose fit my description but i didn't see any red lights on it's v-structure. also, i was certain that it was v-shaped not triangular.\r\n \r\nhere's a map of the area:http://maps.Google.Com/maps?Client=firefox-a&rls=org.Mozilla:en-us:official&channel=s&hl=tl&biw=1280&bih=674&um=1&ie=utf-8&q=san+miguel+properties&fb=1&gl=ph&hq=san+miguel+properties&hnear=0x3397ca03571ec38b:0x69d1d5751069c11f,maynila&cid=0,0,12978885034006348336&ei=dcjdtyl3misgvaoo_oxibq&sa=x&oi=local_result&ct=image&resnum=4&ved=0cdyqnwiwaw\r\n\r\nby the way, the \"a\" or target in the map is the building of san miguel properties which i was mentioning above. at it's right is the sonata building that is still being constructed. then approximately 45 degrees to the right and 50 feet from the building of san miguel was our car. our car was facing north towards st. francis square.\r\n\r\ni am just getting finished in writing this now may 26,2011, 12:06 pm philippine time (just a day after i saw it). right now i am still in shock and i think i'll never forget about that until i know what it was (because i am a very curious individual). i hope someone investigates on this and i hope the workers on the top floor of sonata witnessed it too. if ever it gets publicized, i am willing to step in as a witness even though i'm this young.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":29253,"landingOccurred":false,"latitude":14.5794443,"location":null,"logNumber":"PH-05262011-0001","longitude":121.0359174,"occurred":1306381500000,"potentialRelations":[],"rating":"Unrated","region":"Metro Manila","reportedWeather":null,"shape":"Boomerang,   Chevron","source":"MUFON","status":null,"submitted":1306393866000,"summary":"It was v-shaped, gray(hard for just anyone to notice in the dark sky unless he/she stares at it like i did), really huge, moves at a very slow pace, has faint lights, glides smoothly (no sound) and flies at very high altitude","tags":["sound","lights"],"timeZone":"Asia/Hong_Kong","timeZoneName":"Asia/Hong_Kong","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mandaluyong City, Metro Manila","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56309"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Solid red light in the sky heading from north east to the south west.\r\n\r\nit appeared from the north east over the trees and headed south west at a constant speed. it was pretty far away. i could not see a shape, just a solid red glowing light. no other lights on the craft. i watched until it went out of sight.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":29252,"landingOccurred":false,"latitude":30.2961708,"location":null,"logNumber":"US-05252011-0018","longitude":-97.7389543,"occurred":1306387200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle,   Other,   Unknown","source":"MUFON","status":null,"submitted":1306392181000,"summary":"Solid red light - central austin","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56310"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Zionsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"13 year old son, getting ready for bed looked out back patio door and observed lights/objects moving across the sky from southeast to northwest direction.  wife quickly joined observation and called me up from the basement office to see.  objects were dark and not in a highly definable shape, although each one had a visible flame or fire. speed was steady, not unusually fast.  direction appeared to be linear, no apparent horizontal or vertical movement during observation. did view objects through binoculars, still could not identify.\r\n\r\nafter last object no longer viewable due to obstruction by home, went to front lawn to see if objects were still visible.  no sign of objects.  \r\n\r\nshortly thereafter sounds similar to gunfire or fireworks were heard.  do not recall number of reports.\r\n\r\npresume this was some kind of fireworks display, no way to verify.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":29250,"landingOccurred":false,"latitude":39.9549633,"location":null,"logNumber":"US-05252011-0016","longitude":-86.258287,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle,   Fireball,   Teardrop","source":"MUFON","status":null,"submitted":1306387226000,"summary":"Observed line/series of approximately 8 objects, evenly spaced in line, moving from from southeast toward northwest.  objects unrecognizable, small flame visible each object.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3098,"locationName":"Zionsville, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56311"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Fayetteville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was standing at the edge of our property by the barb wire fence looking westward out into a field. i was watching the clouds of an approaching storm. there was no thunder or lighting at this time. it was around 11:00 a.M. on may 22 or 23 2011. i can't recall which day it was exactly. i'm writing this just a few days after i saw it. i was not expecting to see anything. something in the sky caught my eye. i saw it against some dark clouds in the western sky. the object was flashy and seemed to shake or hop up and down in a rapid motion throughout it's flight. i was unable to make out a shape as it was visible for such a short time. it could have been any shape, but if i was to pick one, i would say it was probably oval in shape. it traveled horizontally across the sky in a north to south direction. it seemed to pulse slightly with a bright light. it appeared to be higher in the sky some distance above the treeline. i would estimate it to be 200 feet or more above the ground. it was quite small looking from where i was on the ground. it could have been a few meters across or several meters across. there were no colored lights on it only white. the light remained on the whole time, although it seemed to dim and get bright rapidly, thus the pulsing. it didn't seem to change height but maintained a straight line direction across the sky. i saw it come from behind some trees. it's important to note that the object appeared to be a fair distance behind these trees. it then continued in it's direction, disappearing behind another tree appearing quickly on the other side. while still continuing in this direction it disappeared behind a cluster of trees and didn't reappear in the sky. it's also important to note that around the time the object was out of view behind the second tree i held up my cell phone to take a picture and that's when the object disappeared behind the last trees and didn't reappear. all of this happened within 4-5 seconds. the object went across the sky fairly fast. it did not resemble any natural or manmade known object that i can think of. i have studied videos online of satellites, meteors, comets, falling stars, flares, aircraft, balloons, ball lightning, sun dogs, and other phenomena, none of which bear enough resemblance to the object i saw, to say it was any of those things. i at first thought that it was a bird. (it's hard to believe that i saw a ufo as i've heard of few ufo sightings in arkansas.) however, i can think of no bird that lives in our area that looks like a light flashing in the sky. i am at a loss as to what the object could be. other things worth mentioning are that i had a dream a couple of weeks before, that i saw several ufo's out in the same field where i saw this object. also noteworthy, there were cows farther out in the field which looked like they could have been beneath the object. i hope whoever reads this takes this sighting seriously. when i saw the object i felt excitement and intrigue. i was in disbelief of what i was seeing. the longer the object was in the sky, the more i believed that i was witnessing something unknown. i'm not saying that this is for sure a ufo, but if no other explanations can come close i think it probably was one. i just wish i had been able to capture this experience on film. had it stayed in the sky a few seconds longer, i may have been able to record a video of it on my cell phone. i think it's a bit ironic that it disappeared as i held up my cell phone.  this is the first time i have ever seen anything in the sky that resembles a ufo. it's a bit embarrassing to admit to seeing something like this because i'm afraid people will think i'm nuts. i look forward to hearing what you think about this sighting. please email me something back regarding this event.\r\np.S. this sighting was outside of town. i live in a rural community called wheeler on a dirt road. wheeler is located just outside of fayetteville, arkansas.","distance":"101-500 Feet","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":29249,"landingOccurred":false,"latitude":36.0645795,"location":null,"logNumber":"US-05252011-0015","longitude":-94.1488963,"occurred":1306173600000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Flash,   Unknown","source":"MUFON","status":null,"submitted":1306384996000,"summary":"Bright, flashy object visible for a short time. traveled horizontally at a fast pace.","tags":["flash"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Fayetteville, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56312"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I'd had extensive dental work done the day before (a number of x-rays, root canal, etc.) and one of my teeth was aching. it was about 2:00 a.M. and i was having trouble sleeping and rather than bother my wife i left the master bedroom and lay down on the futon in my study. i finally fell asleep only to be awakened by a strange buzzing/humming noise. at first i thought it was coming from outside, an airplane maybe. \r\n\r\nbut after a few seconds i realized it was in my head. it sounded like a microwave oven, but without the heat. i couldn't move even though i was fully awake. my entire skull was vibrating. it wasn't unpleasant, just weird. after a minute of this i began to get scared. i thought i might be having a medical event of some sort. with great effort i was able to move one arm and reached my wristwatch on the end table (it's a citizen eco-drive with luminescent hands). it was exactly 3:08 in the morning. \r\n\r\nas i stared at the watch the humming slowly subsided. once it ended i could move freely again. i sat up and looked around. the house was completely still. only the light of the single street light across the street broke the darkness. \r\n\r\ni got up and walked from room to room, but nothing was out of the ordinary. my wife was sleeping soundly. there was no sign of the cats. then i thought i heard something from the roof. i went to a window overlooking the back yard and looked up at the sky. it was an overcast night, but i was certain i saw the curve of something rather large over the house. it was very dark, but it caught the light from the street just enough for me to think it was metallic of sort. it couldn't have been more than thirty feet above the roof (our house is a rancher). i hurried to the back deck but by the time i opened the slider and looked up again, the object was gone.\r\n\r\ni didn't know what to do. i went back inside and went to the bathroom and looked at myself in the mirror. there were droplets of blood coming from my right nostril. but, other than that, i didn't appear to be any worse for wear. i returned to the study, turned on the tv for a while and stared at the screen for quite a long time, not taking much of anything in.\r\n\r\nto cut to the chase, about two weeks later i went out to get the sunday paper and noticed that some of the pine trees nearest my house appeared to be dead. the needles were all reddish brown. i called an arborist i'd done business with in the past and he took a look at them. he agreed that they were dead and should come down (these trees are 60+ feet tall). after he dropped the first tree he came to and asked me how long they'd been dead. i said i thought couple of weeks. he said this wasn't possible because these trees were totally devoid or sap and moisture. in his experience it takes months, maybe a year for a pine to dry out this completely. i stood by my story. they were all still green around christmas time. he said i must be mistaken. so, i asked him, what do you think killed the trees? he said it was either last summer's drought or insects. i pointed at all of the neighbors' trees. they are all healthy and thriving. not a single one for two blocks around is dead. he shook his head and said it was strange, but he didn't know what else to say.\r\n\r\nof course i didn't tell him that i thought might have ufo killed them. that's the last thing i need in my neighborhood.\r\n\r\nas a ps i'd like to add that strange things have been happening to us ever since i saw a ufo a few years ago. i won't go into them here. i feel like i'm living in my very own sci-fi movie. and i don't much like it. even my wife has mentioned odd dreams and thoughts.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":29248,"landingOccurred":false,"latitude":37.4366034,"location":null,"logNumber":"US-05252011-0014","longitude":-78.6472642,"occurred":1294916880000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Disc,   Teardrop,   Unknown","source":"MUFON","status":null,"submitted":1306375606000,"summary":"Unknown craft above house, killed four tall pine trees","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":132,"locationName":"Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:56313"}],"last":false,"totalElements":82758,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1859}
