{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Cape Coral","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just got home from work on the phone with my parents, looked up in the sky (as it's normal for me to look at the stars at night) i look up at the sw sky (not far from the big dipper) i see a strange star-like object high in the sky, it appeared low enough to not be a satellite, but too high for a plane.  it was strange because it would get brighter then no light at all, then it would blink again slowly getting brighter then dimming completely. the light patterns seemed to be a little different each time, and lasted for different lengths of time.It did this several times all while traveling in one direction.... \"sounds like an airplane!\" yes i know... but this is where it gets strange... \r\n\r\ni tell my parents i see something in the sky and i need to call them back as i wanted to take video on my iphone 7plus. it was too far away for the camera to pick it up clearly. i called for my roommate to come look,just before  he came out of the house, the light disappeared... and then bam! a short beam of light appeared. it was bluish white in color, it was horizontal in the sky right where the object was seen, it was a thick beam of light that flashed for a second. it was much bigger than the actual object i witnessed. then both the beam of light and the ufo disappeared completely. that fact alone, tells me it wasn't an airplane.  airplanes do not disappear in thin air. \r\n\r\n i posted the experience on my facebook that same night as i wanted to document the crazy ufo i had just witnessed. ","distance":"501 Feet - 1 Mile","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Other","formattedAddress":null,"id":82306,"landingOccurred":false,"latitude":26.627255702587426,"location":null,"logNumber":"US-02242017-0003","longitude":-81.98683020982651,"occurred":1455657300000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1487900990000,"summary":"Night sky, star luke object random blinking and brightness patterns. the. disappearing after a long \"line of light\"","tags":["video","sound","ufo","flash","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487919346416,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":69,"meanvism":13,"meanvisi":8,"mintempm":16,"mintempi":61,"minvism":3,"minvisi":2,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":69,"meanvism":13,"meanvisi":8,"mintempm":16,"mintempi":61,"minvism":3,"minvisi":2,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}]}},"zipcode":"33991","daysBetweenOccurrenceAndSubmission":373,"locationName":"Cape Coral, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27424"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Albuquerque","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me & my aunt went outside to test the theory of \"calling\" u.F.O's once again, so we stood on the pool deck & \"called\". we noticed the object through some trees, as it looked like a helicopter or plane with very bright lights taking off, until we noticed it stayed stationary after moving for about 5 minutes. as i said, we thought this was a plane, or helicopter, but it had to be something else. when it first started taking off, it was behind some trees, it went straight up & hovered for a few minutes, the object then proceeded to move higher, & as we were filming, it moved south, then north, then stationary. experimentally we asked the object to come close in which case we believe it did, as it became brighter & more visible. we felt humbled by the craft, & excited. we watched as a helicopter flew to the object with no lights on, except the red beacons. they helicopter seemed to almost run into the object, & after going to the said object, the helicopter flew west towards my direction, & passed over us. we also witnessed a few planes fly by/near the object & would turn their lights off, which is against air regulation, especially at low altitudes. we couldn't watch the object any longer due to a recent cold-front, so we headed inside, about 20 minutes later, we went out to see if it was still there, & it was gone. but we captured video & pictures.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":82305,"landingOccurred":false,"latitude":35.04713150452265,"location":null,"logNumber":"US-02242017-0002","longitude":-106.68958979912108,"occurred":1487887200000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1487900676000,"summary":"Venus like light goes from airplane takeoff height, straight up, then hovers/moves.","tags":["video","lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1487919046253,"urls":["http://www.mufoncms.com/files_jeud8334j/82305_submitter_file1__1006712.JPG"],"weather":null,"zipcode":"87105","daysBetweenOccurrenceAndSubmission":0,"locationName":"Albuquerque, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27425"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Healdsburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I first noticed this bright light almost exactly a month ago from the time of this writing. i was on the back patio of my house smoking a cigarette a little after 8 pm on january 24th 2017, when i saw a bright light moving around in the sky. i first noticed it because it was much brighter than any other light in the sky. initially i wrote it off as a drone but thought it was a little weird to be flying a drone at night. but the more i watched it, i became convinced that what i was watching couldn't possibly be a drone. it moves fast, quickly changes direction at almost perfect angles, and comes to a halt without slowing down. it usually starts as an incredibly bright white light, brighter than any other star in the sky. i've seen it go from bright white to a blue white, green, and almost orange red and it seems to change colors randomly.   i've observed this now over 10 times in the past month. it's usually in roughly the same area. i've watched it fly around for well over an hour on multiple occasions. the 21st and the 22 of february i saw two of these lights in different areas of the sky. i've never had any real reactions to the object, other than frustration of not being able to figure out what it is. the couple of times that i've stood outside long enough to watch it disappear, it eventually gets further and further away until it drops off the horizon. my wife, mother in law, father in law, and brother in law have all also witnessed it. ","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":82304,"landingOccurred":false,"latitude":38.6139658,"location":null,"logNumber":"US-02242017-0001","longitude":-122.8650409,"occurred":1487878200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487894747000,"summary":"Bright light moving fast and changing direction, seen multiple nights over a month","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1487918746324,"urls":["http://www.mufoncms.com/files_jeud8334j/82304_submitter_file1__201702231917591.mp4","http://www.mufoncms.com/files_jeud8334j/82304_submitter_file2__201701242026221.mp4","http://www.mufoncms.com/files_jeud8334j/82304_submitter_file3__201702231934431.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Healdsburg, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27426"},{"address":null,"addressResolution":null,"altitude":"Landed, Over 500 Feet (under cloudcover)","city":"Vinton/utah","country":"US","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was a cathlic youth, about seven or eight when i saw the first one. i thouth that it was an angle. it was high in the sky and very shiny. it didnt move and neither did i four minutes or so then it was covered with clouds and i went to school.  second time, i was on a golf course, about fifteen years old. it hung is the western sky, it changed colors from silver to gold. took off very fast  and that wa that. in the 1970s i was working in a town about fourty miles from waterloo. i had driven the same road four five years .On this one day as i was going around this set of hair pin curves an very bright hit mealmost instantly i went paralized.I remember floting over this fence w/ five or six small individuals on either side ofmenext thing i remember is laying on this metal table in a room with lots of buttons on the wall..The swmall individuals were around the table, then a taller skiny person came behind me and said that i wasnt right.He didnt speek but i could here his voice.From here i am not sure if i was taken into another room w/ two other people, or if this was a seperate event. ths event there were two people in the room siting on a metal bench about three feet away from me. i was naked on this table and was looking at thislady about in her mid thirties. she was looking me right in the eywe. she had a cotton dress, black socks and black shoes. the had dark eyes an;d dart short hair. the ezxpression of nere face was one of being lost. her husband i assumed was siting next to here with his arems on his knees. he was wearing a red and white shirt and a kent feed had on. than one of the small grays asked someone who i couldnt see if the wanted to take fluid samples it must o ben yes because in about four seecond i gave a discharge. that is all i rember of these experiances that day i experianced a burning sensation in my groin ares my left arm and the back of my neck. i h;ave tow small objects in my left arm. one i dug our when it was close to the serfice of my arm. it did not bleed as i would have expedid. insted there was a round ;hole where it had been.  the other one is still in my arm. some times it is close to the serfices other times i can hardly see it. since then i have noticed severalother strange objects. it is almost that they know what i am thinking.  i get this feeling whene the around. i start looking around and i will see somthing that is strange, lights and what ever.  during a golf tournamen;t, i observed a round gold objein the sky. it just haan;ged there four about a minuted then ducked behin g a cloud back in two thousend 15 i was driving down the interstate, at 3.33/400 in the lmorning when this very britht light almost ram em off the road. when it turned withen aless than twenty feet from me it went between tow power poles and two very large pine trees. it was round in shape with markings on the portion that i could dee. there was one large light on the botton, going into the light were baffles like strusctures we went form the edge to the light. it was approximately thirty feet in diameter. round in nature. the next time i saw them were in back yard.Tow lights appearted and just sat motionlas four about five minutes. then one3 blinked and the other bli nked and they both went our.My last sight  was on a flight from las vegas back ot iowa on alegia.This took place last year about ay or june we weere flyin in heavy cloud cover. i was looking out the window and thought that i has seen a round metalic disk about fifty feet below  and on the left side of the air plain wing.I thought that i was imagening things, and as i watched. the craft turned side ways. it had nine or ten lights in a circle patern of about twenty feet. the lights were, and a shade of  yellow,green, blue ,red. purple and orange. i watched the lights four about one minute. then the were gone.I am not sure if there are tracking me or this is in my head. but the dreams still come every so often.","distance":"21-100 Feet, Unknown","duration":"00:25:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path then hovering,Unknown","formattedAddress":null,"id":82303,"landingOccurred":false,"latitude":null,"location":null,"logNumber":"US-02232017-0016","longitude":null,"occurred":75686400000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1487892536000,"summary":"Dont know about outside, inside was metalic area w/ lots of buttons the first time, second time room was smoth with metalic table,  others people there human","tags":["lights","disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487910946287,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":16344,"locationName":"Vinton/utah, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27427"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Several photos posted by glenn burns wsb meteorologist channel 2 atlanta, mr. burns is an amateur ufo enthusiasts and likes to debunk them by either lightning ice or reflective. the photos he has posted have been taken at other cities as well and they look very similar","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None, Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":82302,"landingOccurred":false,"latitude":32.1672421,"location":null,"logNumber":"US-02232017-0015","longitude":-82.8922351,"occurred":1487613600000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487891017000,"summary":"Report from local meteorologist who is also an amateur ufo enthusiast","tags":["photo","ufo","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487909446282,"urls":["http://www.mufoncms.com/files_jeud8334j/82302_submitter_file1__FBIMG1487908331334.jpg","http://www.mufoncms.com/files_jeud8334j/82302_submitter_file2__FBIMG1487908318669.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":16,"meantempi":61,"meanvism":12,"meanvisi":8,"mintempm":7,"mintempi":44,"minvism":1,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":16,"meantempi":61,"meanvism":12,"meanvisi":8,"mintempm":7,"mintempi":44,"minvism":1,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":3,"locationName":"Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27428"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mustang","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"(405) 875-4567\r\n\r\nbrightest object in the sky.  looks star like.  viewed from my porch nightly.  skyview app does not recognize as a star.   satfinder app does not recognize as a known satellite.  i live relatively near airport but object lasts in night sky over 3 hours. every night,  same position for the same timeframe (sundown till 11pm). took time elapsed video for 20 minutes.  object \"moves\" but i am unsure if it's stationary and movement captured is earths rotation.  moved in se-ne extremely slowly.  have seen light every night for the past few weeks.  disappears over horizon.  could be natural (military satellite) but it has my interest and wanted to report.  ","distance":"Unknown","duration":"03:00:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":82301,"landingOccurred":false,"latitude":35.389692588281235,"location":null,"logNumber":"US-02232017-0014","longitude":-97.73797402457001,"occurred":1487808000000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487884582000,"summary":"Not plane, star, satellite, iss, or hubble.  reoccurs nightly","tags":["video","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487903146311,"urls":["http://www.mufoncms.com/files_jeud8334j/82301_submitter_file1__trim.3B2D69B3644D4612873822CCB76B1B1E.MOV","http://www.mufoncms.com/files_jeud8334j/82301_submitter_file2__IMG1326.PNG","http://www.mufoncms.com/files_jeud8334j/82301_submitter_file3__IMG1317.PNG"],"weather":null,"zipcode":"73064","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mustang, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27429"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Unknown","city":"Plymouth ","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at home when i heard my son arrive on his motorcycle so i went and opened the front door for him. as i looked up the road for him, i noticed a bright stationary light which, to me, didn't look quite right. my son, walking towards me, turned to see what i was looking at and immediately said to me \"i was looking at that star from home, bright isn't it? \". i told him that it wasn't a star and i'm getting my mobile to film it (video attached). my son was blown away when the light extinguished, although not completely and instantly but more like in two steps and then came on again, although not as brightly, then disappeared completely. ","distance":"Over 1 Mile, Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":82300,"landingOccurred":false,"latitude":50.36844643249682,"location":null,"logNumber":"GB-02232017-0013","longitude":-4.109366062010742,"occurred":1487879400000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1487884005000,"summary":"Solid light seen hovering in the sky over plymouth dockyard ","tags":["video","light","hovering"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":1487902546256,"urls":["http://www.mufoncms.com/files_jeud8334j/82300_submitter_file1__20170223200104.mp4"],"weather":null,"zipcode":"Pl49jx ","daysBetweenOccurrenceAndSubmission":0,"locationName":"Plymouth , England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27430"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Newberry","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ok me and some friends where just playing basketball and me an another friend look up and we see a star we'll we thought it was a star until it started moveing slowly to the left so when we start trying to tell our other friends to look all of a sudden it start to glow brighter that no regularly was them it started to disappear and then just a strick  of light was seen ass all our friends looked thy saw nonthing there so they thought we where jokeing so they laugh and continued to play ball as me and my friend who witnessed it just looked at each other and tried to just blow it off and think to our selfs like we didn't just see it and i started to get loud screaming i know what i just saw but to everybody else i was just acting crazy so i just walked home thinking like i have to tell someone and that's the story.","distance":"101-500 Feet","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":82298,"landingOccurred":false,"latitude":34.277705241870066,"location":null,"logNumber":"US-02232017-0011","longitude":-81.64089658138124,"occurred":1487832540000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487880290000,"summary":"Glowing light hovers for a little then zips off","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487898646301,"urls":[],"weather":null,"zipcode":"029108","daysBetweenOccurrenceAndSubmission":0,"locationName":"Newberry, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27431"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Santa Fe","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Autumn of 1980, my friend stormed in from outside around 10 pm ,woke me up and said, \"there's a ufo outside!\" several neighborhood folks (maybe 20) were also outside watching the city-block sized metallic-looking object floating silently, about 5-10 miles per hour, over the residential street just ne of alameda street in santa fe, nm.  it was about 20 feet from top to bottom. it was floating only about 5 stories high, not much higher than the hilton hotel nearby which is 3 stories high. we all watched until it gently floated into the horizon to the ne. the whole sighting was about 20 minutes. i personally was shaking in my slippers at first, but calmed down as it floated away. it's silence was eerie.\r\nthere were 4 (i think) colored lights at the bottom in a single line, blinking sequentially. there was writing on the sides which looked sort of like russian letters to me. this was during the cold war, but even then i though the russians would not be showing us their technology over a capitol city! santa fe, of course, is only 35 miles from los alamos, the home of the atomic bomb.\r\nthe sighting was in a santa fe newspaper the next day. or maybe it was an albuquerque newspaper, i'm not sure. it was a long time ago. ","distance":"101-500 Feet","duration":"00:20:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":82297,"landingOccurred":false,"latitude":35.6735697,"location":null,"logNumber":"US-02232017-0011","longitude":-105.9895741,"occurred":340416000000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1487873847000,"summary":"Diamond shaped, metallic-looking with blinking lights","tags":["ufo","lights","floating"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1487892346296,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":14,"maxtempi":57,"maxvism":24,"maxvisi":15,"meantempm":10,"meantempi":50,"meanvism":24,"meanvisi":15,"mintempm":6,"mintempi":42,"minvism":24,"minvisi":15,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":14,"maxtempi":57,"maxvism":24,"maxvisi":15,"meantempm":10,"meantempi":50,"meanvism":24,"meanvisi":15,"mintempm":6,"mintempi":42,"minvism":24,"minvisi":15,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"87505","daysBetweenOccurrenceAndSubmission":13280,"locationName":"Santa Fe, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27432"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Memphis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Tenessee, 2017 feb january\r\nmy wife\r\nshe didn't know,\r\nbouncing and transforming\r\nutter awe it disappears  ","distance":"Unknown","duration":"09:25:00","entityEncountered":false,"favorited":0,"features":"Dome, Patterned Surface, Insignia, Other, Unknown","flightPath":"Stationary","formattedAddress":null,"id":82296,"landingOccurred":false,"latitude":35.064021012088894,"location":null,"logNumber":"US-02232017-0010","longitude":-89.85404618301126,"occurred":1485379080000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1487872564000,"summary":"It keeps following me in different shapes sizes. ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487891446273,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":21,"maxtempi":69,"maxvism":16,"maxvisi":10,"meantempm":14,"meantempi":57,"meanvism":16,"meanvisi":10,"mintempm":7,"mintempi":45,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":21,"maxtempi":69,"maxvism":16,"maxvisi":10,"meantempm":14,"meantempi":57,"meanvism":16,"meanvisi":10,"mintempm":7,"mintempi":45,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"38115","daysBetweenOccurrenceAndSubmission":28,"locationName":"Memphis, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27433"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My sighting took place in the summer of 1975. aprox. time between 5-6am. over far north dallas (richardson) at the time, that far north was mainly rural farm land. at first i was not sure what i was looking at, in fact, it took me a second to realize that what i was seeing was actually real. best description would be if you could imagine several super bright white fluorescent tubes of light moving across the sky. each of them, right behind the other in a straight line. each flashing on and off randomly as they went across the sky. from the time i first saw the lights, till the time they disappeared at the horizon, was about 2 minutes. i knew that they were relatively at a very high altitude, as i watched them disappear across the horizon, as they appeared to follow the curvature of the earth. during the entire event, no sound was heard. the description of the landscape that far north of where i was, is mostly flat land. when the last of these lights disappeared at the horizon, and just before i turned to go back to my car, the lights instantly dispersed from the same point of where they had originally disappeared to, but each went in a different direction, and did so literally in a flash. had i blinked, i would have missed it.  when you see an aircraft flying at that altitude, they appear to be tiny, as in fractions of an inch, yet these were huge in length, like several inches in length. i have never since then seen anything like it.  \r\n\r\ni would be seriously interested in knowing if there are others who witnessed this event that summer 42 years ago. at that altitude, it had to be seen throughout several states. not knowing what it was, leaves you anxiously wondering. ","distance":"Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":82294,"landingOccurred":false,"latitude":31.9744788,"location":null,"logNumber":"US-02232017-0008","longitude":-99.8993231,"occurred":177292800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1487864640000,"summary":"Appeared to be moving in the stratosphere. best description several bright white fluorescent tube thousands of feet long. ","tags":["sound","lights","flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487883046310,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":24,"maxvisi":15,"meantempm":26,"meantempi":78,"meanvism":18,"meanvisi":11,"mintempm":21,"mintempi":70,"minvism":5,"minvisi":3,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":24,"maxvisi":15,"meantempm":26,"meantempi":78,"meanvism":18,"meanvisi":11,"mintempm":21,"mintempi":70,"minvism":5,"minvisi":3,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":15168,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27434"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minneapolis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 10:30pm on feb. 20, 2017, i received a phone call from a woman who said she lives in south minneapolis.  the following is a transcript of my handwritten notes:\r\nshe had been sitting on her couch in her living room, with her back to the picture window which faces west, when a bright blue light filled the room and she heard a loud rumbling, like thunder.  [there were no storms in the area.-wim]  she heard a noise like a metallic “whoosh”, and the power went off.  then the power came back on, and there was another bright blue light, and a second “whoosh”, and the power went off again.  (one of the sounds was like “inside a washing machine”.) she wondered briefly if a nuclear bomb had gone off. it was pitch black inside the house.  she ran outside, and “all of the neighbors” ran outside also.  one of the neighbors said a blue orb to the west had “sucked all the light out of the neighborhood.”  a man driving by in a car stopped, said he had seen a blue orb, and the neighbor lady from across the street recorded his account of what he had seen.  the lady next door south came out and said, “i saw it, it was a big, blue orb”.  sirens were heard, apparently from police or fire vehicles racing elsewhere.  a police car came and stopped; the officer said he had seen it from several blocks away; he indicated he was frightened by it, and asked if everyone was okay.  to summarize, four people, including the police officer, said they had seen a blue (some said green) orb to the west.  cell phones were also “out, in emergency mode”.  i asked the witness when this had occurred, and she said she had phoned a friend just after it happened, and she checked her phone and found she had made the call at 9:25pm.   the witness’ children, who had been asleep for 45 minutes, were awakened by the light and the noise.  firefighters showed up at 9:30pm.  the power company (excel energy?) came into the alley behind (east of) the witness’ house.  a cable of multiple wires had broken and was down.  the witness asked what was going on but the workers were “protective” and gave no informative answers.  there was no tree or anything else near the broken cable to account for the breakage.  the electricity came back on about two hours later.  the area of the outage included chicago ave and park ave.\r\nthe witness said, “yesterday, i was at my friend’s apartment in downtown minneapolis, on the 10th floor overlooking the city, and she said she had seen a big blue halo in the sky. [looking south?]  per the witness, someone on “redit” asked “what was the green [glow?] over uptown?”  \r\ni told the witness i would like to visit the neighborhood.  she wants to know if this event left radiation.\r\nthe witness asked me to let her know what i conclude about the case.\r\n","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":82293,"landingOccurred":false,"latitude":44.91941257113469,"location":null,"logNumber":"US-02232017-0007","longitude":-93.25074320444082,"occurred":1487625900000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487861066000,"summary":"Bright blue orb flashed twice with rumble & whoosh, knocked out power, out 2 hours","tags":["sound","flash","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487879446562,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":15,"meantempi":59,"meanvism":9,"meanvisi":6,"mintempm":10,"mintempi":50,"minvism":2,"minvisi":1,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":15,"meantempi":59,"meanvism":9,"meanvisi":6,"mintempm":10,"mintempi":50,"minvism":2,"minvisi":1,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Minneapolis, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27435"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Galesburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Watching sky in back yard with my wife. 3 not so bright rings appeared in the south at an unknown altitude moving very fast. we could not tell if they were solid or hollow. like hula hoops but fuzzy. red in color, no noise at all. in a reverse v pattern at first then the middle hoop moved to the front of the v\r\ni watch the sky all the time and have never seen the likes of these. total time from south to out of sight north 3 to 6 seconds. weather was clear with very good visibility.  ","distance":"Unknown","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":82292,"landingOccurred":false,"latitude":40.92678297399178,"location":null,"logNumber":"US-02232017-0006","longitude":-90.33065125488542,"occurred":1487802600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1487860952000,"summary":"3 red glowing circles but not bright, moving very fast, changed positions,seen by wife and myself","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487879446308,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":13,"meantempi":56,"meanvism":9,"meanvisi":6,"mintempm":7,"mintempi":45,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":13,"meantempi":56,"meanvism":9,"meanvisi":6,"mintempm":7,"mintempi":45,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"61401","daysBetweenOccurrenceAndSubmission":0,"locationName":"Galesburg, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27436"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Katy","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was parking my jeep when i noticed a light that was way too bright to be a star (at least in the city, stars are not that bright.) it also was not a plane cause it was just hovering in the sky, stationed. the object appeared as a blue-white circle but then it would widen and show rings around it like the planet saturn. i wanted to take pictures but i didn't really get good ones so i took a video. when i got a good video and a good picture, i went inside the house and i didn't go back outside in fear i would be abducted.","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":82291,"landingOccurred":false,"latitude":29.8689836,"location":null,"logNumber":"US-02232017-0005","longitude":-95.7130284,"occurred":1487793300000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1487857733000,"summary":"Object was too bright to be a star, was not a plane. stayed in place, widened with rings.","tags":["video","light","hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487876146585,"urls":["http://www.mufoncms.com/files_jeud8334j/82291_submitter_file1__trim.229488B1058B4A04B8EF13CB6B716D8D.MOV","http://www.mufoncms.com/files_jeud8334j/82291_submitter_file2__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82291_submitter_file3__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82291_submitter_file4__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82291_submitter_file5__image.png"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"77449","daysBetweenOccurrenceAndSubmission":0,"locationName":"Katy, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27437"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Katy","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was parking my jeep when i noticed a light that was way too bright to be a star (at least in the city, stars are not that bright.) it also was not a plane cause it was just hovering in the sky, stationed. the object appeared as a blue-white circle but then it would widen and show rings around it like the planet saturn. i wanted to take pictures but i didn't really get good ones so i took a video. when i got a good video and a good picture, i went inside the house and i didn't go back outside in fear i would be abducted.","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":82290,"landingOccurred":false,"latitude":29.8663136,"location":null,"logNumber":"US-02232017-0004","longitude":-95.7175884,"occurred":1487793300000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1487857618000,"summary":"Object was too bright to be a star, was not a plane. stayed in place, widened with rings.","tags":["video","light","hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487876146353,"urls":["http://www.mufoncms.com/files_jeud8334j/82290_submitter_file1__trim.229488B1058B4A04B8EF13CB6B716D8D.MOV","http://www.mufoncms.com/files_jeud8334j/82290_submitter_file2__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82290_submitter_file3__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82290_submitter_file4__image.jpeg","http://www.mufoncms.com/files_jeud8334j/82290_submitter_file5__image.png"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"77449","daysBetweenOccurrenceAndSubmission":0,"locationName":"Katy, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27438"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My son saw 4 purple orbs hovering over phoenix arizona from his airplane window on 2/22/2017. out of the airplane window. it is not a reflection on the glass because the people in the seat in front of him spotted them first and then told him to look out. he snapped a picture. he witnessed them there 30 seconds and then vanished. his picture is a really good one and quite clear.","distance":"101-500 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":82289,"landingOccurred":false,"latitude":33.4560571,"location":null,"logNumber":"US-02232017-0003","longitude":-112.0696673,"occurred":1487788800000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487842147000,"summary":"4 purple orbs witness and photographed by my son from an airplane over phoenix ","tags":["photo","hovering"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1487860546378,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":25,"maxtempi":77,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":12,"mintempi":54,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":25,"maxtempi":77,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":66,"meanvism":16,"meanvisi":10,"mintempm":12,"mintempi":54,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27439"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"La Mesa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I exited my house and started walking to the curb to put a letter in the mailbox in front of my house at approximately 10:10 pm. my street has no street lights and most of my neighbors are elderly so it is rather dark in front of my house at night even though i live in the city. \r\n\r\nalmost directly in front of me at approximately 30' above the horizon i saw a bright flash. a blue-white teardrop-shaped glowing light began falling down directly in front of me, leaving a long, thick glowing white trail behind it. i estimate it was approximately 1/2 mile away from me, but could not be certain because it was so dark it was hard to see the surrounding trees and buildings.\r\n\r\ni immediately thought i was observing a brilliant meteor falling to earth, but the object abruptly slowed as it reached the bottom of its path, hovered for a split-second and then disappeared. \r\n\r\nthis is the second strange object i have seen from my current residence.","distance":"501 Feet - 1 Mile","duration":"00:00:02","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":82287,"landingOccurred":false,"latitude":32.77160058422228,"location":null,"logNumber":"US-02232017-0001","longitude":-117.01557251198847,"occurred":1487628600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1487827727000,"summary":"A glowing blue-white teardrop-shaped object with a long thick white tail dropped and then slowed, hovered and disappeared.","tags":["lights","flash"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1487846146266,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":15,"meantempi":59,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":20,"maxtempi":68,"maxvism":16,"maxvisi":10,"meantempm":15,"meantempi":59,"meanvism":16,"meanvisi":10,"mintempm":10,"mintempi":50,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"91942","daysBetweenOccurrenceAndSubmission":2,"locationName":"La Mesa, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27440"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving along the back roads between eight and 830 on wednesday the 22nd 2017. i live in  lancaster county. was at a stoplight when something caught my eye i glanced over and noticed a line of bright lights. didn't think much of it looked away. i double took however and when i looked back they where in a triangle formation. i went through everything in my head it was not a plane there were no blinking lights, plus it was too low to the field to be a plane. i thought it might be a drone, but with it being so low it would've been a very very big drone.  nothing was blinking or illuminating off of it, there were no beans or anything like that. after i saw it it moved again not lightning fast but quickly to a third point in the field and hovered again for a few seconds. at this point i realize the light had turned green, and i begin to drive away.  but interested in trying to figure out what i saw i looked back and slowed down and i found nothing there, nothing in the sky,  there was nothing up higher,  there's nothing in the field it was gone.  there was one very bright light at the top and three maybe four dimmer lights coming out of it in a triangle formation. ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":82286,"landingOccurred":false,"latitude":41.2121216,"location":null,"logNumber":"US-02222017-0022","longitude":-77.1902647,"occurred":1487794500000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1487803872000,"summary":"Was driving, saw it at a stop light. was a straight line at first glance, double took and it was a triangle, moved quickly but stop for a second each direction (triangle flight pattern) light turned green i lost sight of it as i drove away. ","tags":["triangle","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487822446303,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27441"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Pine Mountain Club","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were standing on my daughter's front porch looking for satellites at about  10 pm. i noticed a satellite that was moving along at a rather slow pace. for some reason i brought my sight down a few feet and noticed two more slow moving satellites behind the first one. about 25 miles behind the first to be exact and the space between the front satellite and what i had first thought was two rear satellites did not show any stars which made it solid!             i told my family members to look at that big ufo flying towards burbank!! they looked up and the craft started moving faster and faster and was gone in just seconds but we all saw it. i told them not to tell me what they saw but for us all to go into the house and draw what we had each see but not to show each other until we were all finished drawing. we had all drawn the same thing. my husband who is a chp officer estimates it was about 20 miles wide and 25 miles long. it was moving to fast to estimate how fast it traveled at the end of its flight and disappearance.","distance":"Over One Mile","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":82285,"landingOccurred":false,"latitude":34.8462176,"location":null,"logNumber":"US-02222017-0021","longitude":-119.1560394,"occurred":896572800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1487803599000,"summary":"While looking for satellites in the night sky (10 pm), i noticed what i thought was a satellite but it was moving way to slow.","tags":["ufo","light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1487822146246,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":19,"maxtempi":66,"maxvism":16,"maxvisi":10,"meantempm":13,"meantempi":56,"meanvism":16,"meanvisi":10,"mintempm":8,"mintempi":46,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":19,"maxtempi":66,"maxvism":16,"maxvisi":10,"meantempm":13,"meantempi":56,"meanvism":16,"meanvisi":10,"mintempm":8,"mintempi":46,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"93222","daysBetweenOccurrenceAndSubmission":6842,"locationName":"Pine Mountain Club, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:27442"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"LOURDES","country":"CA","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Filled out report from an email at mufon headquarters by field investigator l. flechtner 18809. stu bundy may contact for more info.\r\n-------------------------------------------------------------------\r\nhi i really wanted to share my story. i live in st. john's newfoundland canada.\r\nmy story goes back to 92 or 93, can't give a definite year, but at the time i was living in lourdes newfoundland on the port aux port peninsula. i was actually out in my grandparents driveway waiting for my bus, across the road we had a field which lead down a hill with some marshland to a small cliff overlooking the ocean.\r\nit was kinda cloudy that morning, i was looking in the direction of the bus which was to the left, and happened to catch the sun peeping through the clouds. i didn't give it much thought till it split into three balls and formed the shape of a triangle, it kept the triangle shape while spinning in a circle slowly. i didn't pay much mind to it, and actually never really told anyone till tonight..I would really appreciate it if someone wrote me back and maybe correct me if it was a normal phenomenon.\r\nthank you for your time.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":82284,"landingOccurred":false,"latitude":null,"location":null,"logNumber":"CA-02222017-0020","longitude":null,"occurred":694137600000,"potentialRelations":[],"rating":"Unrated","region":"Newfoundland and Lab","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1487793878000,"summary":"Saw the sun like object split into three balls and form the shape of a triangle","tags":["triangle","ufo","contact"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487812246297,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":9185,"locationName":"LOURDES, Newfoundland and Lab","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:27443"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Monrovia","country":"Liberia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Drone like object. but was very high up and large in size. hovered. went up / down& forward / backward. then quickly disappeared.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Other","formattedAddress":null,"id":82283,"landingOccurred":false,"latitude":6.3156068,"location":null,"logNumber":"LR-02222017-0019","longitude":-10.8073698,"occurred":1487799000000,"potentialRelations":[],"rating":"Unrated","region":"Montserrado","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1487793285000,"summary":"Drone like object. but was very high up and large in size. hovered. went up / down& forward / backward. then quickly disappeared.","tags":["none"],"timeZone":"Africa/Monrovia","timeZoneName":"Africa/Monrovia","tweeted":1487811646504,"urls":[],"weather":{"history":null},"zipcode":"1000","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Monrovia, Montserrado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27444"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Melsungen","country":"Germany","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We was in the car with 4 persons on the highway (autobahn) on the way from kassel to the south .In the area of melsungen we see a small shining light.The light came with high speed to us and goes bigger. it was a clear night and you can see that the light was biger and bigger when they came near on the way to us .We hear radio in the car and 8 to 10 seconds before the light and the ufo came over us the radio stop working . some cars before and behind us goes in the brakes ans parked on the right line on the autobahn. the people goes out the cars an talk together . everbody say that they never see some like this before. also some confirm that the radio has no function. when the ufo was away the radio starts and in the first 15 to 20 seconds they have a bad noise to the regular music.\r\nthis was in a night from saturday to sunday .\r\non tuesday was a small report in the newspaper hessische allgemeine zeitung .\r\nthey are people the inform the police that they have seen this ,but they never found out whats going there.\r\ni know airplanes,also military fighters but in this speed and form i never see a plane or other thing . \r\nthis is a true story ,but was in a time when no mobile phones a.S.O. availible . before i have seen this was my personal meaning about people they have seen ufos - they are crazy. no i believe that something is outside our earth.   ","distance":"101-500 Feet","duration":"00:00:35","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":82282,"landingOccurred":false,"latitude":51.1276976,"location":null,"logNumber":"DE-02222017-0018","longitude":9.549567699999999,"occurred":389664000000,"potentialRelations":[],"rating":"Unrated","region":"Hesse","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1487793280000,"summary":"Light radio goes still cars stop on the highway never heard this sound blind by the light short time ","tags":["sound","ufo","light"],"timeZone":"Europe/Berlin","timeZoneName":"Europe/Berlin","tweeted":1487811646284,"urls":[],"weather":{"history":{"dailySummary":[],"dailysummary":[]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":12709,"locationName":"Melsungen, Hesse","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27445"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Dana Point","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking my dog in the park in front of my house. there is a raised grass area along a bluff overlooking a cove in the ocean at dana point.  the bluff is about 100 ft elevation. it was about 9pm and the sky and the ocean were completely black, no stars or moon.\r\n\r\nup and to my right high in the sky a disc shape just appeared. it was white on the top and green on the bottom. it made a few very fast horizontal moves, then stopped.  all of a sudden it starts to fall in an arc, change to a ball shape that was green in the middle with a white glow around it and a comet like tail.  now it was falling and looking like and appeared like a space capsule flaming to earth.  no sound at all.\r\n\r\nwhen it got close to the ocean i thought it was going to crash and explode.  i was so close i thought it might hit me so i turned to run.  as soon as i did it, stopped mid air. now it changed into a ball again, about 30 ft in diameter, and just hovered above the water about 50 feet. it had no distinguishing features, looked like a smooth ball.  bright orange, but not shinning any light.\r\n\r\ni felt like my movement to run made it stop and notice me.  there wasn't another person out that night. the ball then made a roller coaster kind of move toward me which made the ball turn into a worm like shape.  all of this movement is light speed, so the worm shape was more like a color trail.\r\n\r\nit was now coming at me and i turned to run again. when i moved it stopped dead.  it was close to me, but still out over the bluff. then it shot out over the water toward catalina island like it was cast out on the end of a fishing line.  the ball shape changed to more like a rope shape.It moved so fast that the ball shape and the line looping out over the horizon where all visible at once.\r\n\r\nthen it all disappeared. with only me as a witness. have you ever heard of anything like this?\r\n  ","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":82280,"landingOccurred":false,"latitude":33.449037711252664,"location":null,"logNumber":"US-02222017-0017","longitude":-117.72740490083568,"occurred":1471392000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1487786961000,"summary":"More fantastic then anything on tv. a disc object appeared out of nowhere, changed to a ball shape, arced desent toward the ocean, changed clors, stopped in mid air, changed to a worm shape, flew right at me, stopped and flew back over the ocean horizon.","tags":["sound","crash","disc","light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1487805346298,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":84,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":15,"meanvisi":9,"mintempm":17,"mintempi":63,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":84,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":15,"meanvisi":9,"mintempm":17,"mintempi":63,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"92629","daysBetweenOccurrenceAndSubmission":189,"locationName":"Dana Point, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27446"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Gordon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Filled out at mufon headquarters with witness on the phone, by field investigator l. flechtner 18809, on 2/22/2017.\r\n---------------------------------------------------------------------\r\ni noticed lights in my living room window and thought they were car lights  from my neighbor, but these were bright as the sun, orange lights.\r\nat first i saw one light come from the south and go north over the tree tops and the river then out of sight. then i saw a second light, i went outside to see what it was. the second light followed the same path as the first light. i felt a weird sensation in the air, like a electrical charge in the air. then i saw a third light follow the same path as the first two before it. it took about 5 minutes for the first two very bright orange orbs/lights to pass and about the same time for the third one to pass. this time, although i didn't hear anything, all the dogs in the neighborhood started howling. i thought i saw a flashlight from a neighbor in the distance and yelled at them, \"did you see that\" but i got no response.\r\ni stood outside and waited for another 10 minutes, but no other light/orbs came by. i then called the state troopers to report the lights. they were very nice and although they had no reports they said they had seen things in the past. i also notified a man named allen w. smith a local ufo hunter who comes and investigates in his van. \r\nthe next night i went outside at 10:10 pm to see if the lights would return, but instead saw a small private plane.\r\ni didn't see any markings on the plane, but it is very unusual for a plane to fly that low over our neighborhood. the path of the aircraft was se to nw direction, a little off from the direction of the orbs which traveled south to north.\r\n","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":82279,"landingOccurred":false,"latitude":46.31852792094043,"location":null,"logNumber":"US-02222017-0016","longitude":-91.55061563232707,"occurred":1487370000000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487784682000,"summary":"I noticed lights in my living room window and thought they were car lights  from my neighbor, but these were bright as the sun orange lights.","tags":["ufo","lights","flash"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1487803246335,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":13,"maxtempi":55,"maxvism":16,"maxvisi":10,"meantempm":5,"meantempi":41,"meanvism":16,"meanvisi":10,"mintempm":-3,"mintempi":27,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":13,"maxtempi":55,"maxvism":16,"maxvisi":10,"meantempm":5,"meantempi":41,"meanvism":16,"meanvisi":10,"mintempm":-3,"mintempi":27,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"54838","daysBetweenOccurrenceAndSubmission":4,"locationName":"Gordon, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27447"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Cypress","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out riding my harley and saw a strange light in sky. pulled over and noticed it was very bright and no flashing lights. no stars visible in sky plus this was too close. filmed and took pictures for about 45 minutes. it never moved very much. it was spinning and had structural design. very similar to ufo's on tv. i felt very curious about it. called my wife, she went outside and saw it too. i was also with my friend who witnessed it also. i have many more photos and lots of video that wouldn't upload. this was taken with an iphone 7 plus with a telephoto camera. it was still there when we got home and i don't know when it left. ","distance":"Unknown","duration":"03:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"N/A","formattedAddress":null,"id":82278,"landingOccurred":false,"latitude":29.991428950186013,"location":null,"logNumber":"US-02222017-0015","longitude":-95.64452872357155,"occurred":1487705400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1487779556000,"summary":"Saw light in skype while riding motorcycle, stopped and filmed and took photos. ","tags":["photo","video","ufo","lights","flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1487798146307,"urls":["http://www.mufoncms.com/files_jeud8334j/82278_submitter_file1__trim.63DF834B20D8419787063D9890A0D3B5.MOV","http://www.mufoncms.com/files_jeud8334j/82278_submitter_file2__IMG2345.JPG","http://www.mufoncms.com/files_jeud8334j/82278_submitter_file3__IMG2073.JPG","http://www.mufoncms.com/files_jeud8334j/82278_submitter_file4__IMG1945.JPG","http://www.mufoncms.com/files_jeud8334j/82278_submitter_file5__IMG2011.JPG"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":24,"maxtempi":75,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":65,"meanvism":8,"meanvisi":5,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":24,"maxtempi":75,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":65,"meanvism":8,"meanvisi":5,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"77429","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cypress, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27448"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Greenwich","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friend from rye ny called on phone to tell me to go outside and look up at sky. we saw this very large object floating over our yard. it didn' make any sound. we called the westchester county airport and told them about sighting, they said nothing came up on radar. the sighting  left my wife and i speechless, we couldn't believe it. i know this was long ago but i thought it might help mufo.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":82277,"landingOccurred":false,"latitude":41.005673672639084,"location":null,"logNumber":"US-02222017-0014","longitude":-73.63260931714044,"occurred":237841200000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1487778002000,"summary":"Moved slowly over our yard, no noise what so ever. had different colored lights.","tags":["sound","ufo","lights","floating"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487796346290,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":24,"maxvisi":15,"meantempm":24,"meantempi":76,"meanvism":18,"meanvisi":11,"mintempm":18,"mintempi":64,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":24,"maxvisi":15,"meantempm":24,"meantempi":76,"meanvism":18,"meanvisi":11,"mintempm":18,"mintempi":64,"minvism":13,"minvisi":8,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"06830","daysBetweenOccurrenceAndSubmission":14466,"locationName":"Greenwich, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27449"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Pittsburgh","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving back home from work in warrendale, pa. i was heading back to the city of pittsburgh, pa on parkway north. i was in between camp horne exit and wexford, pa exit when i seen the object in the sky. it was a clear night stars where visable but there where some clouds. as i was driving something big in the sky flew pass about me at a very fast speed. it seemed very big and round in shape giving off a very bright yellow, orange and red color. at first i thought it was a meteor because i have witnessed a meteor in the sky b4 and it did seem similar as far as the color of it. but after i compared the two i strongly do not believe it was a meteor because the object moved at a very fast speed under cloud cover. the object was also silent. at the speed in which it moved it did not make a sound and it did not give off no smoke trail or cloud trail that you would get from a falling meteor. the object did not give off no heat as well as u would think from a meteor. the object seemed to be moving under some intelligent power. it amazed me a moment in life i would never forget. \r\n\r\nive also seen another ufo years ago within the city of pittsburgh in the forest hills/wilkensburg area of the city. the object was flying low hovering under cloud cover and then zoomed up into the sky at a speed ive never seen before \r\n\r\nive been and will always continue to look up...","distance":"20 Feet or Less","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":82276,"landingOccurred":false,"latitude":40.372302572661596,"location":null,"logNumber":"US-02222017-0013","longitude":-79.97175783566168,"occurred":1487106300000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1487776740000,"summary":"Driving on pittsburgh pa parway north coming from work in warrendale, pa headed back to the city. ive seen a big round object zooming across the sky at a very fast speed under cloud cover. orange, yellow, and red mixed in color. it was no aircraft ","tags":["sound","ufo","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487795146397,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":9,"maxtempi":48,"maxvism":16,"maxvisi":10,"meantempm":3,"meantempi":38,"meanvism":16,"meanvisi":10,"mintempm":-3,"mintempi":27,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":9,"maxtempi":48,"maxvism":16,"maxvisi":10,"meantempm":3,"meantempi":38,"meanvism":16,"meanvisi":10,"mintempm":-3,"mintempi":27,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"15227","daysBetweenOccurrenceAndSubmission":7,"locationName":"Pittsburgh, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27450"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Toledo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi i was out side with my son and his fried about 2 years ago know we saw a ball of light low in the sky no noise from it , but the 3 f 16 jets made alot of noise they were following real fast they had there after burners on it went to the east for about a minute then i saw it going west north of my house i didnt see the jets anymore i told people about it they said i was nuts but it really happened  uor government knows there here hidding it from us ","distance":"101-500 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":82275,"landingOccurred":false,"latitude":41.72383419869561,"location":null,"logNumber":"US-02222017-0012","longitude":-83.66836691358034,"occurred":1439337600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1487774051000,"summary":"It was a ball of light","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487792446320,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":15,"mintempi":59,"minvism":8,"minvisi":5,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":15,"mintempi":59,"minvism":8,"minvisi":5,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"43623","daysBetweenOccurrenceAndSubmission":560,"locationName":"Toledo, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27451"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Quakers Hill","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Sister had just awoken. we sat watching the end of a movie.  we have noisy water pipes and it is clear when water is being used in the house. even taps outdoors cause same effect.  we heard the sound of the water pipes and knew that all three of my adopted daughters were sleeping still.  my sister assumed ghost, and headed towards the back of the house to check things. i assumed thieving neighbour and headed to the front of the house. \r\n\r\ni found no earthly thief. i looked up while outside in the front of the house. the night was still. a planet perhaps jupiter was up and its gold glow was a sweet sight.  \r\n\r\nthen i noticed an object more gold than jupiter and much more mobile since it was smoothly and silently moving against the blackness. i am an amateur astronomer with decades of experience. i assumed a very very very bright satellite. i watched this thing sail  towards zenith and then  noticed the smaller dimmer object in-trail to the parent object. \r\n\r\namazed and astonished i called my sister to hurry out and witness this stellar exhibition. \r\n\r\nwe watched has these objects crested zenith point and continued 20 degrees east of north until they disappeared out of sight behind the sleeping rooftops and dark tree lines. ","distance":"Unknown","duration":"00:00:45","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":82274,"landingOccurred":false,"latitude":-33.7295791,"location":null,"logNumber":"AU-02222017-0011","longitude":150.9066666,"occurred":1487827080000,"potentialRelations":[],"rating":"Unrated","region":"New South Wales","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1487773767000,"summary":"One craft jupiter in size and.Colour followed at some distance by smaller starlike object","tags":["sound"],"timeZone":"Australia/Sydney","timeZoneName":"Australia/Sydney","tweeted":1487792146341,"urls":[],"weather":{"history":null},"zipcode":"2670","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Quakers Hill, New South Wales","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27452"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were waiting outside of the restaurant, mission chinese for our 5pm reservation in lower manhattan, when the pulsating lights caught my eye. \r\nit was not moving at all, and was also not making any sound whatsoever (like a helicopter would).  it was silent but just hovering and changing colors.\r\n\r\ni immediately started filming the object until they called us into the restaurant for our reservation. \r\n\r\nit struck me as unusual because it was so silent.  we all see helicopters all the time int he city for news, traffic, police etc.  this was different. it was just pulsating and not making any sound. it was also at a higher elevation than helicopters usually fly or hover when in the city.\r\n\r\ni was excited to see this and share it with my daughter.  i wish i could've filmed it longer and could've watched it until it vanished but we needed to go into the restaurant for our dinner.\r\n\r\ni tried to capture the tops of the some of the buildings in my video to show the scale and distance and that it was not moving in relation to the buildings.\r\n\r\nthank you","distance":"Unknown","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":82273,"landingOccurred":false,"latitude":40.7140687,"location":null,"logNumber":"US-02222017-0010","longitude":-73.9901975,"occurred":1482859080000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1487773352000,"summary":"Observed a silent orb of pulsating lights hovering above buildings in lower nyc. did not make any sound and stayed there for several minutes. was not there when we came out of restaurant, 2 hours later.","tags":["video","sound","lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1487791846340,"urls":["http://www.mufoncms.com/files_jeud8334j/82273_submitter_file1__IMG6170.MOV.mov"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":17,"maxtempi":62,"maxvism":null,"maxvisi":null,"meantempm":11,"meantempi":52,"meanvism":null,"meanvisi":null,"mintempm":6,"mintempi":42,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":17,"maxtempi":62,"maxvism":null,"maxvisi":null,"meantempm":11,"meantempi":52,"meanvism":null,"meanvisi":null,"mintempm":6,"mintempi":42,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"10002","daysBetweenOccurrenceAndSubmission":56,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:27453"}],"last":false,"totalElements":82750,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":278}
