{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was about 9:44 am, i had gone to the back yard with my dog. i sat in a chair while\r\nshe ran around. there were some small puffy clouds and i looked up facing the north,\r\ni saw an airliner about 22.000ft heading south-east. then i noticed a small, shinny\r\nobject by the plane. it looked like a sphere. i looked at it and at first i thought why is that so close to the plane? i thought it might have been a small plane and it looked like it was close to the plane...Then i noticed it was\r\nkeeping pace with the plane.\r\ni kept watching it and as the plane flew this object along side of it was bobbing \r\naround slightly as it stayed with the plane. it stayed near the section of the plane were\r\nthe pilots sit on the co-pilot's side. it was close to the wing but to the front of it.\r\nthen.....It hit me....Omg....It's a ufo messing with this plane and it freaked me out.\r\nthen they were heading for a cloud...And they both went in the cloud but only the jet came out. it was about 30-40 seconds before they went into the cloud.\r\ni watched the cloud for a few minutes to see when or if the ufo would come out. i sat\r\nthere for about 5 minutes watching the cloud and i never saw the ufo again. \r\nbut were i live, i have lived for 12 years...This is not my first ufo... and i watch the sky\r\nall the time. i know how long it takes a jet high up to cross the sky. and this jet was\r\nnot cruising....It was hauling, like something was chasing it. it stayed in it's south-east\r\ndirection. i was shaken by this and just so happens today was a mufon meeting at\r\n1 p.M..... i was still shaking even in my voice when i got there. there was just something\r\nabout this craft being so close to the plane that freaked me out.\r\nin all the years i have lived here and all the planes i have seen fly over....I have never, ever\r\nseen a ufo near any of them and i spend a lot of time watching the sky.\r\n\r\nplease let me know if any one else saw this. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":28216,"landingOccurred":false,"latitude":30.275153,"location":null,"logNumber":"US-03122011-0013","longitude":-97.7345008,"occurred":1299951840000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1299996992000,"summary":"Looked up and saw the ufo shadowing a jet liner on the co.Pilots side. keeping up with the plane in front of the wing but along side like staying even with the cockpit. ","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67803"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Tan Valley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Well, i filled this entire thing out once so this might be shorter. the past week i have been seeing clear/silver orbs going back and forth. when they take off, it is so fast i can not follow with my eyes. at night have been the 'bright orbs'. they sit in the sky for hours then are just gone. there are colorful ones that i can see as well. i have only seen one classic 'disc' and it zipped in front of me when i was recording a video. i check all objects with the astro and flight sites to be positive. i moved here three years ago and have seen so many things since.I loose sight when they flash and go dark or take off.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":28215,"landingOccurred":false,"latitude":33.1702778,"location":null,"logNumber":"US-03122011-0012","longitude":-111.5722222,"occurred":1299744000000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle,   Fireball,   Flash,   Sphere","source":"MUFON","status":null,"submitted":1299992077000,"summary":"Red/orange orbs, clear silver, and one disc","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28215_submitter_file1__th_DSC00462.jpg","http://www.mufoncms.com/files_jeud8334j/28215_submitter_file2__th_DSC00507.jpg","http://www.mufoncms.com/files_jeud8334j/28215_submitter_file3__th_DSC00510.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"San Tan Valley, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67804"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mansfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"( 1st ) i only want to report this to see if anyone else seen the same thing....At work, i walked out to check the weather at 4:10 a.M. it was a clear sky. i looked up and noticed a dull circular light traveling in a north westernly direction, light object traversed in a strait line with no blinking lights and no sound. from the moment it was over head until the time it traveled the whole distance of the sky was about 4 seconds. it was much faster than a satellite and to dull to be a meteor. i thought it could be a satellite at first but the object was larger than that but smaller than a low flying aircraft and it was definately the fastest moving object i have ever seen.","distance":"Unknown","duration":"04:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28214,"landingOccurred":false,"latitude":40.76462,"location":null,"logNumber":"US-03122011-0011","longitude":-82.5062471,"occurred":1299916800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle,   Disc","source":"MUFON","status":null,"submitted":1299983953000,"summary":"Dull white light traveling the whole distance of the sky in about 4 seconds object appeared to be a disc in shape","tags":["disc","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mansfield, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67805"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mingo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Looking at the moon through a telescope in daylight through a 25mm lense.\r\nsaw a light curve around the moon, around the top\r\nit was a white star like sphere, as big as an average crater.\r\n ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"","formattedAddress":null,"id":28213,"landingOccurred":false,"latitude":37.7607801,"location":null,"logNumber":"US-03122011-0010","longitude":-82.1713632,"occurred":1299977700000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1299981028000,"summary":" star like sphere circles moon","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mingo, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67806"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"North San Juan","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was doing fieldwork on the middle yuba river with my co-worker (we are biologists for a private company).  we were located ~2080 river feet upstream of the tahoe n.F. oregon creek day use area (see file 1).  it was a clear day except for isolated clouds.  we were wading along the north bank of the river, when we both noticed a sound to the south of us.  i thought it sounded like a flock of geese at first; my field partner thought it was a murder of crows.  the sound continued for about 30 seconds, not changing location, pitch or volume.  but then i noticed that the sound had a discernibly metallic tone to it, and it started to slowly rise and fall in pitch.  at this point we both stopped wading to try to figure out what the sound was and where it was coming from.  the sound continued for ~ 45 seconds/1 min, not changing location but in my mind it started to sound like a metallic monkey or banshee, and it had a \"diffuse\" sound to it, like it was moving in a cluster around a static point.  i was scanning the sky to the south/southeast, trying to locate a group of birds when i saw a shiny metallic, white, egg-shaped/oval object move from west to east, coming just above the treeline on the hilltop to the south.  it was moving east.  see file 2.  i know this sounds like \"mork and mindy\" but that's what i saw! if i had to guess i'd say it was no bigger than a hang glider in length.  it looked seamless, with no windows, tail, or wings (although i only had a profile view of it).  it was moving relatively fast and did not deviate from the horizontal axis that it was on.  it passed in front of, then through a cloud and did not re-appear on the other side of the cloud .  i had no more than 5 seconds to view it; my field partner did not see it at all.  the sound continued for another 30 seconds to a minute before abruptly stopping.\r\n\r\ni can't say i felt scared, maybe a little creeped out, but mostly i was just confused as to what was going on.  i didn't specifically ask my co-worker what she felt, but she didn't seem too freaked out by the incident.  after the sound stopped, we both said \"what the hell\" and carried on with our work.\r\n\r\nit should be noted that there is a large lockheed martin community in this part of california, and there is a lockheed martin facility approximately 2.25 miles se of where this incident occurred.  new aeronautical technology?  regardless we could not identify the sound and i can't identify the flying object that i saw.\r\n","distance":"501 Feet - 1 Mile","duration":"00:03:05","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":28212,"landingOccurred":false,"latitude":39.3700973,"location":null,"logNumber":"US-03122011-0009","longitude":-121.1038655,"occurred":1299871200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Egg,   Oval","source":"MUFON","status":null,"submitted":1299977188000,"summary":"~3 minutes of unidentified sound in sky and ~5 seconds of unidentified metallic egg shaped object in sky","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28212_submitter_file1__Locationmap.pdf","http://www.mufoncms.com/files_jeud8334j/28212_submitter_file2__incidentsketch.pdf"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"North San Juan, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67807"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New Orleans","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I caught this ufo morphing and hovering in one of the moons craters.  pretty creepy.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28211,"landingOccurred":false,"latitude":29.9540758,"location":null,"logNumber":"US-03122011-0008","longitude":-90.0629023,"occurred":1299830400000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Bullet,   Missile,   Cigar,   Circle,   Cylinder,   Disc,   Egg,   Saturn-like,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1299975685000,"summary":"Ufo hovering and morphing in lunar crater","tags":["hovering","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28211_submitter_file1__UFOHOVERINGINMOONCRATER2.wmv"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"New Orleans, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67808"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Absecon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My fiance,our kids and i were traveling north on rt.9 heading home. as i was driving my fiance noticed some lights out of her window. she wasnt sure what it was, so then she asked me \"babe what is that?\".  when i looked i couldnt make out what it was and i was sworving to figure it out, she then ask me to pull over and as i come to a complete stop the lights were gone! it seemed as though they dimmed down then disappered. it was a total of six lights (2 rows of three). we then got out and look for what we had seen and there was nothing in sight , not a plane, or any object near that could of produced those lights! in our county we have an airport and an airforce base. so having aircraft circle all around us everyday, i can be sure to tell you what we saw was not a plane!!!! the lights were like orange and red and they were in formation brighter than anything that my fiance and i have seen before.When we got home she called the local news station and asked if anyone else had reported it but no one else did. our friends dont believe us nor does our immediate family members but we find comfort in the fact that we all saw it, including the kids. honeslty we were all pretty much just trying to figure out what we saw.The children were frightened by it, my fiance and i were more or less excited and wanted to see it again so we circled around and then drove a little down the road north bound again to see if it traveled to another spot but we saw nothing. today the 12th i drove out to the spot where we had stopped to see if there was any kind of water tower or some kind of structure that may have produced those lights but it was all clear sky ......Nothing passed the tree lines. what ever it was it seemed as though it was hovering over the bay, i do know for sure it wasn't an air craft, nor any type of star (it was to low to be that). well we remain here with the curiosity in hope to know what we saw but i doubt it!   ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":28210,"landingOccurred":false,"latitude":39.4307503,"location":null,"logNumber":"US-03122011-0007","longitude":-74.4911376,"occurred":1299908400000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Square,   Rectagular","source":"MUFON","status":null,"submitted":1299967603000,"summary":"Weird lights in the sky!","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Absecon, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67809"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Vancouver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was enjoying a smoke outside when i looked up above me & seen a very bright star like object, there where no stars out last night, the object was no bigger then a normal star. when i came back outside 1-2 min later after getting my 7x35 zoom scope i viewed it glowing a very pretty blue for about 60 seconds when it blinked on & off for 2-3 seconds then disapeared before my eyes no clouds covered it at that time. i went outside later that night & it was still gone !!!   p.S.  my mother & i have seen this wierd star like object before, it tends to blink on & off and never moves across the sky like normal stars do though-out the night!","distance":"Unknown","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":28209,"landingOccurred":false,"latitude":45.6425881,"location":null,"logNumber":"US-03122011-0006","longitude":-122.6604661,"occurred":1299916800000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1299964975000,"summary":"A blue \"star like\" object seen disapear !","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Vancouver, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67810"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Millville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Went to a wooded area with a trail with my ex-girlfriend around 1:55 am, around 2 am i wondered off by myself to find a place to urinate and found a nearby lake with a suitable area to urinate  (not in the lake). while in the process of urinating  i noticed an object in the sky probably around 100ft away from me, when i noticed it wasent anything  i have everseen i noticed its features, black triangle with 4 glowing lights, suprisingly quiet, no movement at all like it was spying on me. frightened by what i saw i turn around to run to my car but trip forgetting my pants were down, as soon as i pull my pants up and get up i was suprised to see that the object was no longer  in the sky. the object disappeared in seconds with no sound indicating to me at the moment that i would hear it if the object moved, i immediately went home and recorded my experience in my notebook, i would have reported it to mufon earlier but i did not have internet till late 2010, i did make a sketch by myself the same night","distance":"Unknown","duration":"00:02:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28208,"landingOccurred":false,"latitude":39.4048596,"location":null,"logNumber":"US-03122011-0005","longitude":-75.0324438,"occurred":1182841200000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1299962254000,"summary":"Black triangle ufo in a wooded area...Millville, new jersey","tags":["triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28208_submitter_file1__p_00160.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1355,"locationName":"Millville, New Jersey","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:67811"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Patterson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my friend were bored so we decided that we would go out in the front yard with a blanket and lay on the grass and look for shooting stars, i was 14 and she was 15 at the time. i had only seen one shooting star my whole life at this point so i really just wanted to see another one. we both noticed the same one and i was amazed i got so excited thinking o my god a shooting star but it just kept going and it was really high up there and it was brighter than your average shooting star. it didnt stop moving and we ruled out that it was a plane, it kept moving semi fast and then it got to the horizon of my neighbors house from the level we saw it laying down and by that time it was still pretty high up but it was a lot brighter and larger than in was when it was directly above our vision. once it got the the point where it was brighter and at the house line it changed direction and went to the right so fast we just saw it disappear. we both said to eachother did we just see a *(word deleted--cms/sg) ufo. nothing goes in one direction then darts off in the other that fast and that bright. we had the house phone out front with us and my parents were out at dinner with their friends so we called her mom and we were just blurting out words and couldnt think strait and told her what we were doing and what we saw. her mom seemed almost confused and said maybe you saw a ufo not even doubting our story, she told us to go inside and watch tv or something but it felt like she didnt want us outside. we told my parents when they got home but they just laughed and said we were exaggerating.To this day we remain friends not as close cause we have grown apart but sometimes when we speak we will talk about it just to see if the other one remembers. i honestly can remember it like it was yesterday. 10 years later and i still dont doubt what we saw.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":28207,"landingOccurred":false,"latitude":37.4716001,"location":null,"logNumber":"US-03122011-0004","longitude":-121.129656,"occurred":991621800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,   Star-like","source":"MUFON","status":null,"submitted":1299960516000,"summary":"Just a bright light","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":3568,"locationName":"Patterson, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67812"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Griggsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I don't remember the exact date or time, it was in the early 70's and i was in high school, but it's one of those things, that when recalled,  is as vivid today as when it happened.  my boyfriend and i were out riding around and were headed west down a country road that is a half a mile from town.  he was looking to the south and noticed a light in the sky that seemed to be moving very slow.  we stopped to watch it and could tell it was moving slow because we had lined it up with the top row of wire on a barbed wire fence.  the closest town to the south is 8 miles and that is how far this light seemed to be from us.  it was just a small white light in the sky moving slowly.  for some reason he decided we needed to go into town and tell our local cop.  we were less than a quarter mile from the main highway that leads into town.  we turned right onto the highway and as soon as he began to speed up he asked me if i could still see it.  i turned around to look out the back glass and said, \"uh yeah! it's right behind us!\"  and it was. it was behind us not too far up in the sky as i could see it through the back glass, and it was no longer a small light, it was a big bright white light.  he was driving fast  and just before we got to the city limits we turned right into the parking lot of a local manufacturing plant.  we stopped parallel to the highway and the bright white light stopped exactly parallel to us over the field to the left of the highway.  he said \"what the hell is that!?!\"  we sat there for just a few seconds and the light never moved. then we sped out of the parking lot, turned right onto the highway and into town.  there was a small cafe a quarter mile from us on the right.  it was closed for the evening but the parking lot was a good place to hang out and visit with friends and as we approached it there were several cars there.  the light was still with us, not behind anymore but traveling at the same speed we were and exactly parallel to us.  we turned right into the parking lot and came to a screeching stop. i could still see the light as it had stopped when we did. he jumped out of the car, pointed up in the sky and said to the crowd \"do you see that!\" and just as he said it, the light disappeared and no one else saw it.  to this day when i recall this event i get the same weird feeling...It \"knew\" we were watching it, it seemed to have traveled a great distance in an extremely short amount of time, and it \"knew\" what we were going to do even before we did it. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change","formattedAddress":null,"id":28206,"landingOccurred":false,"latitude":39.7089361,"location":null,"logNumber":"US-03122011-0003","longitude":-90.7245722,"occurred":60336000000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Circle,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1299960181000,"summary":"Bright light chased us","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":14347,"locationName":"Griggsville, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67813"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cocoa Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on vacation, at the beach, staying in a condo on the ocean.  i was out on the condo's 2nd floor with some friends of mine, looking east out towards the ocean at all the beautiful stars, away from all the city lights, while listening to the waves crashing in the background.  there were no clouds at all in the sky.  we were talking about the different constellations, and one of us said, \"it's a perfect night to see a meteor\".  our eyes were already gazed up at the sky, watching faint satelites fly by, hoping to see shooting star.\r\n\r\nprobably 2 minutes later, i noticed these two balls, which seemed not too high in the sky, coming from the east out over the water.  they appeared out of nowhere, and i initially thought is was a shooting star, and yelled \"look\"!  not even a second later, i noticed there were two of them, and they were going way too slow to be a shooting star, not to mention there were two of them together.  \r\n\r\nas the came from the east, they were flying together, side by side.\r\nthey were two white balls, or orbs, not too bright, but visible easily to the naked eye.  they flew together, like they were attached somehow, and then as they came closer to us, they noticably split apart a little more than they had been flying, just for a brief second or two, then came back instantly to their original distance, still moving exactly the same speed and direction.  as they flew over us, i jumped up on the balcony ledge, to watch them continue over the condo, heading east still.  they then did a little 360 circle, and kept on going east, until theywere out of my sight.  the entire event lasted approx. 6-10 seconds.\r\n\r\ni knew immediately that it wasn't anything i have ever seen, as i am a big star gazer, watching satelites, meteor showers, and even the iss fly over whenever possible.  after my instant excitement about possibly seeing a shooting star, i just as instantly knew, this was nothing i have ever seen before, and nothing i can think of that might have looked and acted similar.  as i had said earlier, we had seen planes, satelites, and even birds fly over that night. \r\n\r\nimmediately after, my friend, who is an engineer, tried to explain away what he had also just witnessed, and couldn't come up with a viable answer for it.  me, being a big astronomy buff, also could not come up with anything it could have been with my knowledge.  we conversed for a long time, and even into the next day, what this, or these \"things\" could have been.  nothing we came up with, matched the speed, distance, size, and manuverability of the objects.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change","formattedAddress":null,"id":28205,"landingOccurred":false,"latitude":28.3258567,"location":null,"logNumber":"US-03122011-0002","longitude":-80.6031413,"occurred":1299836700000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1299955186000,"summary":"Two small white balls(orbs) flying together in unison.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Cocoa Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67814"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Three Rivers","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I stepped outside on our deck to smoke a cigarette, i usually look at the stars at night as well.  the house i am in is on the side of a mountain and away from the city.  out of the corner of my eye i saw something bright.  i looked up more and saw this round bright object moving through the sky at a very fast rate.  i have seen ufo's in the sky before, and they are usually a little slower, smaller, and more of a bright white light and looks like one of the dimmer stars moving wierd.  this time it was different than i had ever seen.  it was a lot larger, larger than any of the stars in the sky, brighter than any of the stars in the sky.  in brightness, it was as bright as the moon was last night, only more of a yellow color.  the moon looked white compared to it..Almost like the yellow of a light bulb...But it was so bright that it was almost too bright for my eyes when i looked at it through my binoculars.  when i first noticed it, it was to the right of orion's belt and the moon; it moved straight up, then started moving fast to the left.  it was about 3 times as fast as planes when you see them in the sky..Not quite as fast as a shooting star though...But bigger and brighter than any shooting star i have seen..And i saw a big one later that night.  it moved to the left above orion's belt and kept moving to the left and then went down and disappeared behind the mountain.  when it stopped moving left and started moving down, it was right around the constellation monoceros...Below gemini.  it did not stop and suddenly start going down instead of left, it moved almost like an arc right before it reached the gemini constellation, then went down.  when i looked at it through my binoculars, it looked like a vertical oval that was solid bright yellow light and on the right side of it, was jagged, like the tail end of flames or something...Hard to describe.  but it was definitely not like any i have seen before.  it was very visible without binoculars...But i wanted to try to get a closer and better look at it.  there was no sound at all or flashing..Just solid super bright yellowish-white glowing object.","distance":"Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change","formattedAddress":null,"id":28204,"landingOccurred":false,"latitude":36.4469164,"location":null,"logNumber":"US-03122011-0001","longitude":-118.9000445,"occurred":1299814200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Oval,   Star-like","source":"MUFON","status":null,"submitted":1299923138000,"summary":"Bright yellow light larger than stars or planes, moving fast.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Three Rivers, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67815"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Apache Junction/Mesa bord","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I came home from my parents house and my neighbors are outside. i am talking with my neighbors when i stop them mid sentance because i see several hovering lights and one that is very close.(mabey 10 miles away). i came to find out later that the other lighs were jets on a particular flight path, and are completely explainable. but there is one light that is not. the one that was really close. i hear an apache, well what i am assuming is an apache coming from the southern part of the sky, from what i am guessing is williams air force base. i thought at first that the white light was the helicopter until the helicopter came in to view and started to chase the white light. it chased the light at very high speeds probably 200+ miles an hour and was as close to him as one football field at times. i remarked that it was strange that the light wsa heading in the opposite direction as us yet we could still see it's headlights. i also said it is strange because planes aren't allowed to get that close together. the only was it makes sense to me in my head is if an orb of light with intelligent control was either being held by a silent helicopter which had no flasher and pretty good but not to fantastic maneuvering capability better than the one that was chasing it at least. or being moved under it's own power. i think mabey the light was something that the helicopter was supposed to follow as like training or somehting it didn't make a lot of sense in my head so i thought i would report it. i googled it before i came here and see that alot of people have seen what i have, there is even pictures.I don't know if this is explained or not actually. but it was really strange. on my way to work in the morning there was an commercial on the radio that talked about car accidents , news and aparently they said that there would be planes doing training excercies, at wiliiams throughout the day. was it the night before too? \r\n\r\n180 description: helicopter chases white light at high speeds over apache junction, az near mesa border.\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change","formattedAddress":null,"id":28203,"landingOccurred":false,"latitude":34.0560281,"location":null,"logNumber":"US-03112011-0010","longitude":-111.0892511,"occurred":1299727800000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere","source":"MUFON","status":null,"submitted":1299906219000,"summary":"Helicopter chases white light at high speeds over apache junction, az near mesa border.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Apache Junction/Mesa bord, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67816"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Memphis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking my dog when a very bright light which was moving towards me direction caught my attention and interest. at first i thought it was a plane or helicopter but it neither made any noise nor had any flashing lights. it came from an easterly direction and then turned to the north. it was not flying very fast and just cruised in the aforementioned direction. i stood there watching with great interest until i lost sight of it when it just dulled out and then disappeared. the sky here is very clear tonight. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":28202,"landingOccurred":false,"latitude":35.1594343,"location":null,"logNumber":"US-03112011-0009","longitude":-90.0431401,"occurred":1299899400000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1299903929000,"summary":"Bright non-blinking light","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Memphis, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67817"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fresno","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ive been trying to find there ufos all morning on the news, outside my house and ive been noticing alot of activity on the trees of madera in the fields of pistatios purple looking sticks clowing i took a few pic from far awayand its still there as we speak it trys to move but it just stays in one spot.My eyes started tear saw blur for a few seconds and winds picked up as if it wanted to do that to cover itsself ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28200,"landingOccurred":false,"latitude":36.7511572,"location":null,"logNumber":"US-08082011-0134","longitude":-119.7626661,"occurred":1299867600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Disc,   Egg,   Oval","source":"MUFON","status":null,"submitted":1312872388000,"summary":"Looking through scopes noticed something shining on a tree just siting there!","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":150,"locationName":"Fresno, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67818"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Springfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and a friend was playing a video game when we stopped to go out side to have a cigarette. as soon as i stepped out the door i looked up and pointed to my friend and said what the hell is that? my friend said that its prolly a ufo and laughed, the object was bright white towards the center with red, blue light pulsating from the center. the object remained visible for about 2 minutes then just vanished like someone turning out a light switch. it was not a air plane as we could see planes flying high above in the skies. the object was around 35 degrees in the air towards the south west of republic, mo. \r\n\r\ni would estimate that the object from my viewing point was the size of a half dollar. hwy 60 west and east run right where this object was and traffic could be heard from the location of my home so someone else had to of seen this it was out of place in the night sky at 8:33pm.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":28199,"landingOccurred":false,"latitude":37.2132572,"location":null,"logNumber":"US-03112011-0007","longitude":-93.2911389,"occurred":1299817980000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1299878616000,"summary":"Pulsating lights with center of object being extremely bright white","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Springfield, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67819"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fresno","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ive been suspecting thinggs to happen since the 3-8-11 evnt and almost like a natrual insting came with the conclusion of the world is in danger because i didnt get any positive energy or vibes from that days event.Plus the way there trying to cover this up had me more entersted. as i was reated and continued to look outside i seen star looking object to close and i started to flash my flashlight and it would dim and follow i and my cousins movement.Also now a i write just seen a cigar looking object fleeing away toward the sun.I lost sight of because i came in surfing the web if anybody else is seeing what i was.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":28197,"landingOccurred":false,"latitude":36.7508572,"location":null,"logNumber":"US-08082011-0134","longitude":-119.7675461,"occurred":1299847200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cigar,   Star-like","source":"MUFON","status":null,"submitted":1312872200000,"summary":"Looked outside and noticed a close by star looking object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":150,"locationName":"Fresno, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67820"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lancaster","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was returning from work from 20th west to 20th east after i was near 20th street east on ave h. i noticed a bright white light. it went under another smaller white light. it looked like a star but seemed to low. i would say around a helicopter distance. i could tell how high it was because of the distance . plus the plains are flat with out no mountains or construction it is the desert. the lights went out about a second or 2 after the small white light swallowed the light. . i noticed a blinking red light a short distance always from this. but i dismissed it do to the flashing lights on the towers and antennas that are common. as i made a right turn into 20th street east heading south. it happened again. it repeated it same. the weird part was the bright light moved in a wiggly pattern. towards the smaller light. the lights sizes were about a xmas light and 2 led being one red. after the second one the red light remained. i made it home and was curious about the red light and told my kids to keep an eye out on it. it disappeared in the same manner the white ones did. the red light i can easily dismiss. but the 2 white ones are unexplainable. this happened on 3-10-11 @ 7;18 pm on the north side of av in the direction of the western part of edwards air force base. it was to close to the city to be anything i can think of being tested. also the way it moved the bottom light in the squiggly manner makes me scratch my head. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28195,"landingOccurred":false,"latitude":34.6881646,"location":null,"logNumber":"US-03112011-0003","longitude":-118.1450732,"occurred":1299813480000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1299834479000,"summary":"Lancaster ca","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lancaster, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67821"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Victorville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Went outside at 6:15pm on 03/10/11. looked toward the sky to the west and noticed commercial airplane on usual flight path for a landing at airport in ontario, calif.  noticed very bright white light above and to the right of airplane.  it was in the distance when i first noticed it, moving eastward about 1/4 mile behind and north of plane.  bright light continued to follow as the plane flew east toward the cajon pass (i 15). the planes always pass south of our house, but the bright light came directly over our house and continued to follow the plane when plane turned south over the cajon pass and into the city.  as the plane and the light passed between the mountains and into the city the bright light faded away as if the lights were turned off on the craft.\r\n  i noted that as the plane flew past our house i could hear it's engines but the bright light made no sound, even though it was closer and passed directly above my house.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":28194,"landingOccurred":false,"latitude":34.5459267,"location":null,"logNumber":"US-03112011-0002","longitude":-117.2885265,"occurred":1299810000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like,   Other","source":"MUFON","status":null,"submitted":1299832586000,"summary":"Bright light following commercial airplane","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Victorville, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67822"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Jacksonville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my way home from a freinds house at around i belive to be 8 pm. i get to the intersection to cross the main road in the neighborhood when i see.. well i dont know what i seen honestly it was a ball of light about 5-10 feet above tree lvl. it hovers in the air with out moving much if any for about 45 sec to a min then it starts moving iraticly left to right, then it starts to gain altitude probly acouple hundered feet, then hovers there for about 2 min and then all of a sudden drops down below the tree line and then just as fast as it drops down it shoots straight up into the sky and out of site. what made me see the object in the first place was orriginaly thought it to be street light till i noticed where it was located. the object made no noticable noise that i could here. and my reaction was more or less like nothing happend it wasent till i got home and started thinking about what i seen that i realized that what i belive i saw was a ufo and even then my reaction was like it was no big deal or like it was something compleatly normal or happed on a regular basis. there was no panicking or anything like that. i ..I realy dont know how to explain it or describe the feeling better then that.","distance":"20 Feet or Less, 21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":28193,"landingOccurred":false,"latitude":34.7572224,"location":null,"logNumber":"US-03112011-0001","longitude":-77.4211814,"occurred":1291262400000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1299830987000,"summary":"Was walking home from freinds house when i see a sphere of light probly 5-10 feet above the tree tops","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":99,"locationName":"Jacksonville, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67823"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Aransas Pass","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside in the backyard taking the dog out, when i noticed an orb of light in the sky, it literally appeared out of nowhere, the sky was black and then it appeared, just a bright glowing orb of solid white light, it came from the west of my location where there is the gulf of mexico.I noticed it immediately because it was larger than any other object in the sky, and it was a solid light, and perfectly sphereical.\r\n\r\nwhen i first saw it, and it was moving, i knew it wasnt a star, and it was too big and too close to be a plane. it was only one color solid white light. also the distance it covered in the time it was in the sky was far too fast than ive seen even a jet cover\r\n\r\n the orb moved a short distance heading east so across the sky it moved west to east for about 5-7 seconds, then turned north im assuming, and i saw the light dim and only a small fraction of the light instead, what appeared to be the top section of the sphere, sort of a crescent of light, maybe 1/5th in size of the total sphere, for only a second or two, and then that fraction of light was gone as well and the sky was black again. \r\n\r\nnow in the second before the sphere became just a fraction crescent of light, it appeared to be 'turning' or changing direction and for some reason it looked almost flat on one side but as it was turning the light shrank into that small crescent, remained for only a second or 2, and then was gone. and then the sky was back to how it was before it had appeared.\r\n\r\n\r\nthis wasnt a plane or any known craft that i have seen. there was no sound when it appeared or the entire time it was moving. there were also at least one other craft in the sky, but it was a plane  that looked to be a few miles east of where it appeared and that one for sure and i could tell the difference because the planes had the flashing white and red lights. \r\n\r\nthe sphere i saw did not flash, or pulse at all and the light itself was larger than any object in the sky at the time, except for the moon.  in proportion to the moon it was maybe 1/4th the size of the moon. and it was a perfect circle and looked like a sphere although it could be cylindrical because i only saw the circle of light.\r\n\r\n it wasnt in the air long enough for me to even take a picture or tell anyone to come look at it, it was just there, and as i watched wondering if it was a ufo it was gone. \r\n\r\ni had never seen something like that which had made me want to report it but what i saw in this incident just felt like something nobody would believe but i wanted to report it anyway.\r\n\r\n\r\n\r\n\r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":28192,"landingOccurred":false,"latitude":27.9094677,"location":null,"logNumber":"US-03102011-0010","longitude":-97.1499898,"occurred":1299813540000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1299818809000,"summary":"Sphere of solid white light, moved across sky for few seconds, turned north and dissapeared","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Aransas Pass, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67824"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Amsterdam","country":"The Netherlands","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Being outside to smoke a cigarette one overcast night on february 27, 2011, in amsterdam, netherlands, i looked idly about the street and noticed a light in the sky.  it was a single, star-like object, bright as venus (or brighter), about the same color as the local orange street lights, moving about the same rate as a light aircraft, glowing steadily.  [there is lots of air traffic over amsterdam, but all of it flashes and none have orange lights.]  \r\nonce i noticed the light, i started walking down the street to keep it view as it moved.  it 'flew' silently in an approximately straight line from the southern sky towards the north-west where it flickered out or went behind buildings/clouds--couldn't tell in the dark.  i watched it for at least 10 seconds, long enough to take a close look and ponder over possible explanations.  no one else on the street seemed to notice.  \r\ni'm an experienced sky watcher and student of unusual natural phenomena. for me, this simple, unremarkable object fit none of the usual categories of explanation. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":28191,"landingOccurred":false,"latitude":52.3763257,"location":null,"logNumber":"NL-03102011-0009","longitude":4.8980879,"occurred":1298878200000,"potentialRelations":[],"rating":"Unrated","region":"Noord-Holland","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1299817608000,"summary":"An unidentified orange light was observed briefly over amsterdam.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":10,"locationName":"Amsterdam, Noord-Holland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67825"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Amarillo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Well i'm going to try to tell you about what i saw. my family lived in amarillo texas at the time. i was 14 years old. my friend *(named deleted--cms/sg)(can't remember her last name) and i were going to a birthday slumber party ( the birthday girls name was *(name deleted--cms/sg) and i remember her birthday was around lincolns or washington's birthday-don't know why i remember that) we put our pj's in our pillows and carried them over our shoulder. the park was on the next block-these were pretty long blocks. *(name deleted) mother was picking us up at the park. i remember it still being daylight at this time. we were walking down the sidewalk towards the park when we heard a low humming sound behind us. we turned around and there was nothing there. we continued toward the park. i saw an old woman or man ( can't remember which) standing inside their door just sort of frozen looking- i said to *(name deleted)\" look at that old zombie,\" and we laughed and continued walking. we heard the low humming sound again. we turned around ( i expected to see a car or something coming down the road,but there was nothing.We walked on just a few steps when there it was again! that low humming sound- i stomped my foot and turned around saying \"what is that!\" when bam! it was right there! above and behind us. i got really excited and started shouting- \"it's a ufo! it's a ufo! do you see it? now this is where things slowed down-i picked my foot up off the ground to take a step towards it and at the exact same time (i mean exactly like the same thought at the same time like one thing-can't explain it good...) the ufo swooped towards me! i did a backwards lean and said \"whoa!\" then things slowed down more(like slow motion) i felt someone yanking on my arm and yelling run! i turned my head to see *(name deleted) face. she was scared- i mean pee in your pants afraid! i wasn't afraid until i saw her face. we ran on towards the park because we were closer to it than my home where we started.When we were running i would keep looking back and the ufo was pacing us- no slower- no faster- staying exactly with us. we got to the park and got under a tree. i could see it through the limbs. i stepped out from the tree to see it and all of a sudden it was like it got sucked up by a vacuum- blink and it was gone! then i felt strange like time was getting normal again. i noticed lights sweeping around and behind me. it was *(name deleted) and her mom coming around the corner in their car. it seemed strange to me the brightness of the headlights. well i told them all about it very excitedly. *(name deleted) didn't want to talk about it, that made me mad. i told everyone about it for weeks and weeks. my friends told me to stop talking about it. my family did not want to here it anymore. my mom told me i was being silly.Well i never did stop talking about it. as for the description- it was metallic- disc shaped- running lights around it- something was sticking out of the bottom of it. it was about 20 -30 feet across.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":28190,"landingOccurred":false,"latitude":35.2306371,"location":null,"logNumber":"US-03102011-0008","longitude":-101.8224169,"occurred":35712000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1299800513000,"summary":"Followed by metalic disk- ran but it paced us-then took off like a shot","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":14630,"locationName":"Amarillo, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67826"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mankato","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Dec 14 approx.  7pm.  near lake crystal.  pulled over, video'd 3 interacting blinking ufo's. very slow moving interacting manifestations. if you want to see the rest go to *(link moved to additional evidence section--cms/sg).","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":28189,"landingOccurred":false,"latitude":44.1703875,"location":null,"logNumber":"US-03102011-0007","longitude":-93.9955796,"occurred":1292400000000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Circle,   Other","source":"MUFON","status":null,"submitted":1299799999000,"summary":"Blinking","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":85,"locationName":"Mankato, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67827"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"San Luis Obispo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just as i had seen the night before this, only an hour earlier this night i went outside to have a cigarette, also with the same witness.  we look up after last nights sighting and see a reddish orange light moving across sky to slow to be a plane or satellite in the southern view of the sky it came from the west above the ocean headed east. i turned to go get my girlfriend who was inside as she didnt believe me the night before she came to the front door which is facing south and looked into the sky right when the object was straight south of me, where i would assume it to be hitting the southern california coastline. it disappeared. she asked if it was a plane that was flying above us saying thats all she could see. of course she didnt see it.. i shut the door and left her alone. we sat outside looking in southern sky for another 5 to ten minutes and discussed it.\r\n\r\n the plane was more above our central coast the ufo was south of here.\r\n\r\nthe only difference from what i seen one night earlier and this night were the direction the craft was flying, the area of the sky it was in, and the height of the craft on the second night seemed to be much lower than the first night. lower than  big planes fly but higher than little cessnas. it was also closer to my location enough so that i could tell without a doubt that i was not seeing a plane or helicopter.\r\n\r\nplease report these lights if youve seen them too.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"","formattedAddress":null,"id":28188,"landingOccurred":false,"latitude":35.2893224,"location":null,"logNumber":"US-03102011-0006","longitude":-120.6573556,"occurred":1299737700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1299789444000,"summary":"Second night in a row ive seen lights moving through the sky silently then disappear","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"San Luis Obispo, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67828"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"San Luis Obispo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live one block off the beach. the sighting was in the north view of the sky. i stepped outside to smoke a cigarette with a friend and we noticed a plane in the sky flying south down the coast, the plane attracted us to another orangish red light moving much slower and with no noise in a northwest to southeast direction. the sky was clear with a full view of stars as the unidentified craft reached the center of our view of the sky it disappeared. we looked for another few minutes for any movement and saw nothing. this incident was repeated the following night about an hour earlier. i will make a report of that too. is anyone else seeing these lights up the coast at night?. these encounters were only visual, there was no feelings tied to the sighting that i can relate, at first it seemed to be a satellite but satellites dont go this slow and they dont disappear halfway across the sky. we should have seen this craft for another 5 minutes at the rate it was going. i know of no craft that can simply disappear.","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"","formattedAddress":null,"id":28187,"landingOccurred":false,"latitude":35.2890424,"location":null,"logNumber":"US-03102011-0005","longitude":-120.6522956,"occurred":1299654000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1299787417000,"summary":"Red/orange lights attached to unknown craft moving slowly and silently through sky","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"San Luis Obispo, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67829"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Maricopa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was in backyard smoking ciggarette when i looked up at the sunnyslope mountain the one with the big white s on it. all of a sudden a bright red ball of light came from behind it and was dropping little balls of ligh. there was no sound what so ever, it dropped at least 2 or 3 balls of light. they would fade out before they hit the ground i ran inside to get my cousin to see it we both rushed out to see if it was still there,it was we observed it for about about another 10 to 15 seconds before it got very bright and then it shot out sparks all over the place almost like a sparkler firework but out didn't make any sound.It was new years yes but fireworks make some kind of noise but thing didn't make any noise at all. after that it disappeared and i lost sight of it it was an unexspected exsperience i mean it completely vanished. thought it might have been a plane at first but again no noise and the while craft was a red light really bright i stood there for a few seconds to make sure it wasnt a plane my heart starting beating fast got excited i have seen one before but was years ago.My cousin also witnessed the same thing he did not see the craft dropping the balls of light but he did see the craft shoot out the sparks. the sighting was at night.Afterwards me and my cousin were extremely excited because we knew how rate it was to witness a ufo, we stood there in amazement as it silently flew over the neighborhood before dissppearing","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":28186,"landingOccurred":false,"latitude":33.0581063,"location":null,"logNumber":"US-03102011-0004","longitude":-112.0476423,"occurred":1293868200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle,   Oval,   Sphere,   Star-like","source":"MUFON","status":null,"submitted":1299776026000,"summary":"Back yard smoking ciggarette red ball of light came from behind mtn","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":68,"locationName":"Maricopa, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67830"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"York Haven","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"     on 09-18-2010 at around 20:30 i was in the backyard grilling when i noticed an orange orb in the sky. i went to get my wife who was in the house preparing the remainder of our dinner. she and her brother came outside with our son and we then called her uncle who on the second story of the house in his room with his girlfriend. my wife's father had just come back in the house from the alley where his cousin was still working in the garage. there were 8 of us total who, within about 1 minute from the first time i seen the object, were witnessing this strange phenomena for about 20 minutes. \r\n      when we first saw the object we all began to wonder at what it might be. we immediately knew that it was not any type of normal aircraft as we all have served in the military and are very familiar with aircraft and air travel. as we paid close attention the orb it seemed to understand that we were interested in it and that it was noticed by us. at this point it begin to descend upon us and it's shape begin to be more recognizable. once we all noticed the same features and talked about it for about 2-3 minutes, we begin to notice that it was traveling with several other orbs which were not the same in color but were the same in shape and form, as well as motion. this continued for about 10 more minutes. \r\n      after this, the orb begin to make slow broad sweeping motions across the sky staying at approximately the same altitude at which time we saw 2 star-like projectiles issue out of the western side of the orb, as we were facing towards the north. we continued to observe this orb for about 10 more minutes after which time it moved higher in altitude and off to the north west at a steady pace dimming, brightening, dimming, brightening until it passed from view into the night sky only to return later on.\r\n      when the orb had faded from view we all went into the house that we might see what pictures and video we had gleaned from our encounter with the object that had shown itself to us. after about 25 minutes of looking at these pictures i looked at the front door because i felt a warmth coming from it. i heard a voice in my spirit that said, \"they're back out here.\" i didn't pay close attention and looked away only to feel the warmth again and look back at the door when i heard the same thing in my spirit: \"they're back out here.\" this time i ran out the front door because i knew that i was hearing from a power greater than myself that i needed to witness this event again. (just so you know i was a skeptic before this and told yah [god] that he would have to prove these things to me if they were in fact true.) he in fact did just that. \r\n       after seeing the objects from the front of the house we all ran back to backyard where we saw the orange orb with its' friends for about 7-10 more minutes before it left in the same manner as before. there were 8 of us that saw this at the same time in the same place. this was a very exciting time for all of us and i believe that it was it meant to happen that we might all witness creation that we are not yet well acquainted with. . .    ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":28185,"landingOccurred":false,"latitude":40.1109277,"location":null,"logNumber":"US-03102011-0003","longitude":-76.7158012,"occurred":1284867000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Fireball,   Saturn-like,   Sphere,   Star-like,   Unknown","source":"MUFON","status":null,"submitted":1299751462000,"summary":"Orange sphere appearing and seemingly wanting to be seen by eight persons.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28185_submitter_file1__9-18-10195.JPG","http://www.mufoncms.com/files_jeud8334j/28185_submitter_file2__9-18-10196.JPG","http://www.mufoncms.com/files_jeud8334j/28185_submitter_file3__9-18-10197.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":172,"locationName":"York Haven, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67831"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Kingman","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Golden valley, az again,\r\n\r\n me and my wife were traveling eastbound on hwy 68 coming home from work.\r\n  i have been having vehicle trouble causing me to pull over and call for \r\n  tow service. while waiting outside something in the northwest sky caught\r\n  my eye. the signature light yellow to amber colored orb traveling silently\r\n  across the sky until dimming to a dull grey and then disappearing. \r\n  i would judge this object as traveling below any aircraft flight paths.\r\n  i called my wife who was waiting in the vehicle and drew her attention to\r\n  it.\r\n  she got out of the vehicle and watched it with me until it faded as these \r\n  objects always do.\r\n  notably about these objects is \"how\" they move. if you watch very \r\n  carefully you will notice their movement is not in a straight path but in\r\n  a jittery, wobbly type of motion. it is not extremely noticeable but you \r\n  can see it.\r\n  it has been about a week and a half to two weeks without any real activity\r\n  here or it could be \"my\" timing of seeing them but they are for sure still\r\n  happening.\r\n  i managed to take some pictures with my phone but image quality is not the   \r\n  great.\r\n  \r\n     \r\n  \r\n  ","distance":"Over One Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":28184,"landingOccurred":false,"latitude":35.192213,"location":null,"logNumber":"US-03102011-0002","longitude":-114.0479865,"occurred":1299723660000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere,   Star-like","source":"MUFON","status":null,"submitted":1299748580000,"summary":"Light yellow orb traveling n. west to s. east","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/28184_submitter_file1__2011-03-0918.22.51.jpg","http://www.mufoncms.com/files_jeud8334j/28184_submitter_file2__2011-03-0918.22.44.jpg","http://www.mufoncms.com/files_jeud8334j/28184_submitter_file3__2011-03-0918.22.51.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Kingman, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:67832"}],"last":false,"totalElements":82758,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1891}
