{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Moline","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Cylinder ufo glowing a bit equal spaced brighter lights on length.  maybe 7 lights on side.  silent. fast.  they were in a hurry to get wherever they were going.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":63990,"landingOccurred":false,"latitude":41.4914822,"location":null,"logNumber":"US-03162015-0016","longitude":-90.4876221,"occurred":1426563900000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1426569476000,"summary":"Cylinder ufo glowing equal spaced lights on length.  maybe 7 lights on side.  silent. fast.","tags":["ufo","lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"61265","daysBetweenOccurrenceAndSubmission":0,"locationName":"Moline, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51149"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cork","country":"Ireland","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside the back of my house late at night for about 5 minutes at around 2 am. i was looking up at the night sky briefly when 2 bright star-like objects caught my attention. i looked over directly at these 2 star-like objects up in the night sky and at first they were bright and stationary for around 3 seconds, then they became intensively bright, brighter than any star, plane or man-made space related vehicles that i know of such as satellites and the iss. while i was watching them they suddenly began to move together across the sky with amazing acceleration as if they went from 0mph to 11000mph in the blink of an eye. as they did this they then became very dim and slowed down to what seemed almost like a complete stop. i should also mention they were moving in my direction so if i was looking 90 degrees straight up they would be passing over to the left of me roughly. \r\n\r\ni cannot be certain what these objects were but they were unlike anything i have seen before and the physical behavior was unlike any comet that i have witnessed.","distance":"Unknown","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":63989,"landingOccurred":false,"latitude":51.8968917,"location":null,"logNumber":"IE-03162015-0015","longitude":-8.4863157,"occurred":1411282800000,"potentialRelations":[],"rating":"Unrated","region":"Cork","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426566370000,"summary":"2 starlike objects stationary then began to move very fast and momentarily became intensly bright as they went across the sky.","tags":["none"],"timeZone":"Europe/Dublin","timeZoneName":"Europe/Dublin","tweeted":0,"urls":[],"weather":null,"zipcode":"none","daysBetweenOccurrenceAndSubmission":176,"locationName":"Cork, Cork","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51150"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Readsboro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi, \r\n\r\ni hesitate to get into detail about this because i just don't think my family really wants the attention. but i think its important info so for what it's worth:\r\n\r\ni grew up with my brother, mom and dad on a hilltop in readsboro vermont (used to be called billygoat hill). \r\n\r\nthere were numerous ufo events that my mom, brother, neighbours spoke of...They are:\r\n\r\n1- my mothers tells us of waking up one night in the middle of the night. the bedroom had three walls with windows out on the property around the house...The house was at least a mile from other houses. she says she woke up and the room was full of blue light coming in through all windows on three sides of the room. she looked around & thought 'that's strange'...Tried to wake my father who for some reason wouldn't wake up...And then she simply went back to sleep.   she never spoke about it to anyone really except for us and she doesn't want to look into it/ get hypnotised as she doesn't want to stir anything up that may be there. \r\n\r\n2- one day my mom went to visit elderly neighbours that lived a mile or so away. they were country types...I think farmers...In their 70s or 80s. randomly they told her a story about 'something strange happened last night...We woke up and there was a light...We went outside to see and there was a big lit up disc above the house...Stragest thing'  etc and then they said they just went back inside and went to bed. my mom remembers being pretty wowed by this and by the fact that they were so matter of fact about it and about not knowing what it was. \r\n\r\n3 - one day my brother remembers seeing something fly by our bay window and my mom coraborates that he started yelling and went running outside to chase it. he was about 10 at the time. he says he remembers it being mettalic and small...Like frisbee sized and that it flew in front of the window and then flew off. \r\n\r\n4- my mom and brother one day witnessed a 'cloud' above the house move at right angles and zip around.\r\n\r\nagain, our house was 200 acres in the middle of no place. my mom said something about the locals in readsboro calling it ufo mountain at the time....So anyway may be worth it for you guys to look into this town and see if these things continue. \r\n\r\ni was a little kid at the time like 3 - 6 years old or something. i don't recall having anything happen to me personally. again, please don't post any of this ...Especially my name ....Just want you to know about this town in vermont and that back when we were there in the 70s / early 80s. seems lots of weird stuff was going on. \r\n\r\n\r\nalso please not phone numbers given are random / invented...I really don't want to be contacted by phone. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":63988,"landingOccurred":false,"latitude":42.7718758,"location":null,"logNumber":"US-03162015-0014","longitude":-72.9470426,"occurred":284029260000,"potentialRelations":[],"rating":"Unrated","region":"Vermont","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426544298000,"summary":"Many events on hilltop in vermont","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":13223,"locationName":"Readsboro, Vermont","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51151"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Washington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the night of march 15 2015 at about 10:30 pm est. my son, who lives in\r\ntown called me and said that him and his girl friend were watching these\r\nufo's or flying lights above their home. they were very excited and said\r\nthey had been watching them for quit a while, not sure exactly how long,\r\nbut at least a few minutes. my son was describing the first one that got\r\nhis attention as the mother ship. he described it as three white lights\r\nthat were in triangle formation at shoulder width apart if your hands were\r\nheld at arms length. he said that he thought it was a solid black object\r\nbetween the light. after that he and his girl friend saw more groups of lights moving across the sky. they had been watching them for around 15 to 20 minutes by this time,( i'm writing this the morning after the event and\r\nhaven't talked with him since last night), so the time maybe a little off.\r\n     they had been laying in their backyard on their trampoline looking at the sky, as it was one of the first nice day's since the bad winter weather, and began to notice the lights. they said i should come over and check it out. i grabbed my binoculars and video camera and headed over.\r\nthey live in town about 2 to 3 miles away. when i got there they came out to met me and were still very excited. i didn't believe they would still be\r\nthere,( the lights) when i got there. they began telling me more about it as they\r\npointed to the sky. i was looking up also, as they told me, hoping to catch a glimpse of something but not really expecting it, when three lights in triangle formation when zipping almost over head. they were going south to north at a high rate of speed. i would estimate their size as the size of an around your thumb at arms length. this is a guess as i think back on it today as i didn't stick my thumb up in the air when it happened. anyway i thought, well at least i got to see one. little did i know of what was to come. \r\n    well, they began asking me what it was, right off the bat i knew i couldn't explain it, and by this time this event had been going on for at least half an hour. the sighting lasted for over 2 more hours with between 30 to 50 groups of lights,at least, traveling in all directions, mainly north, some making swerving high speed turns. some lights stayed in fixed positions to each other some did not. some lights were rectangle some round, and one looked like 3 brightly lite seagull wings that moved closer and farther apart from each other as they speed across the sky. this group i observed with my binoculars and was the most impressive to me. some of the lights that made up the formations were clearly seen as rectangular lite white lights that stayed in fixed formation as they sped at high speeds across the sky. the smaller groups moved faster than the large ones. the mother ship my son saw moved the slowest. they event seemed to peek in intensity after about an hour or so and began to taper down only to surge back up again a little later. as we lay watching this on the trampoline it just seemed surreal to me. it was like watching a fireworks display. it began to overwhelm me in being able to keep track of what i was seeing. it was unbelievable yet there it was, like a space highway in the sky. the sky had a thin cloud cover with clear spots here and there. some were seen through the light clouds, some very clear in the openings. i have been interested in the subject since i was a young boy, i'm now in my sixty's, and that's probably why they called me. i've always been interested in astronomy and have owned more telescope than i can remember and logged many, many, many hours sky watching and never experienced anything like this. i have no idea what it is. nothing i know of can fit the bill. there were four of us who witnessed this, their daughter came out after about an hour or so to watch. i would think that others would have had to witness this. after two hours or so it was getting late and my son had to work that day and the ufo flap was winding down and we decided to hang it up. after i returned home i went outside to see if i could see anything, but nothing. i did try to use my video camera but it would only pickup dark sky. i'm not really a camera guy and you may be able to set it to record at night but i have never used it that way. i do believe that these lights were working together and had a common purpose, all appearing in the same wave and mostly going in the same direction. they seemed to move alike and made up of the same kind of lights. anyway i thought this sighting was significant enough to report. hopefully more witnesses will come forward and report this and possibly add more details.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":63987,"landingOccurred":false,"latitude":38.65921520000001,"location":null,"logNumber":"US-03162015-0013","longitude":-87.172789,"occurred":1426402800000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Square,  Rectangular","source":"MUFON","status":null,"submitted":1426539728000,"summary":"Multiple groups of lights and single lights coming from different directions over a three hour time span.","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"47501","daysBetweenOccurrenceAndSubmission":1,"locationName":"Washington, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51152"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"New Denver","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was dropping off my girlfriend and her daughter when i noticed a very bright light about three quarters of the way up the mountain to the west of us.Having lived in the area for more than 25 years,noticing something out of place like this was obvious.At first i noticed it and pointed it out to my passengers who thought it was a star,or planet,but because of its position along side the mountain and not in the sky above,we had to think again.While we sat in the car and watched it,it hovered in one place and the bright white light pulsated and undulated.I was excited to witness this event as my girlfriend and daughter were always somewhat skeptical to the whole idea of u.F.O.S. i have personally witnessed many appearances of strange lights and crafts in our area over the years and am always exited to see them. i then dropped off my passengers and quickly drove home (3 blocks away) to get my son to come and see the object as well,but by the time we got back, there was nothing but darkness up the entire mountain range. this happened within less than 5 minutes.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":63986,"landingOccurred":false,"latitude":49.97220923822467,"location":null,"logNumber":"CA-03162015-0012","longitude":-117.36322749558164,"occurred":1426129200000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426536961000,"summary":"Was so bright it grabbed my attention, hovered alongside mountain, light pulsated","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"v0g1s0","daysBetweenOccurrenceAndSubmission":4,"locationName":"New Denver, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51153"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Unknown","city":"Basile","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting outside for about 5 minutes when my dog began barking.I looked around to see what i could but there was nothing there.About 5 minutes later i just happened to be looking up in the s.W sky when my eye caught the site of a bright white light in the sky.It was moving much faster than a plane but much slower than a falling star.It seemed to be moving straight across the sky in a horizontal direction,it slowed almost to a stop then picked up speed and left the area as fast as it came in.The whole event only lasted about 3 to 5 seconds.After it was gone my mind couldn't keep up with what i had just witnessed,i began replaying it over and over in my mind.I was thinking,was it a plane,no way to fast.Was it a meteorite,no its way to cloudy out here to see that. i then hurried inside and told my wife that i think i just saw a ufo outside.She wasn't surprised because we have seen much stranger things than that before.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":63985,"landingOccurred":false,"latitude":30.4866912,"location":null,"logNumber":"US-03162015-0011","longitude":-92.5866923,"occurred":1409641200000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426536855000,"summary":"Sitting outside about 11pm dog started barking, 30 seconds later,saw lighted orbe moving pretty quick then slowed for a second then zoomed of .It wasn't a falling star because it was very cloudy that night","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":195,"locationName":"Basile, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51154"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Farmington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving down highway 4 and at 6:30 a.M. i saw what i thought was a comet and then realized i had heard of none being visible at this time. it had the glow with a misty tail, exactly like a comet. i watched the object descend(?) as i watched it, it just kinda faded away...","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":63984,"landingOccurred":false,"latitude":37.929925,"location":null,"logNumber":"US-03162015-0010","longitude":-121.0002168,"occurred":1426512600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1426535995000,"summary":"At first i thought it was a comet, but then it just faded away.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Farmington, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51155"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Salem","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband and i had just gotten home and we were near our garage and i saw a large dark slow moving object in a triangle shape moving(gliding) smoothly across the sky.This triangle was very dark and blended with the sky.We watched it for about a minute or so.I see why people say they did not have time to take a photo because you are  so amazed and do not want to take your eyes off it.Dawn and david ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":63983,"landingOccurred":false,"latitude":40.909072300000005,"location":null,"logNumber":"US-03162015-0009","longitude":-80.8545001,"occurred":1426402800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1426535912000,"summary":"Dark blended in with sky triangle no lights no sounds","tags":["photo","triangle","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"44460","daysBetweenOccurrenceAndSubmission":1,"locationName":"Salem, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:51156"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Richmond Heights","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside to smoke and and saw an orange ball going much faster than a plane but much slower than a meteor. about 5 seconds later another identical object entered view. the objects remained at the same speed as the other and \r\nappeared to be quite high.  the 2nd object was almost directly behind the first but slightly to the right (from the first object perspective)and this formation did not change.  i waited until today to report since i assume they were military planes from safb and the orange glow was the reflection of sunlight, if they were on there way to fly sorties on isis i didn't want to warn anyone. since it was a bit after 8pm that would mean they were flying quite high.  neither had the red/green lights on.  i did not experience any unusual feelings during the event other than it seeming strange, normally it would be black stealths that would not be that reflective.  i lost sight as they passed the horizon.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63982,"landingOccurred":false,"latitude":38.61358625737863,"location":null,"logNumber":"US-03162015-0008","longitude":-90.34499110278281,"occurred":1426230000000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426531569000,"summary":"2 orange balls, traveled in line formation distance between each stayed the same.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"63117","daysBetweenOccurrenceAndSubmission":3,"locationName":"Richmond Heights, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51157"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Horse Cave","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On sunday afternoon (march 15, 2015) at approximately 5:30 pm i was on my back deck grilling a couple of steaks for supper. a couple of flocks of  cranes were flying over headed north. as i was watching them i noticed a passenger plane headed south. this plane must have departed louisville, ky. as it was not extremely high in the sky. the sun was low in the west and sunlight was being reflected from the plane. the reflected sunlight was what caught my attention. while watching the plane, i noticed a round silvery object to the planes left side. this object was keeping pace with the plane. the plane started making a slow turn toward the southeast and the object made the same turn. as the plane was going almost directly overhead the object went from the planes left side, crossing under it and then went above the plane on the planes right side. there is a knob directly in front of my home and i watched until the plane and the object disappeared from view over the knob.\r\n\r\nthe size of the object could be compared to the size of a pea at arm's length. the color was what i would call silver transparent. the plane was not leaving a contrail.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":63981,"landingOccurred":false,"latitude":37.18779749737337,"location":null,"logNumber":"US-03162015-0007","longitude":-85.88822005814889,"occurred":1426465800000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426522813000,"summary":"Object traveling to the left of passenger plane","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"42749","daysBetweenOccurrenceAndSubmission":0,"locationName":"Horse Cave, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51158"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Moonta","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was taking photos of a storm that was approaching moonta bay in south australia from the nw, captured something in one of the pictures, it is small but i am unsure about it. pictures taken before and after show nothing similar to the object in them. the three pictures i have uploaded were taken one after the other with the one containing the object being the second image taken. a few other people from around town i mentioned the object to have said they saw something flying around in the clouds glowing a red or orange colour that same day. i didn't notice the object at the time only until after when i reviewed the photos.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other,Unknown","formattedAddress":null,"id":63980,"landingOccurred":false,"latitude":-34.0686198,"location":null,"logNumber":"AU-03162015-0006","longitude":137.5918907,"occurred":1414453020000,"potentialRelations":[],"rating":"Unrated","region":"South Australia","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1426522637000,"summary":"Took a picture of a small but strange object, zoomed in it contains red and has a swirly look to it.","tags":["none"],"timeZone":"Australia/Adelaide","timeZoneName":"Australia/Adelaide","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63980_submitter_file1__DSCF2289.JPG","http://www.mufoncms.com/files_jeud8334j/63980_submitter_file3__DSCF2288.JPG","http://www.mufoncms.com/files_jeud8334j/63980_submitter_file4__DSCF2292.JPG"],"weather":null,"zipcode":"5558","daysBetweenOccurrenceAndSubmission":139,"locationName":"Moonta, South Australia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51159"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Canberra","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I first saw the object as i entered a bus stop shelter and turned to look across the street (west) and then up as i glint of light caught my eye. i first thought i was seeing a plane - sometimes planes take that flight-path, but not often. then, as i watched it, i realized i was seeing a disc-shaped object not a long tube with wings - planes are easily identifiable. this was circular, and appeared to be spinning or pulsing. it moved slowly - slower than a plane would normally, at that height. i was not surprised, bewildered or negatively affected by the sight of the object as i often see objects like this in the area from time-to-time. after i lost sight of the object as it went behind or over the lump of cloud, i was glad i'd seen it. i lost sight of the object, as i said, as it passed above a cloud. there was intermittent cloud-cover that day, but otherwise a sunny day.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63979,"landingOccurred":false,"latitude":-35.275249800000005,"location":null,"logNumber":"AU-03162015-0005","longitude":149.1374743,"occurred":1426440600000,"potentialRelations":[],"rating":"Unrated","region":"Australian Capital Territory","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1426513155000,"summary":"I saw a disc-shaped object moving slowly across the sky ","tags":["disc"],"timeZone":"Australia/Sydney","timeZoneName":"Australia/Sydney","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Canberra, Australian Capital Territory","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51160"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was new years and we just left a friends house and my girl friend and i were headed home. once we turned down manchaca rd off of slaughter heading north i noticed a bright strange red sphere object not moving at all. i then noticed another one not far from it. same color and not moving as well. i've never seen anything like this and told my girlfriend to pull over. we did and we stayed there just watching both objects. they never moved not even a little. after about five minutes of watching them my girlfriend got freaked out. we were right under them and i told her i think this is my first ufo sighting. she made us leave after that. another car also noticed the objects and stopped across the street. they yelled to us asking us if we were observing the same thing. i said yes. we watched them for about five minutes and then left. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":63978,"landingOccurred":false,"latitude":30.19350859999999,"location":null,"logNumber":"US-03162015-0004","longitude":-97.8114781,"occurred":1420104600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426501657000,"summary":"2 floating in place red orbs not moving extremely bright ","tags":["floating"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"78745","daysBetweenOccurrenceAndSubmission":74,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51161"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Fort Wayne","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My cousin and i left my apartment around 9:15 pm on 3-15-15 we were going out to eat. i looked up and noticed a bright white orb hovering  above a small skyscraper and got my cousins attention. at first we thought helicopter but no aviation lights and it did not move. we then saw a high flying airplane going by it but at a much higher altitude and they were not even close to the same let alone no airplanes just hover. we then thought maybe it was a tower on the top of the skyscraper with the lights for low flying traffic. so i got out my digital camera and my cousin got out his apple i 6 plus and we zoomed in on it. it was not a tower as nothing was attached to it. he took a pic of it and i got a nice zoomed in shot of it. we then moved across the alley to an open lot with a clearer view of the object and he took more photos and i shot a few more videos of it. after 15 minutes we noticed it was actually moving but very slowly across the sky. we then left. after we got home we uploaded our pictures and videos and looked at them closer. the weird thing was 2 of his shots had a different craft in it along with the orb that we did not see and did not show up on my video. it was different than the white orb. it was 2 yellow orbs together. now the first sighting was nw of the parking lot outside of my building and it's slow path was going n.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":63977,"landingOccurred":false,"latitude":41.08340816444707,"location":null,"logNumber":"US-03162015-0003","longitude":-85.13292406120573,"occurred":1426479300000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426497315000,"summary":"Saw a white orb above a skyscraper downtown.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63977_submitter_file1__7F3D55A9143B3B4DDBF7AA251E86818ABF85D9739E3C4F9DBBpimgpshfullsizedistr.jpg","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file2__BC80BB0BF8718EA80E1FD0BE94D31AEBACCFA203981097B879pimgpshfullsizedistr.jpg","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file3__75A91EE44A056A22B1E7B13001B557F8CEE720F8A345AFB9B7pimgpshfullsizedistr.jpg","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file4__5357D44F8FB414C170CF09D805384F85F8D35266465C3F739Epimgpshfullsizedistr.jpg","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file5__1001032.MP4","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file6__1001029.MP4","http://www.mufoncms.com/files_jeud8334j/63977_submitter_file7__1001031.MP4"],"weather":null,"zipcode":"46802","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fort Wayne, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51162"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Collinsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just returned home from rural southern illinois.  during my ride in the darker rural areas i noticed a cluster of stars and was debating if it was perseus, so i decided to go out onto my deck to see if i could determine for sure.  i was looking toward orion, i had used orion as a reference point earlier, when \"movement\" of something caught my attention to the west of orion. it took me a second to understand what i was observing move through the sky because it was almost identical to the color(s) of the night sky, except for the edge which seemed to be ever so slightly reflecting light from the town below it.\r\na large circular shaped object, mimicking the night sky in color, as if for camouflage, was moving in the west going north.  there are a few stratus clouds(guessing they are under 6,000 ft.) tonight and this circular object was below the cloud cover, which is probably the only reason i was able to get a visual fix on it.  it was blocking the clouds behind it, even though it was the exact color of the night sky, it faintly stood out because of the cloud cover and the edges having an ever so faint light reflection.\r\nits flight path was steady and smooth. when i realized i was seeing something out of the ordinary, i focused on whether i could hear any sound, there was no sound, and there were no contrails of any kind.  i held my fist up to try to determine size, it was larger than my fist at arms length.\r\ni lost sight of it due to a tree line and as it got further away, the edges were not as easy to make out visually.\r\ni would say my reaction was of being in awe.  i know i said out loud to myself, 'what was that.....What was that?'  i stood on the deck for about five minutes, looking to see if there were possibly others in the area.  i then became uneasy standing out there and returned into the house.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":63976,"landingOccurred":false,"latitude":38.68004934921109,"location":null,"logNumber":"US-03162015-0002","longitude":-90.01575749390126,"occurred":1426482420000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1426490977000,"summary":"Large circular object, mimicking the color of the night sky.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"62234","daysBetweenOccurrenceAndSubmission":0,"locationName":"Collinsville, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51163"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Woody Creek","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Greetings,\r\n\r\ni was traveling west on upper river road just past the woody creek post office in woody creek,colorado at 7 pm on friday evening, february 20, 2015 -\r\n\r\ni was driving along the windy two lane road and i noticed ahead and to the north, above the foothill,a large and brilliantly glowing light - i slowed to a crawl and observed, i then came to a full stop and just looked at the stationary light with smaller colored lights on the perimeter- it was just hovering there and it was clearly not a house or yard light, it was much larger and brighter- did not see a craft- i stared at it for 15 minutes and thought there was no way i was going to pass,i was nervous and was not up to meeting with our star neighbors that evening-i turned around to go the the woody creek community center to have other folks take a look to confirm what i was seeing and as i was driving i was curious to see if the light was still there so pulled over and looked north west and it was gone.\r\n\r\ni was extremely nervous to travel back home in the direction where \r\ni saw the hovering light but i went for it and floored it til i reached highway 82. the waxing new moon and venus were in the mid southern sky and this brilliant golden light was to the north-\r\n\r\nthanks for the opportunity to share my story-\r\n\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":63975,"landingOccurred":false,"latitude":39.28258350000001,"location":null,"logNumber":"US-03162015-0001","longitude":-106.8943041,"occurred":1424487600000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1426490734000,"summary":"Brilliant stationary light with perimeter colored lights","tags":["lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"81656","daysBetweenOccurrenceAndSubmission":23,"locationName":"Woody Creek, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51164"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I dont know if this is where i report this, but if you have access to the iss recordings please go to roughly the 11:35pm (est) point for today (3-15-2015). look towards the top middle section of the screen. something seemed to be appearing and as soon as i noticed it the feed was cut for about 30 seconds before coming back on. but when the feed came back it was pretty obvious that it wasnt live, as it didnt appear to be in the same position over earth as it was before the feed was cut.","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"None, Unknown","flightPath":"Unknown","formattedAddress":null,"id":63974,"landingOccurred":false,"latitude":32.1719821,"location":null,"logNumber":"US-03152015-0016","longitude":-82.89760509999999,"occurred":1426487760000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1426489067000,"summary":"Iss feed object","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51165"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New River","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My daughter was leaving my house at 7:10 pm when i noticed a flashing orange light around est. 5000' it sat there for maybe 10 mins. unfortunately it was maybe 10 to 15 miles out\r\nthen it began to rise slowly. when it reached  10,000' the large flashing orange light turn off\r\nand you could see six what looked like warning lights it ascended until it looked like a star.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":63973,"landingOccurred":false,"latitude":33.868577569240735,"location":null,"logNumber":"US-03152015-0015","longitude":-112.0178265508929,"occurred":1426472100000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1426487522000,"summary":"Flashing orange light then turned into six lights","tags":["lights","flash"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"85087","daysBetweenOccurrenceAndSubmission":0,"locationName":"New River, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51166"},{"address":null,"addressResolution":null,"altitude":"Landed, Treetop","city":"Eighty Four","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was 10 years old.  a bunch of us kids were playing tag in the field behind a friends house.  it was dark at this time, around 10 pm.  i noticed one of us was looking up towards the sky so i followed suit.  then all of us were staring at this thing.  it a humongous boiling ball, it reminded me of the sun.  it was slowly descending to the ground on the other side of the valley. as it got closer to the ground i saw the trees bent over like some tremendous force was blowing them around, practically touching the ground.  the light from it was glowing yellow and lit up that whole side of the mountain. right before it physically landed we all scattered, ran home like frightened rabbits.  none of us ever talked about it.  i tried to talk to my mother about it when i came busting into the house but she just yelled at me like i was bothering her.  i thought about it for weeks and know in my heart that it was something not man made nor of this earth.  ever since then i believe.   ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None, Unknown","flightPath":"Other","formattedAddress":null,"id":63972,"landingOccurred":false,"latitude":40.18260170000001,"location":null,"logNumber":"US-03152015-0014","longitude":-80.13302639999999,"occurred":269334000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1426484519000,"summary":"Saw a ufo at night a bunch of us.","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":13392,"locationName":"Eighty Four, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51167"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marksville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting outside my friends front porch and we seen this light moving so we observed it for at least 2 hrs ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":63971,"landingOccurred":false,"latitude":31.1279652,"location":null,"logNumber":"US-03152015-0013","longitude":-92.0662356,"occurred":1426479300000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426483438000,"summary":"Ball of light moving no blinking lights moving abruptly ","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Marksville, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51168"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1.I sat in backyard\r\n2.It is not a regular craft.\r\n3.Something of government supreme secrecy.\r\n4.Went from slow to fast in instant.\r\n5.I was upset because i couldn't touch it.\r\n6.It just disappeared over time.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Unknown","formattedAddress":null,"id":63970,"landingOccurred":false,"latitude":36.781451,"location":null,"logNumber":"US-03152015-0012","longitude":-119.4132324,"occurred":1404861300000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1426480926000,"summary":"Black sphere became bright","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63970_submitter_file1__ukm.pt2.wmv"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":250,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51169"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lakeland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving from orlando to tampa at approximately 10pm to 11pm along i-4. at about midway of the cities, i noticed an object that was, what i would determine, about five to eight thousand feet up in the air. the object was stationary, and did not make any noise. the object's location in the sky was directly above the road. without the sound of rotors i was taken aback as the lights on the craft were mesmerizing in how anomalous they were.\r\n\r\nwhat i witnessed were three lights on this stationary craft, much like this (ooo). the \"main\" or centrally placed light \"o\" was very bright, exactly like burning magnesium. it pulsated in a 1-2 second sequence while the smaller lights, or \"o\"s seemed bluish-white and had an alternating frequency.\r\n\r\nbeing absolutely silent, stationary, bright, and so very high up in the sky, i determined it was a ufo in the true sense -- unidentified. there were no red or green lights on this craft and the lights themselves took what i'd say a fair to significant amount of power in its illumination. chose to report this event in case anyone else saw the same thing in december of 2014 in polk county. my alternative hypothesis was that it was a drone of some type though it was quite high up in the air for any amateur telemetry system i can think of.","distance":"501 Feet - 1 Mile","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":63969,"landingOccurred":false,"latitude":28.0410054,"location":null,"logNumber":"US-03152015-0011","longitude":-81.9448742,"occurred":1418884200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1426481669000,"summary":"Three lights. centrally placed light was burning magnesium bright and pulsing. two lights on each side (whitish blue) were flashing in altered sequence.","tags":["ufo","lights","pulsing"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":87,"locationName":"Lakeland, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51170"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Freehold Township","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While driving home from work about 12:15 am entering my street jackson mills road in freehold which runs north to south and was very rural at the time 30 years ago, i saw a semi-circle of six bright white lights hovering or moving very slowly. i stopped the car to watch and got scared and left. the object was low to the ground and very close to me. i couldn't make out the shape of the object itself but the lights were in a semi-circle. ","distance":"21-100 Feet","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":63968,"landingOccurred":false,"latitude":40.1779986,"location":null,"logNumber":"US-03152015-0010","longitude":-74.28895539999999,"occurred":470649600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1426479361000,"summary":"Saw semi circle of 6 lights moving very slow over field","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":11062,"locationName":"Freehold Township, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51171"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Almada","country":"Portugal","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am currently living in the street, and i stay awake most of the nights and sleep by day at some friends houses.\r\ni was at a place, a verry chill and calm park, called ginjal, a place i go a lot, with my dog, i was eating a pack of chips and drinking a 7up, and started to play \"fetch the stick\" with my dog.\r\nafter an hour or so, my dog started to behave stranged, and was constantly sitting at the entrance of the park, shaking, with his tail in the middle of his legs.\r\ni grab him, and went to the grass petting him in my lap, when i saw a triangular shapped object comming down perfectly, with 5 lights, one in the, i will call it, front, and 4 in the back, pointing down to the river tejo, and in that point i got static, just couldnt move or even think, i was only abble to look, i think i freeze with what i saw.\r\ni was about 500 meters maybe more, and could see 3 dark body shappes, with a big and fat rugby ball shapped head, and the most shinning eyes.\r\nat that point my dog urinated in my lap and contiued shaking, when suddently he released some agressive bargings and started to run away, i remember that the bargings \"awaken\" me and i looked at my dog, and back to the triangular shapped object that had the lights of and was standign perfectly in the whater.\r\nat that point i see one of the dark bodies moving and a blue light is pointed from one point of the park to the other, and everything just turned transparent with geometric lines inside, that i associated to flower of life and metatron geometry\r\nall the colors were there, but i was able to see thru everything, i recal looking down to the floor and see an huge deepness, and at that point i start to feel a big anxiety, and started sweating, and i just started runing, i didnt even remebered my dog!\r\ni runned for like 2 minutes, and looked back, to see that the triangular shapped object had the 5 lights back on, and was in the middle of his \"take off\" and it went up into the sky, takingof ina zigzag manner.\r\nat that point i realized that the material was no longer transparent and the geometric lines were gone.\r\ni found my dog latter that morning, at my ex-girlfrids door (i still go there to hang out with his brother)\r\nat that afternoon, i went back there with my ex-gf brother and told him what happend, i dont know if it had something to do with that or not but we saw some dead mullets and gellyfish, and actually took one and putt it in a jar with ethanol, we called it mullet.","distance":"501 Feet - 1 Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Other","formattedAddress":null,"id":63967,"landingOccurred":false,"latitude":38.6786369,"location":null,"logNumber":"PT-03152015-0009","longitude":-9.171358099999999,"occurred":1426328400000,"potentialRelations":[],"rating":"Unrated","region":"Setbal","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1426478897000,"summary":"I was with my dog when strange lights appeard","tags":["lights"],"timeZone":"Europe/Lisbon","timeZoneName":"Europe/Lisbon","tweeted":0,"urls":[],"weather":null,"zipcode":"2800-058","daysBetweenOccurrenceAndSubmission":1,"locationName":"Almada, Setbal","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:51172"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"See description\r\npulsating lite ball multiple lights. saw fighter jet before and a helicopter afterwards","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":63966,"landingOccurred":false,"latitude":40.419357100000006,"location":null,"logNumber":"US-03152015-0008","longitude":-82.89802300000001,"occurred":1426475700000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1426478331000,"summary":"Pulsating lite ball multiple lights. saw fighter jet before anf a heliccopter afterwards","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51173"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was standing on my front porch and i heard military fly over after the ufo. i seen the white orb fly up and down going south and as the military got closer the ufo started to fly further south and then it just disappeared. over the past few days i've seen alot of military movement in dayton,tn","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":63964,"landingOccurred":false,"latitude":35.5209613,"location":null,"logNumber":"US-03152015-0006","longitude":-86.5775873,"occurred":1426057200000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1426445963000,"summary":"White orb ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":4,"locationName":"Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51174"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (no cloudcover), Unknown","city":"Beckley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling back from a business trip in georgia.  it was around 8pm on november 3, 2014. i was going in a northerly direction on i-77 nearing beckley, wv when i observed a bright round white light off to the north - northwest. it was larger and much brighter than a star. \r\n\r\nwhen i first saw it it might have been a mile or two away. it was below the horizon and moving at what seemed to be a fairly slow speed (guessing 60 mph). as it moved in my general direction, i could only see the bright light. then, when it was maybe 500 - 600 yards away, it abruptly changed directions and moved toward the south in a direction that approximately paralleled i-77. \r\n\r\nsomething very strange happened when it changed directions, i could no longer see the huge bright light on the front. i don't know if it was turned off or it was just not visible anymore from my position. i could, however, see other lights further back from where i knew that light was mounted. i am only guessing about size because i can't say exactly how far it was and how high it was, but i am a hunter and fair at judging distance. that being said, here are some guesses at distance and size and what else i saw. the night was so dark to me i couldn't see any part of the thing except lights.\r\n\r\nthe craft (i don't know what else to call it) was probably about 300 to 500 feet off the ground. i have no idea of how big the light was on the front, but it might have been 15 to 20 feet in diameter. about what i'd guess to be 50 - 100 feet behind where that light was there was a small green flashing light. then about the same distance behind that was an elongated red light in a vertical position. there was also another red light just to the left of the larger one that was shaped exactly like the other red one, but it was smaller. maybe half the size of the other one or a little less. i got the idea that this light was on the far side of the craft. if so, this would have made it pretty wide in that area.\r\n\r\ni have no idea of noise since i was driving. when it turned to the south, it was a little north of me. as it passed me, i was trying to keep my car on the highway and watch it at the same time. i only saw the side lights for a 10 to 15 seconds then it was behind me and i lost it.\r\n\r\nthere were other cars on the four lane and i'm sure others saw it as well.\r\n\r\ni've never seen a ghost or a bigfoot, but now i have a hard time going outside without watching the sky and wondering what i saw. i nearly didn't file this because i didn't want people thinking i'm crazy.","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":63963,"landingOccurred":false,"latitude":37.7800502,"location":null,"logNumber":"US-03152015-0005","longitude":-81.18057569999999,"occurred":1415001600000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1426440797000,"summary":"It came from a low northerly direction. moved basically toward me then turned southwest and disappeared.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63963_submitter_file1__Comingtowardme.jpg","http://www.mufoncms.com/files_jeud8334j/63963_submitter_file2__Sideview.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":132,"locationName":"Beckley, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51175"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Napa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on the phone with a friend in key west and we terminated our call at 8:55 p.M. because it was 5 minutes until news years on the east coast. i went out the back door to have a cigarette. i looked to the north and noticed a bright red/orange light. \r\n\r\nat first i thought it was a helicopter but did not see any blinking navigation lights which struck me as odd. the object looked to be approximately 5 miles up valley slowly heading from north to south at an altitude of approximately 100/150 feet. i watched it move south for about 20 seconds.\r\n\r\nas it got closer and closer it remained fuzzy around the edges. it stopped traveling south and became stationary about what looked to be 4-5 blocks away at an altitude of approximately 100 feet. there was absolutely no sound. it remained stationary for 30 seconds or so and then began moving in a westerly direction while slightly gaining altitude at maybe 5/10 degrees. within 6 seconds it got so small i could not follow it in the night sky.\r\n\r\nit must have accelerated at an incredible rate of speed to have disappeared that quickly. the acceleration was not a single burst of speed but rather smoothly. we live in the flight path for the north/south corridor for aircraft out of san francisco/oakland/san jose airports and watch many airplanes traveling around 300/400 miles an hour above us. this had to move at least 20 times faster than them.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Path with directional change,Path then hovering","formattedAddress":null,"id":63962,"landingOccurred":false,"latitude":38.29947104829718,"location":null,"logNumber":"US-03152015-0004","longitude":-122.24747310018776,"occurred":1388552100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1426439388000,"summary":"Fire ball over napa, ca","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"94559","daysBetweenOccurrenceAndSubmission":438,"locationName":"Napa, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51176"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Coventry","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was standing outside work having just finished a shift. a storm had just passed over and a beautiful rainbow was showing.  i was taking photos of the rainbow and didn't actually notice the lights in the frame.\r\n\r\ni took a series of photos to catch as much of the rainbow as i could but after transferring to a memory chip i put them away and forgot about them.\r\n\r\ni was sorting through old memory chips a few days ago when i found these photos.  the first one showed a couple of ellipses with what appeared to be a solid centre. this was at 15.24 gmt. the next photo showed two large balls of light low to the ground and apparently in front of the lamp post.  the time of the photo was also 15.24 so the lights had moved very quickly.\r\n\r\ni think it may have been reflection off something because there were a handful of cars in the carpark, but none moving to the best of my recollection.  the angle of each photo is slightly different but not by as much as the difference in position of the two sets of lights.  also the first ones were very small and seemed distant, the second ones larger and closer.\r\n\r\ni would love to know what created this phenomenon or if i have caught something awesome on camera.","distance":"Unknown","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":63961,"landingOccurred":false,"latitude":52.4260312,"location":null,"logNumber":"GB-03152015-0003","longitude":-1.4342649,"occurred":1257377400000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1426437794000,"summary":"Two bright lights which were ellipses initially but became circles","tags":["lights"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63961_submitter_file1__lights1.jpg","http://www.mufoncms.com/files_jeud8334j/63961_submitter_file2__lights1closeup.jpg","http://www.mufoncms.com/files_jeud8334j/63961_submitter_file3__lights2.jpg","http://www.mufoncms.com/files_jeud8334j/63961_submitter_file4__lights2closeup.jpg"],"weather":null,"zipcode":"CV2 2BL","daysBetweenOccurrenceAndSubmission":1956,"locationName":"Coventry","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51177"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sacramento","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My fiance and i just got home from our thanksgiving gathering in lincoln, ca.  i went into our master bedrm. put the cat window perch up in window . the window faces out to the front yard/street. it is a high window.  i am 5'7\"and the bottom of window comes to my chin.I put my cat up on tall dresser (just under the window) he then can jump from dresser to window. about ten or so minutes passed, i had changed into my pjs, no lights (except a night light) were on in the bedroom.  i walked up to stand next to my cat and look out.  thats when i saw five or more very big glowing,flashing balls of redish/orangish lights.  they seemed to be in a line formation. up and down, spaced the same amount between each other.  i yelled to my fiance to hurry up you have to come see this. he was in  our family room.He came and he too could not believe what we were looking at. we both wanted to get our cameras or phones but knew if we did they might be gone. within a minute a couple dissappeared. then three made a triangle shape for about a minute or two. i ran out the front door to the driveway and a minute later they all were gone. i posted it on my facebook with hopeing someone else saw the same thing. but nothing.Please i would really like to know if there were any other reports of this on thanksgiving night in sacramento, ca. ??","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":63960,"landingOccurred":false,"latitude":38.611602800810005,"location":null,"logNumber":"US-03152015-0002","longitude":-121.35263689069804,"occurred":1417149000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1426414181000,"summary":"Thanksgiving we viewed five or more flashing big round lights","tags":["triangle","lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"95864","daysBetweenOccurrenceAndSubmission":107,"locationName":"Sacramento, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:51178"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":844}
