{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Charlotte","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"At approx. 10pm 62303, i saw a blue white light zip and pause across the skygoing east to west at incredible speed.  no man-made machine could go that fast. i have witnessed plenty of shooting stars, meteor showers, aurora borealus -but have never seen anything move like this object with its stoppulsezip actionacross the sky at that rate of speed.  i dont know what it was but i know i havefinally seen my first ufo.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2373,"landingOccurred":false,"latitude":35.2317969,"location":null,"logNumber":"","longitude":-80.8383767,"occurred":1056129600000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1056129600000,"summary":"White light skipping across the sky at incredible","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Charlotte, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2453"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Fremont","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Getting drink of water, notice bright glow behind a 10 foot high plank fencecantsee thru fence  stood and watched, blacked out. next morning thought it was justa dreamfound impression, burned, 3 inches in ground. resmbled circle line power symbol,only elongated.  no human or machien track seen.  baron field before planting, last week of march","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary","formattedAddress":null,"id":2372,"landingOccurred":true,"latitude":41.3503303,"location":null,"logNumber":"","longitude":-83.1218634,"occurred":798447600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":798447600000,"summary":"Orage-red glow, covered by fence, on ground. left","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fremont, Ohio","triangle":false,"type":"UFO Landing","$$hashKey":"object:2454"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Vail","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I am a mufon member and work as a security guard at the vail valley medicalcenter. i had just gotten home from work at 630pm and was going back to my truckwhen i looked up and saw the object. being a mufon member and having had ufosightings in the past i often scan the skies. i noticed a round object thatappeared about the size of a 18 bb at arms length. it was silverywhite in colorand was moving slowly to the southeast, away from me. at one point it appearedto slow to a stop, before continueing to the southeast where it eventuallyfaded. i did have a chance to grab my 35mm camera and took two pictures usingthe telephoto setting, which unfortunately is not real powerful. at first ithought it might be a large balloon, and as there was no appreciable wind at thetime i could not be sure. there were a few wispy clouds that did not appear tobe moving while i watched the object. about 20-30 minutes after my sighting thewind did pick up and i could see wispy clouds moving to the northeast, at aright angle to the direction i saw the object going. duration of the sightingwas about 5-6 minutes from 633pm to 638pm.","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":2371,"landingOccurred":false,"latitude":39.6402638,"location":null,"logNumber":"","longitude":-106.3741955,"occurred":1056245580000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1056245580000,"summary":"Sighted a silverywhite round object in daylight","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Vail, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2455"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Omaha","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Went outside to get boots from my truck. looked up and saw at first what ithought was a satallite moving sse to nnw and then realized there were 3 uniformlights moving at a high rate of speed in uniformity. i watched them until theywere to the north horizon. looked back up and saw a formation of 5 aura hazedwhite disc shape obects traveling at a high rate of speed following the sametrajectory as the first set of lights. ran in the house and yelled to 2 otherswhat i was seeing and ran back outside. looked up an saw a 2nd group of 5 aurahazed white discs moving at the same rate of speed and trajectory. the twoothers ran out and i pointed the group of lights out to them. the group oflights still moving formed a v pattern and then regrouped into a cluster.  theother 2 went back in.  fascinated, i keep looking up hoping to see more.  about1 minute later, a single whiteredish light went by...Same trajectory and speed.Dont know how to figure my long and latt for the report sorry.  i heard nonoise.  i have always beleived in ufos and wanted to see one. i know what ameteor, shooting star, satellite, commercial airliner, airplane or helicopterlook like moving across the night sky.  i also know that when i looked straightup what i saw was not anything i have ever seen before.  i have read  watchedmany ufo reports, videos, pics etc... for many years.  i know what i saw andwhat i saw were ufos, 14 of them.  i hope others report the same sightings forthe same night for this area.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2369,"landingOccurred":false,"latitude":41.2612334,"location":null,"logNumber":"","longitude":-95.9902183,"occurred":1056265200000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1056265200000,"summary":"Formation 3 lights, 5 discs then 5 discs again, 1","tags":["lights","disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Omaha, Nebraska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2456"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Navajo","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving thurough going west on a delevery i had had a good sleep in and agood meal so i was ready to drive on in to  lasvegas i was thinking to my selfthat i might get a snak at kingmen or at flaggstaff when to the horth at about 2oclock on the clock this thing came over the hills it was moveing very slowil atfirst i thought that  it might be some sort of new plane that the goverment  wastesting but it was moving to slow for that i was moving west at about 70 mi perhr and it crossed the road just about the time i got to the power station  thatis out there by 40  the night was very bright there was a full moon that nightthe date given is as far back as i can remember it is starting to get fuzzy wheni try to rember what happedn all i know is that the truck lost rpm  and speedand as far as i know did not loose speed  but there is a time laps of about 30min i cant account for but now when i got to sleep there is this feeling that iam to find somthing and return it but i cant  remember whatand the smae message keeps comming back to me in my sleep i am eather to findsomthing or someone i cant tell wich the message is find the barron or barrons idont know i have even went to a shrink that is a good freind of mine and hetried to hypnotise me and it would not work so he says i need some relif","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":2368,"landingOccurred":false,"latitude":35.4019765,"location":null,"logNumber":"","longitude":-110.1402594,"occurred":1055935200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1055935200000,"summary":"Sighting 0400 az. near interstate 40","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Navajo, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2457"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sherwood","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"For many years in my present chronological lifetime, i made it a habit to lookinto the skys, with my naked eyes and with binoculars, in a wide varity oftimes, places and weather conditions.Remember, this incident was yrs ago, so i cant give nor do i remember exactdates, times, nor cloud altitude.In this particular instance, i was on my front porch, just off of 99e and acrossthe highway from roamers rest tavern, as well as a gas station just across thedriveway from my house. the set of three houses in this little spot is no longerthere now.  however, i believe the gas station still is.  it was night, but idont remember what time. tho, it was quite dark, so it must have been at least afew hours after sunset.  i think it was a bit cool out and it may have been latespring, maybe autumn.  as was my habit, i looked up into the sky, right above methis time.  it was partially cloudy with large patches of clear sky. uponlooking up, i clearly saw, right above me, two black wing-shaped flying objects. they were flying low in the sky, going north, about the height and speedpassenger jet planes would when coming in for a landing, when viewed from atleast 5-6 miles from a major airport.  these two wings were flying in very closeformation, so close it looked like their wingtips could touch if they moved anycloser.  the one on the right was a little ahead the one on the left.  therewere no lights save for those along the wing edges, possibly six on each craft.The lights were white, with a steady glow. there were no blinking wing lights atthe tips, there were no tail lights, body lights and headlights, blinking orotherwise, as a passenger jet would have, even viewed from this position andaltitude. they made absolutely no noise.  even above the roar of highway traffici could hear airplanes and it wasnt particularly too noisy at this time.  thecraft were slightly different in wing angle from each other.  there was no trailof any kind coming from either craft. i did not let my gaze waver from them asthey continued their flight north.  the craft on the left then moved slightlyahead of the one on the right and then they both disappeared into the cloudcover.  this whole incident lasted for about a minute.  i was quite calm, yetwith a quiet fasination.  after all was said and done, i raced indoors,excitedly telling those inside that i just just seen a ufo.   they were a bitbemused, yet happy for me, but not one body raced out to see.  i guess, as isusual i","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2367,"landingOccurred":false,"latitude":45.3622274,"location":null,"logNumber":"","longitude":-122.838748,"occurred":375955200000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":375955200000,"summary":"Two wingshaped flying objects","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sherwood, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2458"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Dear mufon inc my name is denny scott i live in utah,and iam very happy to beintrusted with pictures and authentic proof that my inlaws that are retired andjust travel around the states alot. these pictures that i have and looked veryvery closley under magnifying glasses and some what experience a very true andvisable ufo in the desert of ill let you know later. please get back to mesoon and tell me what to do from here. thank you denny scott.","distance":"501 Feet - 1 Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Appendage(s),  Other","flightPath":"Stationary","formattedAddress":null,"id":2366,"landingOccurred":false,"latitude":34.0562681,"location":null,"logNumber":"","longitude":-111.0899311,"occurred":1022955120000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1022955120000,"summary":"Two disks on  film","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2459"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Spokane","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"This is a 40 year old memory.My friend and i were going to sleep in the front yard of the farm house where ilived about 5 miles s.E. of the city of spokane wa.Some time around 1100 wenotice a number of round lights in the sky.As i recall they were solid colorseither red green or blue and they were glowing. the motion seemed to be random.They would travel in a straight line for several miles then stop for a fewminutes then go off in another direction. from our vantage point one appeared todecend across the far end of our farm 12 mile or so slowed, then seemed todisappear in the trees of the dishman foot hills a mile or so away. we never sawit again. i dont remember what time the incident ended. we were about 11 yearsold and i think we eventually fell asleep.Early on i called the police and i recall that the answering officer saidsomething like ya ya weve been getting a lot of phone calls. an hour or so laterwhen we thought we had just watched one land,i called again to report what wehad seen. this time the officer seemed quite excited and he said that the airnat. guard had been notified. we never saw any military planes.I dont relate this story very often, but at about the age of 19 someone relatedwhat i believe to be the same occurance to me.I also remember that we counted atleast 27 of these lights. there are other details that i might relate, but idont trust my recollection of them.I am just relating what i am pretty sure of.Alot of people must have seen this.I would like to know.","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2364,"landingOccurred":false,"latitude":47.6647502,"location":null,"logNumber":"","longitude":-117.4164466,"occurred":-234122400000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":-234122400000,"summary":"Lights over spokane","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Spokane, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2460"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"North Aurora","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was about 930 am. i was driving down back roads en-route to a customer. its aroad ive travelled daily for almost 10 years. i was in a jeep with the top down.Doing about 45 mph, in a line of about 5 cars. the road is very rural, a fewhouses scattered along recently built lots of undeveloped woods and fieldsaround. i was south bound on deer path road, just north of oak street. i wasmaybe a half mile from the orchard road toll plaza on i88.At this particular point the road bends sharply and we have to reduce speed. inotice a greenish black object hovering motionless in the sky about 200 feet inthe air, over a field that runs between deer path and orchard. it was maybe 50yards to the east of me. the line of cars continues around the bend and the 3cars ahead of me start to speed up. i continued to slow down and kept watchingthe object. i didnt stop tho...Curiosity killed the cat.Out of the corner of my eye, i see the cars ahead of me brake..As if the driverscould also see it. it looked like it wasnt built for passengers. it looked likemore of a probe or something. it was huge. it looked like it was probably thesize of a school bus. the best i can describe is it was like an eye dropperstanding on end. it was tall and thin with a big bulbous head on top.The headwas shinny and smooth, but the rest of it was bumpy...Like a skeletal frame withappendages running down one side. it didnt move or make a noise. the line ofcars continued on, and i lost sight of it for a few seconds, behind some trees.A few seconds later, i turned east on oak, and had a great view of the field,but the thing was gone.Im 45, and ive lived around air bases...Vance in enid, ok...Carswell in tx. iknow air craft. it wasnt a helicopter, or an ultra lite, or a weather balloon. iknow what it wasnt.Ive seen some kooky lights in the sky in my day, but this is the first up closeday light sighting ive ever had, so i thought id report it.Let me know what you think.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2363,"landingOccurred":false,"latitude":41.8061399,"location":null,"logNumber":"","longitude":-88.3272952,"occurred":1055953800000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1055953800000,"summary":"An eyedropper the size of a bus","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"North Aurora, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2461"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Glassboro","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Examined logsin 1966 while employed by whyy tv transmitter site approx 1500 ftsouth of landing site in glassboro, nj 1964i think, noticed that first on-airtest transmissions from 316kw erp transmitter coinsided with reported ufolanding time just north of site.","distance":"Unknown","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2362,"landingOccurred":false,"latitude":39.7028923,"location":null,"logNumber":"","longitude":-75.1118422,"occurred":-167763600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-167763600000,"summary":"Supp info re landing in 1964 i think glassboro, nj","tags":["landing"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Glassboro, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2462"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ashland","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Ashland, kentuckymy husband and i were driving west on us 23 when he spotted an object hoveringover a convience mart. he drew my attention to the object and, i couldnt believewhat i was seeing. i was so excited. i had always wanted to see a ufo but, neverthought i would be lucky enough to be one of those rare people who get thatchance.It was triangular in shape with lights at each point. one yellow, oneyellow-orange, and one orange. we could only see the underside of the objectpreventing us from being able to tell if it had any dome shape to the top. itwas just hovering, as though, observing the customers coming to and leaving themart. also it, perhaps, was observing the workings of a nearby steel mill andoroxygen plant just across the highway. no engine noise of any kind came from thisobject. it was as though it were floating on air with no propulsion of any kindkeeping it aloft.As we lost sight of the object, it was still hovering over the mart. the timewhich passed was probably about 1 or 2 min. we tried to slow in order to viewthe object. we did manage to get a good look at it. there was traffic on thehighway. i and my husband were bubbling with excitement. we were sure, and stillremain so, that this was an actual ufo sighting.When we returned, heading east on the same highway, the object was no longer atthe spot where we had first observed it. however, as we topped a hill inwestwood, a subdivision of ashland we spotted it again over a differentconvience mart. this mart was located on wheatley road. again, we were bothsurprised and excited at the thought of being fortunate enought to see 2 ufos inone night. we didnt know if it was the same one or another one. the shape andthe lights were exactly the same. we pulled off the street and i rolled thewindow down on my side of our van. again, all we could see was the underside. itwas close enough to us for us to tell it was a rather large ship. it couldeasily have filled a football field and then some. as before, there was no noisecoming from the object. no engine whir. just silence. then, it began moving inour direction as though we had been spotted observing it. this all took placeover a period of approximately 5 min. then it shot off in a southeasterndirection. before i could count to 1003, it was out of sight. it did not goupward. just directly southeast. no noise of any kind emitted from the object.It was just gone.We told all our friends what we had seen and they became as excited as we were.Then","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2361,"landingOccurred":false,"latitude":38.4784144,"location":null,"logNumber":"","longitude":-82.6379387,"occurred":439106580000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":439106580000,"summary":"Sighting of triangular shaped object in kentucky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Ashland, Kentucky","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2463"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I and my friend were having dinner in a resturant over looking the hudson riveri had been looking thru the large window in the front of the resturant catchingthe veiw when i noticed cars on the road in front of the resturant stopping innumbers with people getting out and pointing out over the river to the north ofour location. then after a few seconds a patron in the resturant called out there it is again . curious i asked my friend to step outside to see whateveryone was looking at. when we walked outside to the front of the resturant icould see a long line of bright white lights that formd a curve like a boomerangwith 2 other lights in the front and back forming the front most and rear mostof the out line. my first thought was that we were looking at a blimp but it wastoo big and shaped like a boomerang. i figured it to be between 14 to 12 mileaway. so i listened to hear any noise from the engines and prop wash but, therewas none.My first reaction was to ask my friend what the hell is that and, hereplide that it was a group of hang gliders of altra lights in formation pullingoff a ufo stunt.I found this hard to believe do to the fact that the craft wouldtip up and down ever so slightly and the lights never fell out of line with eachother. the craft seemed to just move along at a speed of 20-30 miles an hour ina straight line directly south down the hudson river. we watched the object forwhat must have been 15 minutes maybe more as it moved past the city of terrytownand faded into the distance. what struck me the most was the fact that the citylights behind the object did not siloet it at all as if the surface absorbed anyreflective light.","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2360,"landingOccurred":false,"latitude":40.5595428,"location":null,"logNumber":"","longitude":-74.1186421,"occurred":564636600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":564636600000,"summary":"I saw a large horse shoe craft with lights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2464"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Helen","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was sitting outside best western motel in helen georgia, enjoying the night air and the quiteness of the town. looked to my right saw this flashing whitelight, kept watching, noticed it was moving very slowly. it kept moving slowly,it finally just stopped and was hovering over the ridge in the distance in frontof me....Kept seeing flashing lights, at times the lights were red green andblue, best of my remembrance... my husband had gone to the office of motel, iran in and got my video camera and started videoing the event...My husbandreturned about 15 minutes later and object was still hovering over theridgemountain. after approx. 30-45 minutes the object just disappeared.","distance":"501 Feet - 1 Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2359,"landingOccurred":false,"latitude":34.7014839,"location":null,"logNumber":"","longitude":-83.7315675,"occurred":1052893800000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1052893800000,"summary":"Star-like lights over a ridgeline","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Helen, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2465"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fargo","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We had enjoyed a glas of wine and went outside for a cigarette on a balcony i ama modest drinker and we were not drunk. we noticed a light that kept dancingaround a short distance away. the sky was clear with traces of haze. this was inthe southern portion of the city of fargo, nd. we were located right south of32nd ave and the light seemed to be just north of 32nd slightly to the east. weobserved the phenomenon for about half an hour. it would move in such a way asit would become obscured from the roof top a more precise angle over the horizoncould be established from this fact. it was one single illuminated object thatkept moving around in the sky. the movement seemed to defy normal flightparameters for regular man made craft. i would liken some of the movements withhow a kite can toss and turn in the wind or an air show barnstormer plane,however neither would explain the full range of motions that we observed and iwould doubt that the night air space above fargo would be used for the purposeof barnstormair show night time excersie. also, the acceleration percieved wasfar larger than seen on air shows, as was the turn radius we saw several sharp90 degree turns. the way it resembled an air show barn stormer was how they gostraight up, kill their engine, fall down on the back, restart their engines andcontinue flight, except that this all happened in the horizontal plane and notin the vertical. the object was bright yelloworange but somewhat fuzzy notbecause of the above mentioned light haze but that could have been my eyes orresidual city lights but i am leaning to it being an aspect of the objectitself. the object would be close to the flight path used by civilian andmilitary air traffic when approaching from the south maybe slightly to the eastof a straight approach to the local airport.At roughly 11.30, after observing the object for roughly 30 minutes, we wentinside. i called a friend and asked that they look outside to corroborate mystory, unfortunately, they went out on the patio which faces north2b they live just north of the above mentioned 32nd ave, while in my estimates,the object would have been wsw from their location, instead of their viewingangle of w, n and e. this would correspond to my observation of the object beingclose to the sun mart on 32nd.After the phone call, we went out again and observed the objects continuedmovementdancing in the area. after a while, 4 four other objects, slightlysmaller than the first, showed up in close proximity of the first object,appearing","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2358,"landingOccurred":false,"latitude":46.8771863,"location":null,"logNumber":"","longitude":-96.7898034,"occurred":1056002400000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1056002400000,"summary":"1 dancing light, 4 smaller lights moving rapidly a","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fargo, North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2466"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Yukon","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"The story happened in 1950 , the second tuesday of february near yellow knife inthe canadian yukon district. my aging parents have given me a tape that wastaped in 1968 by the witness. he was dying of cancer he said and wanted to tellhis story before he died. he had spent the last 18 years afraid of theconsequences of telling his story. he felt they were monitoring him and playingwith his memory. my parents too were afraid to do anything with the tapes. butnow it is up to me to tell the story before my parents are both dead. dad isdying right now. mom is in a home but doing well.This is an up close encounter. five men showed up on his door step . and afterhe got over the fact that they were green head and neck with baby hands hesettled down to accompany them in his own home through to friday morning. otherthan a jaw bone attachment tmj that is different than us they looked like usexcept with evidence of pockmarked skin and in one instance of scarred facialtissue and ears. they wore earthy clothes though. it was 56 degrees below zeroand they had some kind of quickly put together suit of a fabric that looked likeit came from an old car aphostery. jacket,  with and invisible and soundlesszipper pants  pull on and boot  with some metal attached that they wouldactivate by touching...Perhaps foot warmersthey came in smelling like a burned out motor. with boxes of equipment to becalibrated. they had a magnifying loops on their heads with devices that theypulled down to help them work on the devices. almost like computerizedschematics. one had contact lenses.  called bug eye they all had dentures. oddhuh anyway there is a lot more information on this tape. interested i am lookingfor a screen play writer. i am not shy to say i think we have a dollar makerhere. thanks vivian","distance":"Unknown","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2357,"landingOccurred":false,"latitude":35.5121815,"location":null,"logNumber":"","longitude":-97.7536341,"occurred":-628531200000,"potentialRelations":[],"rating":"Unrated","region":"Yukon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-628531200000,"summary":"1950 visit near yellow knife","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Yukon, Yukon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2467"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Manila","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Fat cows will rule the world","distance":"501 Feet - 1 Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":2355,"landingOccurred":false,"latitude":40.9880142,"location":null,"logNumber":"","longitude":-109.7226498,"occurred":-923064900000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-923064900000,"summary":"","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Manila, Utah","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2468"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My wife and i were driving west on i-10 in tucson about 920 or so. on the right,between i-10 and the mountain, we saw a military jet take off almost straight upwith afterburners davis-monthan afb is there. i thought that was odd, because ofthe noise factor in a suburb. about 45 minutes later, near picacho peak, we sawa red steady light about a mile in front of us. we thought it was the beaconlight on a radio tower. as we neared it, we also saw a blue light, to the rightof the red one. when it was almost overhead we saw the white light. there was notower. sherry was yelling to pull over, but cars were on my tail. i lost sightin the windshield, but sherry hung out the window as we passed under it. she sawa black triangle shape connecting the lights, not the wings and fuselage of aplane. there was no noise other than the wind through the open window. if it wasnot hovering, it was flying extremely slow. it was 200-300 feet up. we got offi-10 at the next exit, 212, and doubled back on the service road. but we couldnot see it again. the next morning at the motel in phoenix, sherry caught thetail end of a news report on tv about a military jet crashing in phoenix. awaitress had not heard about the crash, but told us of heavy helicopter activitynear her home during the night.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2354,"landingOccurred":false,"latitude":32.2259729,"location":null,"logNumber":"","longitude":-110.923879,"occurred":1055262000000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1055262000000,"summary":"Triangle near tucson, az","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2469"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cuba","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":" i am a 3 time witness. 1 first sighting 1997 i say said it was neckless of lights. i assessed in the 7 seconds of site that its flight pattern and appearance was not humanly precedented. second sighting was the same kind as the most recent on which was described obove. lasting only a few seconds, but as astounding as any of them in its flight movements. my biggest concern is my discovery that i unexplainably set off metal detectors and video securitythe later not consistantly please send me anything about the metal detector anomaly. ps. i have had a couple of xrays paid for by the state but the last one i must somehow afford which is not presently possiblebefore i can see the results considering that i had no complant of injury. i did see something on the one photo xray but did not take it home. belive me i was discouraged from even caring about this but you... show me if i should.6-15-03 elliot stearns","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Other","formattedAddress":null,"id":2353,"landingOccurred":false,"latitude":38.0628225,"location":null,"logNumber":"","longitude":-91.4034833,"occurred":1056474180000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1056474180000,"summary":"Question and report","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cuba, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2470"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Waitakere City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Saw red object on north western horizon, watched for 15 minutes while objectascended from 15 degrees up to 65 degrees, object changed colour as it ascendedfrom red through orange to black.The object disappeared i was watching through binoculars.The object was many kilometeres distant, but appeared to be quite large.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2352,"landingOccurred":false,"latitude":41.6072807,"location":null,"logNumber":"","longitude":-73.084829,"occurred":1055554500000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1055554500000,"summary":"Saw red object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Waitakere City, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2471"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"West Haven","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was 10 oclock at night on the beach of west haven. myself an my  exgirlfriend were walking the beach right were the water meets the sand. it wasvery quiet beautiful,peaceful night. as we got to the beach pier we had to walkup and around the cement walkway of the pier.As we were doing that i was lookingstraight ahead and i saw at first what i believed was a very tight formation ofbats just above me about thirty feet away. but i quickly noticed that it was asmall circle of very dim red lights. it decended right down in front of us abouttwenty feet from us.The strange thing about it was that i could see the dimcircle of red lights but the upper outline of the craft i couldnt see at all. myex girlfriend was standing right next to me.There was absolutly now sound at allcoming from it. all i said to her was do you see what i see.Her responce waswhat is it. i said to her dont go near it. it just stood their about a foot offthe ground right were the water meets the beach,about twenty feet in front ofus.I was thinking while i was standing their that the tecnology that this craftmust have to be able what i am seeing with my own eyes is so advanced i wouldlove to know how it is powered.Then i started to walk closer to it so i couldsee what the craft looked like.I was amazed that being so close and i couldntsee the outline of it at all. i started walking toward it closer.Now i was aboutten feet from it and all of a sudden it shot straight back about a foot abovethe water out toward the breakwater rocks about 500 yards out. i keeped my eyesglued to the dim red lights.I never lost sight of it ever.As it got closer tothe breakwater rocks,the moon shining on the water reveald the shape and outlineand color of the craft.The speed of the craft going straight wasnt veryfast,maybe about 30 miles per hour.The shape was kind of like a bullet head ormissle head syraight up and the color was a very dull gray green.As it reachedthe rocks it turn right and headed out to sea still only a foot above the water.I watched it untill i couldnt see it anymore.From what i experiencedtheir,something was controling the craft,it definitly new we were there,itreacted intelegently and defensively when i walked toward it,and at no time didit ever make any sounds at all.I have been living with this for years. eversince i had this encounter ihave been getting these image","distance":"20 Feet or Less","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2351,"landingOccurred":false,"latitude":41.2706527,"location":null,"logNumber":"","longitude":-72.9470471,"occurred":809888400000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":809888400000,"summary":"A ufo twenty feet away","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"West Haven, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2472"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Indianapolis","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Hi, im rick garrett, from muncie, indiana, and id like for file a report.......Saturday, june 14th, 2003time, from 640 pm till approx 650 pm there were scattered clouds, most of the weather had moved to the east at the time of the sighting.  it had been cloudy and drizzling earlier in the day i was in downtown indianapolis, approx one half mile north of monument circle on meridian street. myself, and 3 others in my party, observed 2 cigar shaped objects over downtown indianapolis.  they were approx. 3 inches long.....I really couldn't get a good frame of reference as to size, but they were approx the same size  in appearance to jets that were making their approach to indy international earlier in the day over downtown. these objects seemed to be hovering over downtown, and, after about 5-6 minutes hovering, they started drifiting to the south, gaining altitude till they were out of sight.  they did stay in formation, approz 6 feet apart  in appearance.........I'm not sure how to phrase that....... and seemed to move in unison......Not perfect unison, but in unison. there were 4 people in my part, myself, my wife, and another couple.  my wife thought they were balloons of some type, the other lady thought they were paragliders, the other man had no clue, but didn't think they were balloons or paragliders. i don't think they were balloons, as they hovered for some time, neither gaining or losing altitude, before moving off to the south.  i also don't think they were parasails or paragliders, as there was no pilot suspended beneath them, plus, i doubt that the faa would allow such activity that close to indy international. also, for the 10 or so minutes they were in sight, i didn't note any other aircraft traffic in the area.  after they objects were gone, i started seeing jets again.....Interesting, but could have been a coincidence the objects were black, and i couldn't note any windows or other markings. hope this helps.  if you have any questions, feel free to drop me a note. oh, by the way, i'm a certified weather spotter, certified by the national weather service, and also a firefighter/emt, so i'm used to looking for detail and, in my own mind, anyway, pretty observant.  rick garrett","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2350,"landingOccurred":false,"latitude":39.7750055,"location":null,"logNumber":"","longitude":-86.1514736,"occurred":1055641500000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1055641500000,"summary":"2 cigar shaped objects over indianapolis","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Indianapolis, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2473"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Somerton","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"When i was a chil i awoke to numerous small lights foating through the air in myroom from one window and out the other. the object continued passing through theroom it was about 6 feet wide and looked like thousands of little lightsfloating through the air and they made a noise like thousands of small bells.After watching the objest for a few seconds it appeard to have cought mewatching it and then it increased speed and sped through the room until i sawthe tail end of it pass. while it was passing through i now i was not dreamingand i was not scared either. what is wierd is that at that age i was scared ofeverything. up to this day i have never told anyone because they would prbablythink i was crazy.","distance":"20 Feet or Less","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2349,"landingOccurred":false,"latitude":32.5964404,"location":null,"logNumber":"","longitude":-114.709677,"occurred":91972800000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":91972800000,"summary":"Unexplained sighting when i was a child","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Somerton, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2474"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Milan","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Milan,ohio,usa,milliman road pond,i was fishing of coursei noticed a black triadwith three giant white lights on the bottom,over my left shoulder,for 20minutes,moving too slow,from the southeast to the northeast about a mile away.Ilive close to nasa.I just kept fishing,thinking that it would surely be in thepaper.My girlfriends dad asked me if i caught anything,i said in ajokingly,non-believing voice3e no,but i seen a ufo3ei hoped to prove it the next day.I havent quit,i have this ships name and whatits fuel is.I also have a metal band named after this ship,and i have never lostsight of this object.I see it every day,in my mind.I have no choice,thanks alotimade a prayer many years after the sighting,it came true the next morning,an olddrummer called me at a strange time,...In the morningi never get calls thenevenstranger i havent heard from him in over 4 yearshe asked me what i was into itold him i was looking for the triad i seen out in milan ohio,my prayer wasanswered quickhe said his mom and her friend seen something in the samearea,around the same timethey still visit the site.Wow,i dont ever pray unless iam desparate.I prayed i wasnt alone.Super-coincidenceok heres the kicker,my olddrummers band was named3ealien factory3e3ealso3e the euphen triangle,is really a triad,get it right,and open a new catagoryfor this shapei have seen the black triad,on an egyptian tablet,at the tip of anegyptians nose, on the discovery channel program,biblical proof of ufos in thebible. that show title is also a local metal bandwe will tour together if we hadsome transportationlol3eget the big picture my father said i am the winner after 10 years ofdisbeliefcontact me if you want to meet me......Jc3eps. i was 100 per cent free of any alcohol or drugs so i have no scapegoat,,iwish i did,no i donthaha i love the ship,and all who dont are not invited to theshow,the big show.....And you were no help police,thank you sigsworthhaha...Good-byejcaka3ethe last laugh","distance":"501 Feet - 1 Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2348,"landingOccurred":false,"latitude":41.2975519,"location":null,"logNumber":"","longitude":-82.6054547,"occurred":691556460000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":691556460000,"summary":"Blacktriad,three white lights,ohio","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Milan, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2475"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tullahoma","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I aam 34 now and was a young man adolescent at the time of the event.  i wastaking out the trash for my mom at night about six or eight oclock.  i looked upat the bare patch in the sky over the road where the trees had not covered.  itwas a clear night but as i lived in the middle of town there were not many starsvisible.  i noticed a light that looked like a star moving across the sky.  itwas moving abbout the apparent speed of a modern passenger jet it seemed but itwas a single light and not a small grouping as planes usually appear.  i watchedthe light slowly make its way across the sky and the i noticed that there weretwo other lights moving towards it from two other directions.  the lights werecoming towards a central point in the sky.  their pattern together was theappearance of a shrinking isosceles triangle with the lights being at thepoints.  the lights finally came together in a triangle about the width of anadult palm held up at arms length.  they then went back in the direction thatthey had originally come without any appearance of turning around. they seemedto stay at least about the same altitude at all times during the encounter. theythen went behind the trees so that i could no longer see them. there is an airforce base and a space institute located right out of town.  i felt like i hadwitnessed something really rare and special and felt quite privledged.  thedates i have given are approximate as i dont remember exactly how old i was whenit occured.  i think i do remember that it was not cold as i was watching so itwas probably late spring or summer.  thank you for listening.  i wish i could bemore specific.  good luck in your endeavorsstephen dale","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2347,"landingOccurred":false,"latitude":35.3620235,"location":null,"logNumber":"","longitude":-86.2094342,"occurred":375955200000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":375955200000,"summary":"Three lights seen in the sky in the 1980s","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tullahoma, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2476"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was out star watching when every thing around me stared to vibraet.At the same sound pitch the trees,rocks,my body,i could feel the groundvibrating at tha same pitch i could hear no sounds.It hovered ,i thoughti was out of my mind,this was the second time i have seen this object.The first time was in wichita,ks. in 1999 but it was day light and the samething happen but i was driving at the time i saw it ,it was about a mile away.Just above the tree line and every thing vibraeted at that same pitch.To this day no one belives me ,i will be ready for the next time it happens.While i was watching it it shot up into the air clear out of sight.It was moving faster than my eyes could track it,and with out a sound","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2346,"landingOccurred":false,"latitude":33.4520571,"location":null,"logNumber":"","longitude":-112.0661273,"occurred":990086400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":990086400000,"summary":"Black triangle shape","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2477"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cowansville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Myself  three others had just pulled up  parked in the driveway of our farm. westared to walk toward the house, but stopped dead in our tracks when we saw ahuge wedge-shaped like a piece of pie space ship i dont say ufo, because it wasobvious that it was a space ship appear over the treeline.  one witness was veryfearful, and ran into the house, and never came back out, and will not speak ofthis event to this day and gets very angry if you bring it up.  the other 3 ofus stood there in awe, as the ship flew silently toward us.  it made no sounduntil it got right above our heads, at which point it made a rumbling sound asit lowered to be very close above our heads.  it hovered there, and then tookoff in a blink of an eye--shot off over the opposite horizon--barely had time toturn our heads to see it go.  of the 3 of us who stayed there to see this thing,i am the only one willing to talk about it to strangers.  the other 2 will notspeak of it to anyone outside of the 3 of us. the 4th wont speak of itperiod--with anybody  there may have been some missing time invloved here, butthe person who would most likely know the 4th who ran into the house will notconfirm or deny this.  it was afternoon--broad daylight when we saw it come overthe trees, but i have the vague memory that it was a bit darker when it shot offover the other horizon. also, we were standing in a different place about 10away from where we were when we first saw the ship when it left.  we may havewalked there of our own accord, and i just dont remember it.  there were lightsall over the bottom of the craft, but i dont remember the colors anymore.  i doremember that it was metallicsilver in color, and that it had a great deal ofmetal shapes all over the bottom of it--like many mechanical pieces ofsomething.  the other two people said that they saw another, smaller shipsuspended above this ship.  i was not tall enough to see it myself.","distance":"20 Feet or Less","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":2345,"landingOccurred":false,"latitude":40.886703,"location":null,"logNumber":"","longitude":-79.589569,"occurred":439027200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Cone","source":"MUFON","status":null,"submitted":439027200000,"summary":"Close encounter with huge wedge-shaped space ship","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cowansville, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2478"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pine Bluff","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"At home went outside, got the feeling i was being watched, looked up to see it sitting there almost straight up, when i saw it, it started moving slow at first to the east, i ran in to get a cam corder came out to find it moving away faster, got what i did on film you will want to see this","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":2344,"landingOccurred":false,"latitude":34.2284312,"location":null,"logNumber":"","longitude":-92.0031955,"occurred":1003467600000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1003467600000,"summary":"Filmed on digital night vision","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pine Bluff, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2479"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salem","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in the front yard.  the neighbors mom and two children ran over yellingthat there were ufos hovering over the house.  my mother now 100 and sister now74came out to look, and sure enough there they were.  it was a hot summer dayand i lay down in the grass and watched them hover for 5-10 minutes.  they wereround with domes and dull in appearance, but when they wobbled the sun hit themand they would flash brightly.  i had no particular reaction, just thought itwas interesting.  suddenly they appeared to turn to the west and then in aninstant seemingly vanished.","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary,Other","formattedAddress":null,"id":2343,"landingOccurred":false,"latitude":44.9446875,"location":null,"logNumber":"","longitude":-123.0285763,"occurred":-697046400000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-697046400000,"summary":"Ufo sighting in 1948","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salem, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2480"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salkum","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":null,"distance":"21-100 Feet","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2342,"landingOccurred":false,"latitude":46.5320515,"location":null,"logNumber":"","longitude":-122.625947,"occurred":754665420000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":754665420000,"summary":"Breaking contact","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salkum, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2481"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Belle","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving east on west 6th st toward the gas station by hwy 38 and saw theufo hovering over the top of a patch of wooded area across hwy 28.  i noticed itas i approched the stop sign by the gas station. a ufo. mild shock, excitementdisbelief and awe. it was a black triangular craft hovering silently  withlights and windows visable to my eyesight. i driove away and went to work at thecafe i was working at at the time.  i told my friends about it, but tey werentto quick to believe me, and didnt go see if they foulf spot it.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Window(s),  Other","flightPath":"Stationary","formattedAddress":null,"id":2341,"landingOccurred":false,"latitude":38.2858788,"location":null,"logNumber":"","longitude":-91.720442,"occurred":76197600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":76197600000,"summary":"I saw a black triangular ufo with large  small lig","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Belle, Missouri","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2482"}],"last":false,"totalElements":82762,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2683}
