{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Alsip","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I just came out of the home depot in alsip located on cicero and 122nd and looked up in the sky at the sunset. i was looking straight west when i saw this black object moving under the clouds and it looked like it was going to fly directly over my head. as it got closer it turned out to be on a southeastern path which was diagonal from my position. i got a pretty good look at it. it was black and it was larger on the top than on the bottom. kind of like an egg that was upside down. when i saw it in the distance i thought it might be a helicopter because it was flying at the same altitude that helicopters and small planes usually fly in this area. i was waiting for the sound as it got closer and there was none. when it got pretty close to home depot i can clearly see that there were no rotor blades or wings of any kind. it was totally silent and maintained the same level the entire time. it looked like it was going to cross just west of the intesection of 127th and cicero. i watched it until it was too far away to see anymore. it looked like it kept the same flight path until it was out of veiw. i tried to take a picture with my cell phone but, i couldn't get it in view of my cell phone fast enough. the entire sighting took about 3 minutes. it was moving along at a pretty good pace. probably a little faster than a small plane.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":18159,"landingOccurred":false,"latitude":41.6706623,"location":null,"logNumber":"US-07182009-0015","longitude":-87.7355819,"occurred":1247973000000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Egg","source":"MUFON","status":null,"submitted":1247973000000,"summary":"Looked like a black upside down egg.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Alsip, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209813"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Eastlake","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"People we have reports flying into mufon left and right each day. and i have seen the ufos myself everynight and they appear everynight at the same and place. people of all creeds and colors are reporting the same thing and the sightings are increasing 2 fold. these aliens are here for reason and they will not leave on theyre accordance. the airforce tries to get rid of them and they wont leave. they are here to stay as long the troubles on earth would stop. they are policing the world and watching our activities on a everday basis. they are cosmic baby-sitters because the human race cannot takecare of themselves without being watched. the human race thinks we are it, wrong! rethink again and geta grip on reality. remember something! they are sending a message from the skies and soon to be the answer may come quickly.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18158,"landingOccurred":false,"latitude":41.6576259,"location":null,"logNumber":"US-07182009-0014","longitude":-81.4443624,"occurred":1244801520000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Boomerang,  Fireball,  Triangle","source":"MUFON","status":null,"submitted":1244801520000,"summary":"Its apparent we have visitors flying around in our airspace!","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Eastlake, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209814"},{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Sherwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Every  night for the last three months i have witnessed the appearance of  ufos that my family and i have decided to call \"spinners\" in the night skies over our home in sherwood oregon.  to the unaided eye, they have the appearance of very bright stars with a distinct shape and brilliant light, with flashes of color.  with binoculars you can see the underside of the crafts spinning.  for the most part they stay stationary in specific spots, but lately, as early as 10.00 p.M. we have seen them flying low overhead.  they make no noise and flash green, red, and brilliant white-yellow lights.\r\none night i counted 18 in just one area of the sky. i have seen one fly so low and close to me that i could have stood on my balcony and hit it with a rock.  there is a weird whooooooosh sound around 5:00 or so every morning when they leave.  the last to leave is a brilliant yellowish white object that has the appearance of a huge star over the left hand side of my neighbors roof.  i can see it from my bed and  many nights just lie there and watch till they are gone.  sometimes you can hear a pulsing sound that almost has a musical tone to it..\r\n\r\nnearly every night we lay out on the trampoline in the back yard and watch them, and also see oval shaped crafts flying silently overhead, sometimes they just flat out stop, and \"park\" for lack of a better word.  one actually parked in the handle of the big dipper the other night!\r\non four occasions i have seen a triangle shaped craft with a light in each corner.  i have seen that four times.  three times it was just flying silently higher up -it also had multicolor light on the underside of it.  when i saw it the first time it was a close encounter.  my daughter and i were lying in bed having a girls night a night my husband grabbed a graveyard shift.  we were watching a movie and she was dozing when i heard a loud pulsing humming noise, the house actually vibrated. there was a flash of light above our house  i jumped off the bed and ran out on the patio and there hovering directly over our neighbors roof,( close enough for me to hit if i threw something at it) was the triangle shaped craft, pulsing and  humming then it took off slowly. it was huge.  the noise  it made as it was leaving woke up my daughter who saw the tail end of it.\r\n\r\ni have also seen luminous flying things on more than one occasion.  that seem to have the same appearance as a jellyfish as far as definite outlines with illuminated transparent insides.  my husband and i saw one that  was a v shape but had one side a bit longer.  there were 7 luminous round objects inside it-3 on one side, 4 on the other. it floated silently through the night sky like a ribbon blowing in the wind.  i have also seen something luminous with wins, and very recently  i noticed a strange light  that came out from the area where the really bright brilliant yellowish white star/craft was.  i stared at it and suddenly got the distinct impression it saw me staring at it because it came straight towards the sliding glass doors  off our balcony where i was watching from really fast.  (which scared the crap out of me) then started flying figure 8s- at which point i went out on the balcony.  i watched it fly loops overhead and then ran down to get my binoculars it was gone. \r\n\r\nlast night we saw 4 flying spinners, three of them flying very low.  one at 10:30, another at 1:00 and the last at 3:30.  \r\n when i saw the 2 flying spinners last night i decided to try to find someone to report this stuff to, because the activity seems to be escalating though the ufos don't scare me, the things i have seen darting in the sky over our house are beginning to freak me out.\r\ni hear helicopters much of the time in the middle of the night and we have been bombarded with chemtrails for the last several months.  i have one pic of a disc shaped object in a chemtrail.  i have no pics or videos because it is too dark for my mac to pick up.  i am trying to find some way to record this because it is literally every night and it frustrates me not to have tangible physical evidence other than the members of my family and me.\r\n\r\nhave you had any other reports of similar things in this area?  i can't believe my family and i are the only ones noticing!  i don't mind if you use my first name but would like you not to publish my last name.   thank you so much!  sandy","distance":"20 Feet or Less, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome,  Appendage(s),  Wings,  Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":18156,"landingOccurred":false,"latitude":45.3659674,"location":null,"logNumber":"US-07182009-0012","longitude":-122.836118,"occurred":1247895000000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Boomerang,  Bullet,  Missile,  Circle,  Disc,  Flash,  Oval,  Star-like,  Triangle,  Unknown","source":"MUFON","status":null,"submitted":1247895000000,"summary":"We see them every night...","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18156_submitter_file1__strangelightsatnight.jpg","http://www.mufoncms.com/files_jeud8334j/18156_submitter_file2__3discsinchembank.jpg","http://www.mufoncms.com/files_jeud8334j/18156_submitter_file3__3discsinchembankenhanced.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sherwood, Oregon","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209815"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Coldwater","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My boyfriend and i were returning home from battle creek on union city rd traveling southeast. at approximately 9:47 pm i looked out my window (passenger) as we were coming up to a curve and noticed three extremely bright white pulsating orbs in a triangle formation, they looked like they were over a cornfield, but there is also a lake a very short distance behind that cornfield. i did not take my eyes off of the objects, they were probably less than half a mile away and the highest object was probably no more than 300-500 ft off the ground. as we came around the corner i was fidgeting in my seat to see where the objects had been, thinking it was such a short time and they would still probably be there but i looked into the open sky after the curve above the cornfield and lake but they had vanished. there were no other colored lights along with the orbs (green, red, etc.)so it was probably not planes. i could see the night sky between the objects so i don't know if it was one object or many. my boyfriend did not see the objects, he was talking and driving and i didn't want him to think i was crazy because this is the second one i have seen this year.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":18155,"landingOccurred":false,"latitude":41.9434263,"location":null,"logNumber":"US-07182009-0011","longitude":-84.9968015,"occurred":1247892420000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere,  Triangle","source":"MUFON","status":null,"submitted":1247892420000,"summary":"Saw triangle formation of 3 pulsating orbs over cornfield or lake","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Coldwater, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209816"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Twin Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" i was driving to boise id. when i saw a low circular cloud.I pulled out my camera and took three pics.I take pics. of clouds often so to see a low cloud like that was something that i just had to get a pic. of.I didn't notice the objects until two weeks later.In my pics. there are six round disks and one triangle two stream lines that go underneath the disks.I have an idea but i'm not sure what they are.I was looking at the sky the whole time while i was takeing the pics.And i never saw them until i was looking at them later.I also have a crop circle in my back yard for about one and a half years.I have other pics. of more ufos.Thats all i'll say for now,if your interested please get in touch with me and i don't think it would be a waste of your time. thank you  mike from idaho","distance":"Unknown","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18154,"landingOccurred":false,"latitude":42.5658268,"location":null,"logNumber":"US-07182009-0010","longitude":-114.4523911,"occurred":1240948080000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Bullet,  Missile,  Disc,  Egg,  Oval,  Sphere,  Triangle,  Unknown","source":"MUFON","status":null,"submitted":1240948080000,"summary":"I was driving to boise id. when i saw a low circuler cloud,i took three pics. and the 2nd one has several ufos in it.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18154_submitter_file1__coopspics.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Twin Falls, Idaho","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209817"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Independence","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In independence missouri, at about 2:35 pm june 26th 2009, in a completely clear, bright sunny day with a wide open blue sky...I saw something like nothing i've ever seen before. i was driving to work, westbound on 23rd st between noland and chrysler when i looked up and saw something very silvery and shiny in the sky directly in front of me and about midway between the downtown kansas city horizon and the roof line of the windshield of my car.\r\n\r\nit was far away but my first thought was that it didn't appear like any airplane i've ever seen. being as close as we are to a major airport, most airplanes we see around here are either ascending or descending. this was headed straight south (which from the airport should have been ascending) but kept a steady height.\r\n\r\ni couldn't see it clearly enough to really give a very detailed description and this entire episode happened within a matter of about five seconds:\r\n\r\ni glanced up while driving and i saw what appeared to be a very bright, shiny silver metallic object moving slowly southbound at a steady height. my first thought was \"hmmm...What an odd appearing plane.\" and i glanced down to check the traffic in front of me.\r\n\r\ni glanced back up, still there, still moving south very slowly. my thought then was \"hmmm...How strange that it's flying south but it's not assending as it should be, moving in a completely straight, level way. how weird.\" i still thought it might be a far off airplane although i realized that there was something extremely odd about it. i guess my mind was trying to translate what i was seeing into something i was familiar with.\r\n\r\ni glanced down and back up one more time and the object was completely gone! i leaned forward and searched the sky but could see no hint of the object whatsoever. again i state...There were no clouds in the sky, just a clear open blue sky. twice i leaned forward to check the expanse of sky because i could not believe that this object had just disappeared completely. then i looked around me to see if anyone else had seen it and was looking as crazed as i was. (they weren't.)\r\n\r\nthis is the first time in my life that i've ever seen anything like this and i would love to know if anyone else saw what i did. i'm not a ufo enthusiast but i've always had an open mind about such things. as a matter of fact, when i was a child i was actually terrified of the prospect of ufos and aliens. (it was the 70's and i had an older brother that told me terribly frightening stories and i was not yet old enough to not be gullible. lol) my friends and family have treated me with a mixture of chuckling disbelief and incredulity, although they know that it's very unlike me to make something like this up. ","distance":"Unknown","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":18153,"landingOccurred":false,"latitude":39.0930461,"location":null,"logNumber":"US-07182009-0009","longitude":-94.4116268,"occurred":1246052100000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1246052100000,"summary":"I glanced up while driving and i saw what appeared to be a very bright, shiny silver metallic object moving slowly southbound at a steady height. ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Independence, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209818"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Breckenridge","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"July 18, 2009\r\nsaturday, 6:31 a.M.\r\nobject observed from 0631 to 0636 hours cdst.\r\ni have filed previous reports and will only do so if what i witness is extraordinary, as i feel this is.  i am hoping someone else saw this.\r\n\r\ni woke early and at 6:30 a.M. i let the dogs out and checked the rain \r\ngauge, as it had rained shortly before.  the sun was moments away from inching over the eastern horizon.  the sky was light blue and bright with\r\nthe early morning sun. we had just received a 1/2 inch rain, so there were \r\nstorm cloud banks to my south, same to the west and a few puffy clouds \r\nabove.  that is when i noticed a bright light slightly to my sw at approx.\r\n80 degrees agl.  \r\nthis light couldn't be venus, as venus and mars are \"morning stars\" now, rising in the east.  jupiter was about 20-25 degrees above the southwest \r\nhorizon and not visible.  whatever this was, it was almost directly overhead.\r\ni retrieved my binoculars, which were adjusted for viewing stars at night\r\n(infinite).  i had to re-adjust my binocs for closer viewing, in order to \r\nfocus on this bright object. the object appeared to be a perfectly round, white glowing disk, at least 3 times the size of venus at it's closest and brightest, if not larger.  it looked like a huge spotlight, high up in the sky.  from my perspective and with the naked eye, it was the size of a .22 pellet.  with 7x35mm binoculars it appeared the size of a very large pea.  no extraneous lights observed. \r\ni lost sight of the object when it was obscured by clouds.  as the clouds \r\ndrifted away, the object was gone.\r\nno sound, no discernible movement, constant illumination (bright white).\r\ni could not estimate the altitude of the object other than to say that it was well above the clouds.  if i had to guess, i would say at least 50,000 ft.  \r\nmy exact thoughts at the time, \"oh, crap.\" \r\n\r\ni am enclosing a photo i took moments after the object disappeared. i have\r\ndrawn in a representation of how the object appeared to the naked eye.  the only reason as to why i did not attempt to take a photo of the object when i saw it, was that i \"knew\" the object would disappear as soon as i took my eyes off of it.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Other","formattedAddress":null,"id":18152,"landingOccurred":false,"latitude":32.7595768,"location":null,"logNumber":"US-07182009-0008","longitude":-98.8956898,"occurred":1247923860000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc,  Sphere","source":"MUFON","status":null,"submitted":1247923860000,"summary":"Observed what looked like a large, round spotlight, high in the morning sky","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18152_submitter_file1__tx-7-18-09.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Breckenridge, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209819"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Port Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On july 8th my fiance and i drove to port austin to watch the sun set on lake huron. her parents live just a few hundred feet from magraw park on m-25, so we parked there and walked to the park. they were closing the park gates as we arrived at 10:oo p.M. as far as i knowe we were the only people on that section of beach. as we were watching i started to here a low rumble not unlike a jet engine but much lower in tone. it was a clear cloudless sky. i commented to my fiance about how close the sound was (sounded like it was right above us), we both searched the sky but could not locate the source of the sound. i am familiar with this particular sound because for some time i have heard that very sound in this area and never saw any craft to cause it. as a child i lived on an airforce base in arizona , so i am also familiar with the sound of jet engines. this was different. more slow and steady. the sound seemes like it came from the south, headed north, and faded away. a few minutes later the sound returned. i looked behind me to the south and in the sky above the tree line i saw a triangle of lights, three points making each side, and four lights in the center making a square. it turned in place and moved forward to the north, right above us and out over the lake. it was approximately 200-300 feet high, very large. as it went over us we noticed you could see the triangle, but whatever was behind it you could see as well, like you could see through it. if it passed in front of a star, you could see the star through it. it continued over the lake until it was out of sight. i would like to add that although the lights made the outline of the triangle it definately appeared that there was a shape independant of the lights. we decided to leave.By now it was around 10:30. we left and took kennedy rd. to oak beach rd.. as we were traveling on oak beach, just a few miles from the beach, i saw out my passenger window the same craft or one just like it right beside us. i told my fiance to stop the car. we got out and watched the craft pass us going toward the beach and as it neared the beach the kights all seperated into pairs. eacch pair went in a different direction. the pairs, three i think, started blinking their lights as if signalling to eachother blinking in rapid, definate patterns. they were small, white lights. what was odd was that, unlike the beach, we never heard these craft at all. the lights appeared to be doing maneauvers. they would move and change direction in unison. moving sometimes vertically, sometimes horizontally. after watching for maybe 10 minutes we decided we had seen enough and decided to leave. we got in the car and all of a sudden right above us, straight up and down, very close, four very bright , big lights came on in the sky. we were speechless. it was very strange because the lights looked so bright that they should of lit up everything around us but they did;nt.Everything around us appeared as dark as it was before. the bottom light would disappear and one would appear at the top of the collumn at the same time making it appear as if it were climbing. it did this a few times then one of the small lights appeared at the top of the collumn and it took off straight up and the four bright lights disappeared. we were pretty spooked at this point and left, but when we did the smaller lights were still up there moving around. we both got the impression that when those four lights came on it was a deliberate attempt to get our attention. i have had other experiences in the past. i would like to speak to someone about them but don't know how to go about it. please contact me asap.","distance":"101-500 Feet","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Path with directional change","formattedAddress":null,"id":18151,"landingOccurred":false,"latitude":44.0544653,"location":null,"logNumber":"US-07182009-0007","longitude":-82.991314,"occurred":1247115900000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1247115900000,"summary":"We saw a huge translucent triangle which later seperated into several smaller lights.","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Port Austin, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209820"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Middletown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was about 10 o'clock pm.I was driving down the road in franklin ohio and my friend said \"wow what is that.\" we look to the sky and notice three fire balls in the sky traveling in a triangular formation. my first thought was shooting stars. the looked like metiorites. but as soon as i said that the lights would go off and come back on. the objects would also twist and twirl and move in every direction. at times a disc shape could be made out. we got out of the car at a gas station down the road and at a fairly quick rate the three objects decended below trees as if they made it to the ground. there was a hot air balloon show in that direction but i found our because of the wind no balloons were in the air. besides there is no way it was a balloon.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":18150,"landingOccurred":false,"latitude":39.5246576,"location":null,"logNumber":"US-07182009-0006","longitude":-84.3919463,"occurred":1247893200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Disc,  Fireball","source":"MUFON","status":null,"submitted":1247893200000,"summary":"Three fireball like discs in a triangular arrangment made their way to the ground in six minutes or so.","tags":["disc","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Middletown, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209821"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Elk Grove","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was making coffee in my kitchen, looking out the window that faces south, and saw a very shiny cigar-shaped object traveling south to north-west. i thought it was a jet at first, based upon how fast it was going, but i realized there were no wings and no sound associated with a normal aircraft. i went outside to take a better look at it, but as far as i could tell this was not a conventional aircraft. it had a cigar shape to it and had a wierd \"back end\", similar to a submarine with a propeller. it was traveling in a relatively straight line, no variations to speed or direction. i watched it until it disappeared from my view over the roof of the house next door. \r\n\r\nit was a very strange experience. i didn't feel scared, just puzzled.  i'd like to know if others saw this and what they thought. \r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18149,"landingOccurred":false,"latitude":38.4121493,"location":null,"logNumber":"US-07182009-0005","longitude":-121.3636678,"occurred":1247924700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1247924700000,"summary":"Shiny cigar shaped ufo","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Elk Grove, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209822"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pasadena","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at a friends house and we were outside bbq-ing when i looked up at the sky because of a helicopter (police) i noticed a fast moving object. i looked at it and began to focus on it, and didn't see any kind of flashing lights to indicate it as an aircraft (also the speed at which it was going would have been to fast for it to be an aircraft.) instantly me and my girlfriend thought satellite, that is until it made a sharp almost instant turn. it looked like a star that was moving, like a satellite. a dim little dot going really fast across the sky it traveled across the sky in about 10 seconds maybe less, however it was not a meteor or anything like that.. not that fast. the turn was insanely precise, it made me feel uneasy. this was seen by everyone outside. we lost site of the object as it disappeared behind trees. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":18148,"landingOccurred":false,"latitude":34.1493949,"location":null,"logNumber":"US-07182009-0004","longitude":-118.1412255,"occurred":1247814000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1247814000000,"summary":"Satellite like object except for 120 degree shift in trajectory ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pasadena, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209823"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Limido Comasco","country":"Italy","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The object i've seen flying all over my country area lasted for about 1 week. it was middle of march 2009. those u.F.O. were sometimes groups from 3 to 5 units and just one time i saw just one of them, in single. and it was the bigger one.\r\n\r\nat the beginning i thought it was a plane or a group of planes because i live near malpensa (italian international airport) but looking at them better i started to understand that the perspective of those voving objects were incredible. the were moving too fast and they could get lighter and more brillant as they come near and as they go away. i mean...If it was a plane it shuld have got more brilliant coming forward and the contraty. but it wasn't. by the way a plane doesn't have white light back. they didn't show red or green light as planes. and i can see many planes every day and night here. i almost know every international track that pass in here. they were spheres, circle white spheres. one of those nights i tried to follow them because it was so near and big. like a ball over me and as i got closer it started to fasten (i was in my car and driving). at the end i lost it. but i wanna underline that if it was a plane and i was stupidly following it, it was too low and it was flying in reverse. \r\ni say again that this unknown objects were present in my skies for about one week. i cannot explain what they were. i sure know they were not planes or gases or some kind of atmospheric penomena. i'm a scientist and i can analyse things.\r\n","distance":"101-500 Feet, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Straight-line path,Path with directional change,Other","formattedAddress":null,"id":18147,"landingOccurred":false,"latitude":45.6901666,"location":null,"logNumber":"IT-07182009-0003","longitude":8.9809444,"occurred":1237014000000,"potentialRelations":[],"rating":"Unrated","region":"Lombardia","reportedWeather":null,"shape":"Circle,  Sphere","source":"MUFON","status":null,"submitted":1237014000000,"summary":"U.F.O flying (single or group) for more than one day. fast movement. incredible prospective view. ","tags":["none"],"timeZone":"Europe/Rome","timeZoneName":"Europe/Rome","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Limido Comasco, Lombardia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209824"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Edmonton","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On july 1st i saw 2 dots of light in the distance around 11pm \r\n\r\nin the evening moving across the sky at high speeds and \r\n\r\ncoming to abrupt stops. i only observed them for around 15 \r\n\r\nminutes. there was no way they were planes or helicopters.\r\n\r\nthis morning at 3:30am i went to let my dog outside, and \r\n\r\nwhen i looked up to the sky (north east)i noticed a dot of \r\n\r\nlight moving across the sky too fast and too high up to be an \r\n\r\nairplane.... \r\n\r\ni didn���t see cylinders, fireballs, a saucer, or a sphere. it \r\n\r\nlooked like a star in the distance [very small] and would \r\n\r\nsuddenly start to travel at a high speed, then slow down into \r\n\r\nerratic maneuvers, and frequently coming to stops. it would \r\n\r\nresume in a straight line at a high speed and suddenly make \r\n\r\na sharp turn��� once it got further up in the sky it did a 3 \r\n\r\npoint triangular pattern, went backwards, zig zagged, took \r\n\r\nsharp turn left and  and headed that way for a short \r\n\r\ndistance. it then headed down and back up again a few \r\n\r\ntimes... it even did circular and oval patterned maneuvers. it \r\n\r\nstopped often but seemed to be getting further away and \r\n\r\nhigher up in the sky. \r\n\r\nwhen stationary the light seemed to resemble a still source \r\n\r\nof white light, but when resuming motion it would flicker \r\n\r\ncolors at a rate a bit faster than the twinkle of the stars. the \r\n\r\nflicker rate was never the same, sometimes faster, \r\n\r\nsometimes slower.\r\n\r\nit glided like a mouse cursor as it travelled across the sky at \r\n\r\na 45 degree angle. i didn't have a camera handy. i wanted to \r\n\r\ncontinue observing but it was 4am, so i went to bed. i felt \r\n\r\nvery amazed. a bit concerned about their purpose though. i \r\n\r\nwish i had a powerful telescope to see more detail.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":18146,"landingOccurred":false,"latitude":53.545884,"location":null,"logNumber":"CA-07182009-0002","longitude":-113.486092,"occurred":1247826600000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1247826600000,"summary":"Dot of light tavelling at high speed across morning sky and moving erratically and made sudden stops","tags":["light"],"timeZone":"MST","timeZoneName":"MST","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Edmonton, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209825"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Exeter","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" my ufo sighting has been going on for aprox. 3 months. i got interested in quite by accident. one night i went to sit out and observe the skies.\r\nboy! did i ever get a surprise.The skies are full of them. i have observe them both night and day for the last three months.\r\n\r\ni have a process that i go through to get my eyes accustomed to seeing that far. i estimate they are 200 to 250 miles high. i estimate their speed between 20,000 mile per hour to over 100,000 miles per hour.\r\ni get my mph and altitude estimate for the space station as it flies over.\r\n\r\nthey always home in on this one spot. i have counted as high a 50 ( i know that i  proberly missed a lot of them ). they come from the east and from the west, and they all stop at the same place each night.\r\n\r\nit just so happens that the place where they stop is directly above area 51 at groom lake. they have to be connected. i have heard charles hall speak of the alien base in this area.\r\n\r\ni have got a lots of laughs and redicule from everyone that i tell this to. but it is real and it's my truth.\r\n\r\nsincerely     chuck.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":18145,"landingOccurred":false,"latitude":36.2960613,"location":null,"logNumber":"US-07182009-0001","longitude":-119.1420517,"occurred":1241247600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Diamond,  Flash,  Star-like","source":"MUFON","status":null,"submitted":1241247600000,"summary":"I see them everynight .","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Exeter, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209826"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Centerton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Tonight was the first night of the perseids meteor shower, so i was in my backyard to see if i could spot any.  i was looking almost due north, toward polaris, when i saw a flash of light close to the big dipper.  i watched, because i thought i missed a meteor, and it flashed again.  this was not airplane lighting (i live on the approach to xna and see planes all the time).  i've seen satellites go over before, and they're a constant light, not a flashing one.  the flash was not fast, and the begining of the flash was slightly dimmer than the end of the flash.  as i watched, it flashed five, or maybe six times, moving between the bottom star of the big dipper and polaris in a straight line.  the rate of the flash was maybe once every three to five seconds.  i couldn't tell the speed of the object, as i couldn't tell the altitude.  then it stopped flashing.  there were no clouds tonight.  my feelings, reactions, and actions - had to text my wife (she's at work).  don't know if it had anything at all to do with it, but about 5 minutes after i saw this, the neighborhood dogs started barking.  usually that doesn't happen unless there's an emergency vehicle siren, and there wasn't.  i don't have video on my iphone - sorry, wish i did because this would have been cool to catch.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":18144,"landingOccurred":false,"latitude":36.359799,"location":null,"logNumber":"US-07172009-0016","longitude":-94.2852085,"occurred":1247891880000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1247891880000,"summary":"Flashing object traveling west to east","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Centerton, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209827"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Barranquitas","country":"Puerto Rico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just taking a series of pictures of the clouds. i bought a nikon d60 and some software and i was just taking some picture. i didn't notice the object until i saw them home on my computer. i thought it was dirt on the lens. but i checked it and it was clean. i then thought it could be a reflection of light into the lens, no way because of the color.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18143,"landingOccurred":false,"latitude":18.1866242,"location":null,"logNumber":"PR-07172009-0015","longitude":-66.3062802,"occurred":1247881500000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1247881500000,"summary":"I wasn't aware of what i shoot until i looked at the picture home on photoshop","tags":["none"],"timeZone":"America/Caracas","timeZoneName":"America/Caracas","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18143_submitter_file1__encriptedufo1.zip","http://www.mufoncms.com/files_jeud8334j/18143_submitter_file2__encriptedufo2.zip"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Barranquitas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209828"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Denver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At dia along rental car row at thrifty car rental watching planes take off dropping off my sister to get a rental. facing north sitting in my truck caught something out of the corner of my eye toward the northwest looked up it was hard to describe something between a square and a rectangle with unknown apparatus (wings, antenna?) dull brown or rust in color with what appeared to be a hole offset in the corner. thought it was cardboard in wind but it stayed stationary and rotated slow. a 737 flew under it it did not take evasive manuevers from that view it appeared the same size as the plane but hard to judge scale. might have been possibly very high in atmosphere if so it would be huge. watched for maybe 2 minutes then it faded from site.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s),  Wings,  Other,  Unknown","flightPath":"Stationary,Other","formattedAddress":null,"id":18142,"landingOccurred":false,"latitude":39.7440236,"location":null,"logNumber":"US-07172009-0014","longitude":-104.9755034,"occurred":1245254400000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Square,  Rectagular,  Other,  Unknown","source":"MUFON","status":null,"submitted":1245254400000,"summary":"Square closest description like nazca lines","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18142_submitter_file1__DIAufo.bmp"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Denver, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209829"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Chelsea","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The event took place a little north of chelsea, in washtenaw county, michigan-about 8pm sometime in june (it was well before sunset).  i did not have internet available or i would have reported it right away.  i also feel that this event could have been visible in the counties surrounding since it was so high in the sky.  i want to describe the object as an 'almost flattened egg' (or flattened oval shape)**, not a disc or saucer, but an oval that was about three times as long as it was thick.  the flattened oval shaped glow of light, which was approximately the length of about three venus's right next to each other, and roughly the same width for that matter, but it was not as bright as venus is, i would say about 60% of the brightness of venus (when it's at it's brightest).  it reminded me of the glow seen from one of those daylight compact flourescent lights (but brighter), it was evenly distributed light and it never changed luminosity as it transversed the sky from northwest to southeast.  it flew at about the rate that a satellite usually moves across the sky at night.  the rate was constant, no acceleration or deceleration, nor was there any sign of sound anywhere near it, or behind it.  it caught my eye right as it came over the tree line in the distance over the lake, from having a physics background i expected the light to dim as it moved southeast, since i thought for sure it was the reflection of the sun- however after closer observation i noticed the light never changed the whole time, and the light was dimmer and a different color than what the reflection of the sun would have been on an airliner, etc.  based on my observation the 'flattened oval shaped light' must have been self-illuminated to explain how it looked.  the event seemed like it was about a minute and a half, but time was kind of weird for me, since i was in awe.  i had time to run in the house and tell my wife, who was a witness as well as we watched it.   i personally believe it was some craft in orbit due to the speed and behavior it exhibited overall, but my wife says that it looked like it could have been as high as a jet, so it was definitely in between 30,000 ft and low earth orbit.   if anyone has seen this in michigan, please report it, i am not sure of the exact date, but we deduced it to june 19th, around 7:30pm.   don't just read this and say, 'yeah i saw it too' please report it.  thanks!  ** when i say almost flattened oval, i just mean it wasn't a cigar, since it had more roundess and thickness, but like i said, longer than wider oval, by a ration of 1:3 (width:length)","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":18141,"landingOccurred":false,"latitude":42.3236619,"location":null,"logNumber":"US-07172009-0013","longitude":-84.0153229,"occurred":1245465000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc,  Egg","source":"MUFON","status":null,"submitted":1245465000000,"summary":"Saw a small disc shaped light transverse the sky, the luminosity from the craft was even and bright the whole time, no wings, no sound, no reflection from sun","tags":["disc","lights","saucer"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Chelsea, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209830"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Vera","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Since my kids have seen several meteorites the last days, i thought at first i saw one too. but apparently the object came suddenly into my sight of view, and carried on horizontally over the sea (mediteranian) for at least 5 seconds. i assumed it would die out, like a normal meteorite, but it didn't.\r\n\r\nthe object, carried on, and suddenly stopped briefly, then changed to a lower position (down), to carry on with it's path, (from south to north).\r\nthe suddenly after dissapearing completely, it re-appeared briefly, to then move very fast more north, out of my field of view.\r\n\r\ni don't think it was a meteorite, just due to the fact, that it did not die out immediately, but carried on, with a change in trajectory.\r\n\r\n\r\ni had no camera at the time, sorry.\r\n\r\njust hope that other people have noticed this.\r\n\r\ni'm currently on vacation in the south of spain. (vera playa)\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":18140,"landingOccurred":false,"latitude":36.4492594,"location":null,"logNumber":"ES-07172009-0012","longitude":-95.8808219,"occurred":1247899800000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1247899800000,"summary":"White fireball like object, with red afterburn effect","tags":["none"],"timeZone":"Europe/Madrid","timeZoneName":"Europe/Madrid","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Vera, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209831"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lumpkin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Have been looking at my old national geographic mags, and in the pictures of lunar surface explorations, by the lm antares crew pages 140 thru 145 taken by the crew obvious bell shaped craft are very observable.I wonder if this is old news. i am aware astronauts have reported ufo sightings i dont remember this one.��� mv��� note this was the july 1971 issue","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18139,"landingOccurred":false,"latitude":31.959043,"location":null,"logNumber":"US-07172009-0011","longitude":-84.746358,"occurred":34588800000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":34588800000,"summary":"Pictures  of apollo 14 on moon","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lumpkin, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209832"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Silver City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  \r\nit's 2 am, i just came in from ufo sighting similar to the one i saw in the fall!!\r\ninfo:\r\nabout 1 a.M.-ish i was in the kichen, listening to the tv weather station on satelite... i lost frequency with the satellite about 3 times and it just popped into my thoughts - ufo- go out and look --- sure enough, there it was...Just coming over the back yard heading towards phoenix.  triangle in shape, yellow/white, red and then green lights flashing, with a bright white/yellow at the nose, or point of the triangle. there was no sound, maybe a low, deep sort of slow continual wooshing. it traveled steadily and slowly. i raced indoors for my binoculars and phone, then watched for about 45 minutes as it slowly kept moving west towards phoenix.  a few times it went straight down then up again. it was hard to keep my eyes on it. it was just a small orange object with my eyes, but with the binocs i could see the three colors flashing clearly.  the white seemed to be on the top always, with the red on the bottom and the green in the middle. it seemed to just stall and stay in one place for quite a while, went down and back up a couple times, went down really low in front of the mountain range, then back up and moved fast to the right. it was constantly getting further away headed towards phoenix and interestingly enough suddenly some other flying objects appeared. one was probably a helicopter with a bright white light. then a small low flying oldish sounding plane. while these other flyers were out in the ufo area it sort of vanished. there was a band of heavy clouds it could have dropped down behind or into, or it just dimmed all its lights, turned off all color and just looked like a star. then a commercial jet going east from west came through this area. i was shivering so hard at this point from chill i had to go in.  i went in circles debating who or if to call anyone, but it had vanished at this point.\r\n\r\nsighting was 07/17/09 at approximatly 1230 a.M. to 2 a.M. \r\n ","distance":"501 Feet - 1 Mile","duration":"01:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":18138,"landingOccurred":false,"latitude":32.688608897268836,"location":null,"logNumber":"US-07172009-0010","longitude":-108.47701716239368,"occurred":1247819400000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1247819400000,"summary":"Triangle shape with flashing lights","tags":["lights","triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"88061","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Silver City, New Mexico","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209833"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ufo disc, appears out of nowhere from the thin blue sky at 1:07 disapears behind the house, another at 3:21, 3:38, and another at 4:10, disc is traveling at a high rate of speed, hard to see with the eye ....  \"at 1:35 its just a bird..\"  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path,Unknown","formattedAddress":null,"id":18137,"landingOccurred":false,"latitude":40.0648638,"location":null,"logNumber":"US-07172009-0009","longitude":-74.4011812,"occurred":1247641200000,"potentialRelations":[18118],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1247641200000,"summary":"Disc flying high speeds","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/18137_submitter_file1__MOV07148.MPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209834"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Lubbock","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A friend and i were outside having a cigarette when i spotted a  bright white light in the western sky.  the light did at first appear very much to be a star.  i could see no blinking lights.  after only a few seconds it became very obvious that the light was moving and heading east, my next thought was it is an airplane.  we have an international airport in lubbock so i am accustomed to seeing atleast 10-15 planes on any given night.   i saw the object make a sudden sharp change in direction due north, after maybe two or three minutes of moving southeast.  at that point i could see what appeared to be a much smaller and different shade of white flashing on what i will call the back end of the object and what appeared to be the bottom.  suddenly the object made another sharp direction change heading back east.  within only a few minutes we could see this object growing much larger seemingly flying very low and very slow directly over the loop which it right in front of my apartment.  i felt like i would have been able to reach out and touch this object.  definately not any airplane i have ever seen.  there was a distinctive set of two rows of lights, a top and bottom row, if you will.   the top had a very pronounced set of white beams or bar looking lights.  the top had a blue flashing light on the western corner, the bottom had a red flashing light on the eastern corner, the rest were hot white. even though this object appeared to be flying low and slow, however, based on the original point i first spotted it, this thing was massive and moving very, very fast.  for a split second we saw the object make another sharp direction change to the north once again.  while the object was turning we could see a very distinctive triangular shape to the object.  the very interesting thing was were we could not see a lights it really just looked as though there was nothing there, just sky and the few scattered clouds in the sky.  oh and did i mention that we never heard any kind of sound from this thing!  this is one of the best sightings i have had yet.  i couldn't explain it. :)","distance":"21-100 Feet, 101-500 Feet, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change","formattedAddress":null,"id":18136,"landingOccurred":false,"latitude":33.5812731,"location":null,"logNumber":"US-07172009-0008","longitude":-101.8464065,"occurred":1247807400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Square,  Rectagular,  Triangle","source":"MUFON","status":null,"submitted":1247807400000,"summary":"Huge rectangle/triangular  object with bars of white light seen over loop 289","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lubbock, Texas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:209835"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Hiawatha","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While taking my dog on a nightly walk from 9:15pm to 10pm, i noticed a bright solid red object that was in the lower eastern horizon.  i thought it was venus at first since i've seen venus in this area over the past few weeks.  as i was walking my dog i noticed the solid red object was in a slightly different area, which i didn't think a whole lot about it, so i kept walking.  i initially thought it was an airplane with it's landing lights on flying toward me.  a little later while i was still walking that object was again in a different area of the lower to mid eastern horizon.  so i started to watch the solid red light periodically.  i stopped to see if it was actually moving, so i looked at it through a tree branch and noticed it was indeed moving very, very slowly (about like a hot air balloon speed, but a little bit faster).  so i decided i was going to head home and get my binoculars to see just what it was.  so at 10pm i was at my house and that solid red light was above my house, but it was way up in the sky.  i ran into my house and in 10 seconds or less had my binoculars and was back outside.  now mind you, as i was getting my binoculars i thought to myself, \"you wait, as soon as you get back outside it will be gone\" and i also thought, \"i bet i'm gonna wish i had someone watch it while i get my binoculars.\"  sure enough when i came back outside, the red light had completely vanished from the sky.  i looked all around and it was nowhere.  so this is what i concluded: 1. the light was not an airplane since it did not have any flashing lights whatsoever and was solid red 2. not only was i watching that object, but that object must have been watching me and 3. that object somehow knew what i was doing (getting binoculars) and disappeared.  i know that maybe jumping the gun as far as a conclusion, but to be watching an object in the sky for half and hour move from the southeast horizon to the northeast horizon and then gradually go above your house, only to disappear within 10 seconds when you go to get something to view it better, that's what i've concluded.  i was also very angry after the whole thing because i feel like that light was just messing around with me.  it knew i didn't have something to see it up close and when i went to get something, it vanished.  i did see a similar bright red object a couple of months ago that was flying in a straight line from west to east while walking my dog.  while watching it i was distracted by a light (like a super fast flying firefly) that went above my head towards the object, when i looked back for the red light, it has disappeared.  this could have been that same solid red light except it was flying in a straight line from west to east and much faster at the time.  i told a couple of friends about it at the time.  tonight it was flying in a random floating pattern.  i don't know it it's the same object, but both were solid red lights with no flashing lights like an airplane would have.  this also happened to me about 4 years ago in the same area where a solid light was flying over and disappeared when i went to get my binoculars (i don't remember the color of that light anymore, however).  i decided to report it this time, because having this happen to me 3 times in the past 4 years or so, it's time to report it.  i'm actually getting tired of this happening. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":18135,"landingOccurred":false,"latitude":42.0491958,"location":null,"logNumber":"US-07172009-0007","longitude":-91.6815252,"occurred":1247814000000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Sphere,  Star-like","source":"MUFON","status":null,"submitted":1247814000000,"summary":"Solid red object about the size of venus that vanished","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hiawatha, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209836"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Vancouver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I watched what i thought was a satellite move west to east.  the object began to dim, slowly becoming less bright, and then it started to slow down.  the object made a u-turn and after moving in an opposite direction for possibly three to five seconds, it disappeared and there wasn't any cloud coverage around it--it was a very clear summer sky tonight.  i wish i had a video camera handy.  ","distance":"Unknown","duration":"00:00:45","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":18134,"landingOccurred":false,"latitude":45.6436681,"location":null,"logNumber":"US-07172009-0006","longitude":-122.6523861,"occurred":1247806200000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1247806200000,"summary":"Thought it was a satellite, but object made a u-turn and disappeared ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Vancouver, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209837"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Portland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"10:30 pm, 7/9/2009. sudden appearance and excellent close view of a silent yellow-white oblong-shaped light that approached flew nearly directly overhead (75 degrees) at 1,500 feet at an estimated 80mph to 100mph across a cloudless urban night sky.\r\n\r\nthe luminous object had a slightly flaming appearance, as if short flat membranes of the yellow-white light were slowly fluttering on the surface of, or next to, the light-object as it flew.  only a single luminous object was visible, without a visible body, no wings, no stabilizers, etc.  absolutely silent at all times.\r\n\r\ni was looking to the northwest at the big dipper - it was a beautiful clear evening. some commercial and civil aircraft were widely scattered in the sky, all visible as aircraft thanks to running lights and just a pinch of twilight in the northwest sky. i recall thinking, for some reason, that it would be very neat to see a ufo and compare the difference in appearance.  honestly, in about five minutes this light suddenly appeared out of the southwest at about 30 degrees from the horzon - from the corner of my vision it seemed to just pop-on.  the \"switched on\" appearance, the absence of running lights, the color, the intensity, and the direct movement toward my position (the approach began to feel almost purposeful as it closed in) caught my attention right off.  it was at first a thick flat shape, the apparent size of the end of my little finger, looked straight on at arms length, perhaps two miles away \r\n\r\ni watched the light approach in level southwest to northeast flight for about 30 seconds. as the angle of view changed the shape changed and the light took on the form of a thick oblong object, much like the outline of a standard streetlamp.  the speed was constant at 80mph or possibly 100mph, it flew against a light east breeze.  \r\n\r\nat its closest point, the light was about 1,500ft above my position, and about 100ft off to the north.  my reference is mt. scott, 1,000ft high 1/2 mile to the north.  at that point the apparent size was the overall size of my thumbnail at arm's length. (using 1,500ft for comparison, the light-object would have been the size of a large suv).  the intesity of the flamy light at that point was like a sodium vapor streetlamp at, say, 100ft, possibly 150ft. it was brighter than anything in the sky.\r\n\r\nat that point i stepped inside and grabbed my best 7x binoculars and had an excellent view of the object for 30 seconds or more. i tracked it from its position nearly overhead until it flew out of sight behind a bank of aspen trees. \r\n\r\ni saw no structure, or wings, or stabilizers, or rotors, or any sort of physical outline.  the color of the light did not change.  no other light sources were visible on it or around it, no running lights, no landing lights, no flashing or pulsing light, no rainbows, etc.  just a slightly-flaming fat oval-shaped light, clipping right along, just going about its business.\r\n\r\nit flew smoothly and straight. i had the impression that the silent propulsion source provided for very tight control - no change in speed, no wobbles, no banking or rolls, no yaw movement.  it made a straight pass over the east flank of mt. scott, and continued directly at the same height and speed to the northeast in the direction of troutdale on the columbia river.  at my last look in the distance it was in the shape of an sort of flattened egg and still quite luminous.\r\n\r\ni had been star watching with my pooldle at my feet, and when the object approached, i glanced down and and saw the dog was frozen into the position he takes when he hears a rabbit in the garden - head up totally rigid.  it may be that a rabbit was actually there, but to me those moments had a sort of \"cone of silence\" feel to it with both of us conscious of that interesting light. perfectly at ease.\r\n\r\ni was left with a feeling that whoever was operating that light wanted to be seen - that it was an intentional demonstration, maybe showing off, right out in front of everyone.  and moreso, that they wanted to show off to me, and i had this feeling of being sort of lucky.  that sounds rather silly and selfish, and but doubt others saw it and feel the same.  anyway, this was a wonderful sight and special -even if it was something ordinary in the air just dressed up with lights.\r\n\r\nsomething else:  when the light disappeared to the northeast i waited for another 10 minutes hoping it might fly back to give us another look.  i really wanted to see it again.  nothing happened.  i called out to my dog \"hey call those guys back here i want another look at them...You've got a loud enough bark, they'll hear it.\"  he's trained and fun and responds to my voice no matter what nonsense i put to him. a just a few moments later....\r\n\r\nsomething very odd - a commercial 737 with all lights switched on made an \"out of the blue\" unusually low, unusual straight west to east pass directly overhead ��� at approximately the same altitude or lower than the light ��� the lowest i have seen these craft fly over the city.  very low and it seemed to just appear, no sound of it approaching.  it was low and slow that i could see underbody in part illuminated by ground light sources. that aircraft continued on to the east at that same altitude, gunning its jets noisily, and went out of sight behind a bank of trees - the sound went away just as quickly.  while my location is at the edge of an outer-pdx aircraft approach corridor, air traffic is virtually always routed from south to north, about a mile or more to the east of me, and absolutely always at a higher altitude. that 737 was almost stunning and oddly coincidental.\r\n\r\ni went inside, got on the internet and read that another portland area person had reported seeing amber-colored luminous objects, he called \"flying streetlights\" moving over east portland two days earlier.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":18133,"landingOccurred":false,"latitude":45.5286315,"location":null,"logNumber":"US-07172009-0005","longitude":-122.6672271,"occurred":1247203800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Egg,  Oval","source":"MUFON","status":null,"submitted":1247203800000,"summary":"Silent, low-altitude flaming yellow-white oblong-shaped luminous body across a cloudless urban night sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Portland, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209838"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sedona","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at work.  a shop in sedona, the last one in uptown.  i was standing near the door which was open.  i saw something running, i stepped out the door and by then it was too far down the road to have been a human running on foot. it was as fast as i could turn my head.  it ran to the edge of the motel parking area and stopped at the bushes.  it stopped and looked back at me.  it was brown, wearing brown clothing, all the same color skin and clothes, form fitting, large dark eyes but normal looking head and limbs except extremely thin.  too thin to have been a human - at least one that could run that fast.  i knew it knew i saw it, that is why it looked back exactly at me.  i broke eye contact and went back inside. if there is another site to report this on please let me know.  i just thought someone should know about it.  i am totally freaked out by this and it came to me that i could know where it came from - the tunnel in clarkdale - but i have no idea why i might think that.  i also think it escaped.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":18132,"landingOccurred":false,"latitude":34.8767095,"location":null,"logNumber":"US-07172009-0004","longitude":-111.7551896,"occurred":1247246100000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1247246100000,"summary":"I saw an alien i think","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sedona, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209839"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Miami","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This 16th day of july 2009 is the third sighting in about 9 months. other two sightings, same object same about time frames late afternoon early evening. about an hour to an hour and a half before sunset, in a clear sky, i was with my younger children in my pool. i happened to be looking for airplanes with my 6 year old girl, who loves airplanes.\r\ni then noticed what looked like a bright daylight star about three times as bright as venus, and about same size in a daylight sky. my daughters 6 years old and my 16 year old daughters as well as my wife noticed it. its position was about due north of my position, in the 12 o clock, at about 65% above horizon. object remained fixed for about 25 minutes then started slowly drifting erratically, or undulating as it moved, first moving to about 12 o clock, 85% due north, turned ever so slowly and drifted toward the sw. stopped at about 11 o clock position 70% above horizon due west. then drifted south to about 10 o clock position 48% above horizon from due west. then drifted back toward the north to about exactly due west from my position at about 42%-45% above the horizon in the setting sun and stopped. object remained there as sun set becomming brighter as the sun set behind distant western cumulonimbus clouds. at first it looked like the evening star as it reflected white light from high up eventhough we were already getting dark with a red sunset behind cumulonimbus clouds. then as the sun set, it reflected red light and gradually became dimmer as night set in until it disapeared with the sunlight. altitude estimated at 80,000 ft-100,000 ft due to the lag time of the reflecting sunlight off of object in the setting sun over the horizon. during the earlier part of the sighting around 7:30 pm when object is still fully lit by sun, and in the due north 65% above horizon, i observed it through binoculars from neighbor's home! object appeared sphereicle, white ball like with dark and light sides like a half moon.\r\n\r\nthe time before this in april, about mid april 2009, same situation, i was with my children in the pool about 4:50 pm same object same brightness, same size same clear sky. i first noticed object out at almost same position in north sky at about 85% above horizon due north of my position where it remained fo about 30 minutes then started slowly wandering around in all directions until it remained on a heading se until it positioned itself due east of my position at about 70% above the horizon. stayed there for about 5 minutes then started slowly drifting sw until due sw of my position in the south western sky. then it stopped for about 10 minutes then headed back north/north west to about due west of my position, where it remained as the sun set. same scenario, got brighter as the sun set behind horizon (no clouds in the west this time) totally clear. looked like a bright star until sunlight reflecting off of object turned redish and gradually dimmed as night set in until all reflection is totally gone! again lag time between setting sun and darkness untill light stopped reflecting off of object. again about 80,000-100,000 ft. high.\r\nrough guess but sphere may be about as big as small bus or large van, but white ball like!\r\neven small through standard binoculars. too small in sky to get photo, as it dimms with lag time to setting sun at about 8-10 minutes.\r\nthen other time in october of 2008 same situation, but it remained at about straight overhead, enough to kink my neck trying to watch it until sun set. it didnt move much then at all and still had a lag time from setting sun untill all light stopped reflecting off of object.\r\ni am an ex-private pilot and never seen such erratic almost slow jerky back and forth undulations and movements, while it is in transit to new locations, which are really not noticible unless you stare at it. undulations like a giant round ballon on a string in a slight breeze.\r\ni only thought possibly it could be one of those high altitude blimps for the military surveilance, but i have seen them before in key west and they are lozenge shaped with three tail fins and do not go this high.I would have seen the tail fins through the binoculars! and the military blimps have red strobe lights after dark!!!!","distance":"Over One Mile","duration":"01:27:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":18131,"landingOccurred":false,"latitude":25.7905989,"location":null,"logNumber":"US-07172009-0003","longitude":-80.2218393,"occurred":1247796600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere,  Star-like","source":"MUFON","status":null,"submitted":1247796600000,"summary":"Like large daylight bright white star naked eye/binoculars white sphere shaped","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Miami, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209840"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Spokane","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approx. 22:00 i went on the back porch for a cig. and to watch nearby fireworks. (no alcohol/drugs involved). i noticed something i couldn't i.D..  about 200-300 ft. above a cluster of trees i saw a reddish glowing light moving in my direction. i then hollered for my grandma to come look. we both watched as it made a gradual turn from eastbound to the south.  as i was fixating on the object my grandma said \"look, there's another one\" it followed the exact course of the other(about a 1/2 mile behind the other). i should point out that we heard no sound nor could we see any sort of attached apparatus(i.E. hot air ballon or parachute etc.) they seemed circular in shape and although i had nothing to use to scale the size, it seemed to be about the size of a tire you would find on a bulldozer. at this point my feelings were an equal mix of intrigue and fear. the approx. speed was 14- 22 mph. once they were heading south towards seattle, they made a slight increase in altitude. they never vanished. we watched until they passed trees on a hill gradually fading out of sight. we didn't call 911 because honestly how does it sound to say \"it's july 4th and i'm seeing lights in the sky! (in 2001 i had my first unexplainable event while in central mexico so i'm not a skeptic.) the event lasted about 12-18 min. from first sighting to the point where it was out of our field of vision. unless a few rich men constructed two devices to create a hoax, i can say with absolution that my grandma and i saw two ufo's who thought they'd get a closer look at what us crazy earthlings were doing sending colorful explosives into the sky. and perhaps they thought \"no better time to check out the place since the sky is full of lights of all colors and shapes\" \r\n","distance":"101-500 Feet","duration":"00:17:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":18130,"landingOccurred":false,"latitude":47.7189777,"location":null,"logNumber":"US-07172009-0002","longitude":-117.4279032,"occurred":1246774200000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Circle,  Sphere,  Star-like","source":"MUFON","status":null,"submitted":1246774200000,"summary":"Aside from obvious fireworks, we saw 2 reddish lights(no sound) moving at a steady pace. trailing apart from each other.","tags":["lights","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Spokane, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209841"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Pereira","country":"Colombia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Estaba en la terraza de la casa de mi novia y siempre acostumbro mirar al cielo para tratar de ver algo diferente y ah��� estaba como una estrella mas grande de lo normal, que cambiaba de color (rojo-azul-blanco) y parpadeaba como haciendo flash.\r\n\r\na su lado hab���a otras mas peque���as pero con la misma apariencia y desde un extremo totalmente opuesto y lejano viajaba otra estrella diminuta pero a velocidad lenta visualmente porque en un minuto y medio atraves��� todo el cielo y se encontr��� con la estrella grande.\r\n\r\nah��� se quedaron como reunidas movi���ndose discretamente en todas las direcciones ( como en s en z y hacia arriba y hacia abajo )\r\n\r\nes muy normal verlos, los veo sobretodo cuando hay cielo despejado y luna llena, pero como casi nadie mira el cielo es dif���cil que me lo crean...\r\n\r\nvarias personas ya lo hemos visto, mi novia, la hermana, la mama y mis padres, pero no me creen cuando lo reportamos al aeropuerto...\r\n\r\nellos est���n todo el tiempo aqu��� cerca... estamos relativamente cerca de un nevado y de una laguna grande de agua pura... no se si eso tenga algo que ver...","distance":"501 Feet - 1 Mile, Unknown","duration":"03:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":18129,"landingOccurred":false,"latitude":4.81429,"location":null,"logNumber":"CO-07172009-0001","longitude":-75.69464,"occurred":1247809500000,"potentialRelations":[],"rating":"Unrated","region":"Risaralda","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1247809500000,"summary":"Estrellas que se mueven, cambian de color y producen relampagos","tags":["none"],"timeZone":"America/Bogota","timeZoneName":"America/Bogota","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pereira, Risaralda","triangle":false,"type":"UFO Sighting","$$hashKey":"object:209842"}],"last":false,"totalElements":82759,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2201}
