{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Jersey City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":" i was living in jersey city at the time, and i was coming from my second job at a video store riding my bicke since it was only five blocks away and as i was one block from my house i saw out of the corner of my eyes, what i thought was a meteor, because it was coming straight down at lightning speed, so i looked up and it was like an orange fire ball when it was coming down, and when it got to i would guess 200 feet from the grownd, it stoped and thats when i saw that it wasnt a meteor, it was a flying disk and it  looked like it was a meteor because it was coming down on it edge,but as it stoped it slowly began to turn right side up and thats when i saw that it was dark grey on top.Then it  slowly turned on it edge and i saw the bottom,it had 5 pentagon shaped lights wich covered the whole under side,they were emeral color they were aranged one in the middle and the rest around it,  and then it just shot up i at a high rate of speed after being just hovering,it just accelerated so fast that  my eyes could not follow it, and it did all this without a single bit of sound, thats why i know this thing was not made here all flying machines made by us make sound and none had the flying charasteristics of this thing.I stood motionless as i saw it and my tears started to come out, i dont know why, because i felt no fear at all, just an overwelming feeling of disbelief, and then admiration, but on thing that has always been in my mind was that when i first saw it coming down, i was riding my bike on bergen ave. and i remember that as i saw it take off again i was holding my bike on belmont ave, which was the street i lived on, i remember i stood there for about half an hour after it left, just looking up, and my tears coming out. i went home and never talked about it until a few years later, i just know that people look at you like you were on drugs when you talk about these things, so i kept my mouth shut, specially from my dad.","distance":"21-100 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2152,"landingOccurred":false,"latitude":40.7281575,"location":null,"logNumber":"","longitude":-74.0776417,"occurred":710183880000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":710183880000,"summary":"A navy grey disk","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Jersey City, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2854"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Gulf Breeze","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I am probably just imagining this but i really think i saw a a ship over gulfbreeze and it looked like a seven foot something what was wispy and sort of notreal but perhaps.  i am not crazy - i am a former government investigator andwanted to tell someone but i dont want anyone to make fun of me like my olderbrother did when we were kids. im still mad at him.  dan","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Other","formattedAddress":null,"id":2151,"landingOccurred":false,"latitude":30.3604438,"location":null,"logNumber":"","longitude":-87.1561674,"occurred":1050765420000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1050765420000,"summary":"I think i saw a blinking red light in gulf breeze","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Gulf Breeze, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2855"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Boise","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"1.I was in the upstairs of my parents house, looking out the window, talking onthe phone at approx. 330 a.M.2.An elctric blue sliver appeared in the sky , right after i looked out thewindow, at the space in the sky where it appeared.3. i couldnt tell what the object was, i know it wasnt anything i have ever seenbefore though, i am extremely skeptical or at least was, i looked for blinkinglights, space debris, helicopter,anything to identify it, and was at a loss.4.Once i realized i had never seen anything like it, i got out of the hammockthat i was lieing inin my bedroom, and walked to the window, curious as i haveever been. then found myself telling the girl to hold on a sec. i think i seesomething, then found myself opening up the window, and taking off the screen. istuck my head out the window.5.The object floated in the air for a good 4-5 minutes, doing nothing, nobobbing, no swaying, perfectly still, and when i got out of my hammock, itstarted to move,slowly, smoothly , without jerking forward, at this point iinvoluntarily opened the window, and stuck my upper-half of my body out of thewindow, and as soon as i did that it shot, like a bolt of straight lightningacross the sky, leaving a burned image of blue in my mind, not a tracer, but aengraved memory. at this point i dropped the phone and....I guess ill tell youthe rest in person or something, this would be the confidential part i suppose.7. it shot, at the speed of frickin light, as far as i could see, in a straightline, not far above the city, or so it seemed, i couldnt help to start crying.Infact everytime i do tell the story, tears come to my eyes and i feel very funnyinside, like i do right now typing.Its about time i come forward with thisstory, in fact, i have talked to one of your representatives in","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2150,"landingOccurred":false,"latitude":43.619971,"location":null,"logNumber":"","longitude":-116.205786,"occurred":809908200000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":809908200000,"summary":"Electric blue sliver in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Boise, Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2856"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kirkcaldy","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Showground stretching 1.34 miles long firth of the firth, scotland. kev,keithand i were on the big dipper and saw 2 objects head for a point in the sky southof the river then one after the other depart in the same direction east. veryfast but could be seen quite clearly","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2148,"landingOccurred":false,"latitude":56.1168249,"location":null,"logNumber":"","longitude":-3.158137,"occurred":740631000000,"potentialRelations":[],"rating":"Unrated","region":"Scotland","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":740631000000,"summary":"Firth of the forth, scotland. june 1993 x2 ufos","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kirkcaldy, Scotland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2857"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Miami Beach","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"At above dates and timesi was midnight property,manager for alarge condo, in miami beach,i usually wentto the roof of the building to check around, when i looked at the sky, and saw aunsually, bright star, as i stared, it seemed it sensed, this and it sucked itself in, never to reapear,i was naturally very curiuos, and i still wonder tothis day.","distance":"Unknown","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Other","formattedAddress":null,"id":2147,"landingOccurred":false,"latitude":25.790654,"location":null,"logNumber":"","longitude":-80.1300455,"occurred":994759740000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":994759740000,"summary":"I saw something odd over miami beach at dusk 2001","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Miami Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2858"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Havre de Grace","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was currently working for a limo. service and the call came that i had to takea guy up to philli.,pa. after picking him up in baltimore we proceaded on topa.I dont remember why but we went up route 40 out of baltimore for philli.I was driving a new 2000 dodge passenger van and we were moving about 50-55 mphas we were approaching what i believe was riverside park way or riverside road iwas noticing that the clouds we excoming up the road were disapating and beganto look for the moon as i noticed it was begining to show its light itdisappearded again . no one else was in the road i got a stong alert feeling atthis point and continued to look towards hte sky . my hair felt like it wasgoing to jump from my skin all over my body. i let the accelerator petal go as idrifted i was looking real hard at the spot i noticed the moon, in the moon sreappearence thier was a shape plocking the light. the object was shaped likenothing i have ever seen.It had four 4 areas on it which might have been somekinda magnetic field enginethe four of these were interconnected by four walls which were not shaped forthe airodynamics we now see how everything is bubled to a single point but ithad a depressed walllike an obique from engine to enginethe two  engins in the rear were fertherapart the those in the front or is it the other way arround note all the fourengine like units were seperated by a wall its just that the walls were approx.150-200 ft. long and prob. 1-3 building stories high with these engines     iguess i could say the walls resembled this---3e3c-- so if you put four of these together and make the side ones three timeslonger then that of the rear input 4 cylinder shapes bold in appearence anconnect the fron buy a slitly shorter parenthesis paint it rustic and hide therivets or bolts youll have what i saw.","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2145,"landingOccurred":false,"latitude":39.5492792,"location":null,"logNumber":"","longitude":-76.091617,"occurred":749386800000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":749386800000,"summary":"Rt. 40 near aberdead md","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Havre de Grace, Maryland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2859"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Pine City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"News report reported a large object in the sky that they could not identify. itwas invisible, but it did have a radar bounce, they checked radar for precip andthere was none.Initally they reported the object over the dakotas moving into minnesota. duringthee broad cast. throughout the broadcast it was brought up how unusual thiswas.When the 6 oclock news came on nothing at all was mentioned. evening news samething, not a single channel mentioned it. this was very strange with how muchthe 5 oclock news had made such a big deal about this.Up to this time, the invisible mothership is still in orbit and still can betracked on radar.I was hoping to find a way to get more info about this, im kinda excited.Diane hinkley","distance":"Unknown","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2144,"landingOccurred":false,"latitude":45.834282,"location":null,"logNumber":"","longitude":-92.970438,"occurred":1045184400000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1045184400000,"summary":"Transparent object with radar detection only","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pine City, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2860"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sadorus","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving home from work on the sadorus slab. i had noticed that the sky wasclear and lots of stars were out. about a mile before i got to sadorus i noticed2 bright stars in the east sky. they seemed really bright. i glanced at themseveral times. then rolled my window down to get a better look. the one to theright started to move. i looked for flashing lights, thinking it was a plane,but i didnt see any. it started to move faster to the southeast so i called mydaughter at home to tell her to look out the front door to see if she could seeit. the phone rang twice, then she answered it. i told her to hurry, theres areally bright light and its moving. by the time she got to the door it was gone.It was unreal the way it voomed off. at first it was a large bright star. thenall of a sudden it took off to the southeast and was a pinpoint. then it wasgone. only 1 minute probably elapsed from the time i noticed it and to the timeit vanished. i was really excited about this whole thing, ominous, very ominous.","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2143,"landingOccurred":false,"latitude":39.9669758,"location":null,"logNumber":"","longitude":-88.3464425,"occurred":1042423500000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1042423500000,"summary":"A bright light that voomed away at incredible spee","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sadorus, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2861"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was the day after my uncles birthday, and we decided to go out for a driveinto the city.  i, myself, didnt know my way around the state and this would bea new experience.  ultimately it became a memory i wouldnt forget.  that nightas we got near the city, a strange pattern of lights was floating off in thedistance.  i noticed but said nothing.  it wasnt until i noticed them again andrealized that they were behaving stranger than anything id ever seen.  to mysuprize no one else saw them until i pointed them out.  they were the size of anextended fist out on the horizon.  thats when a noise, somewhat of a muffledbuzz, began and so did our car trouble.  our electric equipment alsomalfunctioned.  eventually the objects slowly, but surely dissappeared into thesky above us.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Dome,  Insignia,  Other","flightPath":"Unknown","formattedAddress":null,"id":2142,"landingOccurred":false,"latitude":32.2287529,"location":null,"logNumber":"","longitude":-110.921279,"occurred":1042115220000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1042115220000,"summary":"Spherical in nature","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2862"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Medicine Hat","country":"Canada","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"At the time when i was seeing the ufo i was in a trail in my town which connectsa higher residential area to a lower area and there are train tracks which arein between the residential areas.I was at these tracks in the trails at a slightly higher elevation than the townso i could see the whole town from where i was.  i was just walking home asusual and then i looked up and seen what looked to be a flashing and hoveringtower over the hospital in our town.  i didnt think anything of it and keptwalking.  then i looked at the lights again and they were moving away from thehospital and i realized the nothing man main just sits and hovers for no reasonover a hospital and then flies off.   the ufo moved quite rapidly accross thetown and then did a leaf like effect where it seemed like it was trying tobalance itself.  then it moved closer to my position and stoped in the middle ofthe town.  during all this time it was flashing its lights.First one light would appear starting from the left of the craft, then two, thenthree and finally all four and then all of the lights would dissappear together.Once the object stopped in the center of town hovering over buildings ofcourseit then turned into a very bright light like a sun and came directly towards me. i felt a telepathy feeling like i knew this thing knew i was looking at it.  itcame over the house tops directly toward me so i ran down through the path andto the street below i thought that if i was on the street the craft couldnt takeme without my fellow humans seeing it happen.Once i got to the street below i could see the craft only 15 to 25 feet awayclearing houses making no sound.  i hid behind a tree infront of someones houseand looked at the object hovering over me diagonally over me and i could hear itonly when it was extreamly close.  it stayed there for what i thought a fewseconds and then i looked at the ground because i was scared and when i lookedback up i couldnt see it anymore but i could hear it taking off over the housesclose by.This was without a doubt a real ufo and a high tech one to boot.Please, do everything you can to make this propulsion technology public.It is, in my belief the only weapon to end all wars for our race.  wars, againstourselves that is.Tha","distance":"20 Feet or Less","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2141,"landingOccurred":false,"latitude":50.041554,"location":null,"logNumber":"","longitude":-110.677607,"occurred":1032073200000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1032073200000,"summary":"Saw 1 very high tech. ufo","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Medicine Hat, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2863"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Fort Worth","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"The video was shown live on cnn on the day of the space shuttle collision, thevhs copy we have is clear as a bell, to view a shoet flash clip go to this page,httpwww.Gregg.Gregg.Netpagescolumbiacolumbia.Html ,this is a major cover up, are you part of it  or do you want to do somethingabout it","distance":"101-500 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2139,"landingOccurred":false,"latitude":32.734929,"location":null,"logNumber":"","longitude":-97.3193596,"occurred":1044225000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1044225000000,"summary":"Video shown live on cnn on day of shuttle columbia","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort Worth, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2864"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in the back yard of my mothers house in tucson ,arizona, enjoying the cold night sky welcoming in the new year. i noticed three bright pale orange lights in the eastern sky . they were in a verticle line with the top one offset a little to the south but moved slowly till it lined up in a straight line above the other two. i then noticed a fourth object moving from the south east to the north west at a high rate of speed. as it approched the other three it slowed then came to a stop at the same level as the third disc horizontal to it. i had spent three months watching the sky with my telescope enjoying the clear cold skies so i knew that these lights were not stars as at that time of night in that section of the sky there are no major stars or planets. i knew they were not planes nor helicopters as the night was still and cold and other than the occasional popping of revilers it was quiet. after the fourth disc aligned itself next to the top dics the bottom dics simply winked out, then the next one up winked out, then the top one winked out, i attempted to take a picture with a digital camera but no results so i took my binoculars and watched the fourth  disc wink out. as i watched the last disc wink out with the binoculars i could see behind it at agreat distance the flashing lights of a commercial aircraft blinking. it wasmoving from south to north.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2138,"landingOccurred":false,"latitude":32.2263129,"location":null,"logNumber":"","longitude":-110.919129,"occurred":1041408000000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1041408000000,"summary":"Four orange disks moving s.E.To n.E","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2865"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Bedford","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was letting my dogs out the back door.  i have never heard a rumble such asthat from any ac worked around ac for 37 years, 2 mos. 4 days.  i knew i hadnever seen that before.  i remained calm and called my wife to get out of bedand come and observe this object.  it had the form of a bananna i could only seethe outline with a red light on the port tip and a green light on the starboardtip.  it had about 300 to 400 little white lights filling the space between thered and green tip lights.  the object moved slowly away 40-55 mph in a northerlydirection, with that strange rumbling sound.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":2137,"landingOccurred":false,"latitude":32.844017,"location":null,"logNumber":"","longitude":-97.1430671,"occurred":1021617000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,  Triangle","source":"MUFON","status":null,"submitted":1021617000000,"summary":"Observed large object moving north from back porch.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bedford, Texas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2866"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Grants Pass","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My son and i were camping at a koa a few miles south of grants pass on the roadto cresent city.  it was a totally clear night, without moonlight and with themilky way easily seen.  my son looked up to what i believe was the nw sky, andsaid, look, whats thati saw a glowing cream or beige colored light, with a highly defined oval shapecoming fast about 15 degress from being directly overhead.  in comparison to asatellite, it moved 5 to 10 times faster.  at that time, i knew it wasnt one ofours.There was no trail or tail at anytime, and we watched it as it approached, wentby us, and continued past us.  there was no color bleed, and the object stayedhighly defined.Suddenly, it rapidly accelerated and begin to move both forward and to the sidelike a movement that would trace the fingers of a glove.  at the top of thethird scallop-like path, it disappeared instantly.I immediately asked my son to sit down and we exchange opinions of what we hadjust seen.  we agreed in almost every point.About 5 to 10 minutes after this sighting we were still talking and a number offighters with afterburners on, but no navigation lights, appeared following asimilar path as the ufo and buzzed the area where the ufo disappeared.  after ashort time, they left.I might have dismissed the sighting had it not been for the jets.  whatever wesaw must have shown up on radar for fighters to be scrambled.  ive listed my sonas the first observer, which he was, but he might not be willing to talk aboutit.  i have experienced depresson and anxiety as a result of this sighting.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":2135,"landingOccurred":false,"latitude":42.4485369,"location":null,"logNumber":"","longitude":-123.3189025,"occurred":1023388200000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1023388200000,"summary":"Ufo and pursuit fighters seen near grants pass or,","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grants Pass, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2867"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Belen","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"1. at homewatching news of columbia disaster.2. when it flew past the lower right hand corner of the footage shown.3. definitely a disc shaped ufo.4. i was shocked, as i mentioned it to my wife, she has bad eyes,didnt see it.Iwas then very excited i had experienced the sighting.5.  as i had previously stated, it came flying from the bottom of the picturevery fast,at the right hand bottom of the screen to the right side veryfast,then disappeared from the picture6. as stated ,it flew out of view of the photographer. the station was ,ibelieve wfao- in possibly albuquerque, n.M. we were watching cnn throughourlocal channel 3, here in phoenix,az. i cant believe i was the only person whosaw this ufo6","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Unknown","formattedAddress":null,"id":2134,"landingOccurred":false,"latitude":34.6625523,"location":null,"logNumber":"","longitude":-106.7636332,"occurred":1044117600000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1044117600000,"summary":"Ufo present in space shuttle footage 02-01-03","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Belen, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2868"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hampstead","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Saw a unidentified flying object while looking through telescope","distance":"101-500 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2133,"landingOccurred":false,"latitude":39.6048253,"location":null,"logNumber":"","longitude":-76.8499774,"occurred":1040242380000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1040242380000,"summary":"Round airplane","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hampstead, Maryland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2869"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Washington","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Ellen and i were driving south from wilkenson past carbonado returning from thestore going back to camp where our friend dave yasutake was waiting at camp. inoticed a light off to my right up on the hill following up it seemed to keeppace with us. i thought it was strange because a car or motor bike would bebouncing and the light looked different like as big as a house. i then changfeddirection as we came to a turn and tree over hage ahgaed in the road.  theobject stated down the hill at us and went dark and lights beamed down below it.I said  do you see what i see, because i dont believe it  ellen said yes.I just held on tight to the steering wheel the whole time. the object came donthe hill and into the road and as it reached the road the edge of it split openand the light beams below it went out and the edge open up to mak the objectglow all over it was in the road now and i could hit it with a rock it was soclose. then the object raised up slightly and the top dome area glowed morewhite than the under side which was glowing a orange-yellow with a red tingelikie a toy laser does on your hand. the way it stopped was starteling becuse itdidnt wiggle or wobble it just stopped perfectly and precisely.I tried communication by switching my headlight to parking lights and then downto off and then parking. and back to headlights.  it didnt do any thing for sometime and we just kept staring at it.A sudden flash starteled me with no sound and the light source dimmed like afloadlight when turned off then my eyes slowly cleared and looked to seedarkness. the craft has gone.We looked at eachother and discussed breifly to eachother what did you seeabout a minuite later a dark orange light appeared on the ridge across theriver, it was slightly trasparent.","distance":"21-100 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change","formattedAddress":null,"id":2132,"landingOccurred":false,"latitude":38.9016818,"location":null,"logNumber":"","longitude":-77.0329558,"occurred":779778900000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":779778900000,"summary":"Carbon river sighting on the road","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Washington, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2870"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"St Louis","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was a summer evening in st.Louis city. we did not have airconditioning. i wasstaying with my sister linda,s and brotherinlaw pat at there second floorflat.The building was one of those older building that had windows that camewithin 36 from the floor. my bed i was laying on, came even with window.I layedther with one of arms hanging out the window hoping to catch a cool brease onthat 100 degree day.All of sudden this ship slowly moved into my line of vision.I could not believe my eyes, in broad day light.The sun was starting set andstrarted to shadow some parts of the ground, but not this ship. it took on thatmissouri summer sunset orangeish glow that it was reflecting. i screamed for mysister a brother-in-law to get in here, your not going to beleive me ,just getin here.My sister came into the room and looked out the window and looked overat me,but i refused to take my eyes off it.She colapsed in the coner resitingthe lords prayer.Pat started hitting himself in the face.Saying im notdreaming.I said dont take youre eyes off it.It just hovered there for a least 10min.While pat whent to look for his camera,the ship left in nothing but trail tothe north. it kind of reminded me of the mother ship on battlestar galactica,itwas of wedge triangular shape.But the most strangist part was that we could seethe ship plan","distance":"21-100 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Stationary,Unknown","formattedAddress":null,"id":2131,"landingOccurred":false,"latitude":38.6301025,"location":null,"logNumber":"","longitude":-90.1965042,"occurred":142875600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":142875600000,"summary":"This was no light in the sky.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"St Louis, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2871"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Richmond","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were talking outside and we decided to get a book called the the u.F.O.Hunters handbook. when david ran up to get the book i spotted the craft.Itold jimi and david and we were astonished. we then agreed it was a gray typec shuttle. we filed this report to warn the ufo socitey. slow movingobject,constant light source. went to take picture and it turned up blank eceptfor a blurry cloud with a flash over it. we believe it was some sort of forcefield.Did not lose sight,still watching.","distance":"501 Feet - 1 Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":2130,"landingOccurred":false,"latitude":37.5475046,"location":null,"logNumber":"","longitude":-77.4282981,"occurred":1044765000000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1044765000000,"summary":"Small,silver dot,moves slow","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Richmond, Virginia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2872"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Essex Fells","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was looking out the window, and noticed an airliner in the newark airportlanding pattern ne sky from my perspective.  my attention was drawn to twopoints of light that were apparently following the airliner but appeared to beat a much higher altitude.  as i watched the points of light, i observed themcircling and disappearing, resuming straight motion, and circling each other ,and disappearing.  a third light joined in the dance.  all were fading in andout and displaying unusual changes in motion.  i called to my son christopher tocome and see if he saw what i was seeing.  he did.  we both watched as thepoints of light continued to circle each other, disappear, and reappear again inslightly different points in the sky.  we both watched, and concurred what wewere seeing there are moving towards each other, there gone, there back, etc.... the objects appeared, brightned at times pulsing, and disappeared throughoutthe observation.  one last point of light, appearing farther distant than theothers appeared, moved eastward and disappeared.  the elapsed time was about 4minutes.At first i thought what i was seeing was some refraction in the window i waslooking through, but after calling my son who had a slightly differentperspective and was seeing the same thing, i became more curious.  i wanted toknow if anyone else had observed the same display.  i suggested that we reportour sighting, and my son agreed wholeheartedly.  rather that call it in to ourpolice dept, i felt that mufon could make the best use of our observation.Id really like to know if others observed the same display.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2129,"landingOccurred":false,"latitude":40.8245442,"location":null,"logNumber":"","longitude":-74.2845925,"occurred":1044745500000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1044745500000,"summary":"Observed dance of lights in ne sky 3pm est  nyc ar","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Essex Fells, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2873"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Atlanta","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were driving down interstate i-20e towards atlanta,ga early night. about anhr. from atlanta. we noticed a bright star high in the nighttime sky. itgradually grew brighter and brighter and appeared to pulsate. it seemed tomesmerize both of us. the atmosphere in the car silenced and we watched in aweas it pulsated into a multicolor lighted trianglediamond shape object, shootingfrom one point in the sky to the other, right angles , zig zag type formationextremely fast, faster than anything ive known of to have an earthly quality.Before i saw the craft the sun was setting and the car was quiet except for theradio. i thought i heard the driver say, follow the sun, i was wide awake andasked him. he said he had said nothing for an hour.I have a memory lapse of what happened from that point until i spotted theunusual lights.After the craft zig zagged for a few seconds, it pulsated back into a star,remained stationary and the light pulsated into darkness.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":2128,"landingOccurred":false,"latitude":33.7565254,"location":null,"logNumber":"","longitude":-84.3819324,"occurred":912412800000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":912412800000,"summary":"Saw multicolored lights appear in the sky","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Atlanta, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2874"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dallas","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was walking out of the cinemark 17 movie theater webb chapel and forest andfirst noticed three lights flowing overhead at high altitude.  i thought it wasa jet and ignored it.  when i got into my firends car, we began to pull out ofthe parking lot, i looked up and saw what appeared to be the same three lightsover the same path it had originally been over - but it was at a lower altitudeand flying in the opposite direction.  as it came past our car i got a closerlook at the object.  it appeared triangular and was a bit offset.  then, as itpassed by, it appeared to turn on its side and fly between two nearby buildings. as the car turned on forest i tried to see if the object had come out on theother side - there was no sign of it.","distance":"101-500 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2127,"landingOccurred":false,"latitude":32.810065,"location":null,"logNumber":"","longitude":-96.761343,"occurred":1044674040000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1044674040000,"summary":"Triangular object over cinemark 17","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Dallas, Texas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2875"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"West Chester","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were driving back from my wifes parents house abot 930 at night on eithersnyder rd or butler warren road in december of 2002 in butler county ohio aroundwest chester or cincinnati. she was following me with the kids in her car butdid not see this. i am still amazed she did not see it. out of my driversidewindow while i was headed north off to the nw i saw what i thought at first wasa huge meteorite or shooting star but it had the appearance of sparks flying offof it and it itself was a huge ball of sparks it was traveling toward the earthwhen it look like it exploded quickly but there was no noise. it then reappearedand headed back upward again like a shooting star but headed up it was the samecolor as a spark that metal leaves on the ground at night or a firework with nocolor just burnt orange spark color. at about the time that it re-apearedanother of the same objects came from across the sky straight toward it. theybegan to circle each other like they were chasing and playing in circles andother directions at a high rate of speed i am sure but at that distance it wassimilar to watching two dogs chasing each other. then they seemed either to haveburnt out or just disapeared. they left a spark trail but it was always shortwhat is strange is that the tail of what seemed like a commet originally wasshorter and fatter than what you would expect. they were like a fireball withsparks shooting or dripping off.It seemed like it was molten but yet crisper iwas confused after i saw it when we stopped at the gas station i asked my wifeif she had saw it and she said no. she was wondering why i slowed down and waspulling off the side of the road. i saw something abnormal i am just not surewhat it was.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2126,"landingOccurred":false,"latitude":39.3461916,"location":null,"logNumber":"","longitude":-84.4092383,"occurred":1007141400000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1007141400000,"summary":"Not meteorite had inteligent flight pattern","tags":["fireball"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"West Chester, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2876"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Wimauma","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My husband and i were driving on a country road, sr 674, on our way to naples,atabout 600 am . it was still dark , and clear. we were looking straight ahead,then to my husbands left he saw an object about the size of a full moon,limegreen in color and slowly descending into the woods. he was shocked and saidlook at that, what is that  i turned and looked also seeingit. the object was slowly descending into the woods and it glowed lime green,and resembled the moon in size and shape. by the time we saw it, it wasapproximately a few hundred feet above the tree tops. it descended and went downinto the woods. we were in shock, we watched it until it was out of our sight,it just descended into the woods.The event we witnessed lasted only forapproximately 30 seconds.We continued driving, never stopping, and did not turnthe car around to investigate, as we were in awe of the object and were in alocation all alone of a very dark country road. the object was very vived and inplain view, obstructed by nothing, until it went down into the woods. the woodswere dense, we did not see a glow or anything from the road, once the objectdecended into the woods. we would like to know if anything of this kind has beenseen by others...It was something we have no explanation for. it simple lookedlike a lime green irredescent full moon descending from the sky into thewoods....... any reply would be appreciated. it frightens me that we have noidea what it was.   thanks....Kay dease","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2125,"landingOccurred":false,"latitude":27.7124462,"location":null,"logNumber":"","longitude":-82.2989402,"occurred":1044021600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1044021600000,"summary":"Large lime green irredescent ball of light","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Wimauma, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2877"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Santa Maria","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"April 14th,i went outside my residence that evening to see if i would be able tosee the planetary allignment that night, i happened to look west about 40degrees above the horizon and noticed a very bright and large orange light inthe western sky. i was not sure if it was moving towards me or was a stationaryobject atb first , then i realized that it was coming rather straight on. slowlyand steady it came until it flew direcly overhead ,it had come out of the west,and as it passed it arched to a southerly direction towards los angeles,i wouldquestimate. additionally and actually there were two objects, both were thesame, they were both the same color as an orange marker light that you would seeon a semi tractor trailor truck... it was as if the were in tandem , very highup in space traveling probally 25 thousand miles per hour ,,,no sound ,no changein color, i feel we are not alone in this universe. thats what i had seen,,,, psthat night itb was reported that ther had been an earthquake in mexico... thatsit","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2124,"landingOccurred":false,"latitude":34.9605237,"location":null,"logNumber":"","longitude":-120.4266891,"occurred":1018842300000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1018842300000,"summary":"Sighting april 14th, 2002, santa maria ca, 93458","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Santa Maria, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2878"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Newark","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was at marching band practice with everyone else.We turned around on the fieldfrom marching.I saw a big disc silver shape in the sky it made no nose it waspretty low and big.It just stayed there.I couldnt watch it for like two or threeminutes because my director called sett you have to stand absoutly still,noteven moving your eyes.Got my water and looked back at the same place where i sawit and it was gone.My boyfriend found it weird but believed me.That wasbasically it.","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":2123,"landingOccurred":false,"latitude":40.0581205,"location":null,"logNumber":"","longitude":-82.4012642,"occurred":1028098800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1028098800000,"summary":"I looked up in the sky and there was a big shiny o","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Newark, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2879"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bainbridge","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"As i was driving east on highway 422, enroute to a conference with a mufonrepresentative, approximately two miles from the rt. 306 exit, a grey elipticalobject traveled across the freeway in front of me, moving north to south.  ionly ovserved it for a second or two, when it was directly in front of me andout about a quarter mile.  it moved in a straight line about 200 feet off theground, dissapearing behind a wooded hill in the fog.  upon reaching the spotwhere i had seen it dissapear, the area was a small wooded valley, but nothingcould be seen to the south except fog shrouded trees.  the object wassilhouetted against a distant hill as it moved south through the mist.  nosounds or other effects were noticed.  it was reported to the mufon personell ilater talked to should there be another sighting that could be colaborated.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2122,"landingOccurred":false,"latitude":41.393381,"location":null,"logNumber":"","longitude":-81.337162,"occurred":1044132300000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1044132300000,"summary":"Brief sighting during foggy weather of a gray disc","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bainbridge, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2880"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marietta","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving around 1000 pm on providence road near the intersection of roswellroad and johnsons ferry road in east cobb county georgia. im not sure of thedate. i can only remember that is was in the spring of 1985.I dont remember how it cought my attention but i saw a large star above thetrees. although it was only a star-like light, i could tell that it was near theearth. after about 10 seconds, it moved quickly for a few inches in the sky thenmade an acute turnb130 degrees without stopping. it went made about 3 of these sharp turns andthen shot like a rocket out of the sky.I never felt any real emotions other than surprise. i never called or told manypeople about it. i assumed that the local dobbins air force base would not havetold me anything and that most people would think i was crazy.Quite frankly, i dont really believe in e.T.S. my only real hope in sending thisis that you will let me know that others saw the same thing.Thanks.  ","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2121,"landingOccurred":false,"latitude":33.961762,"location":null,"logNumber":"","longitude":-84.5419327,"occurred":470649600000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":470649600000,"summary":"Starlight makes quick moves and acutes angled turn","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Marietta, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2881"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was walking my dogs at the usual time 500p.M, and as always, i wasphotographing the sunset.I looked up and at about 1100 oclock, in the s.E. direction, and saw whatappeared to me to be a u.F.O.,.It was easier to see with the naked eye than the 2.8 megapixel digital camerashows.It appeared tp me to be an object, shaped like a teardrop or a seed with alittle bit fatter end then ending in a point on the other end.What amazed me were the flight manovers. it would float foreward,backward, turna circle in the skyi have quite a few pictures that i took with the digital camera. i did set thecamera to the highest resolution, as maybe a phot lab somewhere, can get abetter resolution.What i see on the cameras pics are what i saw in the sky, with the exceptionthat my eye took a better picture.Let me know if you would like to see them","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Unknown","formattedAddress":null,"id":2120,"landingOccurred":false,"latitude":32.2296029,"location":null,"logNumber":"","longitude":-110.919139,"occurred":1044259200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1044259200000,"summary":"Tucson az area photos on 020303","tags":["photo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2882"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Id rather not talk about it now.  you may contact me later.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary,Other","formattedAddress":null,"id":2119,"landingOccurred":false,"latitude":43.8085734,"location":null,"logNumber":"","longitude":-120.5468412,"occurred":1044141480000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1044141480000,"summary":"Ufo in oregon willamette national forest","tags":["contact"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2883"}],"last":false,"totalElements":82762,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2689}
