{"content":[{"address":null,"addressResolution":null,"altitude":"Landed","city":"Falls of Rough","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was in my hottub on april 18 2014  was around 9 pm  looked to my left and saw this large red disc of light...Looked away and then turned back  tryed that again  both times it was there about 30 feet from me  blocked the two trees that was there... got out of the tub to go get my husband to see it and when i looked again it was gone.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":57280,"landingOccurred":false,"latitude":37.5880335,"location":null,"logNumber":"US-06222014-0026","longitude":-86.5444095,"occurred":1397804400000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403490732000,"summary":"Looked to my left and saw this red disk that was as tall as the trees...  watched it for a while  looked away and back  was there  second time it was gone.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"40119","daysBetweenOccurrenceAndSubmission":65,"locationName":"Falls of Rough, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147643"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hutchinson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I saw a saucer descend and hover right by our house over the pasture. i was laying in bed looking out the window, and i saw a descending  bright streak of light. i got on my knees to look out the window from my second story bedroom. i saw a saucer shaped object just coming to a stop and hover. it was completely surrounded and covered with energy or electricity. it appeared to be cooling, and dripping electricity or plasma or something very damn odd..It reminded me of the light that an electric metal welder\r\nwould produce. it was extremely bright and difficult to look at..It did have a saucer shape, but completely encapsulated and surrounded in energy..I heard nothing cause it was cold and the window was closed..It hovered for maybe 20 seconds. it then started to head west. it took off slowly, but quickly accelerated to at least 100mph. it was going faster than that when it descended..It came to a very fast stop. there is absolutely no way this was made by anybody on this planet!! it scared me so bad i slept with my window covered for years. i get goose bumps instantly when talking about it. it was on the radio a couple hours later(7:00am), when i was getting ready for school. the local radio station reported that the sheriff's office had 25(or so)reports of an ufo around 5:30. i had told my parents..I ran into their room freaking out, and had woke them up. when it was on the radio i went hysterical with them...They had been mad at me and dismissed me a couple hours earlier..I also saw something 2 more times in the next several years. i was able to show my mother one sighting. i never reported anything. i went to school with the present sheriff's wife, and have thought of asking him about it..They must have a record..At least 25 other people saw it and reported it. im sure some are dead by now.But the ones alive will surely remember it if they reported it to the sheriff. we are honest agriculture based people here, and if 25 people reported, i am not crazy..Lol :-) i believe there was alot of activity here from the mid 80's to the mid 90's..I have another very interesting story from around 1991..I know what i saw. it is etched into my mind..I know we are not alone as they say..This has affected me so much, i am glad to hopefully tell somebody that is actively trying to tell the truth.. i am not pitching for a job here, but if you need any help in my area of the country, this has been bothering me for years..And i would jump at the chance to hear other peoples accounts of such happenings..I know what i saw, and i know they exhist because of what i have seen. it tears at my christian upbringing constantly..I know some time has passed..But it did happen, and it evenade the local radio within 2 hours..There must be some paperwork on this even after these elapsed years..\r\nthank you,\r\n\r\n\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":57279,"landingOccurred":false,"latitude":44.92711073194269,"location":null,"logNumber":"US-06222014-0025","longitude":-94.2412352837134,"occurred":504883380000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1403490629000,"summary":"25 people reported this to the sheriffs office, i heard on the radio a couple hours later, after i saw it!","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"55350","daysBetweenOccurrenceAndSubmission":10400,"locationName":"Hutchinson, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147644"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Beltsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I posted my sighting on my facebook page in order to record the event without risk of loss.  i have unfortunate luck with tech gear.  good thing i did, as it turns out - both phone and computer died since. ** \"on february 13, 2013, i was traveling from beltsville to silver spring to the grocery store. at various stop lights along the way i noticed cloud formations off to the left-front. weird cloud formations. since my camera on my phone died, i didn't get photos, but when i got home i drew them so i wouldn't forget orientation, etc. when i researched angles, i found the right angle with corner in upper left relates to \"west\" in navigation. straight vertical line usually means \"one\". i took the two unequal/uneven diagonal line to then mean \"two\". my destination, silver spring, is exactly 12 minutes west of beltsville using longitude/latitude. freaky!\"  i first noticed the object due to the square shape of the cloud \"window\" ... clouds don't come in squares.  when the 270 degree angle appeared in this cloud \"window\" in a darker shade of cloud, i was intrigued.  then what i took to be a number 1 appeared within the angle, faded, then the two diagonal lines i took to mean 2 appeared withing the angle, then the whole \"window\" faded.  i was bemused, continued to the grocery store, parked, and drew what i had seen so as to be able to research angles and glyphs to see if my interpretations were actually correct.  when i got home, i redrew with my computer what i had seen, with cloud color and shading and lines and directions.  these are the attached pictures.  i haven't been able to locate any glyphics which match these.  do any of you know of any which match?  not at all frightened, just really intrigued.  have you any other cloud-cloaked vehicle reports?","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":57278,"landingOccurred":false,"latitude":39.0512062,"location":null,"logNumber":"US-06222014-0024","longitude":-76.9367348,"occurred":1360742400000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1403489568000,"summary":"Communicated with cloud \"glyphs\"","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57278_submitter_file1__062813cloudglyph1.jpg","http://www.mufoncms.com/files_jeud8334j/57278_submitter_file2__062813cloudglyph2.jpg"],"weather":null,"zipcode":"20705","daysBetweenOccurrenceAndSubmission":494,"locationName":"Beltsville, Maryland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147645"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Oshawa","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at my summer job on my break.  i was sitting in an open window having lunch (it was summer and very hot and there was no air con in the factory).  my fellow workers were in the lunch room on another floor.  i would say it was around 3 a.M.  i noticed the object because it was so huge it would have been impossible to miss as it literally blocked out the sky it seemed! i observed the underside of the object as it was almost directly above at first but then it 'drifted' slowly off to the east. i could not make out the top of the object at all, and, to be honest, i was so shocked that i didn't remember to look at the side of it as it moved off.  i thought the right away that this might be something not of this earth due to the size and the fact that it was completely silent! it moved on a smooth, even path eastward. i observed numerous windows or portholes on the underside of the object which were white and other lights around the underside which were red and green.  there didn't seem to be any pattern to the white lights and i can't remember if i noticed if there was with the green and red lights.  the white lights were the ones that seemed to stand out to me. the body of the craft was a solid, non shiny grey, without any other features that stood out to me.  i was shocked, surprised, and, to tell the truth, completely unnerved by this sighting. i can remember hoping it didn't ever come back and was still quite shaken for days.  it's been 40 years and i still remember this event with wonder and with more than a few questions.  i can't say it was extraterrestrial in nature but if it wasn't there had to be some technology out there that would seem to me to have been far, far more advanced than anything l have seen or heard about even today some 40 years later!\r\ni didn't tell anyone about this until i met my husband and knew he was someone with an open mind as i didn't want people to think i was crazy.  i am reporting it now as i am older and really don't care what people think! ","distance":"101-500 Feet, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":57276,"landingOccurred":false,"latitude":43.917794845095116,"location":null,"logNumber":"CA-06222014-0022","longitude":-78.86272096424753,"occurred":141807600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1403489365000,"summary":"Circular, dull greyish body, multiple 'windows', red, white, green stready lights, slow smooth path, huge in size, totally silent.","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":14602,"locationName":"Oshawa, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147646"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Waupaca","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving to waupaca wi and was a little lost when i observed a fireball in the night sky. it came through the clouds. i thought it was an burning airplane falling from the sky until it turned and headed my way leaving a trail of red smoke in the dark black nite sky. i woke up my wife who was sleeping in the passenger seat. the object traveled about 3 miles to my location and turned into a metallic cylinder with fire emitting from holes along the side. it was completely silent and i saw beings in the windows. i pulled over on the shoulder of the road and turned off my engine. i looked at it and prayed. i did not reach for my weapon or my camera because i did not want to put my family at risk. this ordeal lasted for about 15 minutes.  as i began to wake up my son who was sleeping in the back seat the object turned into a bright white straight line pointing in a downward direction. i then notice a pulsating white light on the ground from across the road. i think it landed and i got nervous and started my car and drove away. i told my friends who we were visiting and i called the sheriff department who told me they had no ufo reports for that night. i am a former police officer and have practiced law for 30 years. i have told few people about my encounter but have had unusual dreams over the years. i made a promise to the ufo at that time that i would not go public with what i saw if they would protect me from evil and bless us with success. before we left waupaca wi we went back to the area and discovered that the object descended into a stream.  ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s),  Other","flightPath":"Path then hovering","formattedAddress":null,"id":57275,"landingOccurred":false,"latitude":44.3677748,"location":null,"logNumber":"US-06222014-0021","longitude":-89.0798864,"occurred":1000969200000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1403489280000,"summary":"Fireball with trail of red smoke to metallic cylinder with windows to straight line then gone","tags":["fireball"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":4658,"locationName":"Waupaca, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147647"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"March 16, 2014 i was watching tv in my living room when my daughter came home from working late in monterey ca at 1:50am and came in and told me come look at this so i went out front of my house and noticed a large stadium sized craft aluminating a orange red light and steam coming out of it moving at a speed like a helicopter.We followed it to williams rd and old stage rd in salinas ca around 2am.We parked and saw it either land or hover.When we stopped and watched it it began to as i call it dance changing colors from white to red moving all around rapidly like nothing i've ever seen before in my life.Very quickly it moved side to side down up to the side again then back to its position of landing.It would seem to change colors from white to red as it tried to take off.I think it was having problems taking off, admitting steam from top of object in 3 seperate areas.My feelings toward this is so surreal i know it was something not from earth.It made no noise as i watched till 7am in my truck parked on the side of road.I never saw it take off but what i did see is a steam trail coming off the ground till 3pm the following day.People i showed my videos can't explain it so this is why i'm so astonished by this i would like an explanation about what i saw.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":57274,"landingOccurred":false,"latitude":36.782861,"location":null,"logNumber":"US-06222014-0020","longitude":-119.4126624,"occurred":1394960520000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1403486459000,"summary":"As i can tell object was in trouble and i think it landed on a near by hill below fremonts peak ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57274_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/57274_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/57274_submitter_file3__image.jpg","http://www.mufoncms.com/files_jeud8334j/57274_submitter_file4__trim.D186C39F92484FEB9F83A6E730A1B86C.MOV","http://www.mufoncms.com/files_jeud8334j/57274_submitter_file5__trim.F8105341897B49D9A3ADC5FC3A04F632.MOV"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":98,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147648"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Edgware","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Myself and two other mates were sat on the terrace looking at the sky and the stars. it is not usual to see clear sky and stars in london! suddenly we saw a star like object moving fast in the sky (not aeroplane) exactly like a star moving from one direction to the other (diagonally) we all kept observing it and after about 1 and a half minutes it was naturally out of our sight. it did emit any trails. it wasn't a meteor/shooting star either. it was just strange in regards to the speed and duration. as it is we were surprised and shocked as none of us had any answers. next thing we see is exactly the same thing happening from a different direction?! we just could not believe this and ended up researching online about it and that's how i reached here and thought of posting this! i couldnt find any answers online or other people reporting it. hoping someone else has seen this!\r\nthank you","distance":"Over 1 Mile, Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":57273,"landingOccurred":false,"latitude":51.5925754,"location":null,"logNumber":"GB-06222014-0019","longitude":-0.2573695,"occurred":1403419500000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1403486073000,"summary":"A star like fast moving object in the sky not aeroplane exactly like a star ","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"NW9 5WD","daysBetweenOccurrenceAndSubmission":0,"locationName":"Edgware","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147649"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sint-Niklaas","country":"Belgium","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on my deck, escaping football. i am well aware of stephen greer and charles hall etc. and have been looking out for anything confirming for months.  ok, so my boyfriend finished the football and came outside, looked up and pointed out two reflective/glowing orbs going from nw to se. forgive me if the directions are off...But lets say, from the sint gillis area, toward brussels.  this was just after belgium won 1- 0 in soccer against russia, and lots of positive energy being heard with car horns and people yelling.  noteworthy is that that these two orbs were travelling in synch, but the right one (more east) went more upward, and went toward the brussels stadium.  they couldn't be seen anymore after about 10 mins.  but then, from the east side i saw a red orb, tiny and very high, traveling toward the west.\r\n\r\nall the while, we saw planes flying, most with trails, not all. but i could see the wings  on all of them.  whatever the orbs were, they were closer.  they were flying in unison, and that doesn't seem like a  flight plan.  they had no trail.  we both agreed that wow... this is it, they are there, they are something else, and they are sharing some positive energy.   the amount of positive energy on the ground was immense with the football stuff (not my thing).\r\n\r\nthe red one afterwards, my boyfriend could  not see. but i do have perfect vision. i tracked it for a while before it went into a cloud.  all this, just 30 minutes ago.\r\n\r\ni did not even dare to try my iphone to photograph. i can't even take a decent photo of the moon. rather, we were both enjoying the absolute reward of seeing them.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":57271,"landingOccurred":false,"latitude":51.1558839,"location":null,"logNumber":"BE-06222014-0017","longitude":4.154441,"occurred":1403492400000,"potentialRelations":[],"rating":"Unrated","region":"Flanders","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1403475023000,"summary":"Besides the planes, with trails and visible wings, 2 orbs flew in tandem toward brussels ","tags":["none"],"timeZone":"Europe/Brussels","timeZoneName":"Europe/Brussels","tweeted":0,"urls":null,"weather":null,"zipcode":"9100","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sint-Niklaas, Flanders","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147650"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Key West","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was out walking my dog @ 7:15am. it was a nice, quiet morning and i looked in the sky and saw the moon @ 75-80 degrees off the horizon. just below it was a very bright orb that i assumed was a star or planet. i opened my google sky app and pointed it toward the moon. it identified the moon and showed that uranus was in the same area, but not in the same location as the object. as i kept looking at the object, i noticed it gradually moving northward. there were no emissions or sound. the object was extremely high in the sky but definitely had the shape of an orb. i took 1 photo from my phone's camera and went home to grab my digital camera. over the next 45 minutes or so i took a couple dozen more photos as i laid on the ground in our back yard. it didn't feel like a \"typical\", disc shaped ufo sighting, but i don't know how else to describe it. it didn't look like a plane, so i could not identify what it was. the only reason i lost sight of the object was because i was in the back yard and it went out of my plane of sight. i also had a class to get to. there were no quick movements to the object. it just gradually moved across the sky.\r\n\r\nit looks like i'm only able to upload the 1 photo i have on my phone at this time. hopefully i can attach more photos when i download them from my digital camera. it stinks that the pic i took on my phone wasn't super detailed.\r\n\r\n","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":57270,"landingOccurred":false,"latitude":24.5570806,"location":null,"logNumber":"US-06222014-0016","longitude":-81.7985157,"occurred":1403359920000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1403474634000,"summary":"Glowing orb high in the sky near moon @ 7:17am","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57270_submitter_file1__20140621071215.jpg"],"weather":null,"zipcode":"33040","daysBetweenOccurrenceAndSubmission":1,"locationName":"Key West, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147651"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Negril","country":"Jamaica","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The night the picture was taken was absolutely clear and we were 1 night away from a complete full moon. the moon itself would be at the 1 oclock position to the direction the picture was taken. (almost straight above but to the right)\r\ni planned on a shot of the courtyard and night sky at \"home sweet home resort\" in negril from my balcony. camera was motionless resting on a balcony railing pointing south (inland). panasonic \"lumix\" (i believe)digital camera set on \"stars\" setting, 30 sec exposure. \r\n\r\nthe \"object\" appears high above the horizon to the right of the resorts' wifi attenna (red light). i did not see the object with the naked eye. i was witness to the stars that were captured and everything else in the shot. only afterwards , maybe 40 mins after i took the pic, when scanning it to see how clear the stars came out... i was suddenly looking at an object that while not bright enough to be seen by my eyes, was captured by a long exposure, appearing to be lit only by the moon and the reflection off the \"object\". i looked back out into the sky and could see nothing. i set the camera back up duplicating the shot and nothing appeared that was out of the ordinary. i tried duplicating over the next 2 nights with same almost full moon, same time, same direction, same settings. the object or annomoly was in no other pics. the stars appear as small vertical streaks. the object does not appear to moving with earths rotation. it seems motionless and would have to be to be captured strictly by whatever faint reflection is was giving off. \r\ni took over 300 pictures during the vacation. no other \"annomoly\" showed up in any shot. digital or otherwise. daytime or nighttime. i am a regular visitor for over 25 years and this is the first time i have ever captured anything unexplained.\r\n\r\ni along with many friends have spent hours looking at the picture. my friend with canadian national defense ran the shot thru various filters. each time the \"object\" appears to be something solid, motionless. an embossing setting clearly shows it as a 3 dimensional object. he convinced me it was worth forwarding for further study.\r\n\r\ni'm sending the original and the various filtered images with the hope it can be explained... or at least added to the ever growing proof that something or \"some things\" are in fact up there.\r\n\r\nsincerely, and happy to answer questions about it.\r\ndk","distance":"Unknown, N/A","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":57269,"landingOccurred":false,"latitude":18.2683058,"location":null,"logNumber":"JM-06222014-0015","longitude":-78.3472424,"occurred":1399963200000,"potentialRelations":[],"rating":"Unrated","region":"Westmoreland Parish","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1403469870000,"summary":"Diamond or cone shaped object motionless night sky lit only by full moon","tags":["none"],"timeZone":"America/Jamaica","timeZoneName":"America/Jamaica","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57269_submitter_file1__ETphonehomesweethomemay122014withcircle.jpg","http://www.mufoncms.com/files_jeud8334j/57269_submitter_file2__etnegative.jpg","http://www.mufoncms.com/files_jeud8334j/57269_submitter_file3__etnegative.jpg","http://www.mufoncms.com/files_jeud8334j/57269_submitter_file4__10359169101520725991521754891680371585771719n.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":40,"locationName":"Negril, Westmoreland Parish","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147652"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Ocean Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This was from a post i put on my facebook page 6/22/2014:\r\n\r\nputting on my \"foil hat\" for a minute.........A few months ago i was reminiscing looking at hurricane katrina pics i took on east beach, the day after katrina. only living maybe 1/2 mile from there, the only way to get there other than walking, was on my motorcycle. while looking at those pics, i began to remember what i thought was one of the most eerie things about the aftermath of the storm........The absolute dead silence! it was truly deafening! no birds singing, because they were gone!!! no insects, mainly the constant sound of the cicadas we were so used to hearing at that time of year, they too were gone. about the only sound of life that day, was the sound of a generator running, but not at east beach, because there was nothing left......Fine, beautiful homes had vanished. i mean even the bricks were gone, the same scene over and over as i snapped pictures was concrete steps leading to a foundation. talking to other people, the overwhelming feeling we shared was that time had stopped the day after katrina. the day before seemed like ancient history........Memories of activities that previous day, seemed like years ago, instead of a day.\r\n\r\nas i was looking through those pictures though, something caught my eye.......I stared at it for a bit, then looked at the negative......It was there too! i was like, \"wtf is that?\" was it a bird, a plane, or superman? lol. well, at that time there was nothing in the air.......It was like an atomic bomb had hit the coast, the only thing that eventually appeared in the sky were helicopters, so many that we declared the helicopter as the state bird, lol. i admit i'm pretty open minded, but still skeptical about ufos, but have a look at this photo and inside the red box. it's not a glitch or dust on the lens, it is an object in the sky......But what? ","distance":"Unknown","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":57268,"landingOccurred":false,"latitude":30.3556275,"location":null,"logNumber":"US-06222014-0014","longitude":-88.6958051,"occurred":1125350100000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1403465225000,"summary":"Cigar shape caught on film","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57268_submitter_file1__ufoKatrina2005002a.jpg","http://www.mufoncms.com/files_jeud8334j/57268_submitter_file2__ufoKatrina2005002.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":3218,"locationName":"Ocean Springs, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147653"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Coral Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was new years night jan 1 i walked out side to take out trash\r\nto the dumpster at my apartment when i observed the objects just \r\nsiting there and 3 more came up under the others","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Other","formattedAddress":null,"id":57267,"landingOccurred":false,"latitude":26.254706126133172,"location":null,"logNumber":"US-06222014-0013","longitude":-80.27443337287396,"occurred":1293868800000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1403461116000,"summary":"3 objects hovering 1 at left moved to center disc then moved back after several minuets 3 more dics came under the first 3 slowly they all moved further away to the west.","tags":["disc","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"33065","daysBetweenOccurrenceAndSubmission":1268,"locationName":"Coral Springs, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147654"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Broadview Heights","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my deck listening to the indians vs tigers baseball game on saturday june 21, 2014. about 10 pm i just happened to look to the east from my air chair when i noticed a single pulsating orange light in the sky. when i first noticed it the light look almost like a flare but there was no wind last night and this light was moving at an angle towards me. i pulled out my cell phone and started to tape the light. it was moving slowly and silently from the ne to sw. when it got to where i was looking to the se the object moved at the same speed ascending straight up until it\r\ndisappeared into some high clouds. about 5 minutes later 2 similar objects appeared from the same ne direction traveling sw and seemed like it followed the same path upwards to the clouds. caught the 2 on video also. about 5-10 minutes later as i was watching the videos i had had just made, i looked up after a video ended and there were 2 more lights in the sky. videoed those 2 also but some of that video is out of focus because of i had to quickly start a 3rd taping. got a third video now, i'm not sure now how much longer it was before more lights showed up in the sky because i was pretty much astonished at what i was watching but they did. got a video #4 now of about 4 minutes long. first coming from the same direction ne as the others comes 1 orange light. shortly afterwards followed by 1 more light, then 2 more followed by 1 more, all captured on video. at one point in video #4 i turned my phone vertically and had 2 lights on top of screen and 1 on the bottom that had just enter my view from the ne. halfway thru the video my wife comes home from a high school reunion and when i see our bathroom light turn on i scream for her to come out at look at the ufo's in the sky and she witnesses these lights. shortly afterwards another single pulsating orange light came out of the ne followed by another. got these both on a video #5. after downloading the videos on my computer on #1 and #5 the video shows the objects flashing or pulsing may different colors. red, yellow, blue, violet & green. videos #2 #3 & #4 all have the lights as white and to the naked eye the lights in the sky looked orange to me and my wife the whole time. i'm attaching one video but will share them all with you at a later date. some files are about 20mb. i had my wife grab my cannon eos ti1 with 200 mm lens but the lights or objects never appeared again.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":57266,"landingOccurred":false,"latitude":41.317527758409,"location":null,"logNumber":"US-06222014-0012","longitude":-81.69060958216187,"occurred":1403413200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403458489000,"summary":"Observed 12-15 orange lights over about 1 hour moving ne to se on 5 videos","tags":["video","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57266_submitter_file1__UFO5.mp4"],"weather":null,"zipcode":"44147","daysBetweenOccurrenceAndSubmission":0,"locationName":"Broadview Heights, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147655"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Brampton","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was having a cigarette in my window when i noticed the bright light. at first i thought it was an airplane because i could here a plane but the object was way to high to make the sound i was hearing.  after locating the airplane that was making the sound i rushed to get my phone to film this object.  by this time it had traveled to the front of my place which fasts south. the event took no more than 2 minutes.  i filmed it as long as i could but as i rushed outside my lovely dog followed me. i had to go get him therfore i couldn't get more then i did.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":57265,"landingOccurred":false,"latitude":43.6916433,"location":null,"logNumber":"CA-06222014-0011","longitude":-79.7570067,"occurred":1403411400000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1403454544000,"summary":"It was an orb like shape traveling much faster then am airplane.  i live near pearson airport in toronto so i'm used to seeing planes at various altitudes.  this wasn't an airplane or a satellite. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57265_submitter_file1__20140621214627.mp4"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Brampton, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147656"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sidney","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" went out to meet wife returning from her job noticed 1 light.I stopped and referenced object between power lines,it was totally stationary.Went inside to get binoculars came out object gone.Approximately 15 min later noticed a second light approach from nw then a third light then a fourth.They were not in a formation .They seemed to turn west at the same point and the lights grew dim and went out.% minutes later noticed similar light far south,estimating over dayton.It appearead to head toward me,north direction then it also went west and dimmed out.My son looked at one of first objects through binoculars and said it appeared to have wings and a front like a plane.No visible aircraft beacon lights ,stayed venus color.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":57264,"landingOccurred":false,"latitude":40.28777080249129,"location":null,"logNumber":"US-06222014-0010","longitude":-84.18626317659997,"occurred":1403413200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1403452255000,"summary":"Like venus sighted 1 then 4 then 1 to south estimate over dayton. lights out when west direction.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"45365","daysBetweenOccurrenceAndSubmission":0,"locationName":"Sidney, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:147657"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Izmir","country":"Turkey","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  \r\n22/6/2014 / approx time:1.00a.M\r\n\r\nyesterday midnight we witnessed two very bright stationary object in the sky through the live camera views of izmir municipality which are taken from the region called ��ahin tepesi of izmir in turkey . after both remained there in the same place for a long time but then the other vanished moving towards the west while the other one still keeps it's place there\r\n\r\nas there is no airplane or something like that and the weather clear no any official explanation from the authorized has just arrived so far or even public side \r\n\r\nhoping someday truth will surface in this regard\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":57263,"landingOccurred":false,"latitude":38.42385,"location":null,"logNumber":"TR-06222014-0009","longitude":27.1353,"occurred":1403420400000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1403449257000,"summary":"Both objects remainsfor a long time in the sky then the other dissapears moving towards the west","tags":["none"],"timeZone":"Europe/Istanbul","timeZoneName":"Europe/Istanbul","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57263_submitter_file1__Sunu1.jpg","http://www.mufoncms.com/files_jeud8334j/57263_submitter_file2__Sunu69.jpg","http://www.mufoncms.com/files_jeud8334j/57263_submitter_file3__Sunu67.jpg","http://www.mufoncms.com/files_jeud8334j/57263_submitter_file4__Sunu6.jpg","http://www.mufoncms.com/files_jeud8334j/57263_submitter_file5__Sunu610.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Izmir","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147658"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marion","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband & i were having a late dinner grilling out, when we noticed 3 bright red lights over the school building across the street to the east of our home traveling north at a high rate of speed. we ruled out them being aircraft, because they had no blinking green or red lights. we ran to the street to take a picture with my cellphone. i got 3 pictures before they were unable to view behind the taller section of the school building.  we then walked down the street to the north to look for them.  at that point, we could only see one and cars were coming, so we had to get out of the street.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Other","formattedAddress":null,"id":57262,"landingOccurred":false,"latitude":37.755988752990014,"location":null,"logNumber":"US-06222014-0008","longitude":-88.90515874908125,"occurred":1403334000000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1403438721000,"summary":"My husband first spotted the 3 reddish lights appear over the school across the street from our house.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57262_submitter_file1__IMG0171.JPG","http://www.mufoncms.com/files_jeud8334j/57262_submitter_file2__IMG0172.JPG","http://www.mufoncms.com/files_jeud8334j/57262_submitter_file3__IMG0174.JPG"],"weather":null,"zipcode":"62959","daysBetweenOccurrenceAndSubmission":1,"locationName":"Marion, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147659"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Santa Monica","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I took the attached hdr photo with an iphone on january 8th, 2012, at 5:08:56 pm pst (this is recorded in the metadata on the original image, which is still on my iphone).\r\n\r\ni had never looked at the image on a large screen until recently, when i added the photo to the screensaver for my apple tv. when viewing the image on a 60\" led tv, i noticed a strange, geometric shape in the sky. the shape's angular appearance caught my attention, as i'm not aware of this type of structure naturally appearing in cloud formations. there also appears to be some displacement of the clouds around the object, suggesting a solid mass is disturbing them.\r\n\r\nthere may be an explanation of which i'm not aware, but i thought perhaps you might find the photo of interest. i'm attaching a copy of the photo at its original size, and a cropped copy highlighting the area of interest.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":57261,"landingOccurred":false,"latitude":34.023018,"location":null,"logNumber":"US-06222014-0007","longitude":-118.5094786,"occurred":1326071280000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1403432599000,"summary":"I took a photo two years ago, and have only recently noticed a strange shape in the sky.","tags":["photo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57261_submitter_file1__SunsetStrangeShape.jpg"],"weather":null,"zipcode":"90401","daysBetweenOccurrenceAndSubmission":895,"locationName":"Santa Monica, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147660"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lake Ozark","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am at a fire investigator conference at port arrowhead resort at lake ozark, mo and was just finished visiting with friends and headed back to my hotel room when i noticed a strange object in the sky. i stopped and got out of the car to get a better look at it. the object was moving in a straight-line path at approximately 80 degrees going east to west. it had 5 to 6 different sections on it and was a cylindrical shape. each section lit up with a different shades of orange light, and at one point all the lights went out, then came back on again. it moved quickly and soon was out of my field of vision behind trees. i observed it for approximately 15 seconds. the size was big - it would take a thumbnail to cover it up at arm's length. this is the first time i've ever seen a ufo in 57 years. it was so strange looking that i find it hard to believe that it was something man-made.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":57260,"landingOccurred":false,"latitude":38.189964005617476,"location":null,"logNumber":"US-06222014-0006","longitude":-92.63660300980818,"occurred":1403425740000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1403431504000,"summary":"Large cylinder with 5-6 sections lit up with different shades of orange","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"65049","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lake Ozark, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147661"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mesa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the evening of june 21, 2014 at 9:28pm, my wife and i were finishing up a dinner date with a couple friends of ours. we were casually walking them to their car when our guest stated how good he could see the stars outside. then he said, \"what's that!?\". my wife and i turned towards the north behind our house in the direction he was looking. we all were looking at a white-blue star-like orb that was moving relatively fast at a ultra high altitude in a south direction. my wife questioned,\"is that a plane?\". i said,\"it isn't flashing.\". the star-like orb never flashed, didn't have a tail, never accelerated or slowed. as the object moved directly over head, it began to fade then vanish from sight. all three of us all saw the object and watched it move from 45 degrees off horizon to 95-100 degrees off horizon over approximately 30 seconds.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":57258,"landingOccurred":false,"latitude":33.30013360527162,"location":null,"logNumber":"US-06222014-0005","longitude":-111.58996171293177,"occurred":1403411280000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1403425152000,"summary":"A star like orb moving south through night sky","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"85212","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mesa, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147662"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"North Manchester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in north manchester hiding out of town when i spotted it throught it was a flare a fire ball in the sky but it was not comeing down wards it was hiding south and staying at the same highs then it changed direction head stright east then southeast then south again i flowed it south for  out of town on 300 east then lost sight of it. then about a mile or two befor i got to hy 24 still on 300e i seen a light in my morror in the sky come up on me looked like the same thing as befor same speed and hight moveing south again i stoped and watched it until it vanshed in to the clouds.... the only the that i feeled was in my left side of my face  and left eye when i was flowing it started off with some pain then whent numm on me my face stay that way for over a 1/2 hour my eye is still begging me a litter.","distance":"Unknown","duration":"00:08:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":57257,"landingOccurred":false,"latitude":41.0104505,"location":null,"logNumber":"US-06222014-0004","longitude":-85.764677,"occurred":1403413560000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1403424071000,"summary":"First when i seen it i thourght it was a flare but thin it changed direction","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"North Manchester, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147663"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Sarnia","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At approximately 11:48pm on june 21st, 2014 i witnessed one ufo to the west in sarnia, ontario.\r\n \r\nthe ufo had an orb shape, and looked like a 'fireball'. the first one i witnessed was a bright red in colour. it moved on a vertical flight path, and descending out of view below the tree lines. then, with 5 minutes two large fireballs came from behind the trees. one was bright red, and the other was a dimmer yellow - orange. fading in between yellow and orange. the two objects were close together in the sky and moved almost simultaneously, from vertical flight paths, to slightly horizontal, but mostly hovered into place. then they both fell behind the tree line slowly and disappeared. they were larger sized orbs. i was completely in awe by this point, and though had full intention of taking a photo, i could not get a clear shot as they bobbed from behind and infront of the tree lines. i waited outside looking back in that direction for a full hour and observed nothing further except a commercial jet.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Hovering then path,Straight-line path,Other","formattedAddress":null,"id":57256,"landingOccurred":false,"latitude":42.94955308619017,"location":null,"logNumber":"CA-06222014-0003","longitude":-82.39592712461372,"occurred":1403419500000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1403423173000,"summary":"2 large glowing orbs of two colours which brigtened and dimmed. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"N7T 5Z6","daysBetweenOccurrenceAndSubmission":0,"locationName":"Sarnia, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147664"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minooka","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"From a patio in a suburban neighborhood, the primary witness observed a small, bright red light rising from the horizon in the wsw direction.  the direction corresponded approximately with that regularly observed for commercial airlines/cargo aircraft on approach to mdw or ord.  the light approached from wsw, heading ne at an apparent velocity at least 4-5 times the apparent velocity of a typical commercial aircraft seen on approach from that direction.  at first, the primary witness considered that the light was a low aircraft without standard landing or navigational illumination.  there seemed to be a faint hiss from the light as it approached.  as it reached between 30 and 45 degrees in elevation above the horizon, the light instantly decreased in apparent velocity and changed heading n.  the light then continued on at the reduced velocity until it reached a position to the nw of the observation position (still at similar angle of elevation) and appeared to hover.\r\nas the light began to hover, the witness observed two more identical lights in close formation with each other follow the same approach and pattern at similar velocity.  the faint hissing sound also seemed to emanate from these.  as the pair of lights approached the apparent waypoint for change to a n heading, the witness observed a commercial aircraft at typical approach altitude from the sse, flying directly overhead, presumably on approach to mdw, and with standard landing and navigation lights.  this commercial aircraft should have had clear observation of the pair of lights, and likely the fourth light.  the dull roar of the commercial aircraft was clearly audible and was vastly different than the faint sound heard from the lights by the primary witness.  the witness also noticed that the first light had apparently disappeared as the pair of lights progressed along the same n heading.  as the pair of lights began to hover in the same nw location as the first light had, a fourth light appeared from the same location along the horizon, proceeded along the same route, and at similar velocity to the first three.\r\nat this point, the primary witness called a second witness from the residence to confirm what was being observed.  the second witness observed the two lights in formation appear to hover in the same location that the primary witness had observed the first light hover.  the secondary witness did not observe the entire approach of the fourth light from the horizon, but did observe its change in heading to follow the pair of lights n.  both observers witnessed the pair of lights either reduce in illumination, or proceed at increased velocity n, until they disappeared.  the secondary witness returned to the inside of the residence as the fourth light progressed along the path n.  the primary witness then observed the fourth light appear to hover in the same location as the first light and the pair of lights had hovered.  for 1-2 minutes, the light seemingly hovered in place, with slight random movement.  after hovering, the light began to diminish as the pair had, again either extinguishing or moving off at rapid velocity directly away from the observer, to the n.\r\nthe witness also observed another, presumably commercial (based on apparent landing and navigation lights), aircraft in the distance.  this second commercial aircraft appeared in the nnw and appeared to be following an e heading, possibly on approach to ord.  from the point of observation, this aircraft and the fourth light appeared to have intersecting paths.  as the fourth light faded from view completely, there was approximately 3-5 degrees of angle between it and the commercial aircraft, with the commercial aircraft still to the w of the fourth light.  for approximately 5 minutes following the event, the primary witness continued to scan for additional lights, but none appeared.  as the fourth light was moving off to the n, a third commercial aircraft appeared on the horizon from the same location as the four lights, to the wsw of the observation position.\r\n\r\nat the closest approach (as each light changed heading n), the red lights appeared in size equal to landing lights on a commercial aircraft at standard to low approach.  the red lights did not blink and no strobe or steady lights of any color appeared to accompany the lights.  the intensities (though not the color) of the lights were similar to a commercial aircraft landing light on low approach and did not appreciably vary, except with distance as they approached from the wsw and appeared to depart to the n.\r\nthe primary witness wears prescription eyeglasses for distance correction and had them on for the entire event.  the secondary witness wears contact lenses for distance correction and had them in for the entire event.  the secondary witness did not indicate noticing the faint hissing sound with any of the lights that the primary witness heard.  neither witness was under the influence of an intoxicant during the event.  over the course of the event, the primary witness observed cloud-to-cloud lightning strokes at altitude far to the ssw.  the distance was great enough that thunder did not perceptibly report at the observation location from the strokes.  fireworks had been launched in the vicinity of the observation location during the course of the evening, though the primary witness does not recall hearing the report of mortars at any time during the event and each of the lights lasted far longer than any pyrotechnic device the primary and secondary witnesses have previously observed and did not wax or wane appreciably in intensity.  there is no doubt by the primary and secondary witnesses that the lights were some type of aircraft, and not a pyrotechnic effect.\r\nin contrast to standard aircraft, the lights displayed the ability to move at high velocity and make rapid changes in velocity.  the ability to, apparently, hover is not common among fixed-wing aircraft, yet the apparent velocity seemed to the primary witness to be too great for a rotor aircraft.  if the lights were at low altitude (to explain the high velocity from the horizon), they did not emit a loud noise as would be expected from a rotor or fixed-wing aircraft.  the primary and secondary witnesses are familiar with military helicopters that operate periodically in the local airspace.  these aircraft (sikorsky uh-60 black hawks) have always been readily audible both during the day and at night.  if the lights were aircraft with stol/vtol capabilities, they did not emit the expected sound of a jet turbine engine.  \r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":57255,"landingOccurred":false,"latitude":41.4597108640903,"location":null,"logNumber":"US-06222014-0002","longitude":-88.27496086746393,"occurred":1403412300000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1403423112000,"summary":"Four lights observed over minooka, il exhibiting abnormal movement and without standard navigation lights.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"60447","daysBetweenOccurrenceAndSubmission":0,"locationName":"Minooka, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147665"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Puerto Vallarta","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"El suceso ocurri�� en puerto vallarta estado de jalisco, m��xico durante un viaje de vacaciones. eran alrededor de las 12pm del d��a 26 de marzo del 2014, en ese momento me encontraba en el balc��n del hotel y decid�� fotografiar el paisaje. es necesario hacer ��nfasis en que en ning��n momento vi los objetos en el cielo, s��lo tom�� la foto con mi celular (samsung galaxy s4 mini) y cuando revis�� como hab��a quedado, not�� la aparici��n de los dos objetos por lo que durante unos 10 minutos me qued�� viendo el cielo por si aparec��an de nuevo, pero nunca sucedi��. de esta forma conclu��, que justo en el momento en que tom�� la foto, los dos objetos estaban sobrevolando la zona tal a una velocidad inimaginable y preciso cuando capturo la imagen, quedan registrados. finalmente puedo mencionar que hasta el d��a de hoy siento curiosidad por saber que son realmente y c��mo aparecieron en esa fotograf��a.\r\n\r\npdt: por favor hacer uso del zoom para ver de forma detallada a los objetos.","distance":"Over One Mile","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Unknown","formattedAddress":null,"id":57253,"landingOccurred":false,"latitude":20.653407,"location":null,"logNumber":"MX-06212014-0035","longitude":-105.2253316,"occurred":1395863520000,"potentialRelations":[],"rating":"Unrated","region":"Jalisco","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1403418156000,"summary":"Dos objetos plateados con diferente forma uno del otro. plateados y a una altura no mayor a la de los edificios hoteleros de la zona.","tags":["none"],"timeZone":"America/Mexico_City","timeZoneName":"America/Mexico_City","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57253_submitter_file1__20140326125345.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":87,"locationName":"Puerto Vallarta, Jalisco","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147666"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pikeville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was with my aunt, in her yard...We were photographing nature with my iphone and her ipad. she told me i should take some pics of the sun, as it was shining down on the trees. i snapped one photo, and noticed an orb-like light, which appeared in the photo. i looked up and saw what appeared to be a bright star to the naked eye (but this was in broad daylight)...So when i went back to the photo, and zoomed in...I knew that this object was obviously not a star! it had almost facial-like features. a very distinctly outlined object. so i snapped 2 more pictures. i got the object in one of those pics. when i zoomed in on the second pic...The object was obviously the same object, but with a slightly different shape. at this point, i knew for a fact that it wasn't a star. at least none that i have ever seen. it almost looked like a head facing to the left, with a mouth in the open position. it was very bizarre, and really freaked me out...I won't lie. i tred to find the object again, but had lost it while i was zoomig in, trying to figure out what it could be. about 5 minutes after the sighting, we heard helicopters overhead. i even managed to snap a pic of one of them, which was very dark in color. could have been a black helicopter. i have felt simply puzzled and baffled all day. but i'm attaching photos to this report...So you can hopefully help me figure out what this could be. i've got the original photos, and the zoomed-in photo's (where you can really see the features). i've also included an image of the dark colored helicopter, which came along a few minutes after the sighting. thanks so much!!","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Dome,  Patterned Surface,  Appendage(s)","flightPath":"Unknown","formattedAddress":null,"id":57252,"landingOccurred":false,"latitude":37.4628815,"location":null,"logNumber":"US-06212014-0034","longitude":-82.5748175,"occurred":1403397300000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1403415778000,"summary":"Was taking photos of sun with iphone, and this object appeared in 2 different pics. was also visible to naked eye briefly.","tags":["photo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/57252_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/57252_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/57252_submitter_file3__image.jpg","http://www.mufoncms.com/files_jeud8334j/57252_submitter_file4__image.jpg","http://www.mufoncms.com/files_jeud8334j/57252_submitter_file5__image.jpg"],"weather":null,"zipcode":"41501","daysBetweenOccurrenceAndSubmission":0,"locationName":"Pikeville, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147667"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Morgantown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I observed a single white light about the size of 6 stars together traveling in a south direction with no sound for approx. 15 seconds.  then saw a plane traveling sw. then saw the light weaving slightly for 15 or so longer. i went outside to walk my dog and looked up at the sky...The light moved past the tree line. i felt lucky to see something like that because there was no sound to the light.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Other","formattedAddress":null,"id":57251,"landingOccurred":false,"latitude":39.52921824704947,"location":null,"logNumber":"US-06212014-0033","longitude":-79.92244613960743,"occurred":1403412600000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403415294000,"summary":"I saw a light that weaved without sound...After observing for 10 seconds saw a plane going south west.","tags":["sound","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"26508","daysBetweenOccurrenceAndSubmission":0,"locationName":"Morgantown, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147668"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Niles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"5 of us were celebrating fathers day in our backyard.....We had a fire...The stars were beginning to really shine...Just chatting and looked up and saw what i thought was a lifeflight helicopter...Except...It was hovering funny..And bright orange..I looked down and back up and it was gone..I said something to my friends..Looked back up and it was back..In same spot..Then everyone saw it..Then it was gone...Continued our conversation..Look up and there the orange circle like something was back in the same spot..It was just there..Shining like an orange ball...But hovering  in helicopter flight altitude..Look down..Look back up...Gone....I was excited, nervous, and i also listen to talk radio and this subject is talked about alot..\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":57250,"landingOccurred":false,"latitude":41.159065697636734,"location":null,"logNumber":"US-06212014-0032","longitude":-80.75792428855772,"occurred":1402815600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403415233000,"summary":"Bright orange round something appearing...Hovering...Disappearing...This happened 3 times..5 witnesses","tags":["hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"44446","daysBetweenOccurrenceAndSubmission":6,"locationName":"Niles, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147669"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Sheridan","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving to work.Almost to sheridan or. looked to my right saw something in my peripheral vision. it was a cloudy day.Clouds were low in the sky. and i saw a huge ship like as big as 2 football fields long. it had two levels,a top and a bottom with a section in the middle to connect the two. it was gray in color. had my i phone with me but did't have time to get a picture. was driving 55 miles an hour hard to stop. about that time i came to a small hill with trees could not see it at that time i got to the other side of the hill and could only see the bottom of it as it was moving into the clouds and disappeared. i was so upset when i got to work i kept asking myself did i really see what i know i saw. later that day i told my husband he was very surprised and found it difficult to understand. anyway i wanted to keep it quiet. but it's been on my mind for quit sometime and would like to know if anyone else saw what i saw.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Other","formattedAddress":null,"id":57249,"landingOccurred":false,"latitude":45.0992814,"location":null,"logNumber":"US-06212014-0031","longitude":-123.3948291,"occurred":1366035600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403414047000,"summary":"Very large about 2 football fields long. had a top and bottom section steel gray in color","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":432,"locationName":"Sheridan, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147670"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ballwin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Not certain what i saw as there is a storm going on with a lot of lightning. i was sitting on my couch with the shades open on the windows to my left. i saw a very bright light moving quickly out of the corner of my eye. it was bright pink and white combined. it was flying in an arc e to w, probably following manchester road as my home sits a few streets back from w manchester and the windows are towards manchester. by the time i turned to look directly at it, it was a little past the halfway mark in the windows. i did not see a solid surface, i am pretty sure it had a slight tail on it. i jumped up and ran to the window just as it got to the edge of the window, but it disappeared. i listened for cars, but heard none - the headlights of cars are orange anyway. my next thought was that it was a meteor, but with the size and low flight of it, it definitely would have crashed. i waited a few seconds and there was no crash...There still, almost 20 minutes later, has been no crash. therefore i don't know what i've seen and have decided to report it here. it was higher than two stories high, but lower than the clouds. there was no sound and no interference experienced. ","distance":"Unknown","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":57248,"landingOccurred":false,"latitude":38.5947247,"location":null,"logNumber":"US-06212014-0030","longitude":-90.5652969,"occurred":1403408040000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1403413066000,"summary":"Pink/white orb of light flew e to w, viewed from window","tags":["light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"63011","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ballwin, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147671"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Yonkers","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While visiting my brother at his home we were sitting in his driveway and i was facing ne when i happened to look up at the sky and noticed a object glittering in the sky next to some clouds.  the object appeared to shimmer or pulsated while in a stationary position.  it appeared to be round or circular in shape although it being high in the sky,  the shape may have been a disc shape. the object stood stationary and shimmering then moved slightly to the right,  returned to its original position when first observed. it then moved up then down and again stood still in its first observed position, it continued to shimmer or pulse the entire time. once again it moved to the right of the cloud then when an airplane i saw approaching at a much lower altitude come into my view the object abruptly moved to its left into the cloud and was lost to my view. the object was at a much higher altitude than the aircraft which was a commercial type and may have been coming from laguardia airport. the object appeared to be silver in color with no visible lighting or vapor trails. it was  not obstructed in any way nor was my view of it. the event lasted approx. 1-2 minutes. the sky was clear except for a few clouds near to the object.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":57247,"landingOccurred":false,"latitude":40.93482485502841,"location":null,"logNumber":"US-06212014-0029","longitude":-73.84716637276007,"occurred":1403226600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1403408469000,"summary":"Object was observed while visting relative from his driveway looking up at sky","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"10704","daysBetweenOccurrenceAndSubmission":2,"locationName":"Yonkers, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:147672"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1049}
