{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Balls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am glorgon, commander of the glorgon galaxy. we will be taking over you punny little world on 12/12/12. prepare to die!!!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15932,"landingOccurred":false,"latitude":41.9703633,"location":null,"logNumber":"US-03092009-0005","longitude":-75.3343405,"occurred":1260604800000,"potentialRelations":[],"rating":"Unrated","region":"Delaware","reportedWeather":null,"shape":"Blimp,  Boomerang,  Bullet,  Missile,  Cigar,  Cone,  Chevron,  Circle,  Cross,  Cylinder,  Diamond,  Disc,  Egg,  Fireball,  Flash,  Oval,  Saturn-like,  Sphere,  Square,  Rectagular,  Star-like,  Teardrop,  Triangle,  Other,  Unknown","source":"MUFON","status":null,"submitted":1260604800000,"summary":"I'm glorgon","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15932_submitter_file1__alien.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Balls, Delaware","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:254687"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Santa Barbara","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking out to my car to go to work it was about 6:00 am.  i looked up at the sky like i always do and i saw this bight star looking thing flying south.  it had no blinking lights, no sound at all and was moving faster than a plane would.  i've seen this before and i know its not a plane i live by an airport and see planes all the time, this object was nowhere close to a plane.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":15931,"landingOccurred":false,"latitude":34.4305205,"location":null,"logNumber":"US-03092009-0004","longitude":-119.6885101,"occurred":1236603900000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1236603900000,"summary":"Star like object moving in the sky.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Santa Barbara, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254688"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lansing","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling from home to howell michigan(heading east) taking i-96. i was about 3/4 of a mile west of m 127 and could see the overpass and noticed a white beam of light coming from the sky and appeared to go all the way to the ground. i couldn't see all of it due to the overpass was blocking my view it lasted about 4-5 seconds. the light was on the east side of m 127 and south of i96. i wasn't sure what it was and didn't think much of it till i went under the overpass of m 127. as i went by the overpass on the north side of i-96 and on the east side of m-127, right above me a huge blue beam of light came (like someone turned a switch) from the sky to the ground. it was about the size of a football field perfect circle. i could see inside the circle what seem to be static. other people also seen this as they were pulling over to see it to. this was not a natural thing it was to perfect. it went right into the clouds.( cloud cover was very low)\r\n it wasn't spot light like you see at grand opening. i can say that cause 5 miles west of m-127 they had that kind of light going and this blue beam was nothing like that. i felt very little next to this light. i've been in the airforce and work at the airport for years and i don't know of anything that could make a light like this or even a aircraft that could carry light or have the power the generate a beam this bright. the light disappeared like someone turning off a switch. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":15930,"landingOccurred":false,"latitude":42.736545,"location":null,"logNumber":"US-03092009-0003","longitude":-84.5526147,"occurred":1235791800000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Flash,  Other","source":"MUFON","status":null,"submitted":1235791800000,"summary":"Blue beam of light from sky to ground.","tags":["none"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lansing, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254689"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Statesboro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Same star like object object appeared to be over town,it was very bright and flashing red and green bobbing up and down side to side, it was stationary and i started flashing it with my red and white led light and it eventually began moving towards other side of town,we got in the car like we have before to chase it,we followed it to the other side of town into to country,i pulled onto a dirt road with a good view and parked and we watched it slowly disappear into the distance headed towards candler county.....It wasnt a star or a plane or helicopter,all three of us saw it but its nothing new to us,im just surprised we kept up with it that far because i have figured out these things can get somewhere very very fast and seemingly effortlessly in the process....I tried to catch a video but i do not have the proper equipment to do so....I was very excited as always....I will continue my reports i am sure. ","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15929,"landingOccurred":false,"latitude":32.4564576,"location":null,"logNumber":"US-03092009-0002","longitude":-81.7799674,"occurred":1236589200000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1236589200000,"summary":"Star like but i would bet money it was a disc.","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15929_submitter_file1__16011a.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Statesboro, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254690"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking my scotty dog after dark at 6:42 and looked up in the sky and saw a large v-shaped grouping of lights, it seemed about 6 or so starlight intensity lights on each side of the leading edges of the wings of the \"v\".  the only thing i can compare it to would be the flying wing bombers of the 50\"s except all i saw were the lights. i first thought it was a jet, but it was too big, flying too slowly, and not making any noise for it to be so big/close to the ground if it was that close. there was no way to scale the object, which makes it somewhat frustrating. i was trying my best to figure out what size the object was as i was watching it in total disbelief.  i held on to a light pole to steady myself as i was looking up at it fly from south to a north/slightly northeast direction. the only speed i could compare it to would be a jet at crusing altitude of 40,000 feet, so it seemed to be flying somewhat slow. at that height its' size would be very small.  i read later about someone in brazil who saw something that she was able to scale with her fingers held 3 to 4 inches apart at arms' distance.  that is how big the object seemed to me. it seemed to be big. the lights were the color of dim starlight, so it wasn't something that would stand out and would be easily overlooked unless you had the fortunate opportunity to look directly in its' direction. if 90 degrees was straight up, i saw it at an angle of about 70 degrees, 20 degrees to the west from straight up. it did have red blinking lights at the ends of the wings, one red light on the wing on the far side of me, and two red blinking lights on the side closest to me. i usually look up at the all the planes flying around the area, and my location being about 6 to 7 miles west of downtown los angeles, there are alot of planes in the sky.  the object crossed the flight path of planes landing at lax coming in from the ocean flying from west to east before they turn over downtown l.A. to fly into the airport. i thought planes flying in the air would have had to of seen it, how could they not unless it was higher than they were.  without anything to scale it to, there was no way of knowing how big or how fast it was going, and this is what is still frustrating to me, that i can't figure something that defies any logical explanation or description. one thing i did make sure to do was to see if the object would block out any stars/starlight that it passed under.  the starlight was not blocked out, even between the lights at the leading edge of the object. i can only assume the lights were on the leading edge of the object, but maybe they were at the bottom of it as it passed from view at about 30 degrees from the horizon.  also deciduous trees were beginning to hide it from view. if it weren't for the trees i would have seen it at it's end as the guy and his girlfriend in the san fernando valley would be beginning to see it at 7 p.M. as they had mentioned in their description. a few minutes prior to 6:42 p.M., a neighbor with his dog was walking away from the objects' direction and i a jogger was also headed away as well. they both passed us and disappeared from view. when i saw it i was totally alone except for the dog who was sniffing a bush, she wouldn't have cared if she saw anyhing anyway.  it was a situation of wanting to shout \"hey come out and look at this!\" but i didn't want to take my eyes off of it for fearing of losing my sight of it.  it seemed somewhat majestic and beautiful slowly flying across the sky, i thought, as i was looking at it.  my nickname for it is also \"battlestar galactica,\" and i have refered to it as that since i saw it. i only today, march 8th,2009, have read the other peoples' descriptions, the people from the san fernando valley (mufon 14894), and the family from long beach, so i am another who can be added to the list and am wondering who else could have seen it, as it flew over an area of millions of people.  i called ktla channel 5 and talked to someone there about as i expected other people who saw it would call in and maybe it would have been mentioned in the 10 o'clock news that night, but it never was talked about. there have to be many others who will hopefully some day read of our shared experience and also write of this fantastic, although unsettling experience. it is something that i think about almost every day when i have some time to myself. hopefully i have remembered most of the pertinent information.  unfortunately i do not have a computer and am using my mothers' computer.  i have left information that will allow those at mufon to contact me, and i would like some day to meet the people in the valley, specifically, as it was unbelieveable that he was describing the direction and time frame of the object as it passed from the south, where i was, to the north, to where they were, within the approximate time frames. thanks, -mark ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":15928,"landingOccurred":false,"latitude":34.0543242,"location":null,"logNumber":"US-03092009-0001","longitude":-118.2405349,"occurred":1226716920000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1226716920000,"summary":"V shaped faint starlight intensity lights slowly going across sky from south to north.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Angeles, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254691"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Litchfield Park","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband john and i were sitting in our backyard on the steps of our swimming pool.  my two daughters were swimming.  it was completely dark and we had the pool light on in the water.  it was a very clear arizona night. all of a sudden, to our east a bright, pulsing light appeared. there was a streetlight about 25 feet from our location.  the light appeared first above the streetlight and was so much brighter than the streetlight.  my husband and i both noticed it at the same time and pointed it out to our daughters.   it was shaped like an inverted teardrop.  the light was bright and pure.  i have never seen anything like it before or since.  it was pulsing and seemed liquid as it descended at an angle.  it was going quite fast but we watched it for a couple of minutes.  the streetlight pole blocked some of the light as it descended, but it quickly emerged on the other side of the pole. i am horrible at estimating distances, so i won't even try to guess how far away it was from us.  it seemed quite large, bigger than a hot air balloon.  all of a sudden the thing stopped and was still.  then suddenly it just disappeared as if it had never been there.  we lived near luke afb and the small glendale airport.  we had been in our home for 4 years and i know what the jets look and sound like at luke.  we also could see airplanes approaching the phoenix airport and knew what landing lights looked like as planes made turns toward the airport.  this thing was far, far brighter than the any airplane lights we were used to seeing in our area.  i wish i had the words to describe how pure the light was.  it was just a beautiful pulsing white light.  the light was mesmerizing.  my husband and i tried to figure out what it could have been, but stopped once we realized we were upsetting our daughters.  i wasn't afraid of the object, just puzzled as to what it could have been.  the rate of descent, sudden stop and bright pure white light still stands out in my mind even to this day.  the next day i asked several co-workers and neighbors if they had seen anything, but none of them had.  if i ever see another object i will pay attention to the details of the time and date. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":15927,"landingOccurred":false,"latitude":33.4933743,"location":null,"logNumber":"US-03082009-0019","longitude":-112.3579364,"occurred":1149130800000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1149130800000,"summary":"Inverted tear drop descended quickly at a right angle, then suddenly stopped and blinked out. it was pure, beautiful, pulsing white light. ","tags":["pulsing","light"],"timeZone":"America/Panama","timeZoneName":"America/Panama","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Litchfield Park, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254692"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Klamath Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Traveling to work it traveled e to w. ","distance":"501 Feet - 1 Mile","duration":"00:00:20","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15926,"landingOccurred":false,"latitude":42.231207,"location":null,"logNumber":"US-03082009-0018","longitude":-121.7773704,"occurred":1236406800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Square,  Rectagular,  Other","source":"MUFON","status":null,"submitted":1236406800000,"summary":"Flashing red blue lights.","tags":["lights","flash"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Klamath Falls, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254693"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Baltimore","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It would take too long to type.  however, could mufon find out if there were any strange blips on the radar at baltimore/washington international airport at the time of the incident....In particular in the howard county area?  if there weren't any, then i guess it was just a dream.  thank you.","distance":"Unknown","duration":"00:00:14","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15925,"landingOccurred":false,"latitude":39.2964748,"location":null,"logNumber":"US-03082009-0017","longitude":-76.6060293,"occurred":1236427200000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1236427200000,"summary":"Successfully resisted an attempted abduction by a six feet tall gray.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Baltimore, Maryland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254694"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Cork","country":"Ireland","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At three am approx my friend and i were on the bridge over the river lee in the middle of cork city.  we were walking to a taxi rank when we notice a group of people looking skyward. we stopped and immediately looked up and right above us maybe 1000 ft up was an orange light. first i thought it was odd as it was overcast an the red haze of the citys lights could be seen against the clouds (note:we dont have any buildings over maybe 20 floors in cork city) then this glowing light started to move....Slowly first then all of a sudden with no noise it shot up and moved at an angle and then straight off in a south east direstion towards cobh.  when people started to gasp it came back almost to the same spot.  it then stopped, and begane to move at intervals in no particular pattern.  the object then went behind some clouds, out again and shot off at incredible speed.  the craft appeared round but any real shape was glared by its one bright light.  the main feeling i got from watching this whole incident was that whoever was piloting this craft knew it was been watched and i got the sense that it was sort of showing off, i know that seems strange. the next feeling was a feeling of oh well i knew it anyway, ie i wasnt shocked or overwhelemed just a feeling like you i was expecting to see something eventually.  i stood around and talked to some people (there was a group of maybe 20 people) and they all saw the same thing.  it was a strange experience but annoyingly i heard nothing on the net about it no paper or media intrest, i mean whats going on, it was over a large city at night glowing and moving around like it owned the place and no one registered.  so hopefully since ive found this site someone might have seen the same thing and posted","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"","formattedAddress":null,"id":15924,"landingOccurred":false,"latitude":51.906367,"location":null,"logNumber":"IE-03082009-0016","longitude":-8.475029,"occurred":1227438900000,"potentialRelations":[],"rating":"Unrated","region":"County Cork","reportedWeather":null,"shape":"Circle,  Star-like","source":"MUFON","status":null,"submitted":1227438900000,"summary":"Orange ball flying over city. ","tags":["none"],"timeZone":"Europe/Dublin","timeZoneName":"Europe/Dublin","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cork, County Cork","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254695"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just walking home from buying some food at whole food sales and i noticed some lights in the sky not blinking. first it might be a plane but it was flying very low and it was huge. it flew right over the world trade center. i was amazed how it didnt make any noise flying so low and how big and triangluar it was. it also had these light on the back of the plane that lid up when it accelerated. it was gone so quickly i lost track of it in the sky. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15923,"landingOccurred":false,"latitude":40.7191928,"location":null,"logNumber":"US-03082009-0015","longitude":-74.0048531,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":-62075356320000,"summary":"Traingle shape lights at the back of it. flying really low and very big.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:254696"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Crossroads","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live in housing community that's in the country; so there is a neighborhood and a 2 lane paved road connecting it to a highway. this event happened while leaving the neighborhood.\r\n\r\ni left the neighborhood at 4:25 am, and had just started down the road. it was a very bright night, mostly due to the moon it seemed. it was warm out, windy and there were a lot of low moving clouds. it wasn't raining or storming, but had that sort of feel. it was nice enough out that i rolled down my window, i was heading north so the moon was on the drivers side. \r\n\r\ni looked up to see the moon and sky when i saw 4 lights that seemed to be attached to each other; although i could not see any form holding them together. they were as bright as the moon was and seemed to be fairly low, my guess is that they were under 400 feet in altitude. the color of the light was a white/blue. they didn't change color and resembled a bright light at a stadium. if the lights were all connected and it was 1 object, it would have been a very large object. my guess is that the area they covered was about half a football field. my perspective may not have allowed me to see the entire object.\r\n\r\nthe first time i saw the lights i returned my eyes to the road and thought it was just a reflection in the window. then i realised, the window was down and looked up again to see the exact same lights; this time with a bit of a startle. i relaxed and looked up a 3rd time, but then it was gone. i didn't see it fly off or move away; although i was also trying to watch the road. i returned back down the road about an hour later and saw nothing.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":15922,"landingOccurred":false,"latitude":30.964222,"location":null,"logNumber":"US-03082009-0014","longitude":-96.790718,"occurred":1236511620000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Square,  Rectagular,  Unknown","source":"MUFON","status":null,"submitted":1236511620000,"summary":"Low flying lights in night clouds.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Crossroads, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254697"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"North Mankato","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 5:35am i took my dogs outside.  as i stood on my sidewalk i noticed a light patch in the clouds in the east-northeast sky.  it was overcast and no stars or the moon were visible.  my first thought was that it was a star shining through a thin patch of clouds but then i quickly noticed it was rotating clockwise in a rather tight circle.  one rotation took approximately 5-6 seconds.  the object or light was about tree top height.  it seemed to be over my driveway.  there was no noticeable \"beam\" to discern if it was shining from above or below the clouds.  i watched it for a few minutes outside but got spooked and cold so went inside.  i watched it from a window and it continued to rotate in an even circle at an even pace.  it never went higher or lower.  i watched it for about 10 more minutes until it just vanished.  the time that it vanished was 5:52am. i am very curious to find out what this was - as i am sure everyone who sees something odd is.  my first feeling was that it was from a searchlight but we are somewhat rural and the circle was so small and compact that does not seem possible.  ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Other","formattedAddress":null,"id":15921,"landingOccurred":false,"latitude":44.1732996,"location":null,"logNumber":"US-03082009-0013","longitude":-94.033845,"occurred":1236515700000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Egg,  Oval","source":"MUFON","status":null,"submitted":1236515700000,"summary":"Rotating light at tree top height.","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"North Mankato, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254698"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Knoxville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just gotten home and was walking into my house. i was looking up at the moon in the sky. it was still day light with the sun shining. after i noticed the big moon in the sky i noticed a white jet fly under the right side of the moon leaving chemtrails when i noticed a large very white object flying perpendicular to the line of the jet. i couldn't tell if it was two objects or one with a dark area in the middle of it. it was higher in the sky and appeared to fly over the top of the jet and was going at such a faster speed that i couldn't help but notice it. it flew in a straight line and continued until i gave it up since i didn't have any way to record it. i knew that since i couldn't record it all i could do was watch it. i was talking on the cell phone to my sister when i saw this and asked her if she could see the moon from where she was. she said no. i couldn't make out the wings or tail but i could definitely see these on the jet. i heard no sound. either from the jet or the object in question. the darker area was in the middle of the craft. if it had been a plane it seems like the wings would be in the front and not in the center of this thing. i probably watched it for 15-20 seconds. it was still in sight but moving away very quickly when i came on in the house. i have seem strange things and lights at night but never in the day light. ","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":15920,"landingOccurred":false,"latitude":35.9674084,"location":null,"logNumber":"US-03082009-0013","longitude":-83.9186692,"occurred":1236475800000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Cylinder,  Unknown","source":"MUFON","status":null,"submitted":1236475800000,"summary":"Object was not spherical as i could tell but was in a straight line in sky.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15920_submitter_file1__CasePhoto1.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Knoxville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254699"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Elk Creek","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" i was on my farm in the comers rock section of elk creek va. i looked toward the flat ridge area of the jefferson national forest. hovering over the ridgeline was an extremely large triangle shaped craft. it had a total of seven lights. two on each side at the rear were light blue as was the one in the front. the two behind the front were distinctly orange. this craft was completely silent. the object turned toward my direction and came across the valley. using landmarks the object came as close as 1/4 of a mile from my location. it hovered again for about fifteen seconds and then shot off to the north towards the town of speedwell at a speed that can best be described as instant and was gone.\r\n at its closest point to me i could feel a heavy feeling like if you walked from air conditioning outside to a very hot and humid day.\r\n i have held a job that was in the air defense industry. i am very well trained at identifying flying objects. this was not an airplane, nor did it have a jet or propeller engine. the turn that it made when it shot off would have torn the wings from any man made aircraft that we know of. residents of this area have seen strange military aircraft flying at night for many years and this was not one of them. if this is an american military craft i will sleep much better at night because we will have nothing to fear from any military in the world. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15919,"landingOccurred":false,"latitude":36.722698,"location":null,"logNumber":"US-03082009-0012","longitude":-81.17997,"occurred":1236493380000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1236493380000,"summary":"Very large, blue and orange lights. triangle 200 yards across.","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Elk Creek, Virginia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:254700"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Klamath Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Flashing red and blue","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15918,"landingOccurred":false,"latitude":42.228407,"location":null,"logNumber":"US-03082009-0011","longitude":-121.7723604,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Flash,  Square,  Rectagular","source":"MUFON","status":null,"submitted":-62075353200000,"summary":"Red and blue.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Klamath Falls, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254701"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Curlew","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Went outside to drive to work, looked up at the sky and saw a large, bright, white light that did not blink moving quickly and silently through the sky.  lost sight of the object when it moved behind a tree and disappeared.  we are not sure what it was.  to big and bright to be a satellite like we see through our telescope.  very visible with the naked eye, it seemed to gradually move faster and faster","distance":"501 Feet - 1 Mile","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":15917,"landingOccurred":false,"latitude":42.9788578,"location":null,"logNumber":"US-03082009-0010","longitude":-94.7410923,"occurred":1236177000000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1236177000000,"summary":"Bright,white light.  did not blink. fast moving from northwest to southeast.  ","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Curlew, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254702"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Newton Abbot","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" i was sitting in a supermarket cafe when i looked up into the blue sky and saw a mustard yellow/dark gold parafoil shaped object moving slowly across the sky from east to south at an elevation of about 30 degrees. as it moved it changed shape gently and became more ringlike but kept rippling. it very much reminded me of the morphing ufo that i and my children had seen in torquay last year. i was talking on my mobile and said \"i can see a ufo!\". the young man at the table next to me looked up at it but seemed unimpressed.\r\ni rushed out of the cafe to the supermarket carpark to get a better look at the object but it was receding into the distance so very little more detail was visible and it then disappeared behind the treeline.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":15916,"landingOccurred":false,"latitude":50.528905,"location":null,"logNumber":"GB-03082009-0009","longitude":-3.60836,"occurred":1236302100000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Boomerang,  Circle","source":"MUFON","status":null,"submitted":1236302100000,"summary":"Yellow morphing ufo over newton abbot, devon uk.","tags":["ufo"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Newton Abbot, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254703"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Endicott","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I woke up in the middle of the night and went out on the front steps of the house to smoke as i always do. i have made it a habit to look up at the night sky when i do this because i'd like to see some of these unidentified objects so many people have reported. while i stood there, a bright light the size of a planetary object or very large star appeared over and just beyond the rooftops of my neighbors' houses as i was facing south and slightly west. it zoomed across my field of vision in a more southwesterly direction and blinked out of existence, as best i could tell, rather than disappearing behind the distant hills. the entire sighting lasted less than 10 seconds. we have many airplanes, jets and helicopters going over our area all the time, but this light could not have been one of these as it moved much more rapidly than any of the aforementioned aircraft. the object moved from north to south in a westerly path and disappeared in 5-10 seconds. i didn't have much time to think about what the object was but i have been trying to find out if it could have been a meteor. this seems to me to be the mostly explanation to fit description of the bright object and its movements. other than being a shooting star, i can't imagine what it could have been. i was happy to have seen this object, since it meant all that looking up at the night sky (while standing out on the front porch steps to smoke and keep my cigarette smoke from stinking up the house)had finally had results. i don't mind if it was only a meteor because i don't remember ever having seen one of those in my life, but if it was an exterrestrial craft or top-secret aircraft, that would be even cooler.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15914,"landingOccurred":false,"latitude":42.099488,"location":null,"logNumber":"US-03082009-0007","longitude":-76.0477884,"occurred":1236326400000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1236326400000,"summary":"A bright light appeared above the rooftops and traveled extremely quickly toward the horizon, but disappeared before reaching it.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Endicott, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254704"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salt Lake City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was about30 minutes after midnight when upstairs to go to bed. as i lay down i happen to look out the second story window to the southwest of the city, i live in the east bench in the city. \r\n\r\ni saw a very unsual bight muli-colored strobing / flashing light very low in the sky. i thought it might be a star for a minute but realized that it was too low and close and positioned in front of the oquirrh mountain range to be a low hanging star i also saw the bright southwest star in the sky above it so i got curious and went and got my binoculars.  my first  view was a little out of focus but i could see it was pulsing and fashing a multi-colored light very rapidly.  as i focused that is when i saw its distnict slightly domed on top of a ( two plates face to face ) disc shape with a slight protrusion of a lower domed bottom. \r\n\r\ni watched it for about 10 minutes and it did seem to be able to change but i believe these \"changes\" to be more related to how much or how little it shape was revealed by the amount of shape defining illumination the object was emitting. just an opinion.\r\n\r\ni was more curious so i went and got my wife out of bed to take a look but she did not have her conact lenses. i kept track of the object as it changed and lost its initial shape    ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15912,"landingOccurred":false,"latitude":40.7675193,"location":null,"logNumber":"US-03082009-0005","longitude":-111.8835574,"occurred":1236371400000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1236371400000,"summary":"Southwest flashing domed disc shaped object low in the sky position in front of the west mountain range which means it could have not been a low hanging star.  ","tags":["disc","pulsing"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salt Lake City, Utah","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254705"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Toronto","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I woke up in the middle of night to get a glass of water. and then when i went back to bed, i passed through the window. through the open curtains, i saw a huge orange planet like object in the sky. and it was apparently not too high above the ground. i can say so because the stars seemed the size of an ant from my viewpoint and that orange ball was relatively extremely huge. \r\n\r\nit was just my plain sight that made me notice it. it was so huge that no body could have missed it. at first, i though the object was a planet or something. i also considered the possibility of it being the moon, but moon isn't orange, neither it is that big as that object was. \r\n\r\nit had spots similar to the spots the moon has. it was very beautiful to look at. its movement was not really apparent, but as i watched it i could tell it was moving because an electrical tower came in from of it after less than a minute. as i kept watching it, it started to fade away as if clouds were covering it, or as if it was shrinking. and in a matter of few minutes, it just disappeared. i kept looking for about another 15 minutes, but it didn't reapper.\r\n\r\ni also woke my mom up, and she saw it too. i wish i had a camera to store a picture. \r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary,Other","formattedAddress":null,"id":15911,"landingOccurred":false,"latitude":43.6443806,"location":null,"logNumber":"CA-03082009-0004","longitude":-79.5230279,"occurred":1236516180000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Circle,  Oval","source":"MUFON","status":null,"submitted":1236516180000,"summary":"Orange planet like shape.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Toronto, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254706"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Kingman","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" my boyfriend, my mother, and myself were outside letting our new puppy go pee. i look up and there was this extremely bright light in the sky (not venus!) so i point it out to them. it was quite low and to the west. i went inside to grab the camcorder (sadly no tape; was using to zoom in). it was blurry, but looked very odd up close. when i looked back up, it disappeared, then reappeared slowly through the clouds. then came a little closer, zig zagged then completely went away.  total time was about 10 minutes. this is the 3rd time this has happened over the past month each being in a different spot / same time range. it is no plane, or anything like that as it hovers. others have seen it too, i know since i read some of the recent reports. \r\n i am receiving tapes for my video camera so i will send those in if this ever happens again. this really is an amazing sight.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":15910,"landingOccurred":false,"latitude":35.196453,"location":null,"logNumber":"US-03082009-0003","longitude":-114.0485165,"occurred":1236397380000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Flash,  Star-like,  Other","source":"MUFON","status":null,"submitted":1236397380000,"summary":"7:43 pm, very bright light in the sky.","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kingman, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254707"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Antonio","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"If i start from the begining i have to go back to the year 1999,where i oberved a star like object moving through the sky at the southern hemisphere. it wasn't much after that that i noticed another event in wich i saw a white star like object approching the earths atmosphere, as it got closer it started changing colors; first blue; then red; then orange, all of a suddne it broke into three sphere's turning a green and yellow color. all three headed off in diffrent directions, the event itself only lasted about 3 minutes. ever since that i have made a rotuine of watching the night skies just to see how much activity was going on over our heads, and i have to say i am amazed. any way over the years i have noticed that must ufo's when moving through the skies it's like a fish swimming in water they don't just move in a straight line like our aircraft do. i have also learned that most movement is from the south to the north or from the west to the east, and usely when the moon is not out for some reason when the moon is out there is no activity no matter what the moon cycle is. if you remember the year the big earth quake hit in the indian ocean causing the tidal waves that killed hundreds of thousands of people, the very night before it happened the ufo's i was observing changed their habit's. they started strobbing, and i don't mean like we are use to seeing in strobe lights, these seem to grow in intensitiy and as they grew the craft would seem to stop and when the intesity of the strobe would start dereasing it would move on. there was no pattern to the strobbing such as we see in intervals with our strobe lights, the only time i saw this pattern again was when hurricane katrina it in new orleans; and i mean the night before it hit. \"strang\". well anyway i have notice now they seem to get down low now, till this recent sighting i have now had. this ufo was transparent and if you don't have some kind of light reflection or water vapor you can't see them, but they are so low now they are with in our own aircraft flight paths. this really should be looked at closely. thank you","distance":"101-500 Feet, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings,  Unknown","flightPath":"Stationary,Path with directional change,Path then hovering","formattedAddress":null,"id":15909,"landingOccurred":false,"latitude":29.4257219,"location":null,"logNumber":"US-03082009-0002","longitude":-98.4900782,"occurred":1231824600000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,  Star-like,  Triangle","source":"MUFON","status":null,"submitted":1231824600000,"summary":"Noticed a boomerang object moving from the north to the south, only reason i saw it was because of spot lights accidently crossing it's path.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Antonio, Texas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:254708"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was walking my dog one night late in the evening. i looked up in the sky to see a satellite inching along in the sky among the trees. as soon as i identified the satellite i saw an orange ball high in the sky among the stars make a 360 degree circle within two seconds it was gone. it was a little hard to see afterward as if i was seeing the stars right in front of me. my vision was kind of hazy.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":15908,"landingOccurred":false,"latitude":32.7228392,"location":null,"logNumber":"US-03082009-0001","longitude":-117.1553551,"occurred":1233302400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1233302400000,"summary":"Orange ball in the sky, high in the stars.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254709"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tampa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Two pics two seconds apart.The first has a rod like object in the vapor trail behind jet and below that at bottom of pic is a diamond shape looking object which in the second pic two seconds later looks like a white dot.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":15906,"landingOccurred":false,"latitude":27.954005,"location":null,"logNumber":"US-03072009-0020","longitude":-82.4535876,"occurred":1236459600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Bullet,  Missile,  Diamond","source":"MUFON","status":null,"submitted":1236459600000,"summary":"Two objects in pic, diamond shape at bottom and rod in vapor trail.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15906_submitter_file1__DSCF9665.JPG","http://www.mufoncms.com/files_jeud8334j/15906_submitter_file2__DSCF9667.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tampa, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254710"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on the couch in my friends apartment in manhattan when i looked out the window and saw this spectacular bright light in the sky right over new jersey, but not too far off the hudson river. at first, we thought it might be a star or venus, but it couldn't have been because it was so close and clearly in our airspace. my friend had a camcorder on hand and proceeded to film the object. we stared out the window for about a half an hour to see if it would move. it looked as though it was staying in one place, but when i returned to the couch, i noticed that it had changed locations and had dropped about 500 feet and north of where i had seen it originally. this is when the filming starts again, and we catch it zipping around in the air. no, the camera was not on a solid surface or a tripod, but we were holding the camera still enough to catch its movements. we then decided to get a better look on the roof of his building. when we arrived on the roof, we noticed directly below the object, a stretch of brilliant light illuminating and hovering over what looked to be cliffside park, or fairview, nj. i've never seen any aircraft light up such a large chunk of land and for such a long period of time. furthermore, there were planes and helicopters flying under, across, and over the object for the entire duration of the sighting. there had to have been at least one pilot that reported this to the faa. after being on the roof for about ten minutes, we noticed an additional ufo that seemed much lower in the sky than the first. it appeared and in about 5 seconds had vanished completely.  after witnessing the second object disappear, we became increasingly concerned. also, the freezing weather was making things worse so we left the roof. by the time we arrived back to the apartment, the bright object was gone, and the brilliant light over nj was no longer present. it's a little hard to describe how we were feeling after the sighting. we were a little freaked out and confused. but, of course we are trying to stay skeptical. aside from being a bit freaked out, it was truly fascinating to have witnessed and up to this point, unexplainable. lastly, i would like to apologize for any profanity on the video. i was just naturally freaking out. \r\n\r\n the entire sighting lasted for about 1 1/2 hours. by approximately 9pm, the bright star-like object was gone... \r\nnote: time displayed on camera is two hours behind. \r\n\r\ni would like a field reporter to contact me.\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":15905,"landingOccurred":false,"latitude":40.7178328,"location":null,"logNumber":"US-03072009-0019","longitude":-73.9980731,"occurred":1236222900000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Diamond,  Flash,  Star-like","source":"MUFON","status":null,"submitted":1236222900000,"summary":"My friend and i witnessed two mysterious objects in the night sky. they were diamond-shaped and illuminating with brilliant light i've never seen before in my life.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15905_submitter_file1__large.m4v"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254711"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sydney","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had been at a friends having a few rums and i had walked outside to have a cigarette when i had noticed a bright flash to the south east of my friends place, then i noticed a set of bright orange lights moving in a nw direction from where i was. there is a royal australian air force base about 2 hours drive from where i live and at first i thought it was a jet doing a flyover but then the lights changed direction, they turned almost 180 degrees and headed in a south easterly direction from where i had seen them originate. they went right over my friends, who shall remain anonymous, and we both got a good enough look to see that it was a cylindrical object roughly 70-80 metres long and roughly 20 metres wide. we were both confused about what we had seen. later when i was going home i noticed that i had no recollection for 2 hours of the night and whenever i try to remember what happened i only get the image of a giant bird swooping down on me, i still get headaches when i try to recall the night in question. it was my 22nd birthday.","distance":"Unknown","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":15904,"landingOccurred":false,"latitude":-33.867731,"location":null,"logNumber":"AU-03072009-0018","longitude":151.2111896,"occurred":1197613680000,"potentialRelations":[],"rating":"Unrated","region":"New South Wales","reportedWeather":null,"shape":"Cylinder,  Flash","source":"MUFON","status":null,"submitted":1197613680000,"summary":"Bright light in se sky travelled n.","tags":["lights"],"timeZone":"Australia/Sydney","timeZoneName":"Australia/Sydney","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sydney, New South Wales","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254712"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Inverness","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Back in 1971 i was up on cape breton island, nova scotia-sight point area along the coast with my girlfriend's family for the summer.  many stars, the northern lights and milky way are visable up there as it is far from city light pollution.  one night after dark we were outside star gazing etc. and i noticed a very obvious bright metallic looking object moving at amazing speed and in a highly unusual fashion.  it was small, about the size of a big satellite or very bright planet or star but was moving and hovering, making impossible turns.  my girlfriend had seen it right away also and asked me if i saw it too.  i simply said yes.  we continued to watch this object fly around high above us and after about 10 minutes it simply \"took off\" into space at a very high rate of speed and dissapeared.  there was no sound, no little green men, no abduction, etc. but whatever it was it wasn't a plane, helicopter, satellite, star, or weather.(it was a very clear night)\r\n    i've thought about this off and on for years and i've been all over the world, flown many planes, have seen military secret planes like the sr-71, steath planes etc. and this wasn't anything like ours.  what can you say?\r\n    this \"craft\" or whatever it was could make 90 degree turns on a dime and also hover motionless.  it's speed and manuvering was incredible and when it took off and dissapeared the only thing i can think of is star strek when they blast into hyperspace or whatever.  there was no sound.\r\n    didn't know what to think except it isn't anything i've known or seen before or since so i'd say it was an unknown flying object.\r\n    ","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":15903,"landingOccurred":false,"latitude":46.230026,"location":null,"logNumber":"CA-03072009-0017","longitude":-61.306258,"occurred":48841200000,"potentialRelations":[],"rating":"Unrated","region":"Nova Scotia","reportedWeather":null,"shape":"Sphere,  Star-like,  Other","source":"MUFON","status":null,"submitted":48841200000,"summary":"Watched a metallic satellite like craft manuvering in the sky.","tags":["none"],"timeZone":"America/Halifax","timeZoneName":"America/Halifax","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Inverness, Nova Scotia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254713"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Tempe","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in the house with my wife and heard a helicopter very close...So i stepped outside and looked up. above me was an unmarked, white helicopter hovering above my house with a cameraman inside. i followed the trajectory of the camera's path and saw a glowing orb hovering above the city of tempe, az. it would sit still and then float from side to side. it had no marker lights and was clearly freely floating in the air.\r\n\r\ni watched in amazement for a while and decided to run in and grab my wifes nikon camera. i brought it outside and we took about 20 pictures of the ufo as it moved away from us. we had no tripod, but did our best to brace the camera. the ufo was in sight for about 15 minutes max and was moving away from our direction, slowly the whole time. look very closely and zoom in on these pics....It goes from being an orb, to what resembles four thrusters firing as it flew away. if you need to get the rest of the pics, send me an email.\r\n\r\ntempe az 2007","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":15902,"landingOccurred":false,"latitude":33.4325704,"location":null,"logNumber":"US-03072009-0016","longitude":-111.9342654,"occurred":1175324400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1175324400000,"summary":"Unmarked helicopter above house points out a ufo being filmed in tempe.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/15902_submitter_file1__DSC_3485.JPG","http://www.mufoncms.com/files_jeud8334j/15902_submitter_file2__DSC_3492.JPG","http://www.mufoncms.com/files_jeud8334j/15902_submitter_file3__DSC_3495.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tempe, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254714"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Saginaw","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I can not write good      call me  please thy would leave me alo              ne         iwant too tell somewon thankyou                it happen at work  with 5camera on me  i was taking aboard at agm plant it was as big as a city it to-- me too mar  it told me it creature me.. i---the end --the world was at hand..","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":15901,"landingOccurred":false,"latitude":43.4240399,"location":null,"logNumber":"US-03072009-0015","longitude":-83.9454368,"occurred":174810240000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle,  Other","source":"MUFON","status":null,"submitted":174810240000,"summary":"Hell.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Saginaw, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:254715"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Roanoke","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Had seen the light or object several times before,come in and just hover over a certain spot on the mountain in front of my home and one time came in and hovered and slowly lowered itself down until the trees up there almost hid it from veiw. this one night which was the last time i saw it, my daughter and her friend were getting ready to go home and me were outside and i had been telling them about it, and there it was actually coming in. it came over almost the same spot but higher up than usual and then all of a sudden 2 lights came out of the bottom of it went away from it and then took 2 separate pathes away from it at a very high speed, no noise, and the two objects both had oselating lights. it reminded me of the movie the third kind by the way those 2 lights traveled one out one way and the other the other way. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":15900,"landingOccurred":false,"latitude":37.2739604,"location":null,"logNumber":"US-03072009-0014","longitude":-79.9337466,"occurred":1201766400000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1201766400000,"summary":"No features just one big light. the two small objects had red and green lights.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Roanoke, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:254716"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2268}
