{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ok, so im not one to jump to conclusions about weird darting lights in the night sky but tonight i undeniably saw an incredibly strange flying object over the corn field behind our house, and i have not been able to find any explanations as to what it might have been on the internet so far.\r\ni was standing outside smoking a cigerette... thanking my lucky stars for my new car that i just got today by some unimaginable stroke of luck or favor, and i was for some reason compelled to look to the heavens.\r\nright above the roof of my house at about 90* (but far enough away that i couldnt see the complete outline)- and this is around 10:30 at night mind you- there is this darting flying object...... it blinks red.... then darts to the left and blinks white.... then red .... then white.... then blue or something.....\r\n\r\nthe strange thing wasnt the colors of the lights.... it was the speed patterns by which they blinked... completely out of sync... unlike an airplane\r\n... i thought at first that it was airplane.... but it zig-zagged .... and moved accross the sky so phenomenally fast that all that i could do was stand there absolutely dumbfounded and stare in disbelief! \r\n\r\noh, and did i mention that i couldnt hear a thing?\r\ni kept waiting for the \"swoosh\" sound you hear when a plane flys over head, but it never came....\r\nthe nearest airport is almost an hour away too.\r\nplus planes are slow in the sky and fly in a straight line normally right?\r\n\r\ni think that the thought crossed my mind at some point at i stood there frozen in terror that my room mates might find this interesting, and that maybe i should call out for them, but i felt that if i spoke or moved that it might dissapear, and that i would miss this fanciful display of what seemed to be happy lights that i would like to think were dancing just for me. i felt that it wanted me to see it for some reason..... like it was checking me out or something?\r\n\r\nit traveled in an arch.... right along my line of vision.... from one side of the sky.... all the way over in a semicicle pattern to above the cornfield behind my house at about 0*...... all the while with the crazy blinking flipping lights in circular motions.... like nemo swimming in the ocean in \"finding nemo\" the movie or ......Swirling about like a dolphin flipping in the air.....\r\n\r\nthen it just hovered.... and dimmed a little.... it didnt move.... it just.....It just....Hovered.\r\nso anyways, i watched this thing for like ten minuets, which seemed like an eternity (after all how many ufo's does one get to see live in a lifetime? :-)\r\n\r\nmy eyes got so tired of staring at it that i got bored and went into the house after i was dissapointed by the lack of an army of little grey men decending upon our cornfield by means of what i always imagined would be a tractor beam of light f i ever did see a \"ufo\"......\r\n\r\n\r\n\r\n....-joey (a new believer/former skeptic)","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":11955,"landingOccurred":false,"latitude":40.4247271,"location":null,"logNumber":"US-08062008-0011","longitude":-82.897983,"occurred":1216877400000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1216877400000,"summary":"Light moves erratically and hovers over house and cornfield","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:350994"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Winnipeg","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At about 10:30 pm. may 10 i was camping near piney, mb. approx. 10 miles from the u.S. border. stepping outside for a restroom break, i casually looked upwards at a clear patch of sky and marvelled at how there were no clouds whatsoever. to the southeast (i believe) i saw 2 brightly illuminated and horizontal white rectangles moving in perfect unison in somewhat of a circular fashion. that's to say, some motions were circular, some vertical, some horizontal, but the movement was easily observed and occupied an area of the sky approx. the size of my outstretched fist. after several minutes the objects merged. no fancy movements, no sound whatsoever...They just became one, and continued the movement as before. and there were no tree leaves obstructing my view, moving with the wind and causing lights to change their appearance. it was a clear, calm night. then, back to being 2 rectangles. the entire event lasted some 10 minutes. lacking my video camera at the time, i then turned in for the night. there was no feeling of being afraid at all, just in awe at what i'd seen. our local astronomer and media \"go to guy\", *(name deleted--sgonzalez/cms)  told me when i contacted him he'd had no similar reports that evening. a friend who's a pilot had suggested the u.S. gov't employed unmanned drones to patrol the canada/u.S. border. (but, if true, why would they be brightly illuminated?) when i mentioned this to *(name deleted--sgonzalez/cms), he said he'd heard of that, but that it was likely the u.S./mexico border that was patrolled. i'm totally unaware of the distance of these lights from myself; being night time, of course, it could have been 5 miles or 50 miles away. anything like this ever crossed your desk? thanks in advance.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":11954,"landingOccurred":false,"latitude":49.9027941,"location":null,"logNumber":"CA-08062008-0010","longitude":-97.1318037,"occurred":1210483800000,"potentialRelations":[],"rating":"Unrated","region":"Manitoba","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1210483800000,"summary":"2 illuminated rectangles observed.","tags":["none"],"timeZone":"America/Winnipeg","timeZoneName":"America/Winnipeg","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Winnipeg, Manitoba","triangle":false,"type":"UFO Sighting","$$hashKey":"object:350995"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Thousand Oaks","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the morning of august 6 i awoke early to choke my chicken. (i am a chicken rancher and part time head of the [profanity deleted] moppers union local 384.) i heard a low thundering pulse and looked into the sky and saw a ufo with the words suzy licktenshtein on the side glowing in red. i grew woozy and then it seemed as though all time stopped. i woke up about 2 hours ago and one of my orifices is swollen - i won't tell you which one. i suspect that i was prodded by this alien sex monster and i think i have been impregnated. please pray that this is not so.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11953,"landingOccurred":false,"latitude":34.1745109,"location":null,"logNumber":"US-08062008-0009","longitude":-118.8333937,"occurred":1218025800000,"potentialRelations":[14045],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1218025800000,"summary":"I saw a strange object in the sky.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Thousand Oaks, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:350996"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Riverside","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just taking pictures to record the local fireworks.\r\ni didn't see these objects until two days later.\r\ni thought one was a scratch on the lens.\r\ncan not say how the acted, i did not witness them.\r\ni got the chills.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11952,"landingOccurred":false,"latitude":33.9612587,"location":null,"logNumber":"US-08062008-0008","longitude":-117.3887164,"occurred":1215230760000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cigar,  Cone,  Disc,  Triangle,  Other","source":"MUFON","status":null,"submitted":1215230760000,"summary":"I took pictures of the fireworks, i did not see them until two days later.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11952_submitter_file1__Twoontheright.JPG","http://www.mufoncms.com/files_jeud8334j/11952_submitter_file2__Groupofthree.JPG","http://www.mufoncms.com/files_jeud8334j/11952_submitter_file3__LargeCraft.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Riverside, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:350997"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cms/tg n/a","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving north on us hwy 83 out of north platte, i noticed a moving oject going from my right to left on the horizon. it was a sky gray color with some yellow. the object was long about 30 meters and flat like.\r\nit had a bulbus nose and flew tieh the nose kind of pointed down.\r\ni would guess it was below 1500 feet and was traveling at about 100 mph.\r\n\r\nit flew in a straignt line to the west out of sight and vanished.\r\n\r\nit had no visible markings and made no noise.\r\n\r\n","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11951,"landingOccurred":false,"latitude":41.4965574,"location":null,"logNumber":"US-08062008-0007","longitude":-99.9000431,"occurred":1217919600000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1217919600000,"summary":"Crossed on front an a low level","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11951_submitter_file1__StrangeObject.jpg","http://www.mufoncms.com/files_jeud8334j/11951_submitter_file2__UFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cms/tg n/a, Nebraska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:350998"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Palm Harbor","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On or about jan 20th 2007 i was driving back from my girlfriends house at about 3am.I was actually on the phone with her when i saw the ufo.Anyway i lived in tarpon springs florida at the time and was coming back from clearwater about a 25 min ride.I was driving driving north on cr1/keene/omaha there all the same road.Anyway i came to the light at cr1 and curlew,as i went through the light i noticed a strange figure flying to my left.It had a weird light pattern.The lights went all the way around.At this point i was thinking holy [expletive deleted] its either a ufo or a weird light system some individual has on a personal aircraft.Nevertheless i am watching all the way down cr1 it appeared to be barely moving for a plane and all.Anyway it appeared to be following me,it was only maybe 4oo feet away or it seemed.This is not a desolate area its very populated.When i got to tampa rd and cr1 i had to make a left.As i turned i noticed it was following me.Down the road.As i approached tampa rd and alt 19 which was less the 45 seconds away it stopped about 50 feet to the left of my car.I could plainly see the shape it was square.It had a interesting light pattern that consist of light blue,light pink,white the blue and pink were very light though almost white.Meanwhile i am watching it with my head out the window for a good 15 to 20 seconds.I looked over and there was a cop also at the opposite light he appeared to be looking at it as well.It made a left turn with no noise and just took off like at the speed of light.I was amazed and freaked out at the same time.All the while my girlfriend is on the phone with me.I am telling her play by play she is laughing at me.I said to her \"i am [expletive deleted] serious\".I dont care if people believe me i know what i saw if anyone wants to chat or have seen something similar my email is [personal info removed] mike","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Patterned Surface","flightPath":"Path then hovering,Unknown","formattedAddress":null,"id":11950,"landingOccurred":false,"latitude":27.99695,"location":null,"logNumber":"US-08062008-0006","longitude":-82.725664,"occurred":1169280000000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1169280000000,"summary":"It flew slow was square,hovered,noiseless,then flew off at the speed of light ","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Palm Harbor, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:350999"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was taking pictures of my baby brother on my hp digital camera when we looked up in the sky.  i was pointing out cloud formations to him when we saw a disc shaped object that appeared in the sky.\r\n\r\nthe object did some strange manuvers and hovered for a few seconds then it shot into the sky and out of sight.\r\n\r\nthe photo i have of it is crystal clear and shows a disc that looks like some kind of metal on the outside with a smaller metal inner circle that is connected to the outer ring on two sides.\r\n\r\nthe sun was out and visibility was clear. \r\n\r\ni downloaded the photos on my brother's computer and saved them to discs.\r\n\r\nthese photos are not fuzzy images they clearly show some kind of disc shaped craft that was able to travel at high speeds and change course radically.  there was no sound coming from the object.\r\n\r\nwhen i realized what i was looking at, i became extremely excited.  \r\n\r\ni showed the pictures (not yet downloaded) to my father, aunt, step-mother and older brother who all agreed that it was like no aircraft they had ever seen.  \r\n\r\ni watched the disc for approximately four minutes and then it accelerated straight up into the sky at a tremendous rate of speed and disappeared.\r\n\r\ni want to show my photos to a mufon representative before i publish them on the internet.\r\n","distance":"Unknown","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path then hovering","formattedAddress":null,"id":11949,"landingOccurred":false,"latitude":40.57240501234379,"location":null,"logNumber":"US-08062008-0005","longitude":-74.14181727391752,"occurred":1218046500000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1218046500000,"summary":"I was taking pictures of my baby brother when we looked up in the sky and spotted a round shaped object.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351000"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Since the first sighting in my life which took place in march of this year, i understandably spend a little time on most clear nights gazing at the sky.\r\non this particular night (august 2nd 2008) i was standing on my porch about to go in for the night when i observed an oval shaped object / craft heading from north to south. it had no lights, but due to its almost white, or opaque color it was totally discernible against the back drop of the clear night sky. at first i thought it might be a bird, but i have never seen a bird that size, that fast, that high moving as fast as it was, and in a perfectly straight line. the object seemed to be roughly 500 ft high (hard to tell exactly). it was oval shaped but moving from the wide side of the oval. it was of course totally silent. it was about the size of a thumbnail with your arm fully extended. it was quick enough to traverse the distance in the sky between my neighbors and my house in just a few seconds. i ran down to the street to see if i could visually re acquire it, but it was gone.\r\ni live near jfk and laguardia airports and am familiar with all sorts of aircraft both domestic and military. this was clearly none of those.\r\nas it passed over our homes many dogs in the general area began barking.\r\nmaybe they could actually hear it. shortly after the object was gone the barking ceased. after about 5 minutes of continued observation i went inside. we are currently watching my mother in laws small dog. she was found (the dog that is) cowering in the corner. it took several minutes to get her calmed and to stop shaking. i have never seen her (the dog) act like this.\r\nperhaps worth mentioning is that this object had the exact same trajectory as the craft i witnessed back in march 08'. i am 45 and until that first sighting of my life in march i was somewhat of a open minded skeptic. that has changed. at least the \"skeptic\" part. probably much more open minded as well.","distance":"101-500 Feet","duration":"00:00:04","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":11948,"landingOccurred":false,"latitude":40.7852445,"location":null,"logNumber":"US-08062008-0004","longitude":-73.9598795,"occurred":1217742000000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1217742000000,"summary":"Unlit oval object witnessed. exact trajectory as sighting in march 08'","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351001"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"UNKNOWN - maybe Cincinnat","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I've always believed, but i'd never definitively seen a ufo until saturday.  i was on a passenger jet on a flight from detroit to cincinnati in the early evening this past saturday and somewhere over ohio i looked out the window into the western sky.  it was a beautiful day with some clouds.  we'd been at our cruising altitude about 10 minutes when i saw what i initially thought was a plane far away, even though it just looked like a white or silvery oval.  it was higher than we were and was climbing at about a 45 degree angle which i thought was kind of strange.  i watched it for about 5 seconds, and then it disappeared!  completely!  at first i just thought i lost sight of it, which can happen with far away objects in the sky, but it was nowhere.  so then i started really paying attention to the sky out the window.  after a few minutes i saw another (or the same) object, but in a different part of the sky.  it appeared out of nowhere.  it didn't seem to be climbing and seemed more or less stationary (although that might've just meant it was traveling at a similar speed to us).  i saw it flash, which at the time i assumed was metal reflecting in sunlight.  and then it also disappeared.  this happened 4 more times!  there were a total of 6 times on that flight that i saw an object appear out of nowhere, flash, and disappear.  i initially thought the flashing was reflecting sunlight, but i now think it must've been related to whatever was making the object(s) disappear.  i don't know what it is that i saw, but if it wasn't an alien craft, then our military has totally been lying and withholding about the level of their technology.  i've never heard of anything being able to disappear and reappear like that; let alone while cruising at 20,000 feet or so.  unbelievable.\r\n","distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","duration":"00:15:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path,Unknown","formattedAddress":null,"id":11947,"landingOccurred":false,"latitude":40.4194671,"location":null,"logNumber":"US-08062008-0003","longitude":-82.898323,"occurred":1217726100000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Oval,  Unknown","source":"MUFON","status":null,"submitted":1217726100000,"summary":"Disappearing and reappearing objects seen out airplane window","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"UNKNOWN - maybe Cincinnat, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351002"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bethesda","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 12:23 am, i was driving down wisconsin ave. in bethesda, md, on my way to work, when i observed a ufo hovering off to the side of the road.  this object was overing right off the grounds of bethesda naval hospital.  initially, driving towards it, i saw a pulsating white light, low in the sky.  it caught my attention, and as i drove closer, i saw that it had a triangular shape, and had alternating red and white lights around it.  i noticed it was not moving, and kept driving, to the point where i was directly underneath it, stopped at a traffic light.  it was low to the ground--about double the height of the treeline.  my window was down, and i could not hear any sound--it was completely silent.  i saw it hover for another approx 5 seconds, when it slowly, without any noise, began to fly \"backwards,\" triangle-base first, in the direction of the naval hospital.  the traffic light turned green, and i drove away, in the opposite direction that it began flying in.","distance":"101-500 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":11946,"landingOccurred":false,"latitude":38.984652,"location":null,"logNumber":"US-08062008-0002","longitude":-77.0947092,"occurred":1218050580000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Chevron,  Triangle","source":"MUFON","status":null,"submitted":1218050580000,"summary":"Triangular ufo hovering near bethesda naval hospital","tags":["ufo","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bethesda, Maryland","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:351003"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Warrington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was ouside in my backyard around 4am.  it was almost a full moon and i was looking up at the night sky. i was looking below the moon and saw a cloud there.   i looked back at the moon and out of my perifrial vision i noticed a light that i thought was a cloud below the moon. then i noticed a boomerang shaped object.  the object moved in different directions.  it moved towards the open end of the v which didn't seem to make sense aerodynamically.  within approx 15 seconds it went off into another cloud.\r\n\r\ni was in disbelief after i saw the object and went back into the house. \r\nthe next day, i shared with my family and friends what i saw.  a week later somebody told me that there was an article in the paper stating that other people in the area saw the shape object that i saw. it was affirming to know that other people also saw something that night. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":11945,"landingOccurred":false,"latitude":40.249167,"location":null,"logNumber":"US-08062008-0001","longitude":-75.134444,"occurred":1216191600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1216191600000,"summary":"I saw a bomerang shaped object  below the moon","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Warrington, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351004"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mobile","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Last night at about 3:50 i woke and couldn't get back to sleep. i walked around the house and got a snack. then just to have something to do i looked out the window of my room. i looked around the sky (as i usually do) and saw what looked like a star.......At first. i looked at it for a minute and saw that it was moving. i thought it was an airplane so i kept watching it. then the object got closer where it's shape was clearer. then it moved very fast around in a very random manner. i kept watching in amazing and curiousity. it was triangular shaped and had a bright light in the center with 3 lights on the side (one on each corner). the side lights started flashing in a pattern. it kept this up for a minute until small lights were heading to and from the object. the next thing it did was move in a side to side motion very fast. then it stopped. all the lights shown bright. then a row of light appeared off one of the corners. after this it made more flashing patterns with a seperate set of lights. all of the lights were bright and appeared a good distance from each other. then moving around slowely and shown a semi-circle row of lights. these light didn't appear to be connected to it at all. then it continued the flashing pattern for a about 20 seconds before flying away. it was pretty far up and away but i could see it clearly. it flew away so fast that if i were to blink i would have missed it.","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change,Path then hovering","formattedAddress":null,"id":11944,"landingOccurred":false,"latitude":30.7040366,"location":null,"logNumber":"US-08052008-0016","longitude":-88.0400541,"occurred":1217935200000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1217935200000,"summary":"Fast moving triangle shaped object flashed lights in a pattern ","tags":["triangle","lights","flash"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mobile, Alabama","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:351005"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"North Webster","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I filmed this flashing hovering object for 6 minutes. i only stopped to get some pictures with the same camera which reveal a cloud by the object then i filmed another 2 minutes. it is way to bright to be able to see exact detail but i will upload them along with both movies. whatever it was is still there! when i was filming i noticed it was cloudy! so whatever it is it's below the cloud cover! keep an eye open and a camera on, just look up each night you're more than likely to see something! and don't be afraid to report it!","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11943,"landingOccurred":false,"latitude":41.332922,"location":null,"logNumber":"US-08052008-0015","longitude":-85.6957848,"occurred":1217999040000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Fireball,  Flash,  Sphere,  Star-like,  Unknown","source":"MUFON","status":null,"submitted":1217999040000,"summary":"I tried to film them again i hoped to look up and see something and i did","tags":["none"],"timeZone":"America/Indiana/Indianapolis","timeZoneName":"America/Indiana/Indianapolis","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11943_submitter_file1__MPEG0037.AVI","http://www.mufoncms.com/files_jeud8334j/11943_submitter_file2__MPEG0038.AVI","http://www.mufoncms.com/files_jeud8334j/11943_submitter_file3__PICT0145.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"North Webster, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351006"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Memphis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on the back steps the afternoon of may 16, 2001. i was looking at the sky, enjoying the afternoon. the back of my house faces west and the front faces east. i saw an object approaching from the west travelling very slowly towards the east. i watched it and at fisrt thought it could be a jet. jets fly over my house all time on approach to memphis international. as it got closer i could tell this was no airplane. i could see that it had a round shape to it. i then tought it might be a balloon of some kind. it continued to get closer and i new it was very strange indeed. i knocked on the back door without taking my eyes off of the object it and asked my wife to get my cam corder. looking through the cam corder i could see it was a real ufo. i made the video before it turned and slowly went out of sight. my wife and my son both saw the object. the sky was clear, and it was still very much daylight. we were on daylight savings time then. \r\nthe object turned south and eventually we lost it in the sky. while taping the object, a jet on approach to memphis international, passed behind the object giving me good perception of the closeness of the object, believed to be about a mile from my point of observation. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":11942,"landingOccurred":false,"latitude":35.1529743,"location":null,"logNumber":"US-08052008-0014","longitude":-90.0468501,"occurred":990063000000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Oval,  Sphere,  Square,  Rectagular","source":"MUFON","status":null,"submitted":990063000000,"summary":"The object was metallic, opaque, white in color, made no noise, move very slow. ","tags":["none"],"timeZone":"America/Kentucky/Louisville","timeZoneName":"America/Kentucky/Louisville","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11942_submitter_file1__UFOBartlettTN21..mov"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Memphis, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351007"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bellville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out last night (saturday night/sunday morning) with my scope checking out jupiter, neptune and uranus. i was going back and forth from inside my house to where i had my scope set up. around 00:30, i walked out side and noticed a rather bright object in the western sky. it immediately caught my eye because it had a very strong \"twinkling\" effect. i watched it for a few seconds and i thought it darted around. i continued watching and noticed that it seemed to zig-zag back and forth and make other sudden movements. the more i looked at it, it looked like it was flashing red, green and white light. i woke my wife up to get her to look at it and she also could tell that it was darting around and flashing. i got my digital camera (i don't have a camcorder) and tried to shoot a video of the object, however it did not show up at all on the screen (i later looked at the video and the object can be seen, but not at a very good resooution and also i was not holding the camera stready enough). i assume that the avg. magnitude of the object was around -0.5. \r\n\r\nthe object did not move more than about 1 degree in any direction as it darted around and stayed in the same spot in the sky for at least 45 minutes. mars and saturn and venus had already set for the night, so it could not have been them and jupiter was still hours from setting and well away from the object. i finally put my telescope on the object with a large eyepiece and got the object into view. the flashes of light were more pronounced through the scope and definately much brighter as i could see the red, green and white lights flickering (almost as if the object was spinning).\r\n\r\ni spend a lot of time looking through my scope and this is the first time i have ever seen something like this. any explanation will be appreciated. \r\n\r\ni did not experience any unusual feelings before during or after seeing the object other than expected excitement.  i thought the object was an airplane until i noticed it darting around.  i lost sight of the object when i went to bed about an hour later.  it was still visible at the time.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":11941,"landingOccurred":false,"latitude":29.9502253,"location":null,"logNumber":"US-08052008-0013","longitude":-96.2571858,"occurred":1217750400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Flash,  Sphere,  Star-like","source":"MUFON","status":null,"submitted":1217750400000,"summary":"Flashing object in western sky at night.  object darted back and forth, but did not leavethe general area.","tags":["flash"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bellville, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351008"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Davie","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At around 10:50 pm i was on my way home from a friend's house when i glanced to the sky noticing around 10-12 orange colored lights that were all at different heights forming a diagnol-like shape. they were too close together to be airplanes. and the color of them was like no airplane i've ever seen. they were fairly low right above a bunch of huge trees. i kept my eye on them while driving and stared for about 8 minutes until i was close to home when i went to get my parents to tell them to come see. i reasoned out all the possibilities, they werent airplanes and the werent light poles.About 5 minutes later after we all got in the car and drove back to the area where i saw them they were gone.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11940,"landingOccurred":false,"latitude":26.0682864,"location":null,"logNumber":"US-08052008-0012","longitude":-80.2276038,"occurred":1217915400000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Boomerang,  Star-like","source":"MUFON","status":null,"submitted":1217915400000,"summary":"Around 10-12 lights in the sky very close together","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Davie, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351009"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Kettleman City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We (my husband driving, me in passenger seat, daughter & her friend in back seat) south on hwy 41 in california on the night of july 31, 2008. \r\nit was about 11:30pm at night. we were driving in an agricultural farming area so other than the lights of other vehicles on the highway it was sort of dark off to the sides of the highway. as i was watching straight ahead, i noticed what i thought was a low-flying airplane coming opposite to us and over the highway and other cars on the opposite side of the highway.\r\n\r\ni couldn't help but notice it as it was a row of very strong bright lights and i had to squint. it seemed to be about 5 lights in a row across. there was no space between each light the way there is on an oncoming airplane. it started to bank to its right which made me think there must be a small airport nearby and the aircraft was going to land. i thought it was a late-night cropduster. i asked my husband if he saw the lights and if he thought there was a small airport nearby. he was disinterested and said probably.\r\n\r\nin the next minutes or so i continued to watch this bright row of lights. the \"aircraft\" did not land but instead seemed to come up from its banking sideways and seem to appear to turn in such a way that the row of lights became a small orangish glow. i assumed it was similar to looking at the wing of an airplane from the side. but as i continued to watch this little orange light which sort of pulsated, it dawned on me that aircraft usually have green or red tail and wing lights. this didn't look like any aircraft i have seen before.\r\n\r\nso i asked the kids (13 years old) in the back of the car if they saw it. they looked and saw it and watched as this aircraft banked left and right in s-shapes all across a huge agricultural field area. both kids thought it looked odd. my daughter commented that it looked like it was pulsating to her.\r\n\r\nmy husband (who was driving fast at 80mph) wasn't paying too much attention until i urged him to pull over on a side road. we sat for maybe about 10 minutes and watched this aircraft doing its strange banking turns and fading out from bright lights to an orange glow then disappear all together. that was pretty strange to all of us. \r\n\r\nwe lost track of it when it literally disappeared on one of its turns.\r\none of the kids even rolled down the back car window so we could hear if there was an airplane engine noise because i thought at first it might be a late-night cropduster. but there was no noise other than the occasional car passing on the highway. no other airplanes were flying overhead.\r\n\r\nas we sat silently watching this aerobatic air show my husband finally took interest when he pointed out that it seemed to be \"hiding\" behind a row of tall cypress-type trees near the only house nearby which was almost directly across from us on the other side of the highway. it then went from nothing to an orange glow (about the size of a light on a lightpole i would guess) to this huge bright row of lights. then it would do its s-turns and disappear. \r\n\r\nwe waited a few minutes more for it to return but then could only see it far in the distance going away from us. we had to press on. unfortunately the battery in our digital camera was already dead so we couldn't catch it on tape.\r\n\r\nlater as i talked to everyone about it i asked what they saw. my daughter thought that in the dark she could make out faintly that it seemed to be the shape of a guitar-pick...Pointy on the top and round on the bottom. her friend agreed. the bright row of lights were at least 5 but seemed to point in an angle horizontally. my husband offered no explanation other than he agreed it had very bright lights brighter than an oncoming airplane and it was odd that it disappeared in the dark night sky and then would reappear elsewhere over the agricultural field. i couldn't tell its overall shape but i can say that when comparing the row of lights to a car on the highway it would have to be at least 3 car lengths across in size or maybe the size of a dc-3. it certainly was bigger than a cessna. i was also amazed at how low it could maneuver in such smooth 30 degree turns...I would guess that it was flying about the height of 1-2 stories...Only later maybe up to 3-stories. this based in comparison to the buildings in the distance and the one house nearby.\r\n\r\nas we continued on i did note the signs on the highway to remember where we were. there was one small street named quail ave to the right of us (or going west). i'd say we were about 5-10 miles outside of kettleman city. we were somewhere between the city of lemoore and kettleman city. (i recall seeing a sign on the left side of the road which pointed east to tulare and corcoran) and then maybe 5 minutes or so later saw the approaching bright lights.\r\n\r\ni might also add that when i first saw the lights they were flying almost parallel to the highway and cars on the opposite side of the highway were under it. no one else pulled over as far as we could tell. \r\n\r\n\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":11939,"landingOccurred":false,"latitude":36.0082864,"location":null,"logNumber":"US-08052008-0011","longitude":-119.9617998,"occurred":1217572200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1217572200000,"summary":"Bright lights off hwy 41 in california","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kettleman City, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351010"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Sabinas Hidalgo","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"La tarde del 7 de julio de 1948 en el municipio de sabinas hidalgo, un objeto volado no identificado se estrell��� en un paraje ubicado entre el r���o salado y el r���o sabinas, en un lugar muy cercano de la sierra madre oriental, en una zona no muy alejada de la carretera a nuevo laredo. aparentemente el ovni ten���a un tama���o poco mayor a 27 metros, el cual fue recuperado por elementos del ejercito mexicano y de la armada de e.U.A. supuestamente el \"piloto\" de la ���nave��� falleci��� quemado, y su cuerpo fue llevado por los militares a un lugar desconocido. (caso no confirmado). \r\n\r\non the evening of july 7, 1948 in the town of sabinas hidalgo, an unidentified flying object crashed in an area located between the rio salado and the rio sabinas, in a place very near to the sierra madre oriental, in an area not far from the road to nuevo laredo. apparently the ufo had a little more size to 27 meters, which was recovered by elements of the mexican army and usa army. supposedly the \"pilot\" of the ���craft��� died burned, and his body was taken by the military to an unknown location. (case unconfirmed). ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11938,"landingOccurred":false,"latitude":26.5069047,"location":null,"logNumber":"MX-08052008-0010","longitude":-100.1794529,"occurred":-677993220000,"potentialRelations":[],"rating":"Unrated","region":"Nuevo Leon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-677993220000,"summary":"Estrellamiento de ovni en sabinas hidalgo (ufo crash in sabinas hidalgo).","tags":["crash","ufo"],"timeZone":"America/Monterrey","timeZoneName":"America/Monterrey","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11938_submitter_file1__sabinashgo48.jpg","http://www.mufoncms.com/files_jeud8334j/11938_submitter_file2__sabinashgo48b.jpg","http://www.mufoncms.com/files_jeud8334j/11938_submitter_file3__sabinashgo1948.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sabinas Hidalgo, Nuevo Leon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351011"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Santa Cruz","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At around 3:30pm, while sitting on the outside deck of the ideal restuarant in santa cruz, having just finished lunch with my girlfried, i was looking to the east, when an object coming from the north, moving to the south, at what i thought was a very high rate of speed, caught my eye. \r\ni beleive that this object caught my attention due to is speed and also a shape that did not look familer to me. at the time when i first noticed this object the sun was directly behind me on my back and i was looking east tword capitola. my very rough estimate is that this object flew over close to capitola at an altitude of approximatly 5,000-10,000 feet. after watching this object for about 5 seconds, i asked my girlfriend, who at the time was facing me, with her back to the object, to turn around and look. at the time i asked my girlfriend to look, i would estimate that this object was already 1/2 to 3/4 across monterey bay. in the 3-5 seconds that it took for me to ask my girlfriend and for her to turn to look, the object was almost out of visual site (my girlfriend did not see the object)\r\nat the time i felt that due to the objects speed i shoud have heard some sound, possbile a jet engine sound or even a sonic boom, i heard no sound at all. this also caught my attention even though this happenend very fast.\r\nafter thinking about what i just saw, i did a very rough calculation: the distance from capitola to monterey across the bay is approximatly 30 miles, i estimated that the object i saw covered this distance in about 10 seconds. this estimate of the objects speed and lack of sound is one of the reason i decided to file a report. i have always been interested in aircraft, have been to many airshows, have seen military aircraft flying at high speed (never supersonic), but my perception of this object was that it was moving at a supersonic speed. also my feeling was that this object moved in a very striaght line, i mean like taking a ruler and drawing a line across a piece of paper striaght\r\nthe shape of this object fit the somewhat traditional saucer shape; kind of skinny at the ends and fat in the middle, with the exception of the trailing edge. the trailing edge had what i can only discribe as similar to a vertical stabilizer on a traditional aircraft, but i do not believe that this was a traditional aircraft. also this object did not seem to me to have a diffinitive outline, although definatly visable, i could not discern any clear lines of an airframe that i would expect to see from my observations of aircraft that i am familiar with. i would say that the outline was almost fuzzy in appearance. i did not see any lights on this object, though this did not strike my as unusual givin the time of day and the angle of the sun. what did strike as possible unusual is that i did not see any reflection of the sun off of the object; maybe just not the right angle?\r\nthe weather at this time was clear and close to unlimited visibility. air temperature was around 75 degrees, no clouds. earlier in the day there had been a marine layer of fog over the bay that burned off around 12:00. at the time that i saw this object there was fog or a marine layer well to the west, over the pacific ocean, but not over monterey bay.\r\nwhen i first noticed this object i had a strong feeling that this was not any aircraft that i was familier with by shape, i think that is what got my curiosity.\r\nas far as i know there were no other witnesses.\r\n\r\nthank you for taking this report,\r\nmark","distance":"Over One Mile","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":11937,"landingOccurred":false,"latitude":36.9805971,"location":null,"logNumber":"US-08052008-0009","longitude":-122.0240363,"occurred":1217889000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1217889000000,"summary":"At around 3:30pm viewed an object that i could not id to the east, moving north to south at a high rate of speed","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Santa Cruz, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351012"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Woodstock","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me, my (now ex)wife and stepson were eating at ihop on hwy 92 near 5-75 in woodstock, ga. when we finished, the three of us started walking out to the car. my stepson noticed something overhead and asked me if i knew what it was. both me and my then wife looked up and saw a black triangle with three lights (one on each corner) moving silently through some clouds approximately 250-300 feet above us. \r\n\r\nit was moving rather slowly, and it didn't make any noise. i initially believed it to be some sort of drone, or experimental craft since we live so close to dobbins afb. i assumed it was monitoring traffic, and decided not to pay any more attention to it and we left. \r\n\r\ni remember it moving almost too slow for it to stay aloft. if a plane was moving that slow it would have crashed. i thought it may have been an electrical powered glider of some sort. \r\n\r\nmy wife was insistent that what we had seen was a ufo. i agreed since i didn't know what it was, and it was something i had never seen before or heard about. \r\n\r\ni still don't know if what i saw was a man made experimental craft and would appreciate any information regarding it. ","distance":"101-500 Feet","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":11936,"landingOccurred":false,"latitude":34.1106273,"location":null,"logNumber":"US-08052008-0008","longitude":-84.5134354,"occurred":1095301800000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1095301800000,"summary":"Black triangle","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Woodstock, Georgia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:351013"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hillsboro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Last night i observed a starlike object in the sky proceeded by a triangle craft.  earlier this evening my daughter and i observed a starlike object moving towards us.  we thought it was a plane that was getting closer.  all the sudden the object fell towards the ground and disappeared like a falling star.  at around 10:25pm tonight i was sitting out on my patio when i noticed another starlike object that just stayed in the same place for almost 10 minutes.  i thought to myself if it was a plane wouldn't it move position.  it just bounced around a little.  last night when i witnessed the two crafts i grabbed my camera but when i turned it on all i got was static.  after an hour my camera was fine again.  tonight i got the object on video, however, my camera was full of static again.  i had a hard time attaching the video as it is very long so i am pasting a link to photobucket here.\r\n\r\nhttp://s302.Photobucket.Com/albums/nn120/funjay/?Action=view���t=cyclinghagglake.Flv","distance":"Unknown","duration":"00:06:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":11935,"landingOccurred":false,"latitude":45.5268432,"location":null,"logNumber":"US-08052008-0007","longitude":-122.9827565,"occurred":1218000300000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1218000300000,"summary":"Starlike object staying in same spot in the sky just bouncing around","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hillsboro, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351014"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Springfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving around shortly after moving to euegene oregon many years ago (1998). i was on an empty road. the sun was starting to go down. i was rocking out to the radio, listening to that cherry poppin daddys song, zuit suit riot. it had just ended and the dj came on to say it was 4;50 or so, talking about the commute/yraffic. i pulled my hair up and drove with my knee for a sec, was growing out bangs or i wouldn't remember because i hated the length when i tried to get them back.\r\n\r\nthen my car slowed down. i'd had starter problems for a while and i was so young i'm not sure what i was thinking but i wasn't alarmed. i remember thining of my low cell battery and being happy it still had juice. then i was going to turn on my lighs and there was like, a truck coming with its lights on and it was sort of bright, which i think distracted me from getting out my phone. \r\n\r\nthe next thing i knew it was dark and and i was on the side of the road with my radio on fuzz, lights on in the car and i felt startled. when i opened my cell, which was laying beside my purse, it was 5;20. my car was just pulled over, not parked. i don't remember pulling off the road at all, just that my car quit running and and there was a truck comming, or something big. my car took a few seconds to turn over, it seemed week which was normal even after replacing the battery two weeks earlier. \r\n\r\nthis is really old and i'm really sort of ashamed to be writing this as though it were some sort of ufo thing. i could never say for sure what happened that fall but i know it wasn't right somehow. because i know all these years later that i cannot explain where i was. i must have been somewhere because my hair was down and over to the right side. my hair band was no where i could find in the car and i'd just put it up. my (short) heels were not on my feet but on the floorboards and i crossed my feet to get into them again.\r\n\r\nall my radio stations were blank as was my clock, as though my battery failed. i was pretty stressed out with my first real job... and i had starter problems but that should not have had any effect on my running car. as i left i noticed that my wipers were on too.\r\n\r\ni can't imagine what happended even ten yeasr later. like how my shoes were crossed, my hair was down, my radio was messed up and my windsheild wipers were on. \r\n\r\ni was really happy to get rid of that car. anyway, i don't know.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":11934,"landingOccurred":false,"latitude":44.0526262,"location":null,"logNumber":"US-08052008-0006","longitude":-123.0184289,"occurred":909820800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":909820800000,"summary":"I was driving,  then i wasn't.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Springfield, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351015"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my way to work in the town of poth, texas.  i was just on the edge of fall city, texas, observing a motorcyclist about 75 yards in front me.  he had just passed over the san antonio river bridge and began descending down the small decline there when an object no longer than the width of hwy. 181 streaked from the left side of my view to right, just above tree-top level.  it passed directly over the cyclist.  visually, it was in a position that i do not think possible to see for the person on the motorcycle.  the speed i was driving at the spot was 45 mph.\r\n\r\nif i was not looking at the cyclist, i would have never known it was there.  it was dead silent and moved so fast that i couldn't register details except for the following:\r\n\r\n1.)  it was slender and had a thin profile.\r\n2.)  it was dull grey metal in color\r\n3.)  i could hear no sound and the cyclist showed no indication that he heard anything above him.\r\n4.)  there was structure to it because i could faintly make out it possessed other angles and differences in shading.\r\n5.)  the bottom portion of the object seemed to have a slight curvature to it, like a lense resting on a surface.  this curvature was more of an impression rather a very clear visual.\r\n6.)  the front portion seemed thinner than the rest, perhaps a bit more like a jet.\r\n7.)  the size was smaller than a f-16 but longer than a car.\r\n\r\ni sometimes see training aircraft in the area, along with crop-dusting planes.  this looked nothing like those and this was completely silent.  i have been to air-shows all my life and if this was a plane or jet, i should have heard or felt something at the distance i was engaged in.\r\n\r\ni could not track this into eastern sky because of the trees blocking the view and also how close to tree-top this object was. \r\n\r\nwhen i got to work i sketched some lines on paper without looking at the paper, to attempt to draw the impression of the object.    i took that sketch and filtered it in photoshop.  i enclosed both.","distance":"101-500 Feet","duration":"00:00:01","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":11933,"landingOccurred":false,"latitude":30.271213,"location":null,"logNumber":"US-08052008-0005","longitude":-97.7335608,"occurred":-62117469000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Diamond,  Unknown","source":"MUFON","status":null,"submitted":-62117469000000,"summary":"High speed dull metal sleek object silently speeds over hwy 181 by fall city, texas","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11933_submitter_file1__UFO1.jpg","http://www.mufoncms.com/files_jeud8334j/11933_submitter_file2__UFO.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351016"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Renton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I looked out the window and saw something unusual object in the sky. the sky was clear, there was no clouds and it was a around 70 degrees weather at night. it was very high above the city of renton wa, that i cant get a good description of it. it sat there for atleast and hour and it still up there, it havent move from it spot. there was plane flying underneath it but that it. ","distance":"Unknown","duration":"09:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":11932,"landingOccurred":false,"latitude":47.4828776,"location":null,"logNumber":"US-08052008-0004","longitude":-122.2170661,"occurred":1217907000000,"potentialRelations":[11899],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Star-like,  Unknown","source":"MUFON","status":null,"submitted":1217907000000,"summary":"Very high in the sky, with bright lights","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Renton, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351017"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Vienna","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I stepped outside to smoke a cigarette before getting ready for bed, and looked up into the sky to \"wish upon a star\"- which is my nightly routine. i saw my first star, made my wish, and continued looking around in the sky above me [i don't have much visibility when it comes to seeing stars in the sky in any other direction other than up, due to very tall oak trees in the neighborhood- unless i'm standing at the end of the driveway]. so, i walked towards the street to get a better view of the north star, which seemed especially bright. i stood there for about 1 minute, turned around to look down the other end of the street for a few seconds, and turned back. that is when out of the corner of my eye i noticed a very large glowing orange sphere southwest of the north star! i was able to focus in on it, but only with my eyes because i was afraid if i ran inside to grab a camera, that it would leave as quickly as it came. it was stationary for about 5 seconds or so, and then seemed to \"dance\" or bobble in the air, up and down, for about 10 seconds before making about a 45 degree northwestern - western departure trail down the street. [i say this because i lost visibility due to the tall oak trees in the neighborhood, and wasn't able to run fast enough to follow exactly how it left and where it left to]. it was silent the entire time! i ran inside to tell my parter to come outside and help me look around for it, but it was too late. i feel so lucky to have seen what i did, but at the same time it almost seems too surreal. but i know what i saw... i hope someone else out there saw it too! and was able to snap a picture or videotape it. there were airplanes in the air, both before and after the ufo sighting, however they were very high in the sky and appeared to be moving slowly in a straight path, blinking red and white lights- which was nothing like the ufo that i witnessed! it was not an airplane and it was not a helicopter!","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change,Other","formattedAddress":null,"id":11931,"landingOccurred":false,"latitude":38.9012225,"location":null,"logNumber":"US-08052008-0003","longitude":-77.2652604,"occurred":1217826600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Sphere,  Star-like","source":"MUFON","status":null,"submitted":1217826600000,"summary":"Large glowing orange sphere \"dancing\" above tall tree-line","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Vienna, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351018"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Watertown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am a 43 yr old truck driver, local route for over 20 years. i live a half mile from a commercial/civilian airport and 2 miles from weeler sack airport, a military base, home of the 10th muntain division on fort drum n.Y., so i regularly scan the skies identifying everything from c10 military planes to small piper cub personal craft as a hobby over the last decade while i work and when driving for personal reasons.\r\n\r\n  while i made detailed sketches and wrote down every detail that day, i am a bit scared to pull up the documentation, so i am only giving you my memory at this time.\r\n\r\n  i was driving back from work on a afternoon as clear as it could be, sunshine, and not a cloud in the sky. as i drove i noticed a metalic craft \"maybe more crome looking i feel\" shaped like a arrow head but with softer edges, \"kind of almond like\". it entered my view from the left of my rig window, \"it was heading northbound while i was heading westbound.\r\nthe craft was close enough to make out every detail as it continued a slow movement northward about three hundred feet above ground and about 4 to 8 hundred feet away depending on its size, \"i couldn't tell for sure\", but i estimate 15 - 30 ft. it made no sound.\r\n\r\n  i was speachless trying to figure out what it was as it continued its course and began to teeter side to side and flash in the sun. i could very clearly see there were no visable doors or window, as thou it had been entirly dipped in crome. as the object continued to \"play\" and flash in the sun, it leaned sideways just enough to the right to reflect the sunshine into the cab like a mirror, attracting the attention of my co-worker. he yelled \"what the hell is that!\".\r\n\r\n  i pulled over the truck a bit shaken and we got out. \"i had never believed in u.F.O's before this event at age 40!\" we watched for another few minute, just repeating the same phrase, \"what the hell is that!\"\r\nsuddenly it was gone in a blink of the eye. i got myself together and went home to tell my family. my brother in law, \"a captian at fort drum\" told me the military would hound my and everyone would think i was nuts if i told my story, but now i am retired and have to get it off my chest. \r\n                                  thanks,  bob\r\nif you wish, you can contact me at gould7@yahoo.Com i would be happy to go into more detail if you care to hear it, or i could dig out my notes and sketches from that day, scan them and e-mail them to you so you have the exact date, time and fresh memory notes.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Wings,  Other","flightPath":"Straight-line path,Other","formattedAddress":null,"id":11930,"landingOccurred":false,"latitude":44.074728,"location":null,"logNumber":"US-08052008-0002","longitude":-75.670732,"occurred":1150401600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Teardrop,  Triangle","source":"MUFON","status":null,"submitted":1150401600000,"summary":"Clear day, no clouds,witnessed by 2 people, metalic and close up.Clearly seen","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Watertown, New York","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:351019"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Arlington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On july 30, 2008 at approximately 1:10 am, i was outside working security, doing foot patrol when i saw a flash of white light in the shape of a square. it was above the six flags theme park in arlington, texas. it moved from left to right in a flash and disappeared. in the movement of the light, it had a mysterious wave moving through, like a flag would wave in the wind or a bed sheet when one would fluff it when spreading it out on a bed. there was no thunder-storm activity that evening. i spent the rest of the morning trying to rationalize what i had seen. i called the arlington police department to check if anyone else had called about the strange light. at the time of the call, nobody had reported any such information.","distance":"501 Feet - 1 Mile","duration":"00:00:02","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":11929,"landingOccurred":false,"latitude":32.744917,"location":null,"logNumber":"US-08052008-0001","longitude":-97.1070056,"occurred":1217405400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Flash,  Square,  Rectagular","source":"MUFON","status":null,"submitted":1217405400000,"summary":"A square shaped flash of white light.","tags":["flash","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Arlington, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351020"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sherwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"   it was between 10 and 11 pm sunday night aug 3rd. every night i go out for at least a couple of minutes to look up at the sky. i had been looking around for a couple of minutes and i saw a very bright object moving across the sky. it was heading east coming from some where towards the coast range. it was different color than a satellite, much larger and not moving like one. i called my wife and oldest son to come and look and we all continued to watch it moved eastward across the sky. suddenly it changed direction as if it were heading directly away from earth, took off at a very rapid speed then completly vanished into thin air. i have been watching the night sky for many years and have seen many things, i can tell the difference between planes, satellites, stars and planets. to me there is no question what i saw last night (space ship,) i am just not sure what exactly was flying it. i am convinced that what i saw was nothing that any country claims to have as far as aviation or aircraft, i just wish i knew what it was that was flying that thing. i will continue to go out in my back yard every night in this little town of sherwood oregon in hope of getting some answers. i have had a feeling for some time that something big is about to happen that is going to shock the world and after last night i am more convinced of this.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":11928,"landingOccurred":false,"latitude":45.3588674,"location":null,"logNumber":"US-08042008-0028","longitude":-122.832438,"occurred":1217828700000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1217828700000,"summary":"It moved slowly across the sky , it started to speed up and changed direction and disappeared.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sherwood, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351021"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Orlando","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was cycling in the back yard of our community that is adjoining to sr417.  it was around 9:20 in the night, with stars in the night, but no moon visible.  towards south i think (that was where all the houses were), a dim violet ball of light came into my view.  it definitely did not feel like a shooting star (i have seen my share of stars,and this was not that brief).  it was clearly a ball the size greater than the brightest star in the sky (venus, is it?). the sighting wasn't for too long either.  it was only for a 3 seconds or so.  it moved across the sky at great speed (too fast to be an airplane).  it could either be a pretty big shooting star or something unearthly.  more sightings might throw the right light on what it exactly is.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":11927,"landingOccurred":false,"latitude":28.5407155,"location":null,"logNumber":"US-08042008-0027","longitude":-81.3751365,"occurred":1217910000000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1217910000000,"summary":"Saw a dim violet ball moving very quickly across the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Orlando, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351022"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lafayette","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On 7/23/08 my wife, brother-in-law and myself were having coffee on our deck. i noticed an orange ball of light and said ���hey, what is that���? my wife and brother turned to see the obol (orange ball of light) just as it was fading away. it was in the ne sky just above tree level but couldn���t tell how far away it was. if you extended your arm out, and stuck your thumb out the obol would have been the size of your thumb nail. also experiencing white lights, if you had a straight pin the white lights would have been the size of the head of the pin.  we talked about it for a few minutes and we saw more lights. they didn���t move they were stationary, and would just fade in and stay on for about 5-7 seconds, then fade out. my wife called into our 19 yr old son and his girlfriend and told them to come out and take a look. they both came out and we saw a set of two lights. one came on then the second. once the second light had reached its peak in brightness, the first one faded out, then the second faded. i said, \"it looks like it's only a mile or so away, i'm going to drive over in that direction to see what i can see\". as i got over by wainwright middle school, my wife yelled into the cell phone that there was another one. i put my head between the steering wheel and the windshield of the car, and noticed it was directly above me. that one actually had a secondary light that split away from the original ball. just before i left the house, my son was getting his video camera, and caught a few sets of lights on his digital video camera. he got a series of two lights, and the light that was over my car. the video shows the second obol splitting off the first one. my brother-in-law thought he saw it move from side to side. the light i saw above my car, would it have been on the ground would have been bigger than my car. i was directly under that one. there were about 6 different sets of lights that night. some had only one, some had two and a few had three. there were 5 witnesses for the 23rd of july 2008. we saw tiny white non flashing pin lights flying all over the area where we had seen the obol. after we had seen the first two lights my brother-in-law said ���look at that little white light flying after that airliner. he���s going to hit it!!!��� it flew very fast and caught up with the airliner and flew just above it until it was out of the area then peeled back and shot towards the east where it had came from. the very last light we had seen (i was back home by now) there we two pin point white lights closing in on the obol from both sides, and when the obol disappeared the two tiny white lights shot straight up into the air nearly colliding, and shot towards the north. in total there were about 4 pin lights while this was all going on. the obol showed up every 4-5 minutes in different areas in the ne sky. it was 22:40 when we saw the last one.  we all went into the house to see if there was anything on the news.\r\n    on july 24th my wife and i had to work the next morning, i told her that i was going to go back out on the deck to see if i can see those same lights again.  so she went to bed and asked me to wake her if i happen to see anything. right on time 22:30 the first one showed up. i ran inside to get my wife and this time my daughter was at home, i had her come out on the deck to watch. the lights looked the same but were in a different pattern. this time there we several lights coming on at the same time in different parts of the ne sky. on both nights if all lights would have been on they would have formed a perfect horizontal line spanning about a 5-7 mile stretch. my wife called my mother who lives in clarks hill.  her and my brother went outside and saw the same thing as we did. the next day i called my friend who is a police officer, he said he saw them also and had no idea what they were. so on this night we had 5 witnesses in three different parts of the county who saw them. \r\n     being retired navy of 20 years, i can say the lights were not flares, it did not illuminate the ground or the trees around it.  it wasn't fire works, some of them where 5 miles apart from each other and over corn fields with no houses around.  \r\n     i photo shopped the photos to give you an idea of what was seen that night.\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":11926,"landingOccurred":false,"latitude":40.4192422,"location":null,"logNumber":"US-08042008-0026","longitude":-86.8655869,"occurred":1216876200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle,  Sphere","source":"MUFON","status":null,"submitted":1216876200000,"summary":"Orange balls of light chased by white pin points of light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/11926_submitter_file1__30.jpg","http://www.mufoncms.com/files_jeud8334j/11926_submitter_file2__301.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lafayette, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:351023"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2390}
