{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Logansport","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"While sitting outside of our home, my wife and i as well as my father-in-law were watching the kids play just after dark  approx. 2015 hrs while talking i glanced up and noticed a bright yellow-orange light in the sky, appearing at about a 40 degree angle to the ground and at a hard to determine distance. the light was unmoving. appearing to resemble a very bright star, or even a headlight on a car at a distance of about 1/2 to 3/4 of a mile. after about 10 seconds the light faded. as i continued to watch, the light slowly lit up, this time about 10-15 degrees to the nw of where it appeared before. at this time i brought it to the attention of my father-in-law and my wife who both witnessed the light, the light did not move while visible and once again the light faded after ten seconds, and failed to reappear.  the thing that i found most odd about this sighting is that it is the third time that i have witnessed this type of light, the first time was approximately 5 months ago with the same m.O. and the second time about 2 months ago when there were 2 lights in close proximity to each other.  all sightings were in the same general area of the sky, ssw of our home.  after witnessing this third phenomenon, i was unable to explain it away and after reading of similar reports the following day in the local paper, i felt that there may be more to this than i previously thought.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2980,"landingOccurred":false,"latitude":40.7595243,"location":null,"logNumber":"","longitude":-86.3500759,"occurred":1082171700000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1082171700000,"summary":"Saw orange yellow light flash on, off, on and then","tags":["flash","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Logansport, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1145"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Brighton","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Brief description from the typed report, in its original format.\"craft is best described as two semi-circles connected together with a singlebeam.  the rounded edges of the semi-circles were on the outside edge of thecraft.  the craft moved in a perpendicular direction to the beam connecting thesemi-circles.  the craft was totally silent.  only two small white lights werepresent at the semi-circle edges, which neither changed in color or intensity. the under body of the craft is thought to be a light grey.  the velocity oftravel was anywhere from 50-100 mph.  the direction of travel was s-sw to n-ne. the duration of the event was approx. 1.5 min.  no strange effects were felt dueto electromagnetic or gravitation forces.  nothing of an extraordinary natureoccurred except the appearence of the craft.\"","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2979,"landingOccurred":false,"latitude":42.5368873,"location":null,"logNumber":"","longitude":-83.7737214,"occurred":691301700000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":691301700000,"summary":"Dumbell shaped object seen over brighton","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Brighton, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1146"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Evansville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were cooking dinner on the grill outside. three lights appeared in the north sky. they looked like fireballs. they rose one after another, paused, and then disapeared. it was very odd. i'm not a big ufo alien person or anything. but this was definitely a unidentified flying object.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":2978,"landingOccurred":false,"latitude":37.9811192,"location":null,"logNumber":"","longitude":-87.5611498,"occurred":1082169900000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1082169900000,"summary":"Three fire ball like lights in the sky","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Evansville, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1147"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Roma","country":"Australia","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Have been observing these occurances for over 4 mths .Noticed a really brightobject to bright to be a star,saw a light flashing and slowly moving through thesky flashes were 6 seconds apart finally disapeared, then saw a large100footlight come over the horizon about 4 miles away it was only 300-500 metresabove the ground heading in my direction very fast no sounds,i felt fear  forthe first time decided that being closer to town would be safer, have smallamount of footage on dv camera also of the pulsating lights that change colourregularly","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Unknown","formattedAddress":null,"id":2977,"landingOccurred":false,"latitude":-26.5717657,"location":null,"logNumber":"","longitude":148.7904026,"occurred":1082266200000,"potentialRelations":[],"rating":"Unrated","region":"Queensland","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1082266200000,"summary":"Red, yellow, green lights,one low flying fast object.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Roma, Queensland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1148"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bartlesville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was taking a walk in a local park during the first week of december 2003 atabout 6pm when i looked up at the sky. i saw venus in the w sw and mars was s ofme. i looked toward my right and saw what i thought was another very bright,white colored planet. i was curious and gazed at it when a light cloud came infront of it and partially obscured the light. i stood and waited for the cloudto pass but when it did the light was gone. im sure there is a naturalexplaination for this but i dont know what it would be. it was stationary whilei was gazing at it and it could be that i mistook its fading out behind thelight cloud for the light actually travelling away from me. i was calm theentire time and very curious. i was never frightened or nervous but a littleannoyed that i lost sight of it before i could identify what it was.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":2976,"landingOccurred":false,"latitude":36.7473114,"location":null,"logNumber":"","longitude":-95.9808179,"occurred":1070200800000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1070200800000,"summary":"Bright light like a planet","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bartlesville, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1149"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Grass creek or south St r","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were traveling north on state rd. 17.  it was around 8:30-9:00pm on sept. 10th, 2001 which is why we felt fear afterwards because the next day was the 9-11 event.  we were just looking at the sky and a pattern of 6 lights appeared in the air they went out and then reappeared.  they were 3 light and a space and then three lights.  like the 6 on a dice.  then we moved out of view.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Patterned Surface,  Unknown","flightPath":"Stationary","formattedAddress":null,"id":2975,"landingOccurred":false,"latitude":40.5602165,"location":null,"logNumber":"","longitude":-85.5960843,"occurred":1000136700000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1000136700000,"summary":"Lights sighted by many in north central indiana","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grass creek or south St r, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1150"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Star City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Last saturday night at aprox. 10 pm i was walking the dog in front of my house. the dog starting acting like it was scared. it kept looking at the field to the south and trying to pull me north. i thought that it was the power lines in front of the house because they were clicking which i thought was odd because they normaly just buzz a bit. looking up at the power line i seen a bright spot that i thought was mars until it went out. then i noticed what apeared to be a red globe just appear about a mile south in the sky for about 30 sec. then it went out. then another to the left just apeared for 30 sec. then another to the left of that for about 30 sec. then 5 min later several jets were flying around. the jets were flying in circle about 10 to 20 miles. 5 min later the lights in the sky did the same thing. then the jets would come back. then the lights came back on. then jets came back and stayed around for while and i didnt see the light anymore. today on the radio they  anounced the fbi and air force are investigating strange lights in the sky.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":2974,"landingOccurred":false,"latitude":40.9719853,"location":null,"logNumber":"","longitude":-86.5561179,"occurred":1081659600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Saturn-like,  Sphere","source":"MUFON","status":null,"submitted":1081659600000,"summary":"3 red globes","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Star City, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1151"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Philadelphia","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Riding with ssgt mccusker in his car going on a saturday or sunday morning beerrun.  the ssgt loved his beer.  we were taking a short-cut from the navymarinehousing area through the train yards and there was no other traffic that iobserved.I first noticed the object at the foot of a telephone pole and my firstiimpression was that it was a large piece of tarp caught up in one of thosedust-devils.  i could not discern a definite shape.  as i kept my attention onthis object we were approaching from approx. 12 mile away at about 45 mph., itthen appeared to look like a pillow or a lozenge shaped object but it was veryclose to the ground and a lot of dust and haze seemed to be swirling about.  thecloser we got, the more we both knew that this was not a normal event.We slowed our approach and got to within 50 yards and pulled over to the side ofthe road and cut the engine.  we both got out of the vehicle and walked towardthe object until we got to the point where the hairs on our body started totingle.At this point we were about 40 feet from the object and it finally took adefinite shape and color.  it was a disc or saucer shape colored dull grey.  nommarkings or other remarkable features.  it rose to the top of a nearbyhigh-power pylon and hovered steadily above it.At this point, to the best of my memory, a silver rod protuded out of the bottomof the disc and made contact with some part of the pylon for about 2 or 3minutes.  we both had the impression that this object was in some sort oftrouble and was paying no attention to our presence up to this point.After a few minutes, the silver rod was retracted and the object started to risebut hesitated.  it seemed to then notice us and came around slowly and hovereddirectly over our heads.  at this point we were pretty frightened even thoughboth of were combat trained marines, this was really freaking us outit hovered over us about 30 seconds then it began to rise straight up.  it movedfaster than any military aircraft i have ever seen and it made absolutely nonoise as it rose.  my impression was that it was falling upward as if beingrepelled by gravity rather falling down.  but it was much faster than that andwe lost sight of it as it disappeared into a pinpoint in a clear sky.After the experience, we looked at each other and didnt say a word.  we got backinto the car and continued our beer mission.  a few minutes later i suggestedthat we report the sighting to our c.","distance":"20 Feet or Less","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":2973,"landingOccurred":false,"latitude":39.960325,"location":null,"logNumber":"","longitude":-75.155299,"occurred":-34243200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":-34243200000,"summary":"Daytime sighting of grey disk","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Philadelphia, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1152"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in the back yard collecting the cat for the night, i live in a rural areaof england, to the ne of the yard there are open feilds with no street  light,clear enough to see the local village on the horizon some 10 miles away.I first noticed the disc when it appered over the small hill some 50 yards away,i noticed it as it was bright, big and easly seen, the thing was the surroundarea was not lit, the trees to the north were still in darkness as was the largewater tower to the south, both of these are only a few yaerds away from me.When i first saw the object i new exactly what it was, there was no dought.I felt calm, a little excited, i was the only person around which did mean thatthis wonderful disc could see me, i felt as if it know im here dont run. therewas a thumping in my chest, a tingle in my right arm and the start of aheadache.The object, came over the small hill on a slight tilt, as if the front was down,it levelled and hovered, once it was hovering it started to sway a little, thenlowered very slowly to the ground. i would like to point out that i am not sureif the object did actually land, if it didnt it was very close to the ground.When it started to lower the white lights changed to a brilliant light blue. itlanded or hovered for about 30 seconds and then took off again, light blue towhite light,  it slowly rose into the air some 20ft and then shot off at onehell of a speed straight up. i could see the light go, but soon lost it in themix of stars.The reason why i write this, is it was about 11.40pm when i first saw theobject, when i got back inside the house it was 12.50 am. i have had a nosebleed all night, headace and i ache all over.I am not one to make things up, i have better things to do, but i cant explainthis and hopefully you can.","distance":"20 Feet or Less","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary","formattedAddress":null,"id":2972,"landingOccurred":false,"latitude":36.785261,"location":null,"logNumber":"","longitude":-119.4103524,"occurred":1082011200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1082011200000,"summary":"Disc","tags":["disc"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1153"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Los Banos","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"On march 10 at 6pm i was preparing dinner for our family.I took a break and satdown at my desk which faces my front glass doors.I looked outside as i always doand seen a strange light not to far away.I told my husband larry what is that.My3 grandchildren ages 7,5,3 ran out with us.It was very bright and it waspulsating and in the center were these red lights that circled the whole thing.Iran back in and grabbed my camcorder and began filming it.It just sat there inthe same spot and did not move.Shaking from excitment i kept trying to focus thecamera.About 10 or 15 min into filming my camcorder shut off,the battery wasdead.I ran in and slapped the battery on the charger and continued watchingit.About 20 min later i reached to get the battery and looked back and it wasgone.I ran out and saw it moving across the sky towards some foothills near ourhome.It was not moving at a high rate of speed.It took me a very long time to goto sleep that nite and very restless throughout the nite.I waited for the localpaper to come out that week to see if anyone had seen it besides us.No word inthe paper so i called and reported it myself,after a reporter watched the tapehe was shock.After it came out in the paper a ladt called me from across townand told me her and her husband saw the same rging but later that night whilewalking their dog,around 9pm.She said it would move straight up and then downlow,never made a sound and very close to them.She said as they watched it awhileit just disappered right before their eyes.I mentioed it to my grandson teacherand she stated some of the people at her church seen it also.Many of my friendsand family have viewed the tape and many got chills from it.In different partsof the tape if you pause it,it looks as if you can see the outline of the craftaround it.A saucer shape.I got a close up of it and it is like a magnetic arayof colors.I am convinced what i have is a ufo.Also i told the repoter that thesething usually hand around military bases and laughed.He stated to me that therewas a military base in the hills near our town,something i and most do not knowof.I am still looking in the sky hoping i see it again.","distance":"501 Feet - 1 Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary,Other","formattedAddress":null,"id":2971,"landingOccurred":false,"latitude":37.0582786,"location":null,"logNumber":"","longitude":-120.8499151,"occurred":1078905600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1078905600000,"summary":"Pulsating light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Banos, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1154"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Sheridan","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"The evening of april 8th, appx. 1000 p.M. returning home from church with family, heading north on mule barn road, which we live on, about 4 or 5 miles south of sheridan, in. wife and i noticed light on horizon due north. it rapidly changed and enlarged into a horizontal string of six or eight lights, just above tree line, however quite distant.  the spread of lights suggested a large aircraft, however did not act like conventional aircraft.  lights disappeared after only seconds as if turned off or rapidly headed away at low altitude below tree line.  realized instantly this was not typical sky event, eventually called brother, who researched event on computer and found the same type sighting in rochester in. at nearly exactly same time frame.  i subsequently read newspaper article out of the south bend newspaper, to find out many other eyewitnesses.  i find it interesting that grissom afb is directly in between sheridan and rochester. would like to know if it was some kind of military aircraft.","distance":"Over One Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":2970,"landingOccurred":false,"latitude":40.1350375,"location":null,"logNumber":"","longitude":-86.2205487,"occurred":1081486800000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1081486800000,"summary":"Non-typical lites in night sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Sheridan, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1155"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Motueka","country":"New Zealand","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Driving home from work. unusually bright light. plane coming into airport. continued driving looking for light feeling strangely curious and apprehensive. appeared in three seperate locations first to the north then west low over mountains then high out to the east over the sea. drove west and lost sight of it behind hills","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":2969,"landingOccurred":false,"latitude":-41.1240452,"location":null,"logNumber":"","longitude":173.0009842,"occurred":1082081100000,"potentialRelations":[],"rating":"Unrated","region":"Tasman","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1082081100000,"summary":"Large bright white orange light","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Motueka, Tasman","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1156"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Walton","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My husband and i were looking for our dog that had gotten hit by a car.  as we were carrying him to the house that night, we looked up to the sky and two rows of bright orange lights appeared and disappeared. i screamed and then they reappeared in the same place and then disappeared again. it looked like there were two jets flying around them.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":2968,"landingOccurred":false,"latitude":40.6608726,"location":null,"logNumber":"","longitude":-86.24194,"occurred":1081573200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1081573200000,"summary":"Sighting in cass county","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Walton, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1157"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Tues. 413 815 pm we were relaxing in the hot tub when my wife noticed a strangepattern of lights in the north valley sky. she then called our attention tothem. there were 5 lights in a square c shape traveling in unision across thesky from what appeared to be north to east. at my arms lenght the size of thelight pattern appeared to be 2 high  1 wide. we could not judge distance. wewatched the lights continue along the sky for approx. 3 minutes till the fadedor were obscurred by the light pollution of downtown.My wife was scared and her reaction was to go inside, but she was also intriguedby the phenomena. my son  i were thinking of what it could have been.Has there been any other reports of this sighting, if so what, where, and howlong this was really something i cant explain.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path,Unknown","formattedAddress":null,"id":2967,"landingOccurred":false,"latitude":33.4525571,"location":null,"logNumber":"","longitude":-112.0686673,"occurred":1081912560000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1081912560000,"summary":"Square c pattern of lights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1158"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Oklahoma City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I and another gentleman saw thursday morning at 646 am on hiway 3 going towardsokc on route to the va hospital.I was driving some veterans to the va onthursday morning we were heading east on hiway 3 about halfway between the elreno turnoff and the   fourway stop at the peidmont road intersection.I waspaying attention to my driving looking east. i saw a bright light which lookedabout as big as a pea at arms length.The light was bright, white and i firstthought it was the landing light of a jet plane, but it was so low i thought itmight be in trouble.It looked like it was maybe 500 to 600 ft in the air off tothe south east.It was just stationary or hovering and just a continues light.Iseemed to see maybe a small red light on the left back side of it.We watched itfor about 6 to 7 seconds or more and then it just vanished.It was perplexing tome for i tried to rationalize it but it would not compare to anything i couldrelate to except a landing plane, but it was over an empty field.Im hoping for alogical explanation for it, but for now i say its unexplained. john clem","distance":"501 Feet - 1 Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2966,"landingOccurred":false,"latitude":35.4713202,"location":null,"logNumber":"","longitude":-97.5089076,"occurred":1081431960000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1081431960000,"summary":"Light sighted off hiway 3 going to oklahoma city","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oklahoma City, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1159"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Montverde","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Carla and i were walking our dog who began barking and straining at the leash tothe sight or sound of the object.  i was stunned by the sight and size of theobject, carla became afraid.  we were both a bit spooked afterwards. a largebulbous metallic object that came straight towards us, brightly lit white anddimming to a violet color with a reddish aura that could be seen as ifbleedingreflected in nearby clouds before it veered sharply left and peeled offuntil we lost sight of it at a treeline. moments later and from the north 3 ormore aircraft arced overhead.  we never see more than 2 aircraft in flighttogether here, so that was almost as unusual as the object itself, but not quiteas surreal. we do not wish to be identified as we saw what happened to ourneighbors when they reported a ufo.  please respect our privacy.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":2965,"landingOccurred":false,"latitude":28.6002769,"location":null,"logNumber":"","longitude":-81.673964,"occurred":1081835820000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1081835820000,"summary":"A thick crystaline color of bleeding light","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Montverde, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1160"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in the basement when my dad and sister called me because they sawsomething in the sky. i went out and saw something glowing in the sky. my dadthought it was a blimp at first. i believed it to be a ufo. my sister called outmy brother and my mom. the object was glowing on and off. but, when a helecopterpassed by, the object turned black and seemed to release some sort of blacksmoke. when the helecopter left it resumed glowing. my brother had the digitalcamerea but was unable to get it on the screen. i ran inside and grabbed thecamcorder and started recording. the object was slowly moving east, and all thewhile it slowly stopped glowing and started turning completely black. i thenlost sight of it. then my sister gave me the tripod. i found it again and it wasmoving quicker in the southeast direction. i lost sight of it when a houseobstructed our view of it. my uncle had come out during the last few minutes ofit and saw the it.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":2964,"landingOccurred":false,"latitude":34.0549642,"location":null,"logNumber":"","longitude":-118.2418449,"occurred":1081778700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1081778700000,"summary":"Saw glowing object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Angeles, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1161"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Calhoun","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was out side looking  at stars and planets thru my telescope. i had  weirdtingling sensasiton i looked up and saw a large floating object  just above thetree tops  , i thought it was a helocopter  the i noticed  there was not  anynoise.. i wasnt scared at all it just kinda took my breath at first i was  inamazement. it was moving  very very slowly  towards  the small sown   and therewas like  a beam comming out of it  like a search light  a real bright bluelight it move  over  town  i watched it  till it went over the  other side of amountain...","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":2963,"landingOccurred":false,"latitude":34.502587,"location":null,"logNumber":"","longitude":-84.9510542,"occurred":1083821400000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1083821400000,"summary":"Large  triangle shaped craft","tags":["floating"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Calhoun, Georgia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1162"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Grand Falls","country":"Canada","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were driving south on the trans canada highway at the speed limiti first noticed the object because of the lights on itat first i thought that it was a building cranewe stopped the car and got out of the car to look at itit was hovering on the left side of the road about a quarter mile up and aquarter mile away it made no soundit was parallel to the highway then turned perpendiclar to the highway  thenslowly drifted above us then rapidly disappeared beyond the horizon","distance":"101-500 Feet","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2962,"landingOccurred":false,"latitude":47.046405,"location":null,"logNumber":"","longitude":-67.74045,"occurred":362030400000,"potentialRelations":[],"rating":"Unrated","region":"New Brunswick","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":362030400000,"summary":"Grand falls new brunswick","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grand Falls, New Brunswick","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1163"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Santa Clarita","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"As i frequently do, i was undertaking astronomical observation. the night inquestion, i was doing some casual observation for nebulae with a small 80mmscope and a uhc filter on an altaz mount. at the time of the incident, i waslooking at mizar in ursa major.I looked away from the scope and turned eastward. thats when i noticed thatthere was a star that had suddenly appeared. this star was approximately 1.7 to2.1 degrees se of jupiter and shined a steady orange with about the samemagnitude and apparent size as jupiter. i thought to myself, goodness, therestwo jupiters this object was stationary for approximately two to four seconds. ihad enough time to look at jupiter, look over to sirius in the south, and lookback just to verify that this object came out of no where. the altaz location ofthe object at first sighting would have been approximately alt 158.17  az 58.40with a right ascension  declination of 1053  04.07 .The star began to move and hook down around and below jupiter. specifically,this object dropped approximately 14 degree eastward, changing directionnorthward as it hooked around. it traveled northward for approximately five tofive and one-half degrees. the object slowly faded from its steady orange colorto dark.If its of any interest, the dogs in the neighborhood were suddenly barkingexcitedly. i hadnt noticed this barking prior to this sighting.Fyi - i have made one other mufon report about a year ago re a cylindricalobject sighted over the same region during the day. at the time of beinginterviewed, i related an incident that occured in approximately 1977 when i wasa child in westchester county, ny where i had observed a group of orange lights.To the best of my recollection, this orange light was similar - however, furtheraway - than the westchester sighting.Being a rather serious amateur astronomer i have some real serious equipment andinterest, i am very attentive and rawther knowledgable with regard to the skies.I had not had anything to drink more than 24 hours prior to this sighting and ido not take prescription drugs or any other drugs. i simply dont drink when imobserving.I wear a -2.0 corrective lens, which i was wearing at the time of theobservation. i have very good eyesight when i am wearing my glasses. forexample, with seeing that astronomers might regard as a 52","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":2961,"landingOccurred":false,"latitude":34.3986741,"location":null,"logNumber":"","longitude":-118.540786,"occurred":1081655280000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1081655280000,"summary":"Sizable orange anomaly se of jupiter at 848pst 041","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Santa Clarita, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1164"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bangor","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My daughter and grandson who was only 3 yrs old at the time were going to thebangor mall to shop.  we left the house at about 800 pm.  when we turned ontoroute 9 in eddington i noticed 2 round lights in the sky about 2-3 miles awayand approx. 200 feet in the air.  i watched the objects and they seemed totravel along beside us at the same distance until we were into brewer.  i toldmy daughter that we should go and sit someplace and watch these objects, becauseit is hard to tell what direction they are traveling when you are not in astationary position, so we went to service merchandise on the bangor mallboulevard and we sat and watched lights travel in a straight line, which lookedas if they were following i-95 towards newport, me.  this was about the timethat a lot of sightings were reported in that area.  the objects were travelingjust above the horizon so we could see them clearly.  when they reached what ithink was the newport area,  one of the objects decended and the other objectkept going south for about 2 minutes, and then it turned and started back,  whenit started back the first object, which had decended, started back up to meetthe second object, and then they started back towards bangor. within a couple ofminutes we lost sight of them because of some trees that were in the way of ourview.  we drove to stillwater ave. to see if we could spot them again but wecould not find them again.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2960,"landingOccurred":false,"latitude":44.8072321,"location":null,"logNumber":"","longitude":-68.7729838,"occurred":704682000000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":704682000000,"summary":"I saw 2 lights in the sky flying side by side","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bangor, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1165"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Brewer","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were driving out route 9 in brewer, me. at about 1000 pm. four of my fivechildren were with me ranging in age from 16 to 7 yrs of age.  i just happenedto look towards the woods  looking over the rooftop of a small house,  and atfirst i didnt notice anything unusual but i took a second look and saw a verylarge object just hovering over the tree tops.  i stopped the car in front ofthe house and opened my car door and got out and looked over the roof of the carto get a better look.  the object was at least four times larger than the housewhich it was behind.  i saw what looked like portholes at the bottom of theobject,  although i am not sure if they were portholes or lights around thebottom,  because my children were all screaming for me to get back into the car,which i did.  i was hoping another car would come along, but there was not a carin sight and there were no lights in the house.  i started to leave and we hadgone about 310 of a mile when my oldest son 16 yrs.Old  said holy,  i asked himwhat was wrong and he said he was looking out the back window and saw a brightball of light going faster than anything he ever saw, shooting up the penobscotriver towards old town.   when we got home i wanted to call and report it but ididnt know who to report it to.  i have told only a few people about thisoccurence.  i was listening to coast to coast on 103.9 fm and the guest that wason that show last night,  i cant remember his name said to report any sightings,no matter how long ago the incident happened.  so i thought i would send it toyou.  i also have another incident that happened in 1992 i am not sure about thelattitude and longitude.","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary","formattedAddress":null,"id":2959,"landingOccurred":false,"latitude":44.7967378,"location":null,"logNumber":"","longitude":-68.7614246,"occurred":340264800000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":340264800000,"summary":"Saw a very large object hovering at tree top level","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Brewer, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1166"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Toronto","country":"Canada","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I noticed this weird thing in the sky that i assumed was a jet or even theevening star. but it was moving slowly from nw to w and then it stood still inthe sky and when i came inside it was still there. it kinda seemed to changeshape more than once at least 3 times and when i left, had maintained shape of asphere comprised of flat plates of...Something. the light was shining throughmost of this thing, but there were clearly designed strips betweeen lights ofwhat i assume is metal. the thing also appeared to be emitting some kind ofparticles or beams or perhaps its a space lifeform and it was a tail of somekind  from its base. slightly angled to my right when i look up and to the west.45 degrees roughly, i suck at math sorry. i have no phone so email me asap. wowthis is cool if theyre friendly, even if theyre not, this is a momentous day formankind.","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":2958,"landingOccurred":false,"latitude":43.655186,"location":null,"logNumber":"","longitude":-79.3749443,"occurred":1081524600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1081524600000,"summary":"Not a star, not a jet, but something strange over","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Toronto, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1167"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hanalei","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was on the beach at hanalei, kauai at 1030pm at night with my dog haupia. isaw a lit object coming over the princeville hotel that looked unusual, nosound. in my mind i said well if youre a ufo. lets have a little light show.The object stopped in mid air and for 15 min. gave the most beautiful light showi have ever seen. then it stopped and dropped down lower into some sparseclouds. i then saw it was lower and headed directly towards me. the hair rose upon my neck and i said mentally, im not sure if i want to go for a ride as yet3e the object was a squashed oval with a small white light at its flat blackbase. it was a  burnt orange color with a grey glass window at the center. likea huge orange dounut with grey glass at the center. it had small preforatedholes all over it, which i assume was where the light show came out of. theexterior looked burnt. it remined me of an ancient hawaiian warriors helmet andwas totally silent. it flew right over my head at treetop level. it headed intohanalei and up towards the mountians. ads if to say goodby, it gave me a little10 seconf light show just after it passed over my head. there were lights fromthe street lights so i could seeit very clearly.I was working at zelos resturant and when i mentioned it 2 people said they sawa light up on the mountains that evening.","distance":"21-100 Feet","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":2957,"landingOccurred":false,"latitude":22.2033221,"location":null,"logNumber":"","longitude":-159.4977455,"occurred":772997400000,"potentialRelations":[],"rating":"Unrated","region":"Hawaii","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":772997400000,"summary":"Swa multi colored light show and oval object flew","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hanalei, Hawaii","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1168"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Salol","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was about 11 pm in mid-june, 1979.  i do not recall the exact date.  also,the latitude and longitude are guesses using internaitonal falls, i do not knowthem for rosea county, mn.  there was a gentle breeze and a moonless, but clearnight.I was standing at the eastern edge of my dads farmyard getting some air after acard game. our land was located about 17 miles east of roseau, closer to salol,hemmingson farm. i happened to look at the ditch grade on the field east of ourland, owned by one billy hagen, and saw this thing.  i thought plane orhelicopter, but it was silent.  then this crickets went quiet, too.  i feltextreme wonder and no fear.  it moved towards me for some time, then stopped,and moved left.  then right, with no verticle movement.  it was small, and lowerthan tree top level. the lights pulsed in a circular fashion and i think it wasround, like a sphere judging by those lights.  for a while it sort of hungthere, and at no time did i feel anything but wonder and awe.  then it suddenlyshot way upwards, and disappeared over the western horizon, so fast i couldhardly turn my head to see it sreaking off in a flash of light and sinking downwestward. i must have looked a bit odd because when i told my dad id just seen aufo he came right outside and stood there with me as i told him about it. numeorus reports had been made in roseau in the summers before this one.  ireport it now at the encouragement of a counselor who works with abductioncases, and knows some the roseau county reports.  i met him at a conventionrecently, and he suggested i write.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2956,"landingOccurred":false,"latitude":48.86047,"location":null,"logNumber":"","longitude":-95.59346,"occurred":297064800000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":297064800000,"summary":"Saw a small silent multi-lighted object, close and","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salol, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1169"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Clearwater","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"March 14, 2004 st. petersburg fl....At about 1100 pm i went out on my 3rd floorbalcony and looked up at a some what hazy night sky. i was facing to the west.All of a sudden a fuzzy round light about the size of a basketball appearedabove the tree tops and seemed to be bouncing ping pong fashion in a straightline from south towards the north it was quickly followed by two more of thesame lights that also just appeared and then went on in this bouncing manner. icontinued to see these three lights until i could no longer view them becausethe building blocked my view.I ran thru my house to see out of the northern window but they were gone.","distance":"101-500 Feet","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":2955,"landingOccurred":false,"latitude":27.9669533,"location":null,"logNumber":"","longitude":-82.7948626,"occurred":1079506800000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1079506800000,"summary":"Strange lights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Clearwater, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1170"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Norridge","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My mom and i were driving from my place of work, past my grandparents house atabout 9-10pm en route to get supper.  i just happened to look up in the sky andi saw an orb of light ahead of us, to the south, just behind some trees leavesdid obscure part of the view.  the orb dipped in a semi-circular arc - just likea u as it moved to the left eastward.  i alerted my mom, and she looked up intime to see it shoot off to the east.  this all happened incredibly fast - onlya few seconds.  when i first saw it, i had no idea what it was - i only saw itdipping.  nothing i know of moves like that.  i was pretty excited to have seensomething so fascinating, but because of the trees obscuring the view, i didalways have some question as to whether my eyes were playing tricks on me. still, there were no street lights that could have produced the effect, and idont know of anything that would move in that manner or speed.  it was verystrange.  we lost sight of the object behind the leaves of the trees.  uponemerging, we searched the skies but could see nothing.  it was a bit cloudy outthat night, so it may have disappeared behind a cloud.  its been close to 11years since the sighting, but i still remember it vividly, and there really isnothing i can come up with that might explain it.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2954,"landingOccurred":false,"latitude":41.9633641,"location":null,"logNumber":"","longitude":-87.827284,"occurred":749372400000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":749372400000,"summary":"Fast-moving orb","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Norridge, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1171"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chattanooga","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I am a commisioned law enforcement officer, on duty. i stopped at taco bell toget lunch. while placing order at drive thru there were two sharp, loud boomswhich shook my patrol unit. i then spoke with other units across the county whofelt and heard the same. there were several high altitude, 30,000 ft, militaryaircraft in the area, but no visible supersonic capable craft. i then stopped invacant parking lot next door to eat. this location is on a hill with no barriersto block view. i then looked up to the northwest and saw a small white objectthat appeared to be falling. i thought at first that it may have been apartially opened parachute. i got out my binoculars to see the object. what isaw was like a long white tube with rounded ends. at first it kind of see-sawedback and forth like a leaf falling, but suddenly one end seemed to take controland it began to make loops with the whole object bending as it moved. it wouldgo vertical then horizontal, also as the object made turns it reflected thesunlight like a piece of metal even though the object was white. the objectnever lost any altitude or drifted. i estimate it was about 3,000 feet out and1200 - 1500 ft high, with the object being 50 - 60 ft in length.The last sighting i had of it, the object turned up vertical and began to climbhigher very fast and then disappeared completely.","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2953,"landingOccurred":false,"latitude":35.0456297,"location":null,"logNumber":"","longitude":-85.3096801,"occurred":1081275300000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1081275300000,"summary":"Balloon shaped object over chattanooga, tn","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Chattanooga, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1172"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Munster","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I took my dog outside to go to the bathroom and i noticed a very bright largelight in the western sky. when my dog took note of it he raised his hackles. iremained stationary, and is still there 12 am hour later. any information youcould provide would be helpful. i have 3 digital pictures of the object that ican provide if needed.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":2952,"landingOccurred":false,"latitude":41.5644798,"location":null,"logNumber":"","longitude":-87.5125412,"occurred":1081225440000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1081225440000,"summary":"Saw a bright light in the western sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Munster, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1173"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St Petersburg","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving home from work on saturday evening. i drive from tampa to saintpetersburg which is a westerly path. i had noticed the moon rising in the eastwhen i left work at approximately 1800. the weather was cool and clear and thesky was blue and cloudless.While crossing the howard franklin bridge which joins tampa to st. pete, i waskeeping an eye toward the sky to my left over macdill afb which is south of thebridge and on a peninusula on the south end of tampa. there was an airshow thisweekend and i thought i might be able to see an interesting plane or part of theair show. i have lived in or near bases all my life as my father is retired airforce, my ex-husband was in the air force for 12 years and my daughter is now inthe air force. i know many types of planes by sight and sound. i was a bitdisappointed as i only saw one plane in the sky which looked like a commercialairliner, complete with contrails. the tampa airport was behind me to the nne.I drove on i275 across the bridge, heading sw i exited on the 118th street exitwhich placed me due west again. at this point it was around 1845 and the sun wasstarting to touch the horizon. thats when i noticed what i first thought wasvenus which ive seen on most nights when im driving home but about 3 times thesize. i thought it odd to see it when it was still daylight, but convincedmyself thats what it must be. it didnt twinkle or strobe, it was just abeautiful white orb about 12 the size of a full moon high in the sky. at thispoint i was pulled over on the side of the road so i could watch it. it slowlystarted to change shape, going from round to oblong. this seemed to be happeningas the sun was setting lower in the sky. the final shape was almost triangularbut with softer corners.  as the sun went below the horizon, the light fadedrather quickly then nothing but blue sky. i guess it was the sun reflecting onsomething.Ive not experienced anything like this before, other than an odd dream mydaughter and i shared back in 1992. i hope others saw the object.","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2950,"landingOccurred":false,"latitude":27.7814656,"location":null,"logNumber":"","longitude":-82.63269,"occurred":1081046700000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1081046700000,"summary":"Strange object at sunset","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"St Petersburg, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1174"}],"last":false,"totalElements":82762,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2664}
