{"content":[{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Sioux Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" as i got over the bridge, the lights that i was flashing at to lower their high beam lights, moved off to my right and hovered over a barn that was about 300 feet away. as i got over the bridge i realized it wasn't a car moving to the right. it was about 50 foot off the ground above the barn with a ton of lights around it's oval shape, with some acting like headlites on a car. underneath there was green and yellow lights rolling much like a barber post goes around but going in a circle. as i got across the bridge i stopped on the side and got out to look at what ever it was. it hovered there for about five seconds and then in a blink it moved to the northwest part of sioux falls about 5 miles away. i had my girlfriend and another female friend of her along when we saw this. it happened so fast that no one really got afraid of what we had just saw. the next day in school talking with a friend of mine whose father was in the police department then about what i saw, he mentioned that the whole police department was chasing around the city trying to figure out what everyone was seeing.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":66088,"landingOccurred":false,"latitude":43.5039497,"location":null,"logNumber":"US-06032015-0011","longitude":-96.749296,"occurred":-107899200000,"potentialRelations":[],"rating":"Unrated","region":"South Dakota","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1433347976000,"summary":"Coming over a bridge, i flashed my lites for on coming traffic to lower their lites","tags":["flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":17838,"locationName":"Sioux Falls, South Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31447"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Dear,\r\n\r\nthe photo i'm sending you was taken on 5-11-2014 from a cruise boat sailing to the north on the hudson river west of manhattan. the photo was taken in a north-east direction towards approximately central park.\r\n\r\nwhen you do enlarge the photo, you will notice little white flatted dots in the sky above the buildings on the photo. they appeared out of the blue, clockwise forming a sort of stretched circles (one dot after another) from the south to the north. one circle after another. every circle consisted of about 11 dots. being bright at first they slowly faded afterwards. as you can see on the photo. the last formed dots on the left side are much brighter than the older dots on the right side of the photo.\r\n\r\nat little earlier there were two chinook helicopters flying very low over the cruise boat to the south. some what later we saw seven chinook helicopters flying to the north..,\r\n\r\nwhat did we see?","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":66087,"landingOccurred":false,"latitude":40.718473700000004,"location":null,"logNumber":"US-06032015-0010","longitude":-73.99727130000001,"occurred":1399844100000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1433347761000,"summary":"White dots appearing in the sky","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66087_submitter_file1__newyorkmei2014131.JPG"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":387,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31448"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Saint George Island","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My family and i were setting on a couch facing the ocean watching tv.I happen to observe what looked to be a row of very bright lights in a staircase  arrangement .\r\norange yellow color .Lasted for a very short time seemed to have gone away as fast as it appeared.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":66086,"landingOccurred":false,"latitude":29.62802349939215,"location":null,"logNumber":"US-06032015-0009","longitude":-84.95937826717538,"occurred":1433308200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1433347004000,"summary":"Row of lights, looked like fireworks. it was not. a stran very large ,way off ,did not last long","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"32328","daysBetweenOccurrenceAndSubmission":0,"locationName":"Saint George Island, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31449"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Ixworth","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was doind maths, my radio bugged out, i thought it was my nan at first but it was more round than her, it moved in a circle, with a... thing on it, i was freaked out, then it ascended, and went north, my friends(imaginary) saw all of it","distance":"20 Feet or Less","duration":"00:05:17","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":66085,"landingOccurred":false,"latitude":52.29966169999999,"location":null,"logNumber":"GB-06032015-0008","longitude":0.8337756,"occurred":1421468280000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1433342747000,"summary":"I was doing my nerd business and saw it.","tags":["none"],"timeZone":"MET","timeZoneName":"MET","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":137,"locationName":"Ixworth, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31450"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Harrogate","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I can not remember the exact time and date but it was the middle of winter in the late 70's around 6pm.\r\ni was on my way to cubs and with it been winter it was dark,i was about 10 at the time. because it was dark and i was young my brother came with me to the bus stop. while we were waiting we noticed something coming over the trees to the north of us. the object flew right over our heads at a slow speed, we were on top of a hill and my village was below.\r\nthe object kept the same hight and did not follow the contours of the land. it carried on in a straight line until it got to the other side of the valley where it seemed to hover for a short time and then it shot of at an incredible speed at about a 45 degree angle and was gone. \r\nmy brother is a few years older then me but since the event he would not really discuss it with me.\r\nwhen ever i bought it up he would just say it was strange and not discuss it further.\r\nat the time of the sighting the only thing i could relate how it looked was to compare it to the roof of the speedway or waltzer that visited the annual show.(this is because of all the lights underneath).     ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None, Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":66084,"landingOccurred":false,"latitude":53.99212,"location":null,"logNumber":"GB-06032015-0007","longitude":-1.541812,"occurred":281412000000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1433335180000,"summary":"While waiting for a bus my brother and i witnessed a saucer shaped craft that flew right over our heads and then shoot off at an incredible speed at about 45*.","tags":["saucer"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":13332,"locationName":"Harrogate, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31451"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Hayward","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on an ifr flight plan and in contact with atc the entire flight. i was about 60-70 miles east of hayward ca at 10 and given pd to 6k through 8.5 i noticed a greenish ball of light pop up from the layer that was at 6k it seemed to be 1000 yards to my 11 oclock. it rose to my altitude and stopped. and it appeared to be pacing me. 30 seconds later a second one popped up from the cloud layer. it stopped next to the first one.Then the lights started to move up and down and left to right then 15-20 seconds later vanished, on to appear about 50 feet off of the nose of aircraft. they started the same movement for 30 seconds and in a blink were gone. i then call atc and reported and asked for any other targets, i was told they were not seeing anything, just as i stopped talking i look out to my left wing and there is an object or craft right next to my wing, and to the right another, and they were not feet away but inches. i had allready turned off all interior lights and exterior to verify to my self i was not seeing any type of reflection. there were at least 4-6 and i took 2:34 of high def video and capture at least 30 frames of something i dont think has ever been seen before. this is not a hoax or any way a joke. the objects paced me and stayed in my plane view hovering me while i was setting up for an approach into hayward. the story is amazing and lasted just over 10 minutes. i feel very lucky to have seen this in my lifetime and will share it but swant to speak with some one first. i have the video and applied for a copyright. also have council. i am having the video enhanced by a lab and should have the enhance version by the end of the week. if this does not prove to who ever that we are being visited by something not of this planet i dont think anything can.The amount of things i watched was amazing. these objects were quiet did not produce any upsetting wake and believe me they passed feet in front of me multiple time at speeds i would guess  over 2000kts. i have on video one object starts at a what seems to be a stationary position and there is a small fla\r\nsh then two steaks right across the nose of the plane and it is only in a single frame for .1000 of that single frame. the camera was a basic samsung s3 recording in high definition at 30fps.There is more but i would rather talk to some one. i ask the pictures not be  shared yet. the faa has spoken with me also.","distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface, Other","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":66083,"landingOccurred":false,"latitude":37.673820500000005,"location":null,"logNumber":"US-06032015-0006","longitude":-122.0763264,"occurred":1429698900000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1433326179000,"summary":"Flying a cargo run from van nuys to hayward and had objects pace me ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66083_submitter_file1__118135342.jpg","http://www.mufoncms.com/files_jeud8334j/66083_submitter_file2__Snapshot4.png","http://www.mufoncms.com/files_jeud8334j/66083_submitter_file3__UntitledCapture32copy.jpg","http://www.mufoncms.com/files_jeud8334j/66083_submitter_file4__snapshot009.bmp","http://www.mufoncms.com/files_jeud8334j/66083_submitter_file5__snapshot008.bmp"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":41,"locationName":"Hayward, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31452"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less, Over 500 Feet (no cloudcover)","city":"Las Vegas","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Im usually out and about late night early morning hours.Beating the heat and the traffic. i observed the tiny 3 light triangle around 2am mid may 1995. i didnt really pay much attention to it thinking it was likely a stealth bomber from nellis as ive seen them through the years. next day was running around town looked up and there it is again 3 bright lights the size of a bb.I thought wow they are still flying around up there. i was thinking if airliners fly around 45kft this thing was likely around 120kft.Next night i happen to look up again and see that it seems to be following with me from one side of town all the way to the other. thats when i started getting concerned.Why would this thing be following me around.So next day i went around to a couple friends homes and asked what they thought it might be. they were as perplexed as i was. next night early morning hours i decided i was going to get to the bottom of it.So i drove from the rio headed nw towards mt charlston.Long story short this boomerang did not like me pointing it out to people and the more i paid attention to it the more it was drawn to me. finally it decended dawn to about 500 ft at 95/cheyenne and let me know.Hey we are here and theres no getting away. i looked directly at the bottom of it as i was speeding down the freeway . it was flat black with rounded edges similar to a nerf boomerang.It piveted and started heading south on cheyenne.I was thinking my best option would be to head down east on craig to nellis air force base las vegas blvd. we have a storage yard out by were the new speedway is now. i turned left on  lvblvd headed out north were all the junk yards are and suddenly just like you see in the movies all my gages are going crazy.I finally made it to our storage yard and then the fun  began. wet flaky crystal circles,glowing plasma ball with a light feeling over cars and trailers until it found me.I was definately being hunted.Weird thing was nellis airforce base surly had to see this thing but did nothing.   sorry for the bad grammar go to head to work.     ","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":66082,"landingOccurred":false,"latitude":36.1743812,"location":null,"logNumber":"US-06032015-0003","longitude":-115.1363896,"occurred":799225200000,"potentialRelations":[],"rating":"Unrated","region":"Nevada","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1433321593000,"summary":"I observed a triangle for 3 days. day and night.It was the size of a small bb.It was triangular with 3 bright lights.  ","tags":["triangle","lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"89031","daysBetweenOccurrenceAndSubmission":7339,"locationName":"Las Vegas, Nevada","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31453"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Yonkers","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was in the early 80's when i was a kid i was walking home from my friends house that lived two houses down across the street from me i was walking home across the street and as i was walking on the street and i heard a humming sound it sounded like womm womm womm it was a sound that i never heard before and i will never forget i stoped and i was looking around and i didn't see anything until i turned around i look back above my friends house a massive round ufo was hovering over the house and it look like it was on top of the house like it was going to land on it it was way bigger than the house and i was amazed by what i saw and i felt like it was watching me and when i was staring at it there was lights that were underneath the craft more like looking on the sides in a round circle of the edges and the strange part about it was i saw lights the lights were not reflecting down on the ground or the surrounding houses but going around on the side of the craft in circles the bottom part of the surface of the craft it was so smooth i like metallic like it was weird but amazing at the same time it was like a circle in a circle the first part of the circle of the bottom of the craft was like a dull metal but the inner circle with the metallic color it almost look like it was liquid i know it's kind of weird but its hard to describe what i saw but it was something unique i was amazed at what i saw and i started walking back towards my house and as i was walking towards my house the ufo started following me and as i was walking faster and faster the craft was moving along with me i started to run in amazement running in my house saying mom mom there is a ufo outside there's ufo outside as i was running through the front door into the living room into the kitchen where my mother was doing dishes i was telling her to come outside to see it she was saying to me yeah right frankie yeah right i said for real mom for real and as i was saying that i was running out the back door of the porch as i open the door and ran out i saw the craft as i looked up and it was just standing still hovering on the left side of the porch and then a matter of seconds it it was like the craft backed up and then warped away leaving the streak of light and disappeared into the sky.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change","formattedAddress":null,"id":66081,"landingOccurred":false,"latitude":40.93975566331548,"location":null,"logNumber":"US-06032015-0002","longitude":-73.90372426432516,"occurred":331196400000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1433321403000,"summary":"It was dark i was walking on the street i heard a humming sound i looked around and then up in the sky and as i turned around over my neighbor's house a huge round massive ufos was hovering over it i was amazed by it as i was walking it was following","tags":["ufo","lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"10703","daysBetweenOccurrenceAndSubmission":12756,"locationName":"Yonkers, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31454"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Prince Albert","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me n two friends were outside while looking at the full moon we see a bright white light glow in front of our eyes as we watch fly from west to east it took about 2-3 minutes. unexplainable. so one buddy stopped looking n i was somewhat still looking in the sky n my last friend was so positive n called out \"what if a jet comes behind him in the distance, following him.  the fighter jet was alot slower.  following the ufo sighting.Most crazyiest sighting ever.  i tried to contact airport.  ","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":66080,"landingOccurred":false,"latitude":53.2090494,"location":null,"logNumber":"CA-06032015-0001","longitude":-105.7441905,"occurred":1433307900000,"potentialRelations":[],"rating":"Unrated","region":"Saskatchewan","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1433320450000,"summary":"Me n 2 friends seen a ufo n getting chased by a fighter jet.  wow ","tags":["ufo"],"timeZone":"America/St_Johns","timeZoneName":"America/St_Johns","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Prince Albert, Saskatchewan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31455"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Siesta Key","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My boyfriend took this video  6/1/15 on siesta key beach. we saw lights that we aren't sure what they are. we contacted the local news station and they referred us to you.\r\n\r\nwe have seen similar lights before and would really like to know what they are. \r\n\r\nif you want you may contact him at  [phone and email removed/cms/tg]\r\n\r\nthese are the videos that we took. we do have a couple more videos and pictures. \r\n\r\n\r\nwe originally pulled over because we saw a light from the road moving from the north to the south. it looked like a fire ball. there were several other people in the parking lot that saw this as well. there was no noise and the center mass looked like it was glowing red/orange like a fire. it wasn't a plane or helicopter.\r\nwhen we went out onto the beach we noticed two more from the south moving north then up into the clouds. this was before the storm started. when we contacted the local news station we were told that they had not yet received any other reports that night, however they have had a lot of reports of strange lights over the area. nobody else has sent in any kind of video feed. they called us back on 6/2/15 and advised us to contact other agencies, news outlets, etc... to try to figure out what they were. they did have their expert go over the video and know it was true footage.  what you see in the video is from a phone camera. it still does not fully show how the lights appeared to the naked eye. \r\n\r\nif you have any explanation for these lights, or hypothesis of what they could be, we would be very interested to hear from you. or if you have any suggestions on who to contact to get answers we would love to hear from you. we have the video uploaded on youtube under '[you tube title moved to fi section/cms/tg]]\"  or try [name redacted/cms/tg].\r\n\r\nthank you, \r\n\r\nanita  and august ","distance":"Unknown","duration":"00:20:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path then hovering","formattedAddress":null,"id":66079,"landingOccurred":false,"latitude":27.2669722,"location":null,"logNumber":"US-06032015-0001","longitude":-82.54634399999999,"occurred":1433142000000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1433319561000,"summary":"Strange fire like lights flying over siesta key","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Siesta Key, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31456"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Clarksville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I belevie in 2006 i was abducted by extraterrestrail in clarksville,tennessee in the early morning hours of early december. around 3:30 or 4:30am i was asleep in my room then awoke suddenly with a strong urge to get up and go smoke a cigarette in my garage. but when i got closer to the garage door i heard a voice in my head say \"you need to go outside\" so, i said speaking upon what i just heard \"your right let me go outside\" so as i stepped out the door i noticed that the sky was crystal clear it appeared as if every star in the sky was visiable. as i looked to the left i saw what appeared to be something like a rainbow it was purple and pink and it sat right above a tall tree in my neighbers back yard. it looked like a snakes body when it slithers so i said to my self what is that i've never seen that before. then i looked off to the right of me still scanning the sky hoping i would see a ufo but i didn't so i turned back to look at the strange colors and as soon as my eyes locked on the colors a cirlce/oval ball of light surrounded by a green and blue gas or plasma subtance shot out \r\nand made a complete stop and hovered for app 10 seconds and started to move really slow for about 7 to 10 seconds before shooting off in super sonic speeds without makin a sound and left behind 6 circles that look like smoke rings with lines in between each of them. as i turned my head the object appeared to be coming back in the oppsite direction except this time it appeared to be far out with the stars and traveled out as far as i could see within 5 seconds so by this time i was crying like a baby because i couldn't belevie what just happen to me so i stepped up on my stairs to the house and looked up to the sky and asked \"god if that was meant for me and if you meant for me to see that would you please show me another sign? and as soon as i said that a ball of light flew right over my house lower than the ufo with noun of the ufo characteristic except for how bright and illuminated they both were and i was in even more shock and couldn't handle it any more so i went in my room and layed down i felt such a sence of peace that i blacked out sayin oh my god oh my god. then i woke up the next morning looking around not yet realizing that i was in my room then while i was in the shower i felt a bump underneath my right arm pit. it went down two years later but the mark is still there goin on 9 years now and it appears as if i was burnt by a lazer or injected with one of the same objects that dr. roger leir was studying but it has never caused me any discomfort. all i want is some help so i can understand what happen to me that night. this is my honest to god truth and im seekin help. i also have a picture of the mark under my arm and two picture's i took of a ufo on my birthday march 27 of 2009","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None, Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":66078,"landingOccurred":false,"latitude":36.56236021677199,"location":null,"logNumber":"US-06032015-0001","longitude":-87.3782138253913,"occurred":1165231800000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1433318785000,"summary":"Ufo comes out of portal ","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66078_submitter_file1__image.jpg"],"weather":null,"zipcode":"37042","daysBetweenOccurrenceAndSubmission":3102,"locationName":"Clarksville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31457"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Peterstown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out side playing catch with my son, i threw the ball up high to him and he didn't catch the ball, he just stared at the sky. then he said \" look daddy\" then pointed up at the sky. i turned around and see what looked like three orbs of lights in the sky. at this point i was in disbelief and complete utter shock. i stared for a good 3-4 minutes before i yelled to my wife to come here.  she came out thinking my son was hurt ( because of the ergency in my voice) she ran out and i said look! ufos! we stared in disbelief.  then it hit me. i told her to run in and grab my phone, i was going to try and video it. well i did. unfortunately my phone would only pick up one of the ufos. before i shot the video there was a forth one that appeared.  so now there's four in sky. two were white pulsing orbs that remain stationery and a blue and a red one. the blue and red one were the ones that did all the moving. very slowly, and then changed colors every so often.  but the colors were so vivid it was unreal. about ten minutes go by and the clouds rolled in to finally hide them.I was shocked and my heart literally dropped.  it was kinda frightening and very exciting at the same time. i also noticed when the red and blue one pulsed you could see a black structure between each pulse. it was very strange. im still in shock","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Path then hovering","formattedAddress":null,"id":66077,"landingOccurred":false,"latitude":37.4006437,"location":null,"logNumber":"US-06022015-0026","longitude":-80.7968331,"occurred":1433301000000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1433313866000,"summary":"4 orbs in the sky two were white one was red one was blue","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66077_submitter_file1__20150602200747.mp4"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Peterstown, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31458"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Front Royal","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at a wedding reception in front royal and upon leaving the holiday inn express noticed the sunset. i turned toward the mountains and took a photo of the sunset. later as i reviewed the reception photos i saw something in my photo of the sunset. i am sending the photo that shows an object over the mountains. check it out, and let me knowwhat it is in the pphoto.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome, Window(s)","flightPath":"Straight-line path,Other","formattedAddress":null,"id":66076,"landingOccurred":false,"latitude":38.9605182,"location":null,"logNumber":"US-06022015-0025","longitude":-78.1929198,"occurred":1433041200000,"potentialRelations":[66005],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1433310960000,"summary":"I took aphoto of the sunset not realizing that i had captured more than a sunset!!","tags":["photo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66076_submitter_file1__IMG20150531134636610.jpg","http://www.mufoncms.com/files_jeud8334j/66076_submitter_file2__IMG20150531134619879.jpg"],"weather":null,"zipcode":"22603","daysBetweenOccurrenceAndSubmission":3,"locationName":"Front Royal, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31459"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"San Juan Capistrano","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"One night, 25 years ago, i was driving back home to san juan capistrano, from san clemente.  i saw a strange \"v\" shaped formation of lighted orbs\r\nover san juan.  the orbs were yellowish/white in color.  as l got off the freeway towards my mobile home park, the orbs seemed to separate and go different directions (apparently not a single object with lights). one of the orbs cruised slowly over my park.  then, the light just went out (vanishing right to left), l tried to see if there was a solid object up there, l could see nothing, it just disappeared. is there any record of this sighting? this was my one and only sighting, to date.  l have seen videos of similar sightings.  i didn't feel scared, l just accepted what l saw, whatever those things were. by the way, it made no sound.\r\n ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":66075,"landingOccurred":false,"latitude":33.5099032,"location":null,"logNumber":"US-06022015-0024","longitude":-117.66029089999999,"occurred":654678000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1433306010000,"summary":"V shaped light formation.","tags":["light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"92675","daysBetweenOccurrenceAndSubmission":9011,"locationName":"San Juan Capistrano, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31460"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the night of 4th of july. i was driving through montana on my way to canada from texas. i was on a back road looking for a spot to camp for the night. i could not find a good spot to camp so i pulled the car off the road and was just going to sleep for the night in the car and continue driving in the morning. i got out of the car and was just looking around the area with my spotlight. i looked up into the sky and noticed the three lights in triangle form. they were slowly moving closer and then further from each other. then i noticed two more groups of three glowing objects doing the same thing. then one craft appeared and started moving back and forth through the sky, it appeared to be pretty close to me. at this time i got out my gopro camera and started recording. i just recently put the video on my laptop and i could clearly see a flying saucer when the light flashes off and disappears. the object kept flying back and forth over head. it would disappear then show back up. my friend keeps asking me what happened the rest of the night but i cant seem to remember sleeping in the car or what i did. i just remember that the lights were still there and at one time i was shining my spotlight at the craft. \r\n \r\n  i am not sending the video today. i would like to meet with someone and have the video enhanced and zoom in on the craft before i give it to someone else to put on tv.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome, Window(s)","flightPath":"Hovering then path","formattedAddress":null,"id":66074,"landingOccurred":false,"latitude":46.8831122,"location":null,"logNumber":"US-06022015-0023","longitude":-110.3547058,"occurred":1404457200000,"potentialRelations":[],"rating":"Unrated","region":"Montana","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1433303960000,"summary":"3 groups of 3 star like objects hovering in triange form. one different craft kept flying back and forth and came pretty close to me.","tags":["hovering"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":333,"locationName":"Montana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31461"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Kingman","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live [location removed/cms/jpg] north of wikieup, az and have been watching the orange orb lights for at least ten years. the last time they were sighted was may 28, 2015.\r\ni didn't know where to report them before now.\r\nthe first time i was driving south on hwy. 93 on a monday night,(10 years ago) when i thought a semi truck was in the wrong lane. i was on the cell phone with my sister-in-law. it died and i thought my battery died. my radio went off and the truck lights dimmed as the lights came at me and went over my head. (truck cab and vanished).\r\ni continued on to our ranch (about 16 miles further south) where i charged my phone and called my sister-in-law to let her know i was okay and was home safely. all the way home my radio was dead.\r\ni saw the lights in the sky to the south of our ranch where they moved up and down, side to side, in a triangular shape, but never as close again.\r\nwednesday night when my husband came home he also witnessed the orange orb lights. sometimes seeming to rotate in a series of five lights...One to the east and seconds later across the horizon to the west.\r\nin the years since my first encounter we have watched \"my lights\" several times, including twice driving from wickenberg to wikieup. \r\nseveral neighbors and friends have also witnessed these lights as i call them when i see the lights.\r\nwhen i described the incident people asked me why i didn't panic in the truck. it never occurred to me. i was very calm and remained so all the way home.\r\nthe lights move so quickly we have not been able to photograph them.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":66073,"landingOccurred":false,"latitude":34.95775958552295,"location":null,"logNumber":"US-06022015-0022","longitude":-113.68882351707101,"occurred":1432796400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1433302107000,"summary":"From my front patio i frequently see orange orbs in the sky to the south between 8 and 10:00 pm.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"86401","daysBetweenOccurrenceAndSubmission":5,"locationName":"Kingman, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31462"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ventnor City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving north on ventnor ave. in ventnor nj i notice what seemed like a quick flash of light traveling west to east above me. i didn't think much of it. within approx. 30 seconds there appeared to be what i thought was a large hazy search light moving in the sky but it seemed to be coming from above the clouds rather than from the ground. within a couple more seconds a second similar light appeared and they would seem to meet each other and then bounce off each other. they did this a few time and then other lights joined in. at first just a third joined in and then more seemed to join in just seemingly to move randomly in the sky. this lasted about a min. finally approx. 4 or 5 of these lights rapidly came in from the south east, which is from the ocean, in a straight line, seemed to reach a certain point and then changed direction flying back over the ocean. one light remained in the sky where these lights seemed to bounce off of and then just disappeared into thin air. my first reaction was some sort of search light until all of the formations and zooming and bouncing off each other. i turned down my street, parked the car rapidly walked toward the ocean searching the sky, there was nothing there. i thought i would see police or other people searching the sky there was no on out as it was a dreary rainy night. i went home and surly thought there would be an explanation on the news, i found none.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":66072,"landingOccurred":false,"latitude":39.3378121,"location":null,"logNumber":"US-06022015-0021","longitude":-74.479727,"occurred":1433223000000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1433298841000,"summary":"While driveing north i noticed numerous dull lights in the sky above the clouds hovering, moving in patterns and changing direction abruptly.","tags":["lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"08406","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ventnor City, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31463"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Mandeville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At about 11:30 pm january 1st i was driving north bound, at around the 3rd to last turnaround on the bridge, and in the east i saw a light about 5 miles away. that light turned into 2 lights and in about 20 seconds it was flying right over us, it seemed to slow down as it flew over the bride and us. the craft flew directly overhead. it was about 60-100ft off of the water, hovering silently. at first i thought it was a drone, but when it got closer it was around 100ft in diameter, massive! it was completely silent. the moon was full. it flew another 20 feet after crossing the bridge east to west, and then accelerated and in 10-20 seconds it was no longer visible. the craft was circular in shape, with 2 bright search lights on the front. very bright. the lights were brilliant white. around the craft there were yellow, red, orange and pink lights on the outer rim. on the underside it had an h shape, not the letter h but mechanical components in the shape of an h. that h was glowing red. ","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Path with directional change","formattedAddress":null,"id":66071,"landingOccurred":false,"latitude":30.3739898,"location":null,"logNumber":"US-06022015-0020","longitude":-90.0824004,"occurred":1433226900000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1433298815000,"summary":"Ufo while crossing a bridge","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Mandeville, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31464"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Keighley","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My sighting\r\n\r\nlocation:  keighley, west yorkshire, uk.\r\ndate: 08 04 2003  \r\ntime: 8.10pm gmt.\r\n\r\nit was an exceptionally warm and sunny evening with a clear sky and hardly any wind when my partner and i had just returned home from walking our dog.  we had just sat down and removed our muddy boots when i noticed a very unusual object through our living room window, (which at first glance resembled a long, straight, black rocket with a large flame coming from the rear).  \r\ni was sat in a low chair only 2 feet from the window (which measures approx 8f x 6f) actually looking out of the window when the object came into view almost directly overhead.  it was immediately apparent that this was something strange and i told my partner (k….) to come and look.  \r\nthe object was very long and straight in shape with an emission from the rear that appeared as a large tulip-shaped flame of a bright white / blue colour, with a small vapour trail that dispersed almost immediately.  initially it was travelling at a speed that would be comparable to that of a standard passenger jet.  again, comparing it with an average passenger jet, i would say the object was about twice as long and flying at height you would consider lower than usual, but not alarmingly so.  as we watched, almost immediately we could see it was noticeably slowing down.  from the underneath the object appeared black in colour.  it had no wings, tail or any visible protuberances or lights.                             \r\nas it passed overhead there was a couple of seconds when you could clearly see a distortion in the air below the object: similar to looking through petrol fumes or a heat-haze.  this caused the object to appear as a zigzag line (similar to how a lightning bolt would be drawn) with four uniform splits.  this distorted view was only apparent very briefly and may have been due to the angle that we were viewing the object (as it was almost directly overhead).\r\nthe object continued on a straight course (roughly east to west) while gently slowing its' speed and apparently turning off the flame-like emission.  after a couple of minutes it had come to a complete stop, roughly 1 to 4 miles distant ( though this is hard to be sure of) and at a height well under a thousand feet from the ground.  it then slowly rotated 90 degrees to face north in a perfectly horizontal position, where it remained for approx. 15 minutes.  during this turn, we could see it was cylindrical in shape.\r\nperfectly motionless, it stood out very prominently in the clear blue sky and we got a good view of the side of the object.  it was long and cylindrical in shape, (its' proportions would be very close to that of a biro pen held at arms length) and it appeared to be made of a light-coloured metal similar to moderately reflective aluminium while the underneath still appeared to be dark.  with the naked eye we could not see any windows, markings or lights.\r\nwe watched, almost trance like, for another 5 minutes before i suddenly thought of taking a photograph.  due to lack of use, both our digital camera and video camera had completely flat batteries; however, during my frantic search i had found my binoculars.  these are rather large; being a 70mm lens with x40 magnification, which makes them almost impossible to focus on anything moving but does give a very clear and bright image. \r\nthrough these binoculars i could just about fit all of the objects' thickness in view, but i could only fit about an eighth of it’s' length.  i could see there was an area of visual distortion of the air / light (not seen without the binoculars) that covered the entire bottom half of the object.  it was not rippling (like a heat-haze) but was more like a large, stable distortion.\r\nthe front (leading part) of the object was rounded and appeared to have a row of windows about three quarters of the way up, wrapped around in an arc of about 90 degrees.  i could not see anything through them other than a faint illumination which appeared to be coming from within the front of the craft, but this light could have been the sky behind the object.\r\nat this point i handed the binoculars to k while i went upstairs to see if i could get a better view through an open window.  the view was no better and i came straight back down noticing that the time was 8.30pm.  as we continued watching, the object slowly changed its position from being horizontal to being a couple of degrees off, pointing nose down.  the object remained in this position for another few minutes before slowly returning to the horizontal.  at this point the object began to move, very slowly in a roughly north / west direction. it was now starting to get dark and there was a bank of clouds approaching our line of view on the horizon.  with darkness rapidly approaching we watched as the object seemed to disappear into the cloud and although we continued watching, after about 10 minutes it simply became too dark to see.  \r\n\r\nat no point during the experience did we even consider that it may be a hallucination or an optical illusion.  the object was a clearly seen physical reality, observed for at least 20 minutes.\r\n\r\nlooking back i believe we were both in a mild state of shock for the remainder of that evening.  we spoke very little and genuinely expected a historic news flash to appear on television at any given second; we actually felt that this was the beginning of a new world.  we went to bed that night convinced that all would be explained in the mornings' news and papers. the next day we were surprised to find no mention of the event on any tv news.  despite this, we were both over our initial shock and were extremely excited about our experience; spending most of the day discussing it.  we both saw exactly the same thing and would describe it as a large cylindrical ufo.  our initial speculations on the ufo’s origins were that it had extraterrestrial origins, but after more consideration (in particular of the flame like propulsion which is a very earth like technology) we feel it may have been a secret military vehicle or some other human built vehicle.  \r\nwe felt sure that many people would have also seen it, yet the local papers made no mention of a reported sighting, which we checked for the next few subsequent days.  i have since realised this does not mean it wasn't seen by other people or that it wasn't reported (this is the first time i have written-up this experience) and i would be interested to hear from anyone who did see it on that day or on any other day in this local area.\r\n\r\nafter the incident i was eager to share the experience with friends and relatives but was shocked and surprised to find either a general lack of interest or complete disbelief. \r\ni then underwent a period of time when i read many ufo books and books about physics and quantum engineering in an effort to explain it all to myself and even wrote a song “ufo over keighley” in an attempt to make light of the whole subject.\r\ni have never found a convincing answer to what we saw and what it all means.\r\ni consider myself lucky to have had this experience and been made aware of the reality of ufo’s but i do often think it is a shame that we, (the general populous) are not given access to the advanced technology that undoubtedly exists.\r\n\r\nmy name is ….. ….. , [birthday removed/cms/jpg] (though i would like to remain anonymous), and i currently run my own business making english longbows, in …. ………, uk. at the time of the sighting i was working as a security guard for a local hospital. \r\ni have never submitted this report to any other authority or organization.\r\nplease feel free to contact me by e-mail if needed.\r\nregards\r\n….. ….. \r\n\r\n02-06-2015\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Path then hovering","formattedAddress":null,"id":66070,"landingOccurred":false,"latitude":53.867795,"location":null,"logNumber":"GB-06022015-0019","longitude":-1.912358,"occurred":1049857200000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1433298329000,"summary":"Daylight sighting of a large cigar ufo with flame out the back, two witnesses, 8 april 2003.","tags":["ufo","light"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":4437,"locationName":"Keighley, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31465"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rye","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While on a geology field trip, a couple of my students had their picture taken by another student. one was taken with the camera in landscape position, and nothing was in the photo. a second photo taken moments later captured a bell shaped object above the ridge in the background. no one witnessed the object.  it was only noticed when the student enlarged the photo after the trip.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":66069,"landingOccurred":false,"latitude":34.1091168,"location":null,"logNumber":"US-06022015-0018","longitude":-111.3537131,"occurred":1428172200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1433295734000,"summary":"Object unknowingly caught in photo","tags":["photo"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66069_submitter_file1__bell3.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":59,"locationName":"Rye, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31466"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Corvallis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Back in 1979 or maybe 1980, between about 10 to 12 at night, i was laying alone on a mattress on a third story window well/ledge (basically on the roof, where i spent many warm summer nights reading and sleeping) and i was simply stargazing for a short while (no clouds), when i noticed something odd at about 50 degrees from south: some of the stars were momentarily 'blinking out' in an overall very large v-shaped pattern heading north, over my head and into the north where i couldn't see the affect anymore, the whole event lasting about a minute. there was no sound. i remember saying \"wow\" out loud to myself, and just watched in wonder. also, throughout 'its flight' from s to n, the 'black-out' pattern slowly veered/wavered from side to side. my first impression was that it might be a v-shaped flock of ducks or geese, but it seemed way too high up for them. although i had some doubt about the event being birds, i could only think that it had to be birds, as it couldn't be a plane or jet because there were no lights or noise; so i just shrugged my shoulders and never gave it much thought for many years, and never mentioned it to anyone, until the many years later when i decided that it could have been an early 'lights out' flight of the then secret stealth b-1 bomber. i've often wondered if anyone else might have seen the same 'thing' that summer in oregon, and that is why i am submitting this report.   ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":66068,"landingOccurred":false,"latitude":44.551614472437805,"location":null,"logNumber":"US-06022015-0017","longitude":-123.26978544270092,"occurred":333957600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1433293531000,"summary":"On cloudless night while stargazing on roof, saw some stars 'blanking out' in v-shaped pattern from something travelling south to north in a slightly wavy path.","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":12723,"locationName":"Corvallis, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31467"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Williamstown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home to cape may from williamstown rd (williamstown) and saw an object in the sky that looked like a spinning florecent tube (electric blue) with a ball on each side. i thought about stopping to take a picture, but just kept going home. i was actually working at the faa tech center at the time as a contractor and i relize now i shouldve kepy my mouth shut... [expletive deleted/cms/tg]","distance":"21-100 Feet","duration":"08:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":66067,"landingOccurred":false,"latitude":39.6932416,"location":null,"logNumber":"US-06022015-0016","longitude":-75.0418601,"occurred":1331679600000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1433291909000,"summary":"It looked like a spinning floresent tube, i shouldve took a picture but was scared, iy reminded me what was seen i think in germany in the 1400s","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1176,"locationName":"Williamstown, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31468"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Merritt","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was with a friend one night around 11pm at a school hanging with her and we were just looking at the sky and talking and i made a joke about seeing ufo's over the mountain and after i did we kind of got creeped out because we seen a lot of things moving over that mountain while there was one just hovering behind all of them, so we went onto the other side of the school and sat down facing the moon and we kept talking and while i was watching the moon it was doing something weird so i pointed it out to my friend and we both seen the moon start to be smudged with yellow/black smudges on it and it started to cover most of the moon it looked like it was bubbling and smudging the moon almost, literally a minute later the moon came straight to the earths surface in a second and hovered over us and i rememeber saying \"what should we do\" while my friend already started to run to her house because she lives right across the street from the school that we were hanging at that night, so i started to run with her and we ended up in her alley beside her house and i looked at the time and it literally took us 30 minutes to run to her house while it was just across the street from the schoo we were just at, we were freaked out and did not know what just happened but what we did know is that there was no moon in the sky after this event happened. (i personally think it was something trying to look like the moon, i don't think we were looking at the moon in the sky that night. i want to know if anyone had this happen to them)","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Other","formattedAddress":null,"id":66066,"landingOccurred":false,"latitude":50.12229388631898,"location":null,"logNumber":"CO-06022015-0014","longitude":-120.77264460082664,"occurred":1371362880000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1433291293000,"summary":"It appeared as the moon in the sky then it appeared right in front of me ","tags":["none"],"timeZone":"America/Vancouver","timeZoneName":"America/Vancouver","tweeted":0,"urls":[],"weather":null,"zipcode":"V1K1B8","daysBetweenOccurrenceAndSubmission":716,"locationName":"Merritt, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31469"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hello:\r\n\r\ni want to share a sighting i had last night.  i found your page through google; i am looking for feedback to try to learn what this might have been.\r\n\r\nlast night, i took notice of a deep green craft flying overhead while walking west on the 400 w. block of division st. in chicago il at 9:44 p.M.  it was solid with no blinking lights.  i took note simply because of its unique color; i've never seen a solid, deep-green aircraft at night in the chicago sky. i assumed it was simply an airplane based on its speed and apparent altitude. \r\n\r\nat first, it was moving in a straight path and at a constant speed.  but as it approached the sear's tower, it suddenly stopped.  that's when i began filming the first video attached to this report.\r\n\r\nthe object is located just above and slightly to the right of the flashing lights on the fixtures atop the sear's tower.  \r\n\r\nbefore resting where it was hovering, it was moving south and it passed overhead from where i was standing; about 2 miles north of the sear's tower.  it took it maybe thirty seconds or less to reach the location where you see it in the video.  \r\n\r\nafter it left frame and i stopped recording, it re-appeared almost immediately.  i began recording this longer video.  in this video, you can see the object change from deep green to a blood red when it moves back near the sear's tower.  it also appears it have gone much higher in altitude.  \r\n\r\n[link moved to fi section/cms/tg]\r\n\r\nit's much harder to make out in the second video. \r\n\r\nto the naked eye, it was very bright and very easy to see.  fortunately, an airplane even passed by during the second video which helped give a reference for size and distance.  it was clear that the object was much higher in altitude than the airplane.  \r\n\r\nafter taking the video, i ran to my car about half a mile away and drove about 3 miles south of the sear's tower along i-90 to try and spot it.  unfortunately, i was unable to find it again.  \r\n\r\nthank you for your time. \r\n\r\n[name removed/cms/tg]","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":66065,"landingOccurred":false,"latitude":41.92507077685762,"location":null,"logNumber":"US-06022015-0014","longitude":-87.62836600194845,"occurred":1433220180000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1433290521000,"summary":"A deep green object flew overhead until reaching sear's tower; changed direction several times and changed color before leaving field of view","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66065_submitter_file1__WP20150601002.mp4","http://www.mufoncms.com/files_jeud8334j/66065_submitter_file2__WP20150601003.mp4"],"weather":null,"zipcode":"60610","daysBetweenOccurrenceAndSubmission":0,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31470"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hickman","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out east of hickman, ne at wagon train lake near the dam, on the north east part, closest to the parking lot, set up to do a little fishing and take pictures of the sunset. (i have included a map of the lake; where the little yellow bubble is at the bottom of the map is where i was.) as the sunset wasn't all that spectacular, i turned my attention to the june full moon. i took around 30 pictures in all, throughout the moon's rise, facing easterly from the south end of the lake. i did not look at the pictures until earlier today. i have not tried to crop anything, or filter it or do anything with the images. it may be a plane, but the pictures were taken seconds apart and were on a photo burst setting, so i really don't think that's what it is.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":66064,"landingOccurred":false,"latitude":40.6309127,"location":null,"logNumber":"US-06022015-0013","longitude":-96.58501220000001,"occurred":1433216700000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1433287080000,"summary":"Taking pictures of the moon rise, found these images taken seconds apart today. ship? ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66064_submitter_file1__IMG0289.JPG","http://www.mufoncms.com/files_jeud8334j/66064_submitter_file2__IMG0290.JPG","http://www.mufoncms.com/files_jeud8334j/66064_submitter_file3__IMG0291.JPG","http://www.mufoncms.com/files_jeud8334j/66064_submitter_file4__Wagontrain.pdf"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Hickman, Nebraska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31471"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Omro","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the night of june 1st 2015, i was witness to a unique spectacle in the southern sky. i was out on the roof of my house star gazing with a friend when we noticed a series of strange lights appear in the southern sky.\r\n\r\ni thought perhaps it was some kind of strange air craft for a moment. however the night was dead silent. also the erratic nature of the lights makes me extremely skeptical that we witnessed anything conventional. \r\n\r\nthe start of the \"event\" was aprox 2:30am lasting for a little over an hour. the night sky was mostly clear, the moon was huge and very bright. i believe i was the first to notice several strange lights in the sky. it appeared to be a series very odd orb-lights,moving in changing formations,shifting colors very quickly,changing in number as well. there seemed to be a few main orbs,that would split and then reabsorb randomly.\r\n\r\nwe were so captivated by the display that i did not even think to go for my camera for at least 30 minutes. i literally could not take my eyes off what was happening. so we both sat and observed the lights for a decent amount time,transfixed. \r\n\r\nthankfully, i managed to break away to run all the way down to my car to get my nikon d3200 24mp camera. also fortunately i had a telephoto lens and a tripod. so i quickly ran back up to the roof and setup for what i knew was going to be difficult photo shoot as night photography can be tricky. \r\n\r\n\r\none of particularly interesting effects i noticed was what appeared to be short ribbons/lighting bolts of red light/energy radiating upwards from one of the objects. \r\n\r\nvery upsetting to me was the fact i would normally have had a pair of nice nikon 10x50 binoculars for star gazing but they were recently stolen. i was able to find a pair of ww2 era binos 6x30s and got a brief look at the object emitting the red energy, to my best estimate it appeared to actually have a diamond shape. due to the frequency of changing patterns, it is difficult to describe. \r\n\r\nmy reaction was at first shock,brief disbelief and excitement then awe. my friend however is the typical skeptical type, had a completely different reaction then i did. she was concerned,in shock,eventually becoming increasingly frightened. after the event was over she was extremely disturbed and terrified for hours. i think she is still having trouble with the event,perhaps denial. thankfully i was able to get objective data like photos/video of some of the event.\r\n\r\ni actually wanted to attempt to \"signal\" the objects to see if i could get a response, i flashed my led flashlight towards them but without any apparent reaction..I wanted to then use my 60mw green laser pointer but my friend was too scared and would not let me.     \r\n\r\nfor the record, i do want to state that i regularly follow reports from mufon and am very interested in unique phenomena lets say. i used to be a complete skeptic until a few years ago when i started research into the field of uavs,ufos,usos,etc. i am also a avid aviation enthusiast and star gazing/amateur photographer. i have seen all matter of celestial events such as comets,meteors showers,etc. what we saw that night was nothing like i have ever witnessed in my life(judging by my friends reaction,she probably had not either). \r\n\r\nalso interesting to note was the fact just the night prior i witnessed strange lights to north,over lake poygan. they were much farther away and low in the horizon. disappearing after about 5 minutes. they appeared to be similar as well. i had no intention of filing a report for that sighting but after 6/1/15, it might be relevant or related. \r\n\r\ni am very interested in any follow up and providing any information/assistance that i can. i shot a 12 minute clip of 1080p footage of the later half of the event. it is 2gb in size, i would be willing to provide mufon with a hard copy of everything if requested. \r\n\r\n\r\n","distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":66063,"landingOccurred":false,"latitude":44.08092783245648,"location":null,"logNumber":"US-06022015-0012","longitude":-88.8235594650286,"occurred":1433142000000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1433286562000,"summary":"Multible orbs of pulsing,changing color quickly,direction,shape,glowing,bright. varying in number,silent, appeared to be a ","tags":["pulsing"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/66063_submitter_file1__DSC0538.JPG","http://www.mufoncms.com/files_jeud8334j/66063_submitter_file2__DSC0537.JPG","http://www.mufoncms.com/files_jeud8334j/66063_submitter_file3__DSC0541.JPG"],"weather":null,"zipcode":"54963","daysBetweenOccurrenceAndSubmission":1,"locationName":"Omro, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31472"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Peterborough","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was a nice warn day and my friends and i were running a round outside when suddenly the air felt differently. as i looked up ,there it was unlike any thing else id seen it was to slow for a plain and wasn't shaped right. as i pointed it out to the other kids they looked at me and said  \"that's a plain\". than i looked back at it as it moved slowly closer  i said \"that cant be a plain\". i asked if they were playing with me and they all said it was a air plain. the slow toe nail shaped object moved over us i could tell that there where windows,small wings like on a jet on the sides and on top and most weirdest feature was that there thrusters of a sort on the back as the craft past over us they glowed white as if they were hot. i stared at the craft in till it was out of view because the trees. i don't remember much about what happened after that i'm not shore why but i do remember felling exited as it flew by but confused after that.       ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":66062,"landingOccurred":false,"latitude":42.9148534,"location":null,"logNumber":"US-06022015-0011","longitude":-71.9455826,"occurred":1189469880000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1433284810000,"summary":"Very quiet ,","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2821,"locationName":"Peterborough, New Hampshire","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31473"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Bradford","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was only about 14 years old stood talking with friends we had been playing football it was the end of a perfect summers day i don't no what made us all look up but we did and there it was i giant cigar shaped object no sound  no clouds it is very hard looking strieght up to say how big it was there was nothing to judge it against it seemed like we all could not move but then after 20 to 40 ish seconds we all just ran i ran about ten feet turned to look at it again whilst still running and it was gone it was a big clear piece of sky nothing can move that fast i ran in to my parents and too\r\ntold them they did not believe me the next day it was on the local news it had been spotted all over west yorkshire it's a long time ago so can't be exact with date but think i won't be that far away and not exact how many of us there were i think about 7 to 10 of us my brother was with me","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":66061,"landingOccurred":false,"latitude":53.7920044005458,"location":null,"logNumber":"GB-06022015-0010","longitude":-1.7317872002623178,"occurred":265611660000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1433284014000,"summary":"I saw a cigar shaped ufo.","tags":["ufo"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":[],"weather":null,"zipcode":"Bd23pl","daysBetweenOccurrenceAndSubmission":13514,"locationName":"Bradford","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31474"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover), Unknown","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was walking down hollywood blvd yesterday around 4:30 or 5 in the afternoon with a friend when he noticed the 3 orbs high in the sky. at first i didn't see them. they were very small and i have bad eyes but once i fixed on them it became clear that this was not normal. when we started taking pictures other people started snapping pics as well. probably 30 to 40 people took notice. we watched these things for maybe 10 minutes trying to figure out what they were. they moved very slowly towards the north. at one point all 3 of them elongated and seemed to kind of stretch out and get bigger then went back into the original form of a cloudy gas ball of some kind. they seemed to pull close together and spread back apart kind of at times. i do have several pictures and they are the exact same thing i have seen on you tube. pics are on my cell phone. i am typing this from my laptop. you guys are welcome to check them out. [phone number removed/cms/tg]","distance":"101-500 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":66060,"landingOccurred":false,"latitude":34.1015709,"location":null,"logNumber":"US-06022015-0009","longitude":-118.3361639,"occurred":1433142000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1433277476000,"summary":"Seen 3 orbs or gas like in triangle formation hovering above scientology bulding. i have pictures. tourist seen as well","tags":["triangle","hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"90028","daysBetweenOccurrenceAndSubmission":1,"locationName":"Los Angeles, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:31475"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Orlando","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was with my mother, my little brother and her friend at the time grocery shopping. they had finished putting the groceries in the car when we heard people in the parking lot talking loudly and the sound of worry. my mom and her friend started saying \"what is that!\" over and over when i looked towards the windshield from the back seat i saw a very bright light rocking back and fourth like in a small u shape. i have never seen anything like that in my b entire life at that point. i remembered being extremely scared. my mom drove off very fast and i tried to hide in the backseat as much as i could. my brother saw it too and remembers that night and says to this day it was in the local newspaper.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":66059,"landingOccurred":false,"latitude":28.4606835660967,"location":null,"logNumber":"US-06022015-0008","longitude":-81.38557643306265,"occurred":831009600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1433271823000,"summary":"Rocking ufo","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"32839","daysBetweenOccurrenceAndSubmission":6970,"locationName":"Orlando, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:31476"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":778}
