{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Fort Myers Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was friday, may 4th at approx. 9:05 p.M.   gf and i were walking north on ft. myers beach, fl.  we both observed at approximately the same time orange lights on the horizon.  we were near the neptune hotel when we saw the first lights.    we observed them approaching... they were bright orange, like a street lamp one would see from a distance of a mile away or so.   we saw three at first.  i thought they may have been several planes on approach to regional southwest airport, as we'd seen several commercial jets fly over us on the way to landing at rsw.   the lights were not in a line, but they were flying in a south-southeast direction approaching. they varied in height between themselves by 500 - 1000 feet between the 3 of them as they approached. standing on the beach they appeared to be on the horizon just to the left of the last light on a building on the beach, and moving towards us from the north-northwest.  the light would have been between st. james city, on pine island  and pelican/cape coral  cities.  traveling over the matlacha pass national wildlife refuge which is  several miles to our north-northwest.    i am guessing, but they appeared to be traveling several hundred miles per hour.  i had observed several jets inbound to south west florida airport earlier in the evening as they were making their final approach, pass over where i was at.  those jets travel at 200 mph on approach?  these objects were moving at least 2-3x faster than the inbound jets were.  the three traveled towards us, but not directly at us. on their current path of travel they would pass us out over the ocean on our left.   as they neared the north end of ft. myers beach island, the objects appeared to change direction.  the objects turned in a southwesterly direction.   the objects were flying well above the clouds.  perhaps at 2,500-4,000 feet.  i am guessing the clouds were 1,500 feet ? that night. i have looked but cannot find that information.  clouds were broken and not very large.    we watched the objects as the traveled away and appear to disappear above the clouds.   at no time did we observe the lights change to the standard red and white flashing strobe lights indicating a plane.   we wondered what we have just seen, when 3 more lights appeared.  they traveled in the same previously described manner.  however the last light appeared to  higher and it turned in a more westerly manner.  we watched what appeared a commercial jet flight passing overhead, flying in a west northwesterly direction as we observed these lights   the commercial jet appeared to be at 35,000 feet or so.   these objects were well below the jet.   in the approximate time of 10 minutes, we observed 15 of these orange lights approach in the same way as described, turn and head out over the gulf of mexico.   two of the lights traveled in a west-southwest direction. those two appeared to be higher than the rest as they turned. all of the others traveled in the south-southwest direction.  the lights came in 3, 3 again, then 4, then 2, then 3 again.  just as one group disappeared out over the gulf, more would appear on the horizon.   i live 2 miles from a large commercial airport in illinois.  i see and hear jets, and propeller driven commercial and private aircraft everyday and night.  i watch them on approach from 10 - 15 miles away.   these lights did not appear to be known aircraft.  they made no sound.  i saw no standard red/white, white strobe lights. i could not really tell shape.   perhaps round. size ? 15 feet i'm guessing on the first light.  i got a good look at it before it disappeared over clouds. i am am guessing it's size in comparison to commercial jets that flew over us 1 1/2 hours earlier at a similar height.   i tried to take cell phone photos.  only one shows two orange lights. nothing definitive.  i didn't have phone set to \"night mode\"... nuts.   what were they ?  i do not know. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":47516,"landingOccurred":false,"latitude":26.4550148,"location":null,"logNumber":"US-05192013-0017","longitude":-81.944865,"occurred":1367726700000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1368986216000,"summary":"Observed 15 orange lights flying near ft. myers beach","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47516_submitter_file1__0503132052a.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":14,"locationName":"Fort Myers Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2957"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Palm Harbor","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Watching tv on patio....Looked up into the sky and saw what looked like a plane on fire..No sound...Went over the patio and continued on into the night..Several seconds later another came...Following the same flight pattern as the first....A minute or two after that another appeared much lower and flying in a line of trees...Not following the original two.  no sound at all.  while the second one was in view saw a helicopter a distance away but not trying to follow the fire looking object.  i could hear the helicopter.  it was around 9:30 at night and sky was clear.  we had several planes fly over later and you could hear their engines but no sound from the fire looking objects.  my friend also witnessed this event.  neither of us had ever seen anything like this and i had lived close to wright pat for years.  i could not tell how high they were except they were not as high as the planes that came over later.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":47515,"landingOccurred":false,"latitude":28.087889297793367,"location":null,"logNumber":"US-05192013-0016","longitude":-82.66520045108372,"occurred":1368937800000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Bullet,   Missile,   Fireball","source":"MUFON","status":null,"submitted":1368983965000,"summary":"3 fire looking objects in sky...Very bright..No sound","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"34685","daysBetweenOccurrenceAndSubmission":0,"locationName":"Palm Harbor, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2958"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Colorado Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was opening a window that had no screen to look at something on the house and suddenly saw a very bright white/yellow/gold colored star like orb that traveled fairly fast across the sky in a straight line then disappeared after about 20 seconds. it was silent. there were also airplanes or helicopters in the sky but not near object. i have seen a ufo before that with one look knew it did not come from earth it was like a flying football stadium sized triangle ufo so i often look up at the sky. usually i can identify if something is a plane or a helicopter or just unknown object and it does not make me think much about it but this was different i really believe it was a ufo not from earth if it was a plane it was silent and bursting as an all light object like an intense fireball so i don't see how it could be ours it was not a flare or star and doubt it was a meteor. ","distance":"Over One Mile","duration":"00:00:20","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":47514,"landingOccurred":false,"latitude":38.84138342351831,"location":null,"logNumber":"US-05192013-0015","longitude":-104.88478723899196,"occurred":1368852660000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1368980405000,"summary":"Glowing sparkling big orb observed then disappeared after about 20 seconds","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"80906","daysBetweenOccurrenceAndSubmission":1,"locationName":"Colorado Springs, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2959"},{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (under cloudcover)","city":"Cogan Station","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside to the yard last night to take my dog for a walk at about 9:00p.M. i looked up at the sky in south west direction and noticed 5 orange globe shaped lights . they were flying at a slow speed ,at different altitudes in no particular formation. i have never seen anything like them before and could not identify them. 4 of them went behind some trees and never emerged and the 5th continued it's flight over the trees and simply disappeared. i only saw for 3 minutes or less. this sighting took place on may 18,2013 \r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":47513,"landingOccurred":false,"latitude":41.3412446951507,"location":null,"logNumber":"US-05192013-0014","longitude":-76.95673248417687,"occurred":1368860400000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368972810000,"summary":"I observed 5 orange round globe shaped lights flying together at a slow speed but not in a particular formation. 4 of the objects diapeared be hind some trees and never emerged. the 5th one flying higher than trees continued past the trees and disapeared.","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"17728","daysBetweenOccurrenceAndSubmission":1,"locationName":"Cogan Station, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2960"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Malibu","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was leaving the 76 gas station located at 26101 pacific coast hwy, malibu, ca heading west or hwy 1 northbound, when i saw 6 or 7 glowing orange/red objects in the distance looking toward where point dume is. they were in a large linear formation slightly scattered from top to bottom. the glowing objects were moving along the coastline at a slow pace. the objects were hard to make out in terms of what shape they were other than oval. i began to notice people who where driving in the same direction as me, begin to pull off to the side of the road to take pictures or just maybe try to understand what they were witnessing. the objects were almost directly in front of me to the left slightly when i began to pass obstructions to my left blocking my view for about 20 seconds. when i saw them again they were at my 9 o'clock and only a few could have be seen and the rest were beginning to disappear. they also picked up speed and began to move inland behind me. eventually all the objects disappeared. about 5 minutes later a black helicopter was flying low to the ground in the path the objects took, the black helicopter had only one blinking red light on the tail and was quiet for its large size. i text a buddy of mine afterwards who happened to be on westward beach that saw the same thing but not until the object passed by him, he was looking south toward the pacific, then eventually due east when watching the objects for a full minute. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":47512,"landingOccurred":false,"latitude":34.0147779,"location":null,"logNumber":"US-05192013-0013","longitude":-118.8054093,"occurred":1368937800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1368970505000,"summary":"6 or 7 glowing objects traveling along malibu coastline","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47512_submitter_file1__image.jpeg"],"weather":null,"zipcode":"90265","daysBetweenOccurrenceAndSubmission":0,"locationName":"Malibu, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2961"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Elyria","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Approximately july 10th at 11 pm 1986 i was allighning my telescope  with the north star which is a celestron 8 2000mm f/10 with a finder scope that is a 8x50.In tne left field of view in the finders scope there was a shinny object.I focuss in to get a better view the object.Was at a stand still for about. 7.Sec.At 1000.1 1000.2 up to 7.Times then a waveyblur like heatwave on a long heated highway.It disappeard.For about 2.Sec.Then a waveyblur agan then the object.Reappeard in the far right field of view for about 7.Sec agan my wife and a friend who were talking to one another said what's wrong because i said what the h.E.L.L is that.Then the waveyblur agan it disappeard. in 2.Sec it reappeard standing still for7.Sec in the far lowerleft field of view.Now i am trying to get a real good look at what i was seeing it was shaped like a football.Or an egg. the surface color was like a grey dullsilver or a steelsilver garbegecan.Color that has a dullshine.At this time i am really screming.What.Is that.What.Is.That.Its at a standstill again for 7.More.Sec.Then the waveybulr it disappeard .In 2.Sec it reappeard in the farright middle.Now i am realy freakingout.I get coldchills.Up and down my neck and spine.Then its standing still for 7.More sec then the waveyblur.It disapperd. in 2.Sec the waveyblur then it reappeard.At astandstill for 7.Sec it was in the far leftmiddle.Iam still screming what is that i could feel the skin on my head tightn up with cold cold chills like a skintight ice glove over my skull.Then the waveyblur it disappeard in 2.Sec.A waveyblur it reappeard in the far upright field of view. my heart is racing my body is shaking i don't know if iam going to passout or what but iam scared to death iam still screming what is that.Its at astand still for 7.More sec then the waveyblur it disappeard then in 2.Sec the waveyblur then it was back in far leftmiddle for 7.More sec then the waveyblur. then it was gone fofever. iam still shocked about the way this thing moved its minebogling.I still have the want to tell someone what i saw.After26 years i still feel it was most scariest and exciting thing ever happend to me one thing i know for sure we're not alone","distance":"Unknown, N/A","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Window(s),  Patterned Surface","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":47510,"landingOccurred":false,"latitude":41.379532199609216,"location":null,"logNumber":"US-05192013-0012","longitude":-82.13065900087133,"occurred":521362800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Cylinder,   Egg,   Oval","source":"MUFON","status":null,"submitted":1368969779000,"summary":"Looking thu a9x50 finderscope on theleft of field of view the ufo was sill for7sec then a waveringblur then it wason the rightsidefieldofvew                                                                                                                   ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"44035","daysBetweenOccurrenceAndSubmission":9810,"locationName":"Elyria, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2962"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Simi Valley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":")ten minutes ago at 1:55am may 19thi walked outside to smoke a cigerette and thought i saw the moon between some trees across the street. i got on my yard chair to get a better look because it was a yellowish color and i thought it was strange the moon was that color. it wa large(big eneogh for me to think it was the moon),glowing orange-yellow,and after two minutes it slowly dissapeared in on itself.Dont know if its related buy alot of dogs were and still are barking.","distance":"Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":47509,"landingOccurred":false,"latitude":34.24556298231109,"location":null,"logNumber":"US-05192013-0011","longitude":-118.74101493586458,"occurred":1368953700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball,   Sphere","source":"MUFON","status":null,"submitted":1368966954000,"summary":"At 1:55am in simi valey ca,saw large yellowish glowing orb,observed for two minutes until it dissapeared","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"93065","daysBetweenOccurrenceAndSubmission":0,"locationName":"Simi Valley, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2963"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Midway Lebanon and Sweet ","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving to sweet home oregon late at night about 1:00 am with my brother and a friend.  i just turned the bend just past the old shirley's tavern (1970's hwy 20 the four lanes ended there and went to two lane toward sweet home)and saw two lights close together (red and green)about a 1/2 mile. the lights were close to a farm house on the right side at the top small hill just before getting to the old midway store. when i turned the bend i saw the lights thinking they were lights to a new short way radio antanna. i was just kidding and said look a ufo and didn't think anymore about it. when we got next to the house (we were below the level of the house because of the cut bank next to the road) our friend was laying down on the back seat with his head on the passengers side of the car we thought he was sleeping when he started yelling ufo ufo then my brother was yelling to pull over i could not see it because the roof of the car was blocking it. i pulled over as soon as i could we all got out of the car and was no further than 200 feet away and at this side of the ufo was only a white light. it was just above a tree next to the small farm house. the ufo was flat silver rounded triangle with a dome on top and bottom with a light on each corner of the triangle. (best way to describe it was the standard saucer shape ufo with dome on top and bottom but instead of the saucer being round it was still round but in a triangle shape soft corners not sharp)we watch it for about 20 to 30 seconds with the white light became in an instant almost blinding with in less than a second it flow up and to the west and was small as a star. we all jump back in the car screaming and cursing i drove east toward sweet home as fast as i could while my brother with his head out the passengers window and our friend watch it out the back window telling me it stop than to off again. the three of us had never been that scared before at least i wasn't. i took them home and i was living with my sister in lebanon and i really didn't want to go back that way. i drove to her house and did not see it on the there. the night was clear with stars out and do not remember seeing the moon. there was no sound at anytime when watch it hoovering and flying off.  when it was hoovering it was as still as the house was.\r\n\r\ni did see it again a couple of months later on the same road and will fill out another report.   ","distance":"21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary","formattedAddress":null,"id":47508,"landingOccurred":false,"latitude":43.8075234,"location":null,"logNumber":"US-05192013-0010","longitude":-120.5470012,"occurred":181292400000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Saturn-like,   Triangle","source":"MUFON","status":null,"submitted":1368960656000,"summary":"1:00 am driving home 3 of us saw ufo hoovery over house","tags":["ufo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47508_submitter_file1__ufodrawing.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":13746,"locationName":"Midway Lebanon and Sweet , Oregon","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2964"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"NL","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"After a soccer game, past saturday (11/may/13), we had a barbecue outside in the backyard of the house. all familly started to go out and few minutes they called me and every body who was in the house. then my oldest son told me to look up and they there where this really round lights flashing randomly. unfortunatelly it was clouded and we can't tell more accuratelly how many where there. the clouds open and close visibility; so, we can't see clearlly to describe the approximate quantity or other details; but guessing, i will say they where no less than 30 and up to a hundred and in regards to movement i will say they where steady and then moved to south very slowly. if it wasn't for the quantity and that they didn't flyed in formation i cold probably say that they where military planes. one more thing is that 3 or 4 of this lights where brighter cause when clouds got together you can see them trough the cloud at least you can see a blur light. then i try to picture them, and told my boys to do it and they already try; but, it couldn't be done with cell phones, they just came out black...","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path","formattedAddress":null,"id":47507,"landingOccurred":false,"latitude":25.65276949280471,"location":null,"logNumber":"MX-05192013-0009","longitude":-100.39812953598728,"occurred":1368940200000,"potentialRelations":[],"rating":"Unrated","region":"Nuevo Leon","reportedWeather":null,"shape":"Flash,   Sphere","source":"MUFON","status":null,"submitted":1368958241000,"summary":"Lots of steady lights, like airplane, no formation all random, then went south.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"64610","daysBetweenOccurrenceAndSubmission":0,"locationName":"NL, Nuevo Leon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2965"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Malibu","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"930pm saw this on westward beach along with others. there was about 6 ufos and a military helicopter flew buy with no lights on towards the ufos , than the ufos disappeared.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path","formattedAddress":null,"id":47506,"landingOccurred":false,"latitude":34.0091768,"location":null,"logNumber":"US-05192013-0008","longitude":-118.81535,"occurred":1368937800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1368957375000,"summary":"6 ufos over malibu","tags":["ufo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"90265","daysBetweenOccurrenceAndSubmission":0,"locationName":"Malibu, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2966"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Malibu","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" husband saw bright lights in sky with triangular formation did not know if it was an airplane star and if not a ufo husband called me from clubhouse yelling came out saw activity called kids and friends all witnessed and took iphone video do. intelligent movement triangular linear and random movements  increasing in lights then decreasing to disappearing. no sound then  helicopter from port hueneme direction looked like a double propped helicopter came by this all happened in approximate 12 minutes \r\n\r\neveryone was amazed and excited the objects basically vanished in a second . shortly after extremely high as in star high a single starlight was moving in a deliberate straight line and disappeared \r\n\r\nfeelings and reactions: amazed and excited    ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":47505,"landingOccurred":false,"latitude":34.0107179,"location":null,"logNumber":"US-05192013-0007","longitude":-118.8030693,"occurred":1368937500000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere,   Other","source":"MUFON","status":null,"submitted":1368955775000,"summary":"7 lights expanding yellowish  glow to diminished glow mo ing in formation triangular linear and random appearing and disappearing helicopter from point hueneme showed up after ","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Malibu, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2967"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Malibu","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"101-500 Feet, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":47504,"landingOccurred":false,"latitude":34.0107379,"location":null,"logNumber":"US-05192013-0006","longitude":-118.8041993,"occurred":1368937800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368954085000,"summary":"Intelligent formation, triangular linear random formations. asendim ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Malibu, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2968"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Huber Heights","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting outside talking on the phone when i noticed the bright orange-red ball of light coming from across the treetops toward where i live. i noticed it because it was very bright. at first i thought it might've been a shooting star, but then i noticed it was too big to be one and it was flying toward my home. it flew at a slower but steady pace over my house and continued to fly nw. i tried to focus on it, but it was so bright that even with squinting my eyes i still couldn't focus on it. i was scared of it. i didn't want to move, i actually wanted to hide so that it wouldn't \"see\" me. i lost sight of it when it flew farther away.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":47503,"landingOccurred":false,"latitude":39.853197,"location":null,"logNumber":"US-05192013-0005","longitude":-84.1162508,"occurred":1368945000000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1368951237000,"summary":"Bright orange orb flew across the sky at a slower pace but in a straight line","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"45424","daysBetweenOccurrenceAndSubmission":0,"locationName":"Huber Heights, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2969"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Marion","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At the time i was driving home from being out fishing i was on hy18 heading east in to marion when i seen what i thought was just stars close together then they started to get brighter and moving west slowly i throught i was just seeing things at frist but then one of the so stop et of lights broke away from the other one and stared heading south by the time i was able to pull over to stop and get out they were gone. both of the things had 3 lights on them one in frount and on each sides they would get bright then go dim the lights looked live they were evenly spaced out to and to far apart on them to be a plane or choper and moving to slow to be a plan to","distance":"N/A","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":47502,"landingOccurred":false,"latitude":40.5664139,"location":null,"logNumber":"US-05192013-0004","longitude":-85.6535442,"occurred":1368943680000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1368951055000,"summary":"Two sets of light in sky","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"46953","daysBetweenOccurrenceAndSubmission":0,"locationName":"Marion, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:2970"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Aztec","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While sitting in my hot tub just after 9:00 pm i noticed two blue orbs coming over from out of the north. they were below cloud level. no sound. best estimate for size; i'd say about 10 of them would fill the moon area. but since i really can't tell how high they were this isn't much help. these two were really not side by side when they went over but moved into that configuration as they went south. guessing that they were about three miles south of me ,,,then a smaller red one joined up them from the left. it seemed to come up to them and almost instantly match speed. at about the same time i noted three more coming in from the north. two blue ones with another red one between them. when those got south of my location there was one more blue one that followed. their direction was generally south and a little east but they all seemed to wander slightly. the area is aztec, nm. the colors remained constant in strength and the blue was almost like a neon blue color. all seemed to be round in shape. i almost wanted to wave at them but had second thoughts. they just went out of sight going south into the distance. i'd guess the time involved was 2 to 4 minutes.","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":47501,"landingOccurred":false,"latitude":36.88374154013891,"location":null,"logNumber":"US-05192013-0003","longitude":-107.95802549569846,"occurred":1368893400000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Disc,   Sphere","source":"MUFON","status":null,"submitted":1368950733000,"summary":"Two groups of three crafts (two blue and one red) then a single blue orb that followed.","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"87410","daysBetweenOccurrenceAndSubmission":0,"locationName":"Aztec, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2971"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Massillon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was just dropping off my sister and 2 nephews at their home at about 11:50 pm and was driving down the street when i noticed a red/orange orb floating maybe a hundred feet off the ground or so heading north. i spotted the object immediately after looking at the moon. i could only describe the object as a glowing ball although i must concede that it may be a chinese lantern or some other explainable phenomenon. i began feeling a little nervous and excited, but decided to follow the object after it left my field of view. the entire event lasted for less than 2 minutes but i managed to capture some video.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":47500,"landingOccurred":false,"latitude":40.83248036594498,"location":null,"logNumber":"US-05192013-0002","longitude":-81.48319710786924,"occurred":1368946800000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368948353000,"summary":"This appeared to be a glowing red/orange orb.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47500_submitter_file1__IMG1659.MOV"],"weather":null,"zipcode":"44646","daysBetweenOccurrenceAndSubmission":0,"locationName":"Massillon, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2972"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Eden Prairie","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside for a cigarette. looked up towards the big dipper. saw the two oval reddish lights. then noticed the cresent shape between the ights. it started on a straight path. suddenly made multiple s shapped manuvers in the pattern of how a snake lools when it moves. very very fast. i live by a major airport as well as a small airport for personal planes. never seen anything like it. it was very low and made no sound. the lights were oval amd sort of dim. clear sky. mild humidity. it lasted maybe 10-15 seconds. it went across the whole sky in this short time and got smaller and fadded out like it left the atmosphere. i was in awe. i tried to get my wife outside to see it also but it was gone too fast. i am not sure what it was. i am sending this from my phone. i already have drawn what i saw and how it moved and i can email it seperatley if wanted.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":47499,"landingOccurred":false,"latitude":44.8582056,"location":null,"logNumber":"US-05192013-0001","longitude":-93.469226,"occurred":1368942600000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1368948708000,"summary":"Cresent shaped, made serpentine mamuvers, sharp left to right movements, two oval reddish lights on tips","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Eden Prairie, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2973"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Fort Erie","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving down the street with my friend, we both noticed these weird lights in the sky, we noticed there were actually 3 flying in a triangle formation, varying distances with eachother as they flew. i thought maybe they were flying lanters or something because of the flame lol on the inside but there were only 3 staying in that triangle. we turned around to go home & we could still kind of see them driving the opposite way when we noticed a couple at the side of the road notice them as well, probably a block later we looked back & we could no longer see them. (photo's only slightly enhanced on iphone 4 edit option for easier viewing)\r\nalso on instagram, i looked under the #ufo & found someone else from i don't know where posted a photo of 3 lights in the sky only about half an hour after i did!","distance":"501 Feet - 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":47498,"landingOccurred":false,"latitude":42.9274023,"location":null,"logNumber":"CA-05182013-0018","longitude":-78.9135447,"occurred":1368938700000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Blimp,   Cylinder,   Fireball,   Oval,   Sphere,   Unknown","source":"MUFON","status":null,"submitted":1368945643000,"summary":"3 small flying objects, varying in a triangle formation","tags":["triangle"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47498_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/47498_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/47498_submitter_file3__image.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fort Erie, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2974"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Macon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The time and date is approx. this happened as i and my friend were walking to my house after a high school event. i was dark and as we walked westbound, i noticed that the stars in the sky were all moving in the same formation to the north. i made my friend aware of this and we both watched as the stars turned out to be the refection of the street lights off the bottom of the enormous dark object that moved to the north. we were unsure of the altitude, but to my best memory it was maybe 1000 ft up. the object was either so large or so low that it filled 50% of my field of view towards the sky.\r\nwe both ran to my house and both drew pictures of what we saw, his picture depicted a disc shape as mine was more of a curvature of the bottom of a large object. to this day i remember the sighting, and i'm glad someone else was with me to see it.\r\nthere is absolutely nothing it could have been mistaken for, my regret is that i don't readily remember if it had edges like a triangle or disc or cylinder, its just been too many years.\r\nno sound, reflective bottom, enormous size, and moving north.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":47497,"landingOccurred":false,"latitude":39.76667112505087,"location":null,"logNumber":"US-05182013-0016","longitude":-92.45608617833494,"occurred":347961600000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1368945395000,"summary":"Extremely large dark object with reflective bottom, no sound moving slowly north","tags":["sound"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"63552","daysBetweenOccurrenceAndSubmission":11816,"locationName":"Macon, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2975"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Portland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My partner and i saw an \"unidentified flying (more like floating) object tonight.   it was a low floating roundish object slowly traveling south east which was observable with the naked eye for about 3 minutes.  appeared to be glowing with a yellow/orange flame color before extinguishing.  a balloon on fire is the best description i can come up with. my girlfriend managed to shoot a phone image of the moon and the object in one frame(moon on top right) and when magnified the colors around the object show the yellow/orange coloration (unlike the moon which still radiates only white light).See attached pictures.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":47496,"landingOccurred":false,"latitude":43.73533982546433,"location":null,"logNumber":"US-05182013-0015","longitude":-70.30677361433929,"occurred":1363588200000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1368944749000,"summary":"Low-floating round object glowing yellow/orange hovered with a few bobbing actions for about 3 minutes. floated  se direction before it disappeared as if extinguished.","tags":["floating"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47496_submitter_file1__UFOKaiaandJoe5182013.jpg","http://www.mufoncms.com/files_jeud8334j/47496_submitter_file2__ufpthemooninthesamepicture.jpg","http://www.mufoncms.com/files_jeud8334j/47496_submitter_file3__ufocloseupanditsreflection.jpg"],"weather":null,"zipcode":"04103","daysBetweenOccurrenceAndSubmission":61,"locationName":"Portland, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2976"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Moore","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on the couch next to a window watching the weather. thunderstorms on their way. other than a dim light above my front door, there is no lighting. my apartment faces the west & over looks trees. i noticed bright yellow orange orb like lights traveling up & to the right. i was frozen with fear as i have seen many program on similar experiences. as more appeared i made my way to the window & snapped a few pics w/ my iphone. i called my ex tommy karr. he is very knowledgable about the unexplained. he didn't answer. i quickly filmed a video of the last of the lights traveling. my phone was close to dying so i stopped the video so i wouldn't risk losing it if my phone died. after the remaining lights disappeared into the sky the humming stopped. i sat on the floor near the window for about 10 mins. i was afraid to move. i sent the pictures to tommy & posted the video on facebook. i also sent it to a local news station. i was eventually able to send the video to tommy & he advised me to contact mufon.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":47495,"landingOccurred":false,"latitude":35.33662543116759,"location":null,"logNumber":"US-05182013-0014","longitude":-97.47565309691173,"occurred":1368935700000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368943752000,"summary":"Shifted up & to the right, in sync, held pattern, humming & finally ascended out of sight","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47495_submitter_file1__trim.e00ABR.MOV","http://www.mufoncms.com/files_jeud8334j/47495_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/47495_submitter_file3__image.jpg"],"weather":null,"zipcode":"73160","daysBetweenOccurrenceAndSubmission":0,"locationName":"Moore, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2977"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Mother's day outing, sunday may 12, 2013. took many panoramic photographs during the day (70+). stopped to take a few photographs of my wife and of the view overlooking long island sound towards ct. after i downloaded the photographs, i observed three objects in the clouds above the water. in another photograph, a very obvious object that is not in the clouds and appears to be flying above the water. it appears to be black in color, and radiating or giving off some type of heat or force around the vessel. if you examine the photos, you can see people walking and the object is in the first photo and not in the second taken but a few seconds apart. ","distance":"Over One Mile","duration":"00:00:14","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":47493,"landingOccurred":false,"latitude":40.7196728,"location":null,"logNumber":"US-05182013-0013","longitude":-74.0043931,"occurred":1368389220000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Cigar,   Cone","source":"MUFON","status":null,"submitted":1368942930000,"summary":"Total of four ufos in two photographs. three cigar shapes in clouds, one teardrop shape in photo approximately 70-100 feet above water. all invisible to the naked eye.","tags":["photo","ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47493_submitter_file1__DSC0128.JPG","http://www.mufoncms.com/files_jeud8334j/47493_submitter_file2__DSC0128CopyCONTRASTBWCopyarrows.jpg","http://www.mufoncms.com/files_jeud8334j/47493_submitter_file3__CopyDSC0129.JPG","http://www.mufoncms.com/files_jeud8334j/47493_submitter_file4__CopyDSC0129Copyarrow.jpg","http://www.mufoncms.com/files_jeud8334j/47493_submitter_file5__CopyDSC0130.JPG"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":6,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2978"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Agua Prieta","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was taking a photo of agua prieta mexico on may 16, 2013, from \"d\" hill in douglas, ariz., but didn't notice anything unusual until the next day while reviewing photos.  even after zooming in on the area in question, i can't identify the object. the photo has not been edited. i have never seen a ufo and i am a skeptic...With an open mind.","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Unknown,N/A","formattedAddress":null,"id":47492,"landingOccurred":false,"latitude":31.3258333,"location":null,"logNumber":"MX-05182013-0012","longitude":-109.5488889,"occurred":1368728100000,"potentialRelations":[],"rating":"Unrated","region":"Sonora","reportedWeather":null,"shape":"Cigar,   Cylinder,   Disc","source":"MUFON","status":null,"submitted":1368941988000,"summary":"Did not see object during photography. saw it the next day while reviewing photos.","tags":["photo"],"timeZone":"MST","timeZoneName":"MST","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47492_submitter_file1__UFO.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Agua Prieta, Sonora","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2979"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Palm Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A friend ask me to come over, that she had seen something in the sky.  i arrived at around 10:00 pm.  she asked me to look up at the sky.  i first saw nothing, then what i thout was a very dull glow.  we took many pictures.  we went inside to view the pictures, upon returning to the outside the objects were gone.","distance":"21-100 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":47491,"landingOccurred":false,"latitude":33.7923185630099,"location":null,"logNumber":"US-05182013-0011","longitude":-116.5528918946071,"occurred":1360310400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368939329000,"summary":"Attached phots taken behind friends home in the desert","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47491_submitter_file1__scan0014.jpg","http://www.mufoncms.com/files_jeud8334j/47491_submitter_file2__scan0014.jpg"],"weather":null,"zipcode":"92264","daysBetweenOccurrenceAndSubmission":99,"locationName":"Palm Springs, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2980"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Framingham","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Waiting at stop light, facing north. saw a large white light object descending quickly from up in sky, down to almost the ground, where i lost sight of it behind building. went vertically down, not as any angle, like a shooting star would have, and which wold have burned out way higher in the atmosphere. this went all the way down, and was consistent in it's glow the entire way down. it seemed like a solid object moving at a rapid speed. it never impacted the ground, or broke the speed of sound (no sonic boom), from what i could hear. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":47490,"landingOccurred":false,"latitude":42.35108716391013,"location":null,"logNumber":"US-05182013-0010","longitude":-71.41350495486815,"occurred":1368937800000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1368938862000,"summary":"A bright white orb descending quickly down. all the ay to earth, behind building. large. not a shoting star, as it went very low.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"01701","daysBetweenOccurrenceAndSubmission":0,"locationName":"Framingham, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2981"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Minot","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"There was four of us witnesses.  we thought it was a plane at first but as it got closer we noticed no collision lights. we grabbed my monocular night vision and look at it and you could see clearly it was a round lit up white object.  nothing protruded from object did not make any noise nor leave any trail, it was moving at a good pace. object was in our atmosphere maybe 500-1000 feet up in the sky.  lasted about 5 minutes i guess, there were other people working out in the rail yard, if they looked up they would have seen it, object could of resembled an approaching aircraft if they just glanced up at it, as there is an airport nearby and airliners do fly over gavin yard.  ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":47489,"landingOccurred":false,"latitude":48.26046603621696,"location":null,"logNumber":"US-05182013-0009","longitude":-101.15780558472852,"occurred":1364822100000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1368919529000,"summary":"Orb light flew over railroad yard.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"58701","daysBetweenOccurrenceAndSubmission":47,"locationName":"Minot, North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2982"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Saint Paul","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my backyard which faces south at between the evening hours of 9:30-9:50pm, i had just sat down in chair to relax after work,when i noticed a very orange light traveling from the west to east at a speed which seemed to be a rate of a fighter jet in motion, the light was about 30/35 degrees above horizon at a distance of 1-2 miles, i lept out of chair to follow it, the craft had a grayish internal soft light emanating from within it then veered south easterly to disappear all this happened within a matter of seconds,not a sound was heard i,am standing there still looking up when 1 minute later the same type of light followed the path of previous craft, now i,am believing my eyes when again another light passed at same speed/path. 1 minute later another light passes same distance as other two, then a fourth passes, all this took 5-7 minutes total, its as the lights were playing follow the leader, they all vanished quickly. i have excellent hearing and sight,what i saw but did not hear makes me feel very special! ","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change","formattedAddress":null,"id":47488,"landingOccurred":false,"latitude":44.99535405103143,"location":null,"logNumber":"US-05182013-0008","longitude":-93.15231999424192,"occurred":1368592380000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Boomerang,   Sphere","source":"MUFON","status":null,"submitted":1368910933000,"summary":"Orange lights playing follow the leader.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"55117","daysBetweenOccurrenceAndSubmission":3,"locationName":"Saint Paul, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2983"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ottawa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Traveling back to okc from kcmo on i-35. had 2 blowouts on back tires and slowly got to store at wellsville, ks exit. couple took me to the ottawa, ks exit (15 miles)to the walmart tire center to get one of the tires changed out so that we could return to the car, where my wife waited, then put the new tire and the spare to travel back to walmart and replace the other.\r\nwe were supposed to wait an hour for the work to be done. the couple went shopping while i went to the back lot outside the store to the employee break area for smokers. i saw a fluttering white object southwest of my position(i was facing west)traveling directly north. it was snow white and flat. when it was close to being directly in front of me, i asked two lady walmart employees to verify my sighting. they, like me, thought debris or a deflated weather baloon. but, like me, they ruled each out due to the stable, constant, straight path at a pretty decent speed. a tire tech came out of the bay to see what we were looking at. he just shook his head and said, \"i don't know what that is\". \r\nit was at about 60 degrees altitude in a clear blue sky. my guestimate for speed would be 40 mph, as it took 10 minutes for it to move 6-8 miles over ottawa, ks. it was moving pretty close, direction-wise, to a star in the north sky, which was at about 65 degrees. a star on a clear day? i guess it was venus? maybe you would know.\r\nwhat was intriguing was that the north and south ends of the 20' + sheet were slowly moving up and down (winglike) as the middle just furled and bounced, like a flag. it was the whitest-white you could imagine.\r\nmy wife and i are in our 60's, retired from the federal government, and have never seen a ufo before. we all were so intrigued by the anomaly, none of us thought about pictures. hell, i have a droid 8mp with video. i could just kick myself.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":47487,"landingOccurred":false,"latitude":38.6184368,"location":null,"logNumber":"US-05182013-0007","longitude":-95.2588815,"occurred":1368389700000,"potentialRelations":[],"rating":"Unrated","region":"Kansas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1368868410000,"summary":"Snow white sheet, straight path, no change in altitude. ends of sheet moved up and down- winglike. not weather baloon or debris. 3 other witnesses.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"66067","daysBetweenOccurrenceAndSubmission":5,"locationName":"Ottawa, Kansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2984"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"San Juan Capistrano","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On tuesday may 14, 2013 4:52 pm, i was driving north on interstate 5. i was driving between 65 and 70 mph. i was just at the junipero exit at san juan capistrano, ca, when i saw a round dark spot (1) in the sky above the cars, farther up the freeway. the spot grew bigger. it was coming in my direction. then it appeared to be a blimp (2), just off to the left, over the south bound lanes. it was shiny silver looking. then it sped by so fast and i thought thats no blimp, a blimp cant go that fast. it seemed like a bullet whizzing by.  i was shocked! i guessed its speed at maybe 200 mph and about 200 feet in the air.  it was bullet shaped and highly polished steel or chrome. it had a double band around the middle with dots along the side, from top to bottom. it was moving south, in a direct line. it moved at unbelievable speed.  it appeared as a bullet shape yet somewhat round on both ends and about 20-30 feet long. for a second i thought it might be a missile.  then i thought it could be a drone, but it was moving so fast, how could it record anything?  it had no wings and no gondola like on a blimp. what can fly that fast with no wings? \r\n\r\nthis only took about 3 seconds, from seeing the spot (1) to looking like a blimp (2) to having it speed past me (3). my process time was this: what is that? oh is it a blimp?  no way! as it zipped past me on my left. \r\n\r\ni estimated the speed, size and height based on the cars travelling south, that were probably doing about 70 mph and this object zoomed past them in a second. \r\n\r\ni immediately called jt on my cell phone to tell him what i just saw. my call is recorded at 4:53 pm.  i then hung up. i was just merging onto the 73 toll-road and then i exited at la paz. i parked in my dr.S parking garage. i called jt again at 5:04 to tell him more about what i saw. i have searched the local news but there is no report of what i saw, so i am reporting this now.\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":47486,"landingOccurred":false,"latitude":33.5202453,"location":null,"logNumber":"US-05182013-0006","longitude":-117.6666814,"occurred":1368575520000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Bullet,   Missile","source":"MUFON","status":null,"submitted":1368865640000,"summary":"Fast moving shiny bullet/missle object over 5 fwy headed south.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/47486_submitter_file1__UFO5.14.134.52PMSJC.jpg"],"weather":null,"zipcode":"92675","daysBetweenOccurrenceAndSubmission":3,"locationName":"San Juan Capistrano, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2985"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Jacksonville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. i was taking a walk and in my neighborhood\r\n\r\n2.When i started to look at the stars i notice a light in the sky \r\n\r\n3. i thought it was a spotlight there was no light source it could come from\r\n\r\n4.It was an orb rotating in a circle in less 4 sec. the orb continued rotating before vanishing.\r\n\r\n5. it was a very weird feeling\r\n6.It was rotating then it just vanished.","distance":"501 Feet - 1 Mile","duration":"00:55:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":47485,"landingOccurred":false,"latitude":34.7610024,"location":null,"logNumber":"US-05182013-0005","longitude":-77.4261414,"occurred":1365396600000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Flash,   Sphere,   Unknown","source":"MUFON","status":null,"submitted":1368864139000,"summary":"Orb rotating in circle in the same spot for a long period of time","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"28574","daysBetweenOccurrenceAndSubmission":40,"locationName":"Jacksonville, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:2986"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1340}
