{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Northumberland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife and i were on our back deck after taking the dog outside.  it was overcast and there were no stars or planes in the sky. the object was very bright and easily seen. this is the second time we have viewed this object within the last week.  this time i had my phone.  i have a pic and a 2 minute video of the object.  the object was oval in shape.  it was orange in color at first and then changed to red.  the object came slowly from the east. it stopped and hovered for a few seconds. it then went to the left and right slightly.  it proceeded to move backwards and headed in a northeastern direction until it was behind the trees and out of our view. when witnessed last week the object acted in the same manner. it came from the east and hovered only to move left and right slightly.  last time it headed back east but it faded out. it didn't go behind any trees or move to a distance not seen, it just disappeared. we were mesmerized and weren't quite sure what we had witnessed or what the object was.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":61752,"landingOccurred":false,"latitude":40.94940258791942,"location":null,"logNumber":"US-11302014-0016","longitude":-76.73281813858813,"occurred":1417412700000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417417551000,"summary":"Orange light that changed directions and colors.","tags":["video"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61752_submitter_file1__20141130204607.mp4","http://www.mufoncms.com/files_jeud8334j/61752_submitter_file2__20141130204546.jpg"],"weather":null,"zipcode":"17857","daysBetweenOccurrenceAndSubmission":0,"locationName":"Northumberland, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79714"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lee's Summit","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was the night of oct 7th before the blood moon began.I was on my back deck. i took 2 pictures of the moon. when i viewed the photos there was a white spot. i enlarged the photo & there it was in both pictures. it is plain to see a circle of lights. there is no mistaking it. it can only be seen when the pictures are enlarged. i want to share the photo but they will need to be enlarged. it's on my cellphone.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":61751,"landingOccurred":false,"latitude":38.92782638159722,"location":null,"logNumber":"US-11302014-0015","longitude":-94.41002193822705,"occurred":1412665200000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1417417570000,"summary":"It's in a picture i took of the moon","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"64081","daysBetweenOccurrenceAndSubmission":55,"locationName":"Lee's Summit, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79715"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Duluth","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in my car in heavy traffic at a red light facing east i happened to look up at the sky and noticed an abject going in a fix path going north east. it did not have any fixed wings it was a classic uf o shape. it was not a balloon it was not a kite it was not a helicopter it wasn't a plane. air-traffic in this part of georgia is very very light i very rarely see any kind of plane. this object kept going in a fixed straight path i watched it until i lost it in the traffic against the horizon. i took a picture as best i could. thank you. i did not notice if any other people in cars noticed it because i did not want to lose my fixture on it. i did not notice any lights it did appear in the pictures to have a bronze kind of color on it. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":61749,"landingOccurred":false,"latitude":34.0061486,"location":null,"logNumber":"US-11302014-0014","longitude":-84.13884759999999,"occurred":1417220880000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1417411583000,"summary":"Sitting in my car in heavy traffic stopped at a red light.   i just happened to look up from the steering wheel and i noticed this object moving very very slowly in a straight line across the sky  it was coming from the south east moving north east","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Duluth, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79716"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Columbia","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside watching the night skies with the new skymaster binnoculars my wife got me for my birthday a week ago.I have been watching the night skies i have alot of sightings here looks like stars that move,.No blinking lights at all,,.,i have been watching the skies for s few months now,.Ive seen them before,few weeks ago and few months ago,.I had no clue what it was,.I used to liove next to ohare airport in chicago ill and ive never seen a plane that looked like a light in the sky,.,.With airplanes u can see the dark of the body and wings against the dark blue night sky,.This object i first noticed it north of my house it went over my house and then turned east,.No way could a plane turn instantly like this,.It seemed like it kind of skipped through the sky,.Hard to explain my heart was racing,.I was scared but yet excited at the same time,,.My actions i ran in woke my wife up again lol,.Tried to have her come see,.Like i said i spend hours looking ast the night sky watching,.,its almost like clockwork in these parts,.,.Wish i had binocculars that took video i would have proof,.I will see them again i always do 37th p  i lost sight of it just got so far i couldnt see any more,..,gosh i have a few good ones,.,.All sightings from my back yard,..,i am sorry my spelling is so bad,.I rusheds through this its a clear night and i wanna go sighting,like i said if only i had binocculars that took video,.I would have few good videos to show,.This is somthing ambition flows from,.I see these objects alot and i tell everyone i mention them too if u dont belive me come over well do a stake out or two and u will believe,.,","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":61748,"landingOccurred":false,"latitude":38.92797246550665,"location":null,"logNumber":"US-11302014-0013","longitude":-92.40943669460582,"occurred":1417266660000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1417411506000,"summary":"Goin south then turned east all of a sudden","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"65203","daysBetweenOccurrenceAndSubmission":1,"locationName":"Columbia, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79717"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (no cloudcover), Unknown","city":"Waterville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife, a friend and i were heading from maumee to haskins via. route 64 sometime between 7:00 pm and 8:00 pm october 27th 2014.  when i was looking out the window, i noticed 3 lights above the maumee river.  the lights did not appear to be moving at first.  i then noticed that the lights were solid, and not pulsating, which i thought was a bit odd.  i also noticed that the stars and moon glow from the background were blocked by this object (it was solid). after looking at the object for a few seconds i asked my wife if she could see what i was seeing.  she was driving, so she could only look briefly.  she did see the object that i saw, then a deer ran out in front of our car, and we almost hit it.  i said to my wife, that it must be a helicopter and the solid triangle look of it must just be some optical illusion.  all of what i just described took about all of 15 seconds.  after getting our bearings from almost hitting the deer, i look back and see the object passing behind our vehicle in a e/se heading.  if i had to estimate the altitude i would say somewhere from 500-1000 feet, but that all depends on exactly how big the object was, which was not easy to estimate.  and if it was at the altitude i think it was, then i would estimate the speed it moved at to be somewhere between 60-120mph.  no sound was made that i could hear, but our windows were up and we were heading at 55mph.  \r\n\r\nmy friend who was in the back of the car did not see the craft.  he is mostly deaf, and didn't hear me point the object out to my wife.  he only saw the deer we almost hit.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":61747,"landingOccurred":false,"latitude":41.5086559,"location":null,"logNumber":"US-11302014-0012","longitude":-83.7109901,"occurred":1414393200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1417410598000,"summary":"Saw a triangle with three white lights hovering to the w/sw from rt. 64 between perrysburg and haskins.  object hovered over river, then went in a e/se direction.","tags":["triangle","lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"43566","daysBetweenOccurrenceAndSubmission":34,"locationName":"Waterville, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:79718"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"San Antonio","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was  outside my home looking west after handing out candy for halloween and i saw a ball of light yellowish glowing looked blurry witnessed coming from the north headed south and my brother was with me he witnessed it also i told him what the heck is that it was hovering very low over the trees across the street and south and turned west it had no sound it was weird but something i could not explain i was excited because technically i saw a ufo..It was small i would guess 3-4 ft in diameter and disappeared past the houses just cuz i couldn't see that far ...Thanks","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":61746,"landingOccurred":false,"latitude":29.484207184672012,"location":null,"logNumber":"US-11302014-0011","longitude":-98.70699506762796,"occurred":1414816200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1417406046000,"summary":"Hovering blurry like ball","tags":["hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"78250","daysBetweenOccurrenceAndSubmission":29,"locationName":"San Antonio, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79719"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Lake Oswego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching television with my boyfriend, [name deleted; trb], when we noticed a large, red light swim around in the sky then quickly ascend up and disappear. not long later, we noticed two golden colored star-like things hovering above the hills where the red light had come from. we noticed these lighting slowly floating up and down before one started slowly moving east and increased gradually in speed. we ran upstairs, where my dad kept a pair of binoculars near the window. we observed the objects, which were disk shaped with red and white lights on the bottom and moved in a rotating motion with the red light flashing every rotation.As soon as both objects flew out of sight, we noticed another faint light appear in the same location where the previous two appeared. and it did the same thing as the other two. we saw about 7 before seeing one that appeared fainter and almost as if it were struggling. out of nowhere, one of the ones from before it turned around abruptly and sped over to the struggling one. it hovered above it for a little bit before slowly moving east again, which the other one that had struggled a little lower and behind it, both rotating in sync and maintaining a constant distance between each other before disappearing the same way the others had. we went downstairs onto the porch and observed the discs, until we heard a loud female scream that came from the sw and ran back inside. we saw around 10 before my dad and i had to drive [name deleted; trb] back to his house. after coming back home, i observed 4 more of these discs before forcing myself not to look anymore as i felt on edge, nervous, and scared.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome, Other","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":61745,"landingOccurred":false,"latitude":45.41670787205756,"location":null,"logNumber":"US-11302014-0010","longitude":-122.72848694336491,"occurred":1417320600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1417396734000,"summary":" {dr}disc shaped objects appeared in hills 1-2 at a time, hovered for a bit then moved increasing in speed east.","tags":["disc"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61745_submitter_file1__IMG49992.MOV"],"weather":null,"zipcode":"97035","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lake Oswego, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79720"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Gulfport","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on a pier overlooking bayou bernard in gulfport, mississippi during the summer of 2011, with a friend. it was around midnight, and as we sat there talking i noticed a swirling ball of light about 100 yards to the east of us. at first and even to this day i thought it was some kind of trippy disco ball and perhaps someone was having a party and it was just some kind of one-off lighting decoration.  but recently memories of that night have come flooding back while looking at videos of various orbs of light. i now believe i had a genuine sighting of an orb up close. its description is this: it was 100 yards away, appeared to be approximately 10-15 feet in diameter, and its surface was most amazing. it did not flash or blink, it changed colors the entire time, reds, purples, blues, yellows, pink, orange, greens, but it wasnt ever a solid color, as one color was covering its visible side another would come washing across not in a line but with a fluid motion, as if it were filled with all the colors in the rainbow swirling around inside. i dont remember how long we watched it but it was more than a few minutes and i remember saying to my friend,\"what is that, thats so wierd\". my friend is a person who doesnt care about stuff like this so it would be no use asking.  one strange thing was that even though this was highly unusual,  thinking back to our reaction it was like this orb wanted to be seen but not remembered if you know what i mean. like we were talking about other things and mesmerized by the shear spectacle of it but still not talking about it then or even later. now that ive thought about it i believe i had a up-close view of some type of orb that changed colors very slowly and differently than the videos ive seen of orbs in the sky. perhaps it changed colors slowly because its energy level was lower than when its flying through the sky. the memory is forever burned in my mind. then again maybe it was just a trance-hypnotic party ball. just fyi, i have seen many unexplained sightings of aerial phenomena, huge black flying triangles twice in kansas city, green orbs following my car with my wife in mississippi, stars cutting right-circles on the gulf of mexico, a classic flying saucer my mother and i saw landing and a missing time abduction dream when i was in 9th grade where during my first episode of sleep paralysis i was taken on board a crystal-like ship watching myself stare at a screen while a grey crept up behind me and touched the back of my ear with a sharp probe.","distance":"101-500 Feet","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":61744,"landingOccurred":false,"latitude":30.3939831,"location":null,"logNumber":"US-11302014-0009","longitude":-89.02680459999999,"occurred":1343808060000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417390306000,"summary":"Orb multicolor-changing slowly, very close, very detailed near ground","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"39503","daysBetweenOccurrenceAndSubmission":851,"locationName":"Gulfport, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79721"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Naples","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Round classic ufo but sphere like","distance":"Over One Mile","duration":"00:02:11","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":61743,"landingOccurred":false,"latitude":26.1420358,"location":null,"logNumber":"US-11302014-0008","longitude":-81.7948103,"occurred":1417345440000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417389062000,"summary":"{dr]traveling in path then it dissapearred","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Naples, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79722"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Castro Valley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Mom and i were outside on the porch of my apartment we saw a flash from over the bay there was an object above the sf bay it was white it had flashed a flame red almost explosion like three times then began to streak across the sky .\r\nthe next night at 644 pm once again out front clear nite and a beautiful blue violet doughnut like craft was silently flying across the sky i got video of it on cell phone however it was blinking off and on so you really have to watch but it is brighter then any plane that were in the area wich made it easy to see . it flew directly above me so i know it was a circular craft it was as if i could \r\nsee through the center \r\n\r\ni have also included a photo from july at hedge creek falls in wich there are grey aliens standing on the rt bank of the water towards the center of the picture .","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":61742,"landingOccurred":false,"latitude":37.6784639489174,"location":null,"logNumber":"US-11302014-0007","longitude":-122.06805544960378,"occurred":1417050600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1417386356000,"summary":"Abductee has various encounters these are the most recent ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61742_submitter_file1__20141128191204.3gp","http://www.mufoncms.com/files_jeud8334j/61742_submitter_file2__20141122170957.mp4","http://www.mufoncms.com/files_jeud8334j/61742_submitter_file3__IMG201407211327479272.jpg"],"weather":null,"zipcode":"94546","daysBetweenOccurrenceAndSubmission":3,"locationName":"Castro Valley, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79723"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was laying on my balcony watching the stars around 1am there were virtually no clouds and the sky was very visible. a bright greenish blue sphere shot across the sky for not even a quarter of a second  then disappeared it was way to big to be a shooting star and to fast also.  as soon as i realized what i saw i got up to see if it was somewhere else or what happened. also at the very time it happened my dog jumped up while she was laying next to me and watched the sky. she was very upset with her hair sticking on end for about a minute. she watched the area it was at for a while after it disappeared.   ","distance":"501 Feet - 1 Mile","duration":"00:00:01","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":61741,"landingOccurred":false,"latitude":31.9738588,"location":null,"logNumber":"US-11302014-0008","longitude":-99.8968831,"occurred":1417338000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417383680000,"summary":"Bright green light shot across sky faster than falling star","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79724"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Tuxedo Park","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was cross country skiing on extension of acoma rd about .3 miles from my house. it was sunny with blue sky. i looked up coming back to my house and\r\nnoticed a geese like v shaped flying formation. i started to pay attention to the object and noticed lights instead of geese. in front of v formation there were about 5 to 7 lights and lines forming letter v were also white amber lights. all the lights in the formation kept their position without any changes. color of lights was bright white. lights looked-like recessed ones. \r\nlights occupied about 30% inside of v in a spiral like form.\r\nv wings were much longer vs. my observation of real geese flocks i saw many times in the area.\r\nthe object was moving from nw to se. i observed it 5 to 7 minutes. i could not see it longer because of forest like area   \r\n\r\n ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":61740,"landingOccurred":false,"latitude":41.1874048178455,"location":null,"logNumber":"US-11302014-0007","longitude":-74.20991006074019,"occurred":1417161600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1417379114000,"summary":"I observed delta like shaped object comprized of ressesed lights on sights and insight with spiral located lights  ","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"10987","daysBetweenOccurrenceAndSubmission":2,"locationName":"Tuxedo Park, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79725"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On tuesday of this month i was watching the live iss feed. i was drawn to a flashing i saw in the distance. i did a screenshot. i took several photos as it got closer and passed out of you. seven in sequence. i only have the ipad photo editor. i was unable to get great resolution. i assume that you have software much more advanced than i have but you can take a look at this. it is definitely triangular when i did some contrast to the photo. the last file in the attachments is my attempt at enhancing the photo. i would like to know what you think.","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":61739,"landingOccurred":false,"latitude":34.0548881,"location":null,"logNumber":"US-11302014-0007","longitude":-111.0911311,"occurred":1416971280000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1417375259000,"summary":"Iss live cam photos","tags":["photo"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61739_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file3__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file4__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file5__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file6__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file7__image.jpg","http://www.mufoncms.com/files_jeud8334j/61739_submitter_file8__image.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":4,"locationName":"Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:79726"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Alden","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at home when a large boom sound accrued. my house shook.\r\n\r\neveryone in town heard and felt it.\r\nsome surroundings towns felt it too.\r\n\r\nthere is no explanation. ","distance":"20 Feet or Less","duration":"04:44:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":61738,"landingOccurred":false,"latitude":42.9069196,"location":null,"logNumber":"US-11302014-0005","longitude":-78.4872771,"occurred":1417308240000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1417375064000,"summary":"Large boom felt within 20 miles and not explanation. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"14004","daysBetweenOccurrenceAndSubmission":0,"locationName":"Alden, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79727"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Eagan","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At around 6:40 pm i went out onto my deck to have a cigarette and noticed the moon was at half full unobstructed by clouds, it was ssw from my position and quite beautiful so i was gazing at it when i noticed what appeared to me to be a satellite approaching from the north moving in a straight line to the ssw towards the moon about 2 degrees off to the right.\r\nthe right side of the moon was lit and it was a mostly clear night sky.\r\n\r\nas the object came next to the moon there was an extremely brief flash from its right side and a momentary trail and secondary object, that looked like a yellow/green fireball slightly larger than the first object, as if shot out or ejected, was observed for less than a second.\r\nthe primary light continued on its straight path for another second or two and then disappeared.\r\ni am unsure if what i observed and laid out in my narrative is what happened or if some light phenomenon caused by the satellite passing by the brilliantly lit half moon created an effect that i saw.\r\ni have no photos or video of the event.","distance":"Unknown","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":61737,"landingOccurred":false,"latitude":44.816846048155185,"location":null,"logNumber":"US-11302014-0004","longitude":-93.1593199603911,"occurred":1417315200000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417370245000,"summary":"Moving light observed to eject an object ","tags":["light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"55121","daysBetweenOccurrenceAndSubmission":0,"locationName":"Eagan, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79728"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Covina","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Thought i was watching a helicopter coming from the nw but while watching it it wasn't moving after all just kept watching it pulsating red then it just faded away. i had the sense of anxiety really bad ran inside and told my husband and he said cool. cause i saw one over the san gabriel mtns a few years back so he knows i saw it. i was in my kitchen looking out towards the west and saw it to the right so that would be nw. i didn't lose sight of it it just faded out to nothing.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Unknown","formattedAddress":null,"id":61735,"landingOccurred":false,"latitude":34.08920700603777,"location":null,"logNumber":"US-11302014-0003","longitude":-117.90588856869306,"occurred":1417333200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1417345233000,"summary":"Red pulsating lights then just slowly faded out","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"91722","daysBetweenOccurrenceAndSubmission":0,"locationName":"Covina, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79729"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Blythewood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving back to my boyfriends house and right before we got there we both saw something in the sky. it's a clear night too, there are absolutely no clouds anywhere around us. it was too low and too fast to be a plane, jet, helicopter, anything. but too high to be a drone. we couldn't see a shape but there was a blue-purple flamish cloud coming from behind it, but there was no trail. there was a gleaming light all the way around it. we were both speechless for a second then we both said it was a ufo and started looking around more. it disappeared about 3 or 4 seconds after we first saw it. my radio also had more static in it on my drive home. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":61734,"landingOccurred":false,"latitude":34.2143159,"location":null,"logNumber":"US-11302014-0002","longitude":-80.97397699999999,"occurred":1415697180000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1417340809000,"summary":"Same thing as below","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":19,"locationName":"Blythewood, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79730"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Livermore","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in front of the house (livermore, ca) i shared with my daughter and her family. facing east i was taking pictures of the full moon. i did not notice the three objects when i took the photograph. after downloading the photos to my computer i first noticed that there were three unfamiliar objects that were either on or in front of the moon. one seems to have a triangular shape. i was rather shocked to see what i had captured. i didn't notice anything unusual in the skies or anything odd in the neighborhood. the digital photo /i have attached is a copy. i am still searching for the original that has been saved to a cd.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":61733,"landingOccurred":false,"latitude":37.67422603722138,"location":null,"logNumber":"US-11302014-0001","longitude":-121.79142684554218,"occurred":1257235200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1417339367000,"summary":"While taking pictures of the moon 3 objects were captured in front of the moon","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61733_submitter_file1__2009113LUNARFLYBY.jpg"],"weather":null,"zipcode":"94550","daysBetweenOccurrenceAndSubmission":1853,"locationName":"Livermore, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:79731"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Redmond","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were just arriving home when we spotted two, bright orange objects to the north of us. they were moving east slowly. we stopped the car and got out and tried to get some pictures. the object that eastern most began to flicker then blinked out  then the one behind it did the same. we got back in the car and saw another one very low on the horizon. it was also moving in a west to east fashion. we got video of this one.","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":61732,"landingOccurred":false,"latitude":44.2816303,"location":null,"logNumber":"US-11292014-0018","longitude":-121.1689512,"occurred":1417312800000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417327738000,"summary":"Three orange lights to the north","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Redmond, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79732"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Kirkland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is the second time in three months we have seen something in the sky. only this time there were about 9 or 10 of the bright, silent, orange orbs or discs in the sky flying a pattern from south to north. around the time the 6th one showed up we heard a plane overhead but it was above the cloud cover, these objects were under the cloud cover which would have made them aroung 500-1000 feet. at one point two of them seemed to fly in a different formation together before one object went up into clouds and the other one continued in a north east direction. lasted about an hour maybe. we got video of it on my fiancee iphone.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":61731,"landingOccurred":false,"latitude":47.689777500000005,"location":null,"logNumber":"US-11292014-0017","longitude":-122.1994053,"occurred":1417251660000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1417325181000,"summary":"Series of bright orange orbs with no sound","tags":["sound"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"98034","daysBetweenOccurrenceAndSubmission":0,"locationName":"Kirkland, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79733"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lee's Summit","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A triangular craft and a large craft over lee’s summit\r\n\r\n\r\nsunday evening november 16, 2014 beginning at 6:24 p.M. i observed what seemed to be a red pulsing light that caught my attention and which hovered in the sky. the compass direction was at approximately 345°, and about 18° altitude at about 1,320 ft.  after analysis of the videos it appeared to be a white light.\r\n\r\nfour short videos were  shot over a four minute span of time. the first two recordings from videos #1 and #2 were primarily of a white light that moved in various ways all over the screen, in which, at times, a second light appeared. they at first did not seem to be anything except randomly moving lights. the 3rd video showed at least  two lights that moved in tandem. these binary lights moved together and appear 7 times in the video and many lasted nearly a second before vanishing.  \r\n\r\nthe 4th video showed two lights at times, and then a third light which also moved precisely with the other two making it appear to be a triangular craft. in fact, the third video may very well have been a triangular craft as well, but the third light was not in the frame. the three lights moved precisely together when they did move.  the lights in all four videos essentially hovered in the same area over the four minutes. the analysis of this report is mainly from videos #1 and #4.\r\n\r\nseemingly random images from video #1 appeared all over the screen.  occasionally there were two together.  i made note of these binary images and formed a list of these “data points”.  later i merged them together onto an image to see if this was relevant information.\r\n\r\nthe data points from video #1 were taken from the raw untouched images and the color was inverted to remove the black of the sky. the relationships of all these individual pairs of images show what seems to be elements of different points from a large craft that appears to be cloaked, or at least not visible due to the darkness of the night. for whatever reason, the images become visible for just fractions of a second in seemingly random places.  but when assembled together, they show a logical and geometrically sound structure. it was approximately 350 feet long.\r\n\r\nanother group of images of a spheroid craft appear in video #1 randomly, and it appears to be following or surrounding the “cloaked” large craft. \r\n\r\nsummary\r\nmultiple flying craft were in the skies that night. some were rod-shaped, others were spheroids, one appears to be triangular, and one a large craft. it is not clear if there is a relationship between the triangular craft in the 4th video and the large craft of video #1. this still remains to be studied. they may part of the same object, or they may be separate craft. also, i have seen spheroid craft like this one before and they are reported in case # 61036 on october 20, 2014.   \r\n\r\nit is clear that there were several objects in the sky that evening. they were not aircraft of any known type, balloons, or helicopters, and they stayed hovering for at least four minutes.\r\n","distance":"501 Feet - 1 Mile","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":61730,"landingOccurred":false,"latitude":39.00720477296387,"location":null,"logNumber":"US-11292014-0016","longitude":-94.33332228532973,"occurred":1416191040000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1417313021000,"summary":"A triangular craft and a large craft over lees summit","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61730_submitter_file1__TriangularandLargeCraftReportImages.docx"],"weather":null,"zipcode":"64064","daysBetweenOccurrenceAndSubmission":12,"locationName":"Lee's Summit, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79734"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rainbow Lake","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were driving when my husband noticed a bright light in the blue sky.  the time was around 9:00am and the temperature was -32c, there were no clouds at all.  \r\n\r\nwe watched it for a bit joking that we finally had seen a ufo.. then it disappeared.  we were surprised at that but continued driving wondering what it was that we say.  about 3-5 minutes later the light reappeared but in a different place.  we watched as it moved through the sky, finally we decided to stop and then took some pictures.  i had my iphone 5s to max zoom when i took the picture, we could not make out the actual shape, but the light seemed to get brighter, also heard no sounds.  finally we went on our way and that was it.  i would like to know what it is we saw.\r\n\r\n[name removed/cms/tg]","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":61729,"landingOccurred":false,"latitude":58.5,"location":null,"logNumber":"CA-11292014-0015","longitude":-119.383056,"occurred":1417161600000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Square,  Rectangular","source":"MUFON","status":null,"submitted":1417311515000,"summary":"We saw it disappear then reappear.  watched if move around.","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61729_submitter_file1__10402593101527757650757956709643566243090154n.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Rainbow Lake, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79735"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lee's Summit","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Friday afternoon august 29, 2014 i was shooting images at about 13°angle from the horizon.  the time was 6:30 p.M. but there was still an hour before sundown. as i directed a \r\n300 mm telephoto lens skyward to a patch of open sky next to the house, i took some stills as well as a couple video shots. there were dozens of different shaped craft that moved very rapidly and then vanished. some were spheres, some looked like rods, others seemed to have panels that appeared to be extended. \r\n\r\nthis report will focus primarily on three of the vehicles that were observed in one of the videos that lasted 6 seconds. in all, 15 different craft appear the six seconds duration.  some were visible for only one frame, but the longest was up to 11 frames.\r\n\r\nthe first object which appears to have two panels of some type were open and appeared to be in process of either closing or at least changing their position. it buzzed across the screen in three frames, taking 1/10th of a second in frames :24, :25, and :26 at the end of the first second.\r\n\r\nthe second object appears next to the sun, and over the next 11 frames, which cover .36 seconds constantly changes shape from a rough diamond, circular, oval, to a short rod with two thinner rod-like protrusions, and then a vague blob in the final view.  \r\n\r\na third object appears shortly in frame 4:12 to be a faint white sphere. after some contrast highlighting, it becomes easier to see.  \r\n\r\nthis is but one view of the sky in a small section for a short duration. at nearly any time of day, these types of craft and many others can be seen when the white balance of the slr digital camera is tuned to be sensitive to brightness of the sun but in a very small sliver. this then allows the sensor to record  many kinds of craft which appear to be coming in and out of space.  whether they then cloak themselves, or continue on to other dimensions is unknown.\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Straight-line path","formattedAddress":null,"id":61728,"landingOccurred":false,"latitude":39.013432957680514,"location":null,"logNumber":"US-11292014-0014","longitude":-94.32413219652877,"occurred":1409361660000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1417311118000,"summary":"Many craft","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61728_submitter_file1__ManyCraftAug29ImagesOnly.docx","http://www.mufoncms.com/files_jeud8334j/61728_submitter_file2__DSC0123.MOV"],"weather":null,"zipcode":"64064","daysBetweenOccurrenceAndSubmission":92,"locationName":"Lee's Summit, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79736"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Virginia Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was @5:30am i was looking out a 2nd floor window of my house (which i often do when i have awakened early)facing west when i noticed a bright white light in the almost starless night.  i could see it slightly moving so i thought it was a helicopter at first, but it remained hovering for at least 45 minutes.  there was an oblong shape underneath it (it was somewhat far away, but not as far as a real star)and it flashed a red light intermittently.  at one point an airplane (? it flew like a plane and had a light) flew from the south in front of the bright light and disappeared to the north.  as it began to get light out (i watched it approx. 45 mins) i saw the light withdraw to the west as if at a very high speed.  did not look or act like a helicopter, airplane, drone or anything else i've ever seen. it was too far away to see any details, other than the lights and a vertical shape underneath. i felt when i was watching this object at first that maybe it was some sort of military helicopter (live near a base) but when it continued to hover in the same place for a long period of time it seemed rather odd.  i actually went downstairs and opened the front door to see if i could hear anything out of the ordinary (no).  the bright light never dimmed until it disappeared in the western sky.  it looked like it was almost being pulled to the west and the light was bright until it was a tiny speck, then gone.  i woke my husband to come look at this light, which he did and agreed it seemed strange.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":61727,"landingOccurred":false,"latitude":36.83445201676875,"location":null,"logNumber":"US-11292014-0013","longitude":-75.99465613197114,"occurred":1417269600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1417309275000,"summary":"Saw a bright white light that seemed round with a vertical shape under the light.  a red light flashed at times. when it got light out it withdrew.","tags":["lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"23451","daysBetweenOccurrenceAndSubmission":0,"locationName":"Virginia Beach, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79737"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Jacinto","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my daughters room in the early morning. i thought i heard her talking on the phone, due to it being almost 4 am. i went into the bedroom where she was sleeping, and came to realize she wasn't on the phone. now all i heard was a mumble and a one sided conversation that was taking place. i then turned on the light to see if she had the phone, and she did not. i then turned off the light, and was standing in front of the window talking to her. about 2 mins goes by, and i seen a flash come from outside, next thing i seen was this creature fast with backwards legs, sprinting across my patio. now i had the porch light on, so it was clear. it seemed to have smaller arms, shorter like from ours from our shoulder to our elbow. it could have been because it was sprinting, and had its arms up. it also had no hair on its body, and had skin the same color that of a plucked chicken or turkey. it was about 4-6 feet tall. i then got close to the window to look across the porch, and it was gone. this whole event happened 3 or 4ft in front of me.","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":61726,"landingOccurred":false,"latitude":33.77140040349509,"location":null,"logNumber":"US-11292014-0012","longitude":-116.94865501156585,"occurred":1417261560000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1417308076000,"summary":"N/a","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"92583","daysBetweenOccurrenceAndSubmission":0,"locationName":"San Jacinto, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79738"},{"address":null,"addressResolution":null,"altitude":"Landed, 500 Feet or Less, Over 500 Feet (under cloudcover), Unknown","city":"Phoenix","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I'm going to tell the story .I'm not going to reveal the exact location. i haven't been able to return to look for evidence .   i was out looking for traces of indian s in the mountains you will see that in the pic i had set my phone down on the ground. it took the picture by accident. i didn't know i had it until i got home . so obviously i was in the mountains about a two he four wheel drive. their was a massive thunderstorm. like i've never heard before it shook the ground . it was after that. that the ffirst pic was taken . so at the end of the day i was headed back .I stopped at one last place a mountain that had a spine of rock in the shape of a saddle .I was hiking around just as it was getting dark heading back to the truck .I saw across the clearing to the trees that edged a canyon a bright light passing behind the trees inside the canyon .I watched go a ways down.Turned to go get my phone to take a picture and as i did another one flew over my head and down over the trees into the canyon and down to the other one then they both went further down the canyon and stopped. i got the phone out to take a pic .But the battery was completely dead of course. and i was thinking great now nobody will believe any of this .  so i thought i'll drive the truck as far as i can go . to get closer so i tried to start it it woul d not start . the lights and dash had power but somehow no power to starter .It doesn't make any sense .Besides its a toyota it always starts on the first turn of the key . so i got out. and as i was looking  up to see if i could see anything else .I heard a lot of noise and noticed this thing that looked like a slice of pie shape not a triangle but more like a wedge with a light on both sides toward the front and what looked like two light at he back but could have also been motors ? it sounded like it was having major problems . as i watched it it flewcloser i could see that it had a thickness or structure. as soon as it flew past the spine it turned to the same light as the other two and was silent it also flew down into the canyon and joined them and they just sat there .I pulled out my spotting scope but all i could see was the light from them so i started looking to the sky for more i noticed what looked like a question mark of lights or stars but i realised that it was below the cloud cover .Their were many points or kinds of lights around it.When it was between the spine of the mountain it seemed very close. and i had this overwhelming thought or feeling that it or whatever i can't explain it but i feel it said to me .Their are only 19 of us left! meaning them or it . whatever it is i don't know and i don't understand .At this point i'm very frustrated with the whole experience. i have tried to prove it and i have a lot of evidence to the good. i have tried to debunk it and keep coming to the same conclusion. its real its a machine of some kind and it huge . i also have many other pics since then of many other craft . in other places. also i will say this on my way out of the mountains their were probably 20 other crafts or lights from craft? parked on the sides or tops also down in the the valleys .And theirs much more to tell. also my ex wife who was a complete skeptic . now understands .Because she also has an incredible set of pics from around the same area probably 30 miles or so from mine. but the same kind of crafts . bottom line now she believe s . the blue pic is the fist one the others are enhanced in trying to get past the cloud . check the edges of the cloud note the s shape or questionmark and how its attached to the rest of the machine also note the way this thing came through the atmosphere .At least that's how it looks to me .I've worked on getting as close as i can to the final keep in mind i'm not a computer person .So it took a lot to get there .The last photos are of my computer screen because i couldn't figure out how to save the image once i had it zoomed to this size i know how i did it taking away seemed to be the best instead of adding so the last are all from the same picture . i zoomed and only changed pixel rate as focus changed i can do it with the same result with this photo always. it never turns out the same in trials with no picture .Just zooming and pixelation so i believe i've got it right .That's why i'm sending in so someone can help with it .? thank you for the consideration. and know this they are will here as close as the 25 of nov. ","distance":"101-500 Feet, Over 1 Mile, Unknown","duration":"02:01:01","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Path then hovering,Other","formattedAddress":null,"id":61725,"landingOccurred":false,"latitude":33.452037100000005,"location":null,"logNumber":"US-11292014-0011","longitude":-112.0699273,"occurred":1409965260000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1417307306000,"summary":"It can't be told in 25 words .To much information . /events . ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61725_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/61725_submitter_file2__image.jpg","http://www.mufoncms.com/files_jeud8334j/61725_submitter_file3__image.jpg","http://www.mufoncms.com/files_jeud8334j/61725_submitter_file4__image.jpg","http://www.mufoncms.com/files_jeud8334j/61725_submitter_file5__image.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":84,"locationName":"Phoenix, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79739"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Trinidad","country":"Uruguay","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hola. soy periodista de trinidad. ese dã­a (fecha y hora exactas en la foto) recorrã­amos un barrio de trinidad con un edil para reclamar por alumbrado. despuã©s, al revisar las fotos en la pc me encuentro la primer foto (la que tiene fecha y hora) y me llama la atenciã³n el objeto alargado. se las dejo para que las evalãºen.","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"N/A","formattedAddress":null,"id":61724,"landingOccurred":false,"latitude":-33.5201418,"location":null,"logNumber":"UY-11292014-0010","longitude":-56.9042201,"occurred":1372363980000,"potentialRelations":[],"rating":"Unrated","region":"Flores","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1417304132000,"summary":"Despuã©s, al revisar las fotos en la pc me encuentro la foto y me llama la atenciã³n","tags":["none"],"timeZone":"America/Montevideo","timeZoneName":"America/Montevideo","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/61724_submitter_file1__27JUNIO084.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":520,"locationName":"Trinidad, Flores","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79740"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Hiawatha","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 2:53 p.M. on november 6, 2014 i was out walking my dog and saw a cigar shaped object moving from the southeast to the northwest.  the reflective object was at about 25,000 feet and lower than a passenger jet in the vicinity. the object was moving slower than the dark passenger jet which appeared to be at about 34,000 feet and flying from east to west.  there was no sound and no con-trail.  the object appeared to be flying horizontal. the cigar-shaped object was larger that the passenger jet. the observation lasted two to three minutes.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":61721,"landingOccurred":false,"latitude":42.0537454,"location":null,"logNumber":"US-11292014-0007","longitude":-91.66637949999999,"occurred":1415314380000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1417283574000,"summary":"Cigar shaped object in broad daylight","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"52233","daysBetweenOccurrenceAndSubmission":22,"locationName":"Hiawatha, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79741"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Baton Rouge","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at home when i was told to look up in the night sk u at strange lights i instantly started recording and got the whole thing on video!! mufon u guys have to see this footage! i believe i have captured the best ufo evidence in history! it moved like nothing i've seen before and sent chills down my spine as i recorded it","distance":"Over One Mile","duration":"01:00:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":61720,"landingOccurred":false,"latitude":30.386828999880873,"location":null,"logNumber":"US-11292014-0005","longitude":-90.9909933578186,"occurred":1417166040000,"potentialRelations":[],"rating":"Unrated","region":"Louisiana","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1417259582000,"summary":"Cebook saw strange lights so i recorded thr event in hd and have thr footage now!","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"70817","daysBetweenOccurrenceAndSubmission":1,"locationName":"Baton Rouge, Louisiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79742"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Little Rock","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was 13 years old and was at henderson junior high track filed practicing my 440 yard runs. i observed just off to the side of the track field an object that slowly materialized and was about 1000 feet above the ground. it was not moving and there was no noise and it was hovering above a small stream and some tree's by track field. the birds never stopped making noise and were not disturbed by the object. i was doing my runs and had just stopped to breath a little before i would run another 440 yard run for time and spotted the object as it began to materialize.\r\nit was cylinder in shape about 100 yard long and about 50 feet in diameter. it took about 2 minutes to fully become visible and never moved. it had no lights or sound and no port like holes for windows or doors that i could see.The birds were not disturbed and the traffic never stopped to see what i was seeing so i figure that it was not observed by anyone else. there was never any movement or lights or anything unusual about this craft i seen except i noticed that sunlight did not reflect off of it or it did not appear to have a shinny surface. sort of just soaked up the sun light i guess.\r\nno one witnessed this event to my knowledge and it was visible for about 5 minutes and then slowly just became invisible like it had appeared.\r\ni would be very thankful for any information as to how many people have seen objects like this that did not have lights, never moved and had no opening as far as i could see.I know what i seen was real yet i do not believe in aliens. i consider that only two forces in the whole universe has ability to have crafts of such and they are controlled by my belief in god. i do not consider what i seen to have been from anywhere else but gods domain as i don't think he would allow such from the evil angels to come to earth. now this belief is only since  i would say within the last 2 or 3 years comes to my mind. i think we are protected by god myself. but i do know that what i seen was real.\r\ni do not think any craft needed for space travel would need lights for anti collision and i would not consider smoke from chemical fuels rockets would be used either. distance for space travel is too great for such chemical type rockets. the appearing without movement and then leaving the same is close to what i would think would happen with a ship from god. i know the bible well and have read of smoke and lightning and such in events that took place in the bible and flying chariots and fire and smoke but this was not like that and i don't think it would be needed by god as well.\r\ni think this planet is protected by god and if there are aliens then they are bound by his creation to not come to earth in my beliefs. maybe long ago such happened but not after a period of old times. i think god placed a do not go there order upon any aliens if there are such!I really would like to know of such same type object seen before and same shape and descriptions as i have given. i just basically want to know if others have seen what i have seen. thank you","distance":"501 Feet - 1 Mile","duration":"12:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":61719,"landingOccurred":false,"latitude":34.76625394335281,"location":null,"logNumber":"US-11292014-0005","longitude":-92.36491153882513,"occurred":-23342400000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1417258563000,"summary":"100 yard cylindar length 50 feet diameter no sunlight reflected off dull grey color","tags":["light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"72205","daysBetweenOccurrenceAndSubmission":16673,"locationName":"Little Rock, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:79743"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":914}
