{"content":[{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Edmonton","country":"Canada","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"The twin globes were flying north to south no sound emission through outencounter.No fear or adverse effects noticed by subjects,objects were justunderneath cloud cover as light was reflected off clouds. objects were followingeach other in standard flight pattern. no notice in eletro-magneticinterference.No other reactions besides awe and elation upon seeing such craftyourself and knowing we are not alone.","distance":"101-500 Feet","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":2014,"landingOccurred":false,"latitude":53.543564,"location":null,"logNumber":"","longitude":-113.490452,"occurred":901335840000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":901335840000,"summary":"Twin balls of light","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Edmonton, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3163"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tulsa","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was standing in the front yard smoking a cigar...The sky seemed cloudy..Nostars...Then one by one the stars appeared...Normal brightness strange pattern..Ther were seven or eight stars all lined up in a straight line...Three wereclose together..Then they seperated...Not far but far enough to notice...As istared straight at a abnormaly blinking star, i noticed it wobbleing back andforth, up and down side to side...If i moved my vision slightly, it would appearin its normal position...Due south of my house...Then i saw the first of about15 to 20 crafts fly over my house...It was square shaped, with the edges cutoff..Almost octagon shaped...It had lights around the botom, like a normalpassenger jet would..Only with one at the rear and at each cut corner..Only witha brighter one in the middle...The outer, were bright white..The middle wasbright red...These lightsstobed in a circular pattern, giving the apperance of the craft being round...Then they began to blink in an almost moris code pattern...Two reds, one white..Two whites one red...Then four then  one two one two three...I counted them outloud,it seemed as though they could here me or read my thoughts...I started laughingout loud...This kept on until it faded out of my sight...Due west of my house..Then the next one...Same thing..Different flight pattern....Then it fadedaway...Then suddenly it was one half mile closer to me, in a split second....It appeared so fast i think it may have been another craft coming out of acloaked state...Invisable, almost..I saw a slight blur when it appeared...Then several more did the same fly over as the first...They were dark grayblackacross the underside....Flying at a normal slowish speed appearing to be showingthemselfs to me,...Since all of them flew over or around my home...They made noaudible sound...Nothing...No whisper...No roar...They were 700 ft up...Some lower...Then i saw an amazing shooting star...Just west of my house....Itwas brighter than ive ever seen before...With a very long srteem behind..With afirery ball in front...Then more crafts....Then as i saw another coming in thedistance, a smaller jet dashed towards the craft...It was heading in anintercept course, but as it got closer to the craft,it flew under it...Directlyin front of its position....It just kept on flying straightahead...The craft flew right on by me....Then i saw a bright white light flyingback the opposite direction of all these crafts...Much","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Straight-line path","formattedAddress":null,"id":2013,"landingOccurred":false,"latitude":36.1574216,"location":null,"logNumber":"","longitude":-95.986235,"occurred":1038846000000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Square,  Rectagular","source":"MUFON","status":null,"submitted":1038846000000,"summary":"Strange planes","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tulsa, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3164"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Conway  Longs","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was leaving a friends house about 4am on the morning of thanksgiving. leavingconway, i was driving northwest on hwy 701 towards hwy 22. it was a very clearnight and i had been admiring the sky as i was driving. i noticed a brightgolden object off to the right. i figured it was the planet venus but continuedto watch it as i drove, because it looked much bigger and brighter than venusand it was a very bright gold. as i got onto 22 going east towards myrtle beach,the object was now on my far right. glancing at it occaisionally, it suddenlycrossed my field of view moving towards the north carolina border, where it cameto a dead stop. i noticed that it was a sort of a flatened cone shape, almostlike a spinning top. it faded for a few moments then reappeared. turning ontohwy 905, i was now driving towards the object.When i got home, it was still hovering just above the treeline. the objectremained in place, i continued to watch it for about 30 minutes from my backdoor window until i became too tired and went to bed around 5am.During this time i became very nervous, because down the road it appeared to benear the location of my house. next door in a neighbors yard, a group of dogswere extremely agitated, barking and yelping uncontrollably. admitedly, thesedogs do bark frequently, but they have never behaved this intensely. i haventdiscussed this with anyone except the friend whose house i had been leaving.Again i ask my name be witheld.","distance":"501 Feet - 1 Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":2012,"landingOccurred":false,"latitude":33.8581129,"location":null,"logNumber":"","longitude":-78.8228485,"occurred":1038486600000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Cone","source":"MUFON","status":null,"submitted":1038486600000,"summary":"Conwaylongs, south carolina","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Conway  Longs, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3165"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"New Port Richey","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"After watching fireworks on the 4th of july and then going over to a friends, weleft to go home. while driving down a dirt road, my wife and kids startedscreaming, look look oh my god, look i could not imediatley see what they werelooking at, but just prior to turning on our road, i saw it, i was totallyastounded. a triangle shaped craft hovering just over the tree tops, i turnedonto our road and pulled right underneath it. as i could not hear any sound, iturned off the car engine, still no sound, i got out of the car. standingdirectly beneath the object, 50-60 i could only hear a faint whir. i literallystarted banging my head on the car, i was and still am in a state of total awefinally, i bent down to pick up a rock, i was going to try to see what sound orreation would occur. then my wife and kids really started screaming they did notknow what happened to me, i imedately stood up and then the craft gently startedmoving opisite the direction the car was pointing. i jumped in and made a quicku turn, just as we started to catch up, it started increasing speed, just enoughto stay ahead of us. by the time we reached the end of the road, we weretraveling 80 mph foot to the floor. there were tall trees at the end of theroad, so the craft climbed steeply at least 45 degrees, then banked hard left,flying over what is referred to as the potburg ranch property, several hundredacres of wooded land. the craft never exceeded 200 altitude. the body was wellcamoflauged against the nite sky, it had only 3 lites eminatting from it, 2 onthe rear, 1 on the front, all were redorange, and projector like, we could notsee the source of the light. i stood beneath this object for a good minute andlikely closer to 2 minutes. it was aprox. the size of a large doublwide moblehome and hovered not more than 60 above myour heads, the only sound was a faintwhirring noise, probably more silent than my computer cooling fan. i called thelocal sheriffs office the same night, they actually laughed at me, i did noteven say ufo, or anything of the sort. i just said there was a strange objectand wanted to know if they had any other reports. there is no admitted craft,either civillian or military that could do what this object did. i still feel asense of helplessness","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":2011,"landingOccurred":false,"latitude":28.2441768,"location":null,"logNumber":"","longitude":-82.7192671,"occurred":770757300000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":770757300000,"summary":"Triangle shaped ufo viewed from 50-60 feet, overhe","tags":["triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New Port Richey, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3166"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Parchment","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I went outside to have a cigarette as i do not smoke insidei immediately noticed two star-like objects moving together, keeping the samespace between them as if they were connected.  they seemed to be moving slowerthan an airplane, and the lights were not blinking. i first saw them just beyondthe radio towers next to our house.  there are four towers, belonging to wkzoradio.  i watched for a little more than a minute, walking out into the yard toget a better look away from the lights inside the house.  i was hoping to see itthere was an unlit object between the lights, because it appeared there was, andi was looking ahead of the object to see if any stars lined up with the path itwas heading, to see if something might interfere with the light from the stars. it was then that the lights began to fade, as if going into a thin cloud bank. the sky was clear however.  i watched for a few more minutes, but saw nothingelse.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2010,"landingOccurred":false,"latitude":42.3280952,"location":null,"logNumber":"","longitude":-85.5697296,"occurred":1038885000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1038885000000,"summary":"Two star-like objects moving together","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Parchment, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3167"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Seaford","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was driving to work going north on rt 13 and at that time in the morning it isstill dark and there is not a lot of traffic on the road. out of the corner ofmy eye i saw the object streaking across the sky. at first i thought it was afalling star but first of all it was too big for that and secondly it was greenin color. finally what made me realize that it wasnt a falling star was the factthat it was traveling south to north, not top to bottom like a falling starwould normally do. my reaction to this sighting was to hit the brakes and swervemy truck involuntarily. thankfully there were no vehicles around. the objectreminded me of two things. first the size and shape looked like the haley cometthat was in the sky several years ago but this was green in color and travelingvery fast. secondly it reminded me of the pictures from the news of misslesbeing fired over in iraq at night. it was traveling at what i would think themissle rate of speed but looked like the haley comet, but green. i did becomescared because when it disappeared i was honestly waiting for an explosion tooccur.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2009,"landingOccurred":false,"latitude":38.6412256,"location":null,"logNumber":"","longitude":-75.6110381,"occurred":1038835200000,"potentialRelations":[],"rating":"Unrated","region":"Delaware","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1038835200000,"summary":"I saw a green tinted flash traveling across the sk","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Seaford, Delaware","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3168"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Oviedo","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was around 226 am on early december 2nd, 2002. i was busy turning off variouslights in the house and preparing to go to bed. i put my 2 cats out the frontdoor and went to the back of the house to draw my vertical blinds closed thesliding glass door leading to the backyard. as i did so, i noticed a slow,steady moving object with very bright light heading in a southsoutheasterlycourse. living in oviedo, florida, we are located between sanford internationalairport and orlando insternational airport and have planes frequently landing ateither airport. i stepped outside to observe the object looking for anypulsating red lights or strobes typical on airplanes. as the object got closerin view, i noticed there were no strobes or red lights seen on wingtips. i alsonoticed the light coming from it was a bluish hazeextremely bright white light.This light was brighter than any landing light seen on an airplane. the lightalso faded a little but never lost its brillance. the light continued its coursewith slight irratic movement to the right. it would almost move slow then speedup going straight sideways only a few meters or so, then continue going forwardagain. after realizing what i was possibly viewing, i noticed that everythingaround me in terms of the environment was extremely still, dead silent and verycold it was cold last night in orlando, some 40 degrees. the silencestillnesswas very unnerving. this caused a sense of fear in me and something instinct,not telepathy was telling me to get back inside the house. for some reason, ihad a general fear of the object but was extremely curious. perhaps, this wasdue to various abduction stories you hear about along with the high profilecases such as travis walton. i went back in the house to collect my nerves. wheni had worked enough courage to look back out, the object was gone completely. iwonder if sanford international, orlando international or nasa picked upanything on radar","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2008,"landingOccurred":false,"latitude":28.678797,"location":null,"logNumber":"","longitude":-81.2070403,"occurred":1038824760000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1038824760000,"summary":"Saw an irratic and slow moving light","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oviedo, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3169"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in the porch, reading  a book with the artificial ligth we had there. losangeles, july 7, 2000, silverlake hills. i saw what i thought could be a lostfirework the 4th of july was close aproaching from the north, over the mountainswith an erratic trajectory, when it was just over my head stopped suddenly andbecame very, very  brilliant, with an extremely glowing brigth white light.Itcould be an explosion of some sort. after 30 seconds of so...The ball of lightgrows bigger and projected four rays of light that made a perfect cross. at thispoint i called my roommate and both of us saw the fenomenon. it lasted around 20minutes, after that all that was left was a glowing phosphorescent green light.We were convinced we were seing a real ufo. it was around 920 pm, at 10 pm thenews on tv announced that a u.S missile interceptor launched from a pacificisland had missed its target a dummy warhead gliding throught space, authoritiessaid friday. there are pictures in the la times of sunday july 9,2000. however,there are some data that doesnt match with what i saw. for instance what i sawwas the supposed dummy warhead that according to the newspaper continued itscourse towards the pacific instaid of freezed over silverlake and diplay thelight show. the first report on tv we heard around 10 pmtalked about the warheadcrashing agains an unidentified object. we never heard this version again. butwe saw helicopters above our heads flying around the area where we saw thelights. the timing its odd too, since as far as we remember it did happenedbefore according to the news happened. but since the whole thing was part of afailed24100 million test for the anti-missile system we havent heard a word or readanything else beside the loussy report of the los angeles times.","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":2007,"landingOccurred":false,"latitude":34.0582542,"location":null,"logNumber":"","longitude":-118.2393549,"occurred":963030000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":963030000000,"summary":"Ufo july 7, 2000,  around 920 pm silverlake hills,","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Angeles, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3170"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Winterset","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was star gazing and i noticed that the stars shouldnt move like that and istarted to watch it and it was like they were flying in formation but a 180degree change in flight isnt possible instanttaniously by any thing i know of. a shooting star but then i noticed several and they werent falling in theattmostphere but more like flying. i was awe struck by the shere mobiliy ofthese ufo s they flew in a delta shape like they were going somewhere and thentwice they changed directions 180 degrees. i lost sight of them when they flewover the horizone.","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Unknown","formattedAddress":null,"id":2006,"landingOccurred":false,"latitude":41.3336537,"location":null,"logNumber":"","longitude":-94.0038893,"occurred":1038587640000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Cone","source":"MUFON","status":null,"submitted":1038587640000,"summary":"A group of floating bright spheres in a formation","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Winterset, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3171"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Pittsburg","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was watering the yard, when i looked up and noticed a rather large round ballof light moving northeast just above the horizion, not very fast i ran into thehouse for the video camers a filmed it as best i could. i couldnt tell what itwas. just a big round ball of light moving slowly, with no sound.As i wasfilming i tried to focus the object in closer and only suceeded in getting afuzzy shot at times. it moved slowly in a north east direction, and seem to begoing down at the same time.As i was filming, i stop for a few seconds to findthe zoom button, and when i looked back up with my naked eye, it was going out,down to the size of a pin head then went out all to gether. i didnt get thatpart on film.The video tape is just over a minute long, and only has a fewseconds here  there, that are my best shots of it. but even there not thatgreat. but i noticed when i slowed the film down, it does look like it ispulsating. you got me","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2005,"landingOccurred":false,"latitude":37.8339241,"location":null,"logNumber":"","longitude":-93.3004738,"occurred":1038793440000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1038793440000,"summary":"Saw round ball of light","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pittsburg, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3172"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Oxford","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Got up to get a drink of water. looked up out window over sink, the bright lightcaught my eye.First thought it was the headlights of an airplane comming towardsus. wow, what the24 is that called husband to view. tried to anolize it . could not. it washuge. it moved very slowly if at all. seamed to hover. it kept changing shapeand color. had no sound. of course we were in the house, couldnt really tell ifthere was a sound. started out round, got flat on left side. then got flat ontop. changed from white to red and back again. had yellow green rim. changedshape to christmas bulb shape. top square part seemed to have a window in it ,it looked purple inside. had two parallel rings around it, close to its roundbody part. looked like there was a small ring in the round part center with fourlines stemming from this center circle forming an x. shape was like a ball witha box on top and two rings tightly around ball part. with large window in boxpart that took up the whole shape of the box part. center was purple.","distance":"Unknown","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Dome,  Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":2004,"landingOccurred":false,"latitude":42.1167621,"location":null,"logNumber":"","longitude":-71.8647941,"occurred":1038484800000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1038484800000,"summary":" saw a very large light in the night sky that chan","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oxford, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3173"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lufkin","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Smoking cigarette outside with girlfriend. saw triangular light pattern crossthe sky at high altitude in less than 3 seconds..Silent, no trail. headingsouthwest about 10 pm 113002..Figure it to be military, would like to know whatwe have.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2003,"landingOccurred":false,"latitude":31.3382406,"location":null,"logNumber":"","longitude":-94.729097,"occurred":1038722400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1038722400000,"summary":"High speed over lufkin, tx10pm 113002","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lufkin, Texas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3174"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Leavenworth","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was standing on my back porch looking up at the night sky, and it was amazingthat i had just thought to myself thast i onlt had about a thirty degree view ofthe overhead  sky because i have a canvas awning over the back deck.  i pftenlook up at the stars and have on numerous occasions been lucky enough to see asatelite.I was looking straight up and noticed three points of light that i st firstthought to be stars.  i then noticed that they were moving...In unison.  theyformed a triangle of sorts.  i could not make out any surface detail.  it semedto be a matte or dark color, if it was a color.  i even think it could have beentransparent.  i continued to look at it.  to say the least, i was shocked.  itwas moving towards the north, slowly.  gently, flowingly, and silently itchanged direction towards the north east and then to the north west.It was ableto change direction witin the span of its own size  on its own axis  i thenthought it had the same type of fluidity of motion that a glider aircraft wouldhave. but that doesnt make sense either.  within less tghan a minute i could nolonger see it.  it blended in with the backdrop of stars.  man the strange thingis this was huge, and it was dead silent.  but why the lights  this was strange. i live 20 miles from kansas city intl airport and i see aircraft all the time. but this made no noise, it had no lights from passenger compartments, no landinglights, no flashing lights.I dont know what my lat and long is.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":2002,"landingOccurred":false,"latitude":39.3157612,"location":null,"logNumber":"US-08072011-0070","longitude":-94.9198137,"occurred":1038714300000,"potentialRelations":[],"rating":"Unrated","region":"Kansas","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1038714300000,"summary":"Saw large triangular shape at night , silent, smoo","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Leavenworth, Kansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3175"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Winterset","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Was on my way inside from work when i heard a strange whining noise i jumped andturned around. what looked like a psychadellic cone came hovering downward. itlanded approxametly 15 feet in front of me and nocked me to the ground. i thenran inside to use the cell phone, which to my surprise was emitting a strangewhirring noise. i obsereved that the tv and computer where flashing and changingatations randomly. the music that my cd player was playing became verrydistorted and a voice came on the track. it was ery deep and distorted. iscreamed and ran to the window. a small violet object came hovering towards mefrom he cone with a gun like object in his hand. it looked like some sort ofape. it approached the window and i recoiled in fear i felt helpless he fadedout of view and then appeared diectly in front of me. i screamed back you deviland i noticed the device he was holding was actually a probe of some sort. iturned and coward in the corner facing the wall with my butt in the air.I then felt a great pain in my anus and screamed at the top of my lungs. iquickly turned and he was gone. confused, i","distance":"20 Feet or Less","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Window(s),  Appendage(s)","flightPath":"Other","formattedAddress":null,"id":2001,"landingOccurred":false,"latitude":41.3308237,"location":null,"logNumber":"","longitude":-94.0138393,"occurred":1038587400000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Cone","source":"MUFON","status":null,"submitted":1038587400000,"summary":"Alien encounter","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Winterset, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3176"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kansas City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"  i saw this slim silver colored object when i was driving on gillham rd andlinwood gillham is north bound linwood is east  west gillham also is bothnorth and south bound . but i was traveling north bound on  gillham in kansascity,mo -in -the -midtown district of kansas city-it was a bright sunnyday  and  a cold saturday at 1300 hours100pm.I  saw this object pass infront a tv  tower formly tv 5 tower  tv 19 tower this   is the tallest tv towerin the usa  plus this  thing ufo was about 12 was up the tower far asheight the ufo was  2 - or- 3 miles distance from the  tower but it passed infront of the tower .Also i watched the object  and  saw  it looked like aairforce  or  airforces type of fighter plan was  2-3-miles away from theufo and  5,000 feet above the ufo .The ufo at a super high rate of speed tookoff and  was gone so fast i had to think about what i had  just saw in the sky.James,allen,tutt,jr mufon field investigator i.D. 7606kansas city  missouri","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2000,"landingOccurred":false,"latitude":39.1053965,"location":null,"logNumber":"","longitude":-94.5729967,"occurred":1038690000000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1038690000000,"summary":"Ufo sighting over kansas city,mo-slim silver -obje","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kansas City, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3177"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Saskatoon","country":"Canada","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":" i saw a ufo on november 26th. me and my 2 friends droveout kinda on the outskirts of town to just chill out and talk. weparked off the side of the road, and we must have been there forabout an hour or so. we were talking and talking when we saw thisreally bright lights in the back window. we thought it was a carcoming down the road. the lights were getting brighter and brighter,and we were like a2424hole,has his brights on, but they eventuallygot so bright that we knew it was a car, and there were way more than2 lights on it anyway. we got the hell outta there as fast as wecould so we took off up ahead of the road, knowing that it would leadus knowherethe nearest town in that direction would be at least a45 minute drive. we could still see the lights behind us. we realizedthat this way was definitely not the way home, so we all agreed toturn around and get back into the city as fast as possible. we turnedaround and started driving back. there is a bit of a hill on the wayback, and the ufo must have lowered a bit or something bc althoughwe could not see the actual lights anymore, we could see itsradiance shining out from behind the hill. it was so bright, kindof an orangy red colour. and we were driving right towards thefreakin thing. i was so scared, my foot was shaking and and bouncingup and down on the gas pedal. i started saying the our father i wasso scared. it soon moved to our left and flew into the air quickly aabout 100 ft. i looked long and flat, with some type of aerodynamicpoint on the front, and theres was dozens of brights orange andyellow lights all over it. we had our windows rolled down about6 inches bc we had been smoking. anyeays, we hadnt rolled themup at all, and we noticed that this aircraft was not making anynoise at all. it had no wings, or propellor, and it was just hoveringin the sky, in the exact same spot for about 30 sec- 1 min. all wecould say was what the hell is that, drive faster, etc. it beganmoving towards our right so that we could now see it out of th","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":1999,"landingOccurred":false,"latitude":52.13437,"location":null,"logNumber":"","longitude":-106.647656,"occurred":1038383100000,"potentialRelations":[],"rating":"Unrated","region":"Saskatchewan","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1038383100000,"summary":"Flying very low, very bright, made no sound","tags":["sound"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Saskatoon, Saskatchewan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3178"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Philadelphia","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in my yard looking at jupiter with my 60mm telescope. i started to get acrook in my neck so i stood up to stretch. at first i saw nothing. then a fewseconds later i noticed a flourescent blue-green cloud appear directly above me.At first i was curious, i had never seen an atmospheric condition of this sort.But as the cloud began to grow, i became nervous as i began to think that it maybe radioative in nature. the clouds behavior was exactly like if you were toblow ink into water through a straw. the back door was open and the lights wereon. when i looked in to call my mother and siblings out to come and see, inoticed that they were all asleep. as i continued to look on, the cloud began todisepate. this was no aroua borialis. its structure was to well defined, justlike to billowing cloud of the space shuttle during take-off. eventually thecloud vanished, to my relief, and i was left wondering were 3 hours had gonesince my activites start at 10pm and the cloud disepated after 1am. but theevent only lasted a little over a minute.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":1998,"landingOccurred":false,"latitude":39.959995,"location":null,"logNumber":"","longitude":-75.157359,"occurred":498286800000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":498286800000,"summary":"Flourescent green cloud","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Philadelphia, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3179"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Texarkana","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was on my way to church and before i got on the overpass to cross i-30, i saw an object in the sky.  it looked like a greenish white light that arced over the trees.  it was first a thick line then mushroomed to a sphere-like object that collapsed back to the thick line and continuing arcing toward the ground. i yelled for my daughter to look to the north and she observed the same object. the line then mushroomed once more into a sphere like object and then collapsed into the line again arcing toward the trees.  that's all we saw.  it was on sunday, 11-24-02 at about 5:55 p.M.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":1997,"landingOccurred":false,"latitude":33.4417915,"location":null,"logNumber":"","longitude":-94.0376881,"occurred":1038189000000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1038189000000,"summary":"Greenish white light from line to sphere and back","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Texarkana, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3180"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Rapid City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My daughters  i were driving north on a deserted country road at approx. 7pm 28nov 2002.  we saw a glowing green light slowly descending over a field ne of us. it looked round to me, but teardrop shaped to my daughters.  i was driving  wasafraid to stop, so i didnt get to stare at it like my daughters did, i keptglancing at it every few seconds.  we saw nothing go up, so we do not believethat it was a flare.  the light glowed steadily for 2-3 minutes and thendisappeared behind a hill.  we did not see anything for the 3-5 minutes it tookus to reach the road we live on.  we all kept looking in the direction we sawthe light.  we didnt see the glow again, but when we started up our hill we saw5-10 cars stopped with their lights on beyond the hill where the light wentdown.  there were several people with flashlights along the road  out in thepastures bordering the road.  near the cars was an object that flashed white red.  i drove very slowly up our hill  we kept the cars in sight for at least 5minutes.  i was afraid to stop, because if we could see them, they could see us. the road on our hill leads to our complex  no where else  i didnt want anyoneto come looking for us.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":1996,"landingOccurred":false,"latitude":44.0805434,"location":null,"logNumber":"","longitude":-103.2310149,"occurred":1038538800000,"potentialRelations":[],"rating":"Unrated","region":"South Dakota","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1038538800000,"summary":"Glowing green light descending.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Rapid City, South Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3181"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Rio de Janeiro","country":"Brazil","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"P.S. this form has a htmljavascript coding error - this is a foreign report, sothere is no stateprovince applicable, but it requires it. as i already lived inca, i filled in just for submission acceptance.A detailed description of a strange but very real fact.I was just 17 years old, and it was saturday, about a week before my 18 junebirthday in rio de janeiro. when the weather was nice, i and my friendssometimes went to a distant neighborhood named barra da tijuca now full of plushskyscrapers to bowl, drink and enjoy a good time in front of a beautiful beachwith our girlfriends. there is also a nice restaurant at the very end of the15-mile long beach.This scene is pretty common, but one day i was driving back in my blue opalachevrolet from this restaurant at 315 am, speeding over 120 kmh 75 mih on thebumpy beach side road, to arrive to the girl92s home before her mother woke up.  singing happy while listening to the radio,and seeing the beautiful night sky with a full moon and bright stars, i wastotally unconcerned while my special yellow high headlights were vanishing thedarkness ahead of us. when the road was","distance":"21-100 Feet","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary","formattedAddress":null,"id":1994,"landingOccurred":false,"latitude":-22.9035393,"location":null,"logNumber":"","longitude":-43.2095869,"occurred":14121900000,"potentialRelations":[2651],"rating":"Unrated","region":"Rio de Janeiro","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":14121900000,"summary":"Large ufo descended over brazilian couple in 1970.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Rio de Janeiro, Rio de Janeiro","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3182"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Central Point","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I went out to smoke and i looked off in the distance and i saw a light i hadseen the night before, well the night before i thought it was the space stationthe news had reported. i went in to get my mother to come out to look and whenshe did i noticed a second light. we watched these two lights and as we did theystarted to move up and down, side to side, and in angles. i thought it was myeyes playing tricks with me but i had made myself stationary so my body wouldnot move from side to side and the objects still appeard to have moved theywould go behind trees and then a second later be above the trees.Well afterabout an hour of watching this one of the lights moved way off in the distanceto the point where it looked like a star and has remained there since. i hadgotten in my truck and drove in the same direction as the object but the more idrove the further they would get. as i got home i looked up and it seemed asthey where coming back. after about 10 minutes a third light had appeared frombehind some trees to our left. it was low eough that we thought it was asecurity light on the house but it to started to move. now the lights make aperfect very large triangle in the sky.","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":1992,"landingOccurred":false,"latitude":42.3403209,"location":null,"logNumber":"","longitude":-122.942223,"occurred":1038551400000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1038551400000,"summary":"Triangle in the night skies of central oregon","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Central Point, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3183"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Memphis","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was on 21st floor of friends apt bldg watching the planes approach the airportwhich is halfway across memphis. i was downtown looking eastward. i saw anobject which at first i thought was a cargo jet but quickly realized had nolights and no sound, and was too close to be a jet being in the middle ofdowntown. i called my friend to see it and we witnessed it float behind abuilding across the street and then come out the other side and keep goingtoward the city. the object was dark and it was nighttime around 730 so it washard to see the exact shape but it appeared about 20-30 feet long and had somekind of smaller objects attatched to it almost like jet engines on a wing. theobject came in from the north and passed by us about 200-300 feet away then kepton its path headed southeast. it appeared to be floating in the wind but i dontknow what direction the wind was. it was eye level to us about 200 feet movingabout 20 mph. as it floated away, we lost sight of it into the darkness ofnight. the shape was very hard to distinguish. my friend said it looked morelike a cube to him. i have not asked him about his anonymity yet but will assoon as i talk to him again. that night i felt an acute sense of relaxation forthe rest of the night. when i brought it up at work, 2 men said they hadwitnessed a gray craft near the airport in the daytime the week before whichlooked just like an airliner but was staionary in the sky, then bolted off inone direction, stopped again, then bolted again and left.  i cant help but thinkthe two are related but what i saw did not stop and was much smaller than anairliner. i am interested to see if anyone else in memphis has reported anythinglike this. i would be grateful to get an email or call if this is true.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Straight-line path","formattedAddress":null,"id":1990,"landingOccurred":false,"latitude":35.1562443,"location":null,"logNumber":"","longitude":-90.0473901,"occurred":1038195000000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1038195000000,"summary":"Dark gray object floating through downtown memphis","tags":["floating"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Memphis, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3184"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Shoreline Seattle","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":null,"distance":"Over One Mile","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":1989,"landingOccurred":false,"latitude":47.7544646,"location":null,"logNumber":"","longitude":-122.3390117,"occurred":1036267200000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1036267200000,"summary":"Very bright round light, changed color slowly and","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Shoreline Seattle, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3185"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was attending a bbq on the beach at shelter island in sandiego for a friend ofmine when we spotted these objects seemingly coming up from the sea to the west. the objects we traveling vertically for some time, then proceeded south, onefollowing the other.  total duration of the sighting was about two minutes.  ihave never before seen anything like this and felt compelled to report it tosomebody.  there were about 15 of us who saw these two objects and none of usknew what to make of it.  we were not drinking alcoholic beverages or any typeof drugs.  just soda and hotdogs.  thank you for your time","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Other","formattedAddress":null,"id":1988,"landingOccurred":false,"latitude":32.7174092,"location":null,"logNumber":"","longitude":-117.1537251,"occurred":1038121800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1038121800000,"summary":"Two multi lighted shapes coming up from the sea","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Diego, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3186"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Tuesday night the 18th of november i went out into my backyard at approximately1000pm to observe some of the meteor shower as i would not be able to be up at230 in the morning for the most active period.  i live in san diego, ca.  thesky was very very clear as the entire southwestern us was under a high pressureridge at that time. i was looking to the northeast as the news had indicatedthat that would be the most likely direction to see meteors.  it was a full moonwhich was, at that time, to the southeast near orion.  there was a constellationalmost directly overhead and slightly to the northeast that looked like anupside down w cassiopeia.  at about 5 degrees below the w was that i thought wasanother star.  it was about the same brightness but was more yellow,as opposedto blue-white of the nearby stars. at first i thought that my eyes were playingtricks on me.  the star appeared to be jumping around or jiggling.  i know thatthe stars will appear to do that if you move your eyes around quickly especiallyif you dont have a stable ground reference point in your peripheral vision.  ikept blinking and trying to focus but i finally realized that it was the onlyobject in the sky doing that.  it moved in very small, quick pulse motions withoccasional circles and s patterns thrown in.  it moved towards the west over aperiod of about 45 minutes.  it would pulse 3 or 4 times forward thenoccasionally move back one or two pulses. it was so subtle that if you hadglanced up you wouldnt even noticed but observed over time it was almost likewatching the motion of a milling fly.  the kind that seem to gather under ashaded porch in the summertime.  it moved to the west until in was about 20degrees above the horizon then moved north about 30 degrees before i stoppedwatching it.  i had observed it for over an hour.  i finally had to go to bed asi had work in the morning.  i have seen satellites, high flying aircraft,meteors and other regular objects in the sky.  i have never seen one move aboutin this manner.  i dont know if it was extraterrestrial in orgin just that itwas a flying object that was unidentifiable to me.","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Other","formattedAddress":null,"id":1987,"landingOccurred":false,"latitude":32.7216292,"location":null,"logNumber":"","longitude":-117.1483551,"occurred":1037772000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1037772000000,"summary":"Erratic star during last weeks meteor shower","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3187"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was in an appartment building in downtown chicago, overlooking lake michigan.I was on the 37th floor.As i was wathching tv, which was in direct line with my bay windows and balcony,i saw a quick flash of what appeared to be a rocket shaped aircraft zip by mywindow at a veryt high rate of speed. there was nho sound or vibration.I recall seeing black markings, which looked like 2 numbers. it had a tail fin,and rear horizontal stabilizers. the rear of the aircraft glowed yelloworange,and had a rounded exhaust.By the time i jumped up, ran to the balcony 15ft it was gone.The reason i have waited so long to report this, is largely due to the fact thati didnt know where to report to, however it has still leaves me thinking aboutwhat i saw for the briefest of moments. what was most disturbing was theproximity of the aircraft, the lack of sound or vibrations, and the velocity.This occured in february 1994, im not sure which day.Thank you for your time.","distance":"20 Feet or Less","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":1986,"landingOccurred":false,"latitude":41.8799536,"location":null,"logNumber":"","longitude":-87.6241882,"occurred":760081200000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":760081200000,"summary":"Possible military aircraft.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3188"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dallas","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Like a blob of round objects, almost w shaped, silent and moving at about 100 -200 miles and hour.  not a plane.  totally silent, moving from southesta dallasto nw dallas towards i 75 centarl expressway.  neighbors were across the steetfrom 6244 highgate lane in dalls.  i walked out front after watching the ufowith my roomate in back facing south, and then i went to the north front yardand saw my neighbors looking at the sky.  did you see that  they acknowledgedand thought it was like a big black handglider or baloon, but not really.  i andsteve saw a light, dim but in the front of the shape.  the neighbors did notreport seeing a light, or remember seeing one.  eeirre.  my first thought wasthat it was a huge clump of black baloons, but the cold front is coming intonight from the north and winds are out of the northwest,  the shape washeading northwest.  very large and undefinable.  very very black.  tinyintermittent white light in the fore of the shape. heading for north centraldallas at an elevation of about 500-900 feet.  black shape clearly definedagainst white night clouds coming in from the nortwest.  4 searchlights wereshining a 4 split configuration to the north of the object, shining against theclouds, converging and sepaerating into 4 lights, then reconverging.  lookedlike an open house lighting searchlight display.  this continued past the ufosighting.  after about 10 minutes after the sighting , a small jet was seenfllowing the same trajectory as the ufo.  very weird.  very creepy.  neighborsand roommate saw it at the same time.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":1985,"landingOccurred":false,"latitude":32.802955,"location":null,"logNumber":"","longitude":-96.769923,"occurred":1038194700000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1038194700000,"summary":"Ufo","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Dallas, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3189"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Orem","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"","distance":"21-100 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":1984,"landingOccurred":false,"latitude":40.3058779,"location":null,"logNumber":"","longitude":-111.6929375,"occurred":462949200000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":462949200000,"summary":"Slow moving triangle craft","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Orem, Utah","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3190"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Orlando","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was a clear night. i was only about 12 years old at the time ,believe me idont forget things like that. any how it was like a straight line that wentup,and down,it was red also. but anyways not to long after that maybe a fewmonths i came across a ufo book with pictures in it of some sighting from thefew years ,and i saw the same one that was in book,the book stated thatsighting was last seen in the 70s. ive always been into ufos and thins likethat,so if you can please send me some info,on what you think it could of been.","distance":"Unknown","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":1983,"landingOccurred":false,"latitude":28.5422955,"location":null,"logNumber":"","longitude":-81.3778965,"occurred":818928000000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":818928000000,"summary":"Red straight lines.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Orlando, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3191"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Miami","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was on my way to worki work 11pm-7am,tues. thru sundriving from west to east,on 1st street. as i turned right on a designated road known as thetruck-routesouth-bound, i passed a group of buildings on my left, as i wasapproaching the intersection of central  the truck-route, i looked left to therailroad crossing, this is when the light in the sky got my attention. it wasabout 200 feet above the r.R. crossing, a diamond-shape with white lights aroundthe middle and one red light observed on top. i slowed down,rolled down mywindow, looking slightly back to my left, saw a darkdull surface, decided it wasnot a helicopter or any other known aircraft, heard no sound of engines orwhirling of blades. i raced-off to where i work approx. 14 mile away because ihad no phone. as i turned left on 10 hwysteve owens blvd. looking back to myleftnorth it disappeared. the sky was extremely clear, lots of stars out and avery bright full moon, no cloud cover.","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":1982,"landingOccurred":false,"latitude":36.8745146,"location":null,"logNumber":"","longitude":-94.8774554,"occurred":1037861400000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1037861400000,"summary":"Ufo sighting","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Miami, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3192"}],"last":false,"totalElements":82762,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2693}
