{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Malibu","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Maybe you can help me. i have a friend who took a picture with her digital camera this past saturday december 6 while driving down the pacific coast highway. she wanted a picture of the sunset. she claims there is nothing there when she took the pic. she gave it to me to study, (since i have a small background in film school) but was wondering if you could take a look at it. any feedback would be highly appreciated.","distance":"Unknown","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14337,"landingOccurred":false,"latitude":34.0085079,"location":null,"logNumber":"US-12102008-0009","longitude":-118.8032493,"occurred":1228610760000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1228610760000,"summary":"2nd hand report.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14337_submitter_file1__spaceship.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Malibu, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291350"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hot Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Myself, my father and 2 other hunters were making brunch after a morning of\r\nhunting on the upper cowpasture river in northern va. we had run out of film and one of our group was driving out to buy some. it was a sunny morning with\r\nvery few clouds. we noticed a large, dark object up the river about 5 miles\r\nmoving slowly amongst the trees. it was spherical at the top. i immediately noticed that the edges were convoluted, and there were projections on top and\r\nthe underside. i remember the feeling of 'recognition' - this is a 'ufo'. or, a large balloon with the same shape. we were in a state of unbelief.\r\nthe object was 'right there' and definitely a machine.\r\nthe machine was moving too slow for the eye to follow. it moved without seeming to. in retrospect, we all agreed that the manner of movement of the object was one of the most unusual aspects of the experience.\r\nthe sun glinted on the top surface which seemed to have a flat - 'black force field' around it. the details of the machine were visible, through the blur. i remember that i thought,i should estimate the size of the object in terms of 'football' fields. i decided that it was almost 500 yards across. it would've taken an object the size of a golf ball to cover it, in my out stretched hand. then it vanished, over a ridge. \r\nwe queried the ranger at his station at the only access to that stretch of the river. we thought that there might be some scientific experiment that\r\ninvolved a giant 'black balloon.' he told us that nobody had passed his station all year. he said that he would investigate as there were a number of sightings in that area, at that time. when we spoke with him again, he said that he had found nothing except some strange impressions in a meadow. \r\n(this area between va. and west va., is one of the most remote parts of the u.S..) in the 30 plus years since that encounter, whenever i met up with any of the other witnesses, i queried them if they had any explanation for what we saw. these stolid, baptist folk wouldn't even use the word 'ufo'. they said 'it was not of this earth!' \r\nmy father quietly agreed with me, that the only thing it could have been was an et machine - a ufo. all of us experienced 'time lapses' when we were in that area. my father experienced a 6 hour lapse while driving up there which disturbed him even more than the sighting - for what it's worth.\r\nafter examining the online videos to find the object i saw, i'm thinking that the object i saw was not 'top shaped'. there are too many videos of saucer shaped objects exactly like what i saw. (nov 4 2004 mexico city is one) so, i've concluded that there was 'something' extended below the craft\r\nthat gave the 'top shaped' impression, due to the blurring effect of the strange 'flat black' glow around the object. the flat black 'blur' around the object decreased the sun's reflection off it. but we all agreed, that there was not doubt of the solidity of the object.\r\nno one reported anything to any authority. we've told very few people, not even family members due to the credibility issue. however, now i have decided to actively pursue the political angle, demanding the gov. to disclose what they know.\r\nr. conner\r\n\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s),  Louvres","flightPath":"Path with directional change","formattedAddress":null,"id":14336,"landingOccurred":false,"latitude":37.9993993,"location":null,"logNumber":"US-12102008-0008","longitude":-79.831587,"occurred":-72687600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":-72687600000,"summary":"4 people watched a large upside-down top shaped machine over a river.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hot Springs, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291351"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Chattanooga","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"101-500 Feet","duration":"00:13:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":14335,"landingOccurred":false,"latitude":40.6369912,"location":null,"logNumber":"US-12102008-0007","longitude":-84.7849627,"occurred":1152822600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1152822600000,"summary":"Watched silver sphere hover 20'-30' above ground about 120 yards away.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Chattanooga, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291352"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Washington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"White light moving slowly across the sky like an airplane, but it was a litle bit faster dissapered slolwy over the treeline","distance":"Over One Mile","duration":"12:59:59","entityEncountered":false,"favorited":0,"features":"None,  Dome,  Window(s),  Patterned Surface,  Insignia,  Appendage(s),  Louvres,  Wings,  Other,  Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":14331,"landingOccurred":false,"latitude":38.9018218,"location":null,"logNumber":"US-12102008-0007","longitude":-77.0292958,"occurred":-2521817280000,"potentialRelations":[],"rating":"Unrated","region":"District of Columbia","reportedWeather":null,"shape":"Blimp,  Boomerang,  Bullet,  Missile,  Cigar,  Cone,  Chevron,  Circle,  Cross,  Cylinder,  Diamond,  Disc,  Egg,  Fireball,  Flash,  Oval,  Saturn-like,  Sphere,  Square,  Rectagular,  Star-like,  Teardrop,  Triangle,  Other,  Unknown","source":"MUFON","status":null,"submitted":-2521817280000,"summary":"A light in the sky that moved slowly.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Washington, District of Columbia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291353"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Bend","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home and noticed a bright red object just nw of bend, oregon about 11:45pm. this object had 3 red lights side by side and the lights were flashing back and forth very slowly. it hovered for 5 minutes then slowly went north. it looked nothing like the airliners that were passing by. the moon was out to make everything bright, it was cold so i could see airliner vapor trails, and i could here jet sounds when they went by, but this object had no vapor trail nor did it make a sound. this is my second time reporting an object in the same area at a different time. please know that i really try to debunk what this object was the charactersitics of the object were nothing like the airliners passing by and the round red light were very distinct.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":14329,"landingOccurred":false,"latitude":44.0627228,"location":null,"logNumber":"US-12102008-0005","longitude":-121.3066696,"occurred":1228891500000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1228891500000,"summary":"Object with 3 red lights possibly same as wa reported ufo????","tags":["ufo","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bend, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291354"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Palm Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"2 objects were clearly visible in the sky. they weren't planets. i used 55-200 lens. exposure was 6 seconds 5.6 ","distance":"Unknown","duration":"01:15:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14328,"landingOccurred":false,"latitude":26.7145206,"location":null,"logNumber":"US-12102008-0004","longitude":-80.0329297,"occurred":1227927900000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1227927900000,"summary":"Claim was planets, but i wouldn't have this much detail.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14328_submitter_file1__UFO1.jpg","http://www.mufoncms.com/files_jeud8334j/14328_submitter_file2__UFO2.jpg","http://www.mufoncms.com/files_jeud8334j/14328_submitter_file3__UFO4.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Palm Beach, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291355"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bainbridge Island","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in my living room watching t.V and something very bright caught my attention outside my window. as i went outside to get a closer look it revealed itself as an airplane that had its lights pointed at my direction very briefly. so i watched the airplane until im convinced its an airplane and as im watching it i started to look around the sky and i noticed a very faint blinking almost directly above me. i tried to follow it for as long as i could which was about 30 seconds but it disappeared in the clouds.\r\n\r\nnow there were a few things that were interesting about this light. particularly the strobe of the light when it would blink. it looked identical to a buoy when it blinks,(starts out faint and within a second or two it fully lights up and then dissipates.) lights on airplanes don't flash in this manner. when you see a blinking light on an aircraft in the sky its a very constant flash and almost instantaneous (on , off within a second.)there also appeared to be about a 2 second interval between each flash but i dont think that means anything significant or maybe it does..\r\n\r\nthe other piece of evidence that leads me to believe that this blinking red light was a ufo because of the appearance in altitude and speed that this object had and i compared it to my previous sighting which was an airplane and still in view and appeared pretty far away. it appeared to have just recently taken off and was climbing towards cruising altitude. it was traveling from the sw towards the nw then heading north. the red blinking light appeared soon after the plane had reached about the halfway point in my field of vision (halfway meaning from where i had originally seen the light from my living room to where it would travel out of view on the opposite side ) so this leaves about another 30 seconds until they both go out of view) the red blinking light traveled out of view in about 15 seconds before the airplane (keep in mind this object did not appear in my field of vision when i first saw the airplane )giving the appearance that it was traveling at an enormous speed but it was also extremely high in altitude compared to the airplane and the clouds. when the red flash would dissipate, the object became invisible it had no other visible parts or lights other than this faint red flash.\r\n\r\nso basically when the first object i noticed reached the halfway point in my field of vision, a second object came into view where the first object was originally seen. before the first object (airplane) could travel out of my field of vision the second object (bright red flash) traveled out of my field of view about 10-20 seconds before the first object did.\r\n\r\nso the red blinking flash had 3 times if not 4 times the speed of the airplane that combined with the altitude made it appear to be traveling in our orbit\r\n\r\nive seen satellites and space shuttles and neither of them have signal lights that broadcasts their presence for anybody who looks in the sky at the right moment would see it. when you see satellites and space shuttles with the human eye they appear as very tiny solid object with a small reflection from the sun. no signal lights or anything this bright and visible for that matter. the only way to see satellites and shuttles is to be very lucky or would know their orbit they take and be able to track them accordingly. \r\n\r\ni tried to grab my phone to take a picture but when i came back it was gone. but the plane was still traveling out of view.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14327,"landingOccurred":false,"latitude":47.6284681,"location":null,"logNumber":"US-12102008-0003","longitude":-122.5132148,"occurred":1228890300000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1228890300000,"summary":"High altitude red light blinking.","tags":["light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bainbridge Island, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291356"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"South Brunswick","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were comming home from picking my husband up from work. when we neared the high voltage power lines directly over the farm market on highway 27, a light caught my eye. i looked up and saw what i thought was an aeroplane, but noticed immediately that it was not moving. it wasn't hovering; it was still. it was dark, matte gray, almost black. i said, \"guys, what is that plane doing?\" to my sons who were sitting in the back of the van. \"wow, thats really weird. is it going to crash?\" they said. my husband, who is legally blind even saw it. its like it just didn't make any sense.It couldn't have been any higher than the power lines- that would be, what? 150 feet? and it stood out really clearly from the sky;, no wavy heat patterns or anything. there was a lot of rush hour traffic, but i tried to roll the window down as fast as i could to get a better look, and my husband said \"it sounds like a jet, but it doesn't look like one..\" my children and i noticed a black thing (they said it looked like a ladder to them) hanging out of the back of the \"plane\".I couldn't understand why people weren't seeming to pay any attention to it. it was very big, and very low, and stationary. it was just weird, almost surreal.\r\nwe didn't really talk about it at all after that night until today. we even all drew pictures of how we remembered it, and it was all the same, except my husband and one son remember something that looked something like big engines way towards the back; i dont remember that. also, right afterwards, as soon as we got home and out of the car, we heard lots of helicopters, and saw 2 or 3 of them. it was the oddest thing i can ever recall seeing.\r\noh, and the \"plane\" only had one light on it, and that was a very bright white light near the tip of what would have been the right \"wing\". we talked about that when we were home, as we thought it odd, as most planes have a white light on the nose of the fuselage, and a green and red light on the wings. this only had the one light. there was nothing else visible or discernible on the whole thing. not windows or insignia or anything.","distance":"101-500 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Wings,  Other","flightPath":"Stationary","formattedAddress":null,"id":14326,"landingOccurred":false,"latitude":40.3806901,"location":null,"logNumber":"US-12102008-0002","longitude":-74.5316938,"occurred":1221181800000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1221181800000,"summary":"Very low, looked like aeroplane, but was not moving; dark gray.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"South Brunswick, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291357"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Quincy","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"     i was staying at a hotel on the beach in scituate, ma. my room was on the third floor of the hotel. it was a friday night in august and a warm night. the sky was clear and the wind was between 0 and 5mph. i had the window and screen pulled down from the top to catch the breeze.\r\n\r\n     i couldn't sleep and it was a little after 1 am while laying in bed when i cought sight of a very bright object slowly comming into view. i stood up to see better and noticed that there were not one but three objects that appeared to be oval in shape and shining with an electric blue color that radiated from within the objects. the area outside the hotel was dead quiet but i could hear no sound at all from the objects. they were individual objects and not one because i could see stars in between them as they moved. there were no visible signs of windows. their speed was between 50 to 75 mph. the distance from my view point had to be between one thousand and three thousand feet at about a 30 degree angle. all considered, i would estimate their size to be between 150 to 300 feet in diameter. although they appeared oval they may have been circular because of the angle of sight?\r\nmy first impression was one of amazement and i thought to myself, \" am i the only one seeing this at this time of the morning.\" it was about five minutes since i first noticed the objects and now their speed was increasing as they continued a course due east. as i stood there observing i remembered i had my camera with me and quickly dressed.  i was down to the first floor in no time and went out to the patio near the beach but there was no sign of the objects anywhere. the sight i observed is forever imbedded in my mind! i did a painting with details close to what i did remember attached with this report.  \r\n\r\n            \r\n\r\n     ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":14325,"landingOccurred":false,"latitude":42.2585372,"location":null,"logNumber":"US-12102008-0001","longitude":-70.9970605,"occurred":-44207400000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Blimp,  Disc,  Oval","source":"MUFON","status":null,"submitted":-44207400000,"summary":"Observed three objects in triangle formation.  electric blue in color.  moving east over the coast line.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14325_submitter_file1__UFO-1.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Quincy, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291358"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Richmond","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving my car along rt. 10 at night and the horizon was very clear.  i had a panoramic view of the sky in front of me.  there were no tall buildings and not much urban sprawl.  while driving, all of a sudden straight ahead and above me in the distance, i saw a green, glowing dot in the sky, about at a 60 degree vertical angle from my eye level.  the glowing neon green ball seemed to appear out of no where and falling straight downwards from the sky for about a quarter of a of second.  after this brief falling motion, in mid-air, it completely stopped on the dime for about a milisecond, and then accelerated horizontally outwards at a 90 angle, faster than it had been falling downwards, so fast that it seemed to disappear.  at the beginning i thought it could have been an ice cluster from a flying airplane, but when it stopped in midair and changed direction, i then knew that it was not this.  i was speechless when i witnessed this, shocked, and then excited after.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14324,"landingOccurred":false,"latitude":37.5461646,"location":null,"logNumber":"US-12092008-0012","longitude":-77.4305681,"occurred":1103097600000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1103097600000,"summary":"Object had a bright neon green glow, as if on fire.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Richmond, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291359"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Beacon Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Actually, this sighting was observed my my friend at work, who related to me word for word and said i could report it for her to you. her name is dee. she was on her back deck, smoking a cigarette, about 9:15 the night of oct. 16, 2008. she was looking at the moon, when she noticed two bright lights in the distance, shaped like diamonds. they were side by side, and after a few, maybe ten minutes one object took off at a high rate of speed. after a couple of minutes more, the other object took off at a very high rate of speed and disappeared. she said they made no noise, and were about as large as a 8x11 sheet of paper held at arm's length. she said the sighting scared her.\r\n\r\n\r\noctober","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Hovering then path","formattedAddress":null,"id":14322,"landingOccurred":false,"latitude":41.4419411,"location":null,"logNumber":"US-12092008-0010","longitude":-73.0497856,"occurred":1224216900000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1224216900000,"summary":"Two diamond shaped objects, side by side. first one took off at great speed, second took off 5 min.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Beacon Falls, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291360"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Pomona","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just finished playing my little leauge game for the \"lions\" in pomona california,...I was about ten years old and many of my teamates and their parents were headed back to our cars to go home because the lights to our ball field \"ted green\" had just shut off, but it takes a few minutes for them to glow down in intensity,...As the lights turned off it makes a sound and the lights go dim,...And dimmer,...When the sounds went off a older parent said \"hey\" look at that!!! pointing to the sky in the west,...It's a star getting brighter and brighter,...Larger and larger,... but then it explodes in the sky,....Small tiny white lights evenly spreadout throught out this small explosion in the sky roughly about 1 and a half inches in diameter in the evening sky,...It exploded in slow motion and even through-out,... pure white surrounded by a dark blue evening sky,...It took about a minute to get brighter and larger and then the explosion took about 30 seconds long and then it took another 2 minutes 30 sec to finaaly disappear in the evening sky,...Everyone young and old stood their in amasement,...About 2 and a half minutes into this event an edlerly parent said \" your witnessing some that happened millions of years ago and it's (the light) now just reaching our planet at this very moment\",...Years later when i attended usc film school i asked my professor about this event and he said \"know one has ever caputered or seen with their own eyes a star going into super nova,...A star blowing up\" ,... has never been seen with the naked eye,...I wondered whether he was wrong or whether this was a rare accurence,... it looked just like a star blowing up thats why i believe this ederly man that told us all it was a star blowing up,...It look like it,....Thats how it would be seen in the sky for sure,...Does anyone have a explanation for this accurence,...\r\n\r\n[cms/pid]","distance":"Unknown","duration":"00:05:30","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":14321,"landingOccurred":false,"latitude":34.0587267,"location":null,"logNumber":"US-12092008-0009","longitude":-117.7511748,"occurred":22993380000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":22993380000,"summary":"Star exploding!!!","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14321_submitter_file1__SevenDolphinsSmall.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Pomona, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291361"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Winslow","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Our uncle was taking a pic of the beautiful sunset in front of him, when a big bright object suddenly brightened the sky while he was taking the picture. h was saving it and when he looked back it was already gone. her said he was felt a little fear (he was in the middle of the arizona desert.) he also told me that he's seen other things before, but never like this and captured in a picture.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14320,"landingOccurred":false,"latitude":35.0256273,"location":null,"logNumber":"US-12092008-0008","longitude":-110.6946671,"occurred":1226822400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1226822400000,"summary":"Taking a pic of the sunset with a cell phone. this object showed up.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14320_submitter_file1__ufo.jpeg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Winslow, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291362"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Manhattan","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving home from work with my mom - she picked me up that day. we weren't talking so the car was pretty much silent. i was staring out the window at two lights and wasn't thinking about it really for about a minute; then i was confused because at first i thought they were part of an airplane - but they weren't moving at all. it was just hovering there, so i asked my mom what she thought because it scared me a bit - and she didn't know either - and she was trying to focus on driving so she didn't get a good look at it - i could tell it scared her too though. but i stared at it - i couldn't look away. it was too close to the ground to be any kind of airplane and too high up from it to be a tower or building. \r\nit was a triangle. picture a normal triangle with equal legs and the base being smaller. the points of the base where the legs meet had the brightest lights - white lights being about the same brightness of car headlights or brighter. the 'tail' light was smaller - and less bright. you almost couldn't make it out. the rest of it was just the triangle - darker than the sky was so you could tell it wasn't an airplane or anything. also if you've ever seen the road on a hot day - that weird hazy fog that comes off of it in the summer - thats what was around the thing i saw - that same haze - only more of it than on a road. \r\ni know we weren't the only ones who saw it because while driving we saw people on their porches or in their yards looking at it too - one of them was filming and pointing. i watched it as we were driving, and then at a stop light i saw that it was moving, but very very slowly - about the same speed as somebody walking. our planes can't do that but i wouldn't call it a 'hover' quite because it was moving but it almost was a hover. i couldn't see it anymore because after that light turned green we had to drive away. \r\n\r\nif anybody else saw this can you email me about it?","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary,Hovering then path,Other","formattedAddress":null,"id":14319,"landingOccurred":false,"latitude":39.1913382,"location":null,"logNumber":"US-12092008-0007","longitude":-96.5672694,"occurred":1228628700000,"potentialRelations":[],"rating":"Unrated","region":"Kansas","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1228628700000,"summary":"Driving home from work and saw triangle shaped lights in sky not moving.","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Manhattan, Kansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291363"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kingstree","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside to get my dog and saw a big giant circle like a perfect cloud circle with the moon dead in the middle. the circle was so big the moon looked like a marble. there was big x going through the circle not as thick as the circle it self. the x began to fade like airplane smoke and about 20 mins later another x was made and that one also dissappeared. the circle stayed around the moon the entire night until i feel asleep. the moon moved and the circle followed it with the moon still dead in the middle. and during the first x i also saw a shooting star or what i think was one. i'm 33 and my parents live next door and i called my mother and she came outside and also so this. since she's older and from down south i thought she might know what it was. she had no idea just like me, so i was hoping you can explain what happened. the shooting star thing with everything else i saw is what really made me send this message. if it was nothing still please contact me and let me know.\r\nthank you","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14318,"landingOccurred":false,"latitude":33.6676643,"location":null,"logNumber":"US-12092008-0006","longitude":-79.8306264,"occurred":1228723200000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Circle,  Other,  Unknown","source":"MUFON","status":null,"submitted":1228723200000,"summary":"X marks the spot.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kingstree, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291364"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Brownwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was about 7:45 pm.11/14/2008 i was talking to my sister on my front pouch on the telephone .She was looking south out her kitchen window.I live about 300 feet just south of her .I was looking at were a feed mill and seed company is located .About one mile south/south east of my home .Then there it was in the sky about 100 feet of the ground flashing fire balls shooting up ward in the sky .I started yelling out at my sister ,did you see that ,did you see that .The second flash of fire balls were four fire balls and they were plus ading and started to take shape to it in a circle form .  it was moving up ward at 45 degree slow ,and by that time my wife and son was running out side to see what i was yelling about then the third time like the frist two times ,it just apeared agian 4 fire balls and they were turned at a ankle this time ,were you could see more of its shape .It was disc shape with 4 fire balls ,in a line with each other it went out again then apeared agian by this time my wife and son were out side to see the fourth sighting with me and my sister saw all four sightings with me .The four time it apeared ,4 fire balls,shape was disc but it was at a ankle still moving up ward at a 45 degree ankle .Then it went out .This all happen in about a 30 to 45 second span of time .We all was so trilled at what we saw .My wife and i, sons waited about 10 min's looking for more of what we just saw .And we decided to go up to the feed company to see if there was anything on the road and to see if there was a fire or something there .There was nothing there .We were coming back to the house and then the 5 th sighting my wife saw it frist .Then myself and son saw it .It was two lights one above the other about 500 feet apart no shape yet just lights and they were moving slow in the sky just north of our home .What ever this one was it was not like the frist 4 things we saw .It was boomerang shape with two white lights on what look like on each wing .It was moving very slow for about 3 min's when we got close to home it started moving faster then just went out of sight very fast .We got home and started talking about what we just saw .We sat out on the front pouch for about two more hours that night it was about an hour after the frist sighting and just south of our home there were two fire lines ,yes i said two fire lines ,one beside the other ,they just apeared for about 3 seconds and went out .After that sighting about 45 min's later about 6 miles east of our home there was one more .It was like falling out of the sky a white light or white fire ball ,it fell for about 3 seconds an then just went out .We were so shoked at what we saw that night and were kind of shy about telling any one the next day .We just ask the people , we came in contact with if they had saw anything last night . my sister saw one more sighting late in the night about 2;30 am it was two white light just south of our hpme ,they were kind of chancing each other moving side ways and at all ankles like they were playing chance with each other .I did report this the next day to a friend at mufon, steve at csallen57 .","distance":"Over One Mile","duration":"05:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface,  Wings,  Other","flightPath":"Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":14317,"landingOccurred":false,"latitude":31.7113097,"location":null,"logNumber":"US-12092008-0005","longitude":-98.9841111,"occurred":1226720700000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang,  Circle,  Disc,  Fireball,  Flash,  Teardrop,  Other,  Unknown","source":"MUFON","status":null,"submitted":1226720700000,"summary":"I saw 7 different sightings that night, my wife and son, an my sister saw 4 of the 7 that i saw on 11/14/2008 it was about 7:45 pm, i was on the front pouch talking on the telephone with my sister she was looking out her kitchen window facing south.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Brownwood, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291365"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Atlanta","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Looked out of window at planets, i then notice a large orange,glowing object roof top, it then looked like an explosion into silver, it dissappeared. there were several small objects moving for at least l-hr.I was dizzy, and sick for about several hours after this event. i did not sleep at all. i felt threatened. ","distance":"101-500 Feet","duration":"01:01:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary,Hovering then path,Path then hovering","formattedAddress":null,"id":14316,"landingOccurred":false,"latitude":33.7539754,"location":null,"logNumber":"US-12092008-0004","longitude":-84.3862624,"occurred":1228805100000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Cylinder,  Disc,  Flash","source":"MUFON","status":null,"submitted":1228805100000,"summary":"Looked out window at atars,i noticed a large orange object, then it flashed and was done. ii saw several more small objects. they were so active.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Atlanta, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291366"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mt Carmel","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ok i had made my report back in may and i got to frankly with you i thought what i seen was a asteroid but then i realized that it was moving so slow and hovering over pine tree lines i was out on my back patio cutting wood to build a fire to take the chill out of my house because it would still get cool out at nights being that summer was coming up 3 weeks before that we traded our oil in for a wood and coal burner so i first i thought to my self someone was burning wood up here on the hill that was my first reaction to it as it got over the tree's it was a as to what some would say your crazy and out of your mind a big red fire ball and it was that close to me that it will stick in my mind till the day i die and i know dozens of people said they seen the same deal but the strange thing that boggles my mind is my neighbors were out that night and i was yelling to them to look up but they didn't see it as it was going over the house they move so slow that i had enough time to get in my house to yell for my mom we watched what we still to this day can't be explained right after that like a week later i was driving to pick my mom up from work i looking towards the moon and once again seen it heading for the moon and it would dissipate then the summer came on and we would see them fly over ever night like these star light objects it's like they would show up out of no where other people started talking about on what they were seeing one night me and a friend was hanging out in my yard about 12 am 1 am one came down out of no were coming right for us i was scared to death it stopped over my house it was low and it stayed in one spot for like a minute and moved off like it was nothing i seen what they can do and it's sick the way they can move ok i'm putting a picture close to what i saw! any comment's or question contact me [pid] i'll share my story with anyone  ","distance":"Unknown","duration":"00:08:10","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14315,"landingOccurred":false,"latitude":40.8010512,"location":null,"logNumber":"US-12092008-0003","longitude":-76.4087061,"occurred":1211689800000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1211689800000,"summary":"I have seen so many ufo's over the past summer but the one that really caught  my attention is the fire  and how low it was it was right  above the pine tree line","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14315_submitter_file1__sfdfs.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mt Carmel, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291367"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Washington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Below is the article on the komo-tv website www.Komo-tv.Com\r\n\r\nthe high-quality photos of these spectacular cloud formations did not come through on this cut-and-paste.\r\n\r\nplease check out the komo-tv site or email me at rebeccaphb@yahoo.Com\r\nand i will send you an email at a designated eddress with the photos embedded.\r\n\r\ni witnessed four ufo disc-like cloud formations from approximately 3:30-5:00 pm pst on friday, december 5, 2008 at elliott bay park on the seattle waterfront.  these rare large, layered \"lenticular clouds\" did not move; they hovered in the same shape/position for three days.  others saw and photographed this phenomenon from friday 12/5 thru monday, 12/8/08.  they were evidently seen by a number of thousands of people \r\nthroughout western washington on these days.\r\n\r\nin my opinion, they could possibly be et motherships using a cloud camouflage to send a signal to those receptive to prepare for something imminent.  this seems to support some channeled transmissions purportedly from the galactic federation sent to me by associates, which i had previously mentally shelved until i had some evidence.  this may provide some evidence that these messages are authentic.\r\n\r\nplease contact me if i can be of any further service.\r\n\r\nrec\r\n\r\n\r\n\r\ndecember 5-8, 2008\r\nwestern washington state\r\naaarch\r\n\r\nmount rainier puts on a holiday light show:  ufo-like cloud formations give \"peak/peek(?)\" experience\r\n \r\n by scott sistek-komo-tv reporter \r\n\r\n\r\nour little dry streak is about to come to an end. but if you looked at mt. rainier today, you would have known that already.\r\n\r\ntake a look at some of these incredible clouds captured over mt. rainier today. the one above was taken by tim thompson. the one below, by david embrey:\r\n\r\n\r\n\r\nthose are called \"lenticular\" (vehicular?) clouds.  they're caused when the air flow is just right so when it flows over mt. rainier, the air gets pushed upward where it cools and condenses into clouds.  depending on how smooth the flow is, you can get some rare, amazing clouds formations as we've seen so far today.  here is more information on what causes them from an earlier blog entry. \r\n\r\nit's usually a sign of rain within 24 hours because typically the moist flow that precedes a storm around here is the perfect set up for these clouds.\r\n\r\nhere are some other ones submitted into younews (feel free to submit your own!)\r\n\r\nfrom younews contributor: corgis4ever in monroe, wa:\r\n\r\n\r\n\r\norca86 from orting, wa:\r\n\r\n\r\n\r\nuser samich in sammamish, wa:\r\n\r\n\r\n\r\n\"emcleod3\" of gig harbor:\r\n\r\n\r\n\r\nkazw37 from orting, wa:\r\n\r\n\r\n\r\nand these two by \"fi-bll-fe\" in fife, wa:\r\n\r\n \r\n\r\n\r\n\r\nand these next three are from peter murray of vashon island, wa:\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\nand finally, one by user \"knitterbread\" of sumner, wa\"\r\n\r\n \r\nnote:  the first major ufo sighting in america of the mid-twentieth century was in 1947 near mt. rainier.\r\n\r\n \r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Other","formattedAddress":null,"id":14314,"landingOccurred":false,"latitude":38.9002318,"location":null,"logNumber":"US-12092008-0002","longitude":-77.0337358,"occurred":1228519800000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1228519800000,"summary":"Massive ufo cloud formations linger over mt. rainier 12/5-8/08","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Washington, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291368"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bangor","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have photo's so far i have developed 4 rolls most pictures reveal something.I have several very good pictures showing the disc.My pics were taken with a 35mm with a 200 max zoom. most at a distance of maybe 3 to 5 miles guessing but some closer.I have more film approx.4 rolls not developed. i will do this soon.I live very close to bia.I'm curious if you have other reports from that time frame or others.I have convinceing evidence and a story.The evidence has only been shown to my 2 adult children.I apologize but i'm not ready to tell the story or reveal all my photo's yet.I'm curious if you have anything that i can collaborate with or work with you on with my photo's.So far what i have developed contains alot.I still see the star like ones on a continuous basis in this area.I would appreciate anything you could throw me on info..I'm watching documenting,and photograghing anything i can.But thereis definately things going on around bangor international airport.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14313,"landingOccurred":false,"latitude":44.8024821,"location":null,"logNumber":"US-12092008-0001","longitude":-68.7711838,"occurred":1218178800000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Disc,  Star-like","source":"MUFON","status":null,"submitted":1218178800000,"summary":"I watched events over a week period,but have been noticing events since dec. 27th of 2007","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Bangor, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291369"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Windham","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On wednesday, november 5, 2008, at about 4:30 p.M., i was driving from my office in londonderry, new hampshire, en route to my home in andover, massachusetts, a trip of about 21 miles.  i was on route 93, a major interstate highway which runs between boston and northern new hampshire.  i was between exits #3 and #4, about a mile north of a truck weighing station, traveling at about 65 m.P.H.  there was very little traffic, and the sun had not yet set.  by chance, i happened to look up, and i noticed a flying disc of gray/metallic color which seemed to be hovering at an altitude of about 100 feet, off to the side of the highway.  it appeared to be perfectly round, about 25 meters in diameter, perhaps seven or eight meters in thickness at the middle, looking very much like a classical \r\n\"flying saucer.\"  it seemed to have an observation dome made of glass (or similar transparent material), but i did not see anyone or anything within the dome.  it seemed to have four \"landing legs\" extended from the underside.  it appeared to be swaying slightly from side to side.  my first thought was that it must be an advertising balloon designed to look like a \"ufo\" which was meant to attract attention to a business or store.  however, i have passed that location on many subsequent trips and have observed no store in the area - and in fact, there is no street or road!  i slowed down to try to get a closer look at the object, but it my view of it was obscured by a stand of trees atop a bluff.  when i passed beyond the bluff, i looked back to try to view the object again, but it was gone.  i have never seen anything like this before, but i was not at all frightened.  rather, i was intrigued, and i wished that i had been able to get closer to it and view it for more than eight or nine seconds.  i wish i knew what it was, and i wonder whether anyone else saw something of this nature in the area at the time.  please feel free to contact me if there is anything more about this experience that i can share.  ","distance":"21-100 Feet","duration":"00:00:08","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Hovering then path","formattedAddress":null,"id":14311,"landingOccurred":false,"latitude":42.8006441,"location":null,"logNumber":"US-12082008-0018","longitude":-71.304229,"occurred":1225931400000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1225931400000,"summary":"Flying disc, at altitude of about 100 feet, hovering near major interstate highway.","tags":["disc","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14311_submitter_file1__Case109Asaucer.doc","http://www.mufoncms.com/files_jeud8334j/14311_submitter_file2__109Aphoto1.JPG","http://www.mufoncms.com/files_jeud8334j/14311_submitter_file3__109Asaucer.JPG","http://www.mufoncms.com/files_jeud8334j/14311_submitter_file4__Case109Asaucer.doc","http://www.mufoncms.com/files_jeud8334j/14311_submitter_file5__map109.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Windham, New Hampshire","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291370"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Poquoson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Location: yorktown, va\r\ntime: 8:40pm\r\ndate: 12/8/2008\r\nweather: partly cloudy to clear\r\n\r\ni exited my garage with my dog to go for a walk. i noticed a light above my head. i was facing north; the semi full moon was west / north west in the sky to my left and above. my first thought was that the light was a flare. the light, after catching my attention took off / flew to my right / east at a speed that i can only describe as faster than i have ever seen anything go. the flight path seemed level and controlled. there was no sound made by the object.\r\n\r\ni estimate the size of the object, relative to the moon and holding my thumb up to the sky, to be larger than the moon and 50% larger than my thumb. the object was large enough to grab my attention and surprise me. it appeared to be traveling at a speed much faster than an aircraft. i can only describe the speed as amazing. it is my belief that the object was low in the sky relative to aircraft flying at altitude.  the object as well was above the altitude of an aircraft on approach for landing.\r\n\r\nthe object appeared as a blue to blue / teal sphere or circle with a pronounced outer circle or halo. there were no trails, blur or flashing. the object seemed clear and defined. i lost sight of the object when ti flew east and was obscured by a line of trees.\r\n\r\nthe entire sighting lasted 2-3 seconds, but i must say, that i am still smiling with amazement and wonder over what the heck did i see? really, a very unique experience.\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":14310,"landingOccurred":false,"latitude":37.1223664,"location":null,"logNumber":"US-12082008-0018","longitude":-76.3457773,"occurred":1228723200000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Circle,  Sphere","source":"MUFON","status":null,"submitted":1228723200000,"summary":"Witnessed a fast moving blue / teal sphere with a halo streak from overhead east accross the horizon.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Poquoson, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291371"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Scottsdale","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving south on pima road near mcdonald.  looked up and saw what i thought was a plane.  but noticed it did not have wings or tail. it did not move but i watched it for about a second then it disappeared.\r\n\r\ni always look at the sky.\r\n\r\nfigured it was a ship.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":14308,"landingOccurred":false,"latitude":33.4960104,"location":null,"logNumber":"US-12082008-0016","longitude":-111.9239119,"occurred":1228550400000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1228550400000,"summary":"Saw \"silver bullet\"","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Scottsdale, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291372"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Philadelphia","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friend jodi and i went out to her backyard to smoke a cigarette. we were standing and talking when we noticed 3 objects traveling from the southwest direction heading north to south. it wasn't what we expected...There were no glowing lights and there was dead silence. because they were not glowing or lit it is hard to tell how far away they were. they were definetly triangular or boomerang in shape. we watched for a few seconds as it faded over the tree tops. we were not overly excited but we did manage a corresponding \"did we just see a ufo\"?. we didn't think anything of it until the rash of sightings this past summer.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Straight-line path","formattedAddress":null,"id":14307,"landingOccurred":false,"latitude":39.954565,"location":null,"logNumber":"US-12082008-0015","longitude":-75.159039,"occurred":1204344000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Boomerang,  Triangle","source":"MUFON","status":null,"submitted":1204344000000,"summary":"We saw 3 non -glowing triangle/boomerang shaped objects.","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Philadelphia, Pennsylvania","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291373"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Lafayette","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On april 16th, 2008 i was driving east across harrison st. bridge into lafayette from west lafayette.\r\n\r\nmy friend and i both noticed a large single light in the sky. it was in the east, but not far away, it looked like it was just a couple thousand feet up and over lafayette.  it caught both of our attention but nothing was said. until it began to move and pulsate. at that moment, we both said at the same time, \"that's not a plane\". (purdue university is in west lafayette and has a small airport. it is not uncommon to see small aircraft about to land. that is not what this was)\r\n\r\nthe large pulsating light then turned into 3 lights in a triangle. the lights were stationary and in a triangle formation for about 10 - 20 sec.\r\nthen they pulsated and turned into a horizontal line of 5 or 6 lights that appeared in a sequence.  (i'm not sure if the lights actually moved or if the line appeared as the triangle went out.)\r\nthis line of lights was totally stationary, not falling, and lasted for another 10 - 20 sec.\r\n\r\nbefore the lights were gone, we were over the bridge and able to pull over and get out of the truck. there was no sound.\r\n\r\nthe next day i heard people talking about a \"sonic boom\" in kokomo, which is an hour away, but that was really all i heard until ufo hunter's aired in nov. from kokomo! some of the sightings are very similar to what i saw. i am not aware of anyone else in the lafayette area seeing this on the night of the 16th, and i feel somehow this is important since we are an hour away from kokomo.\r\n\r\nthat is what has compelled me to submit this report, and makes me wish i would have done it a long time ago.\r\n\r\np.S. they were not flares.\r\n\r\n\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path","formattedAddress":null,"id":14306,"landingOccurred":false,"latitude":40.4220022,"location":null,"logNumber":"US-12082008-0014","longitude":-86.8736069,"occurred":1208329200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1208329200000,"summary":"Saw yellow/orange lights in eastern sky, not far. triangle of lights that began to move as a triangle and then lights appeared in a staight horizontal line.","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lafayette, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291374"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Grand Haven","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On november, 28th 2008 at 11:28 pm tom maat & amberrose hammond called me out on the deck where they were talking to look at what they were looking at.  i was on the couch watching the film police academy when they called me.  i came out on the deck and they pointed out what they were seeing for me to cooberate with them.  tom maat & amberrose hammond had been watching this for about 3 minutes before i came out.  we all saw an object floating in the sky through the tree line in front of us.  it was flying in all sorts of random patterns within, from our vantage point, at least a mile distance from left to right.  it was very difficult to discern the distance it was away from us, but upon further inspection after the event, we drove out to the approximate area we think it was hovering and it was about 2 miles southwest from where we saw it from.\r\n\r\nwe watched it for about five minutes and tom maat grabbed his camera to take some video and pictures.  tom started filming at 11:33 pm and filmed until 11:36 pm.  the craft continuously just kept flying in erratic patterns randomly up and down and from side to side.  i note that it was also doing dive-bombs back and forth kind of like a skateboarder does on a half-pipe styled ramp when they ride it.  tom maat also took some still photos capturing the anomaly in a couple of the frames.\r\n\r\nit seemed to disappear at around 11:37 pm.  we still stood and watched the sky and then it came back after about five minutes.  this time, while it was still doing all the random maneuvers it seemed to get a little closer to us and saw some detail.  i saw red, white, and green light emitting from it.  i could not see any type of shape but amberrose noted it looked like a rectangle. . this lasted for about another 5 minutes and then the object disappeared.\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":14305,"landingOccurred":false,"latitude":43.0693334,"location":null,"logNumber":"US-12082008-0013","longitude":-86.2269664,"occurred":1227943500000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Cigar,  Square,  Rectagular,  Star-like","source":"MUFON","status":null,"submitted":1227943500000,"summary":"Ufo sighting over grand haven, michigan.","tags":["ufo"],"timeZone":"America/Detroit","timeZoneName":"America/Detroit","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14305_submitter_file1__3822f1d012977dc6.mp4","http://www.mufoncms.com/files_jeud8334j/14305_submitter_file2__100_2821.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Grand Haven, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291375"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Norwich","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is just a sighting of something unusual. i'm not a ufo hunter or anything. we are close to an airport and some uk and us airforce bases. in the large picture, the object is 1 third from the top and 2 fifths from the left. it looks a bit like a beach hat if you zoom in on it. i didn't notice it till i opened the file on my pc as a raw file.\r\n\r\nthe shot was taken just outside norwich city centre.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":14304,"landingOccurred":false,"latitude":52.6308859,"location":null,"logNumber":"GB-12082008-0012","longitude":1.297355,"occurred":1227313440000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1227313440000,"summary":"I just found this after checking the raw file. ","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/14304_submitter_file1__5MPHrgb.JPG","http://www.mufoncms.com/files_jeud8334j/14304_submitter_file2__skyclose.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Norwich, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291376"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Salt Lake City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"There's been 2 other times in my life that i think i may have seen a ufo but this is the only one that seems like it might have been real.\r\n\r\nmy \"bro\" (aaron s.) and i were walking south on 3450 west in our neighborhood sometime in the mid 1980's. i was somewhere between 10-13 years old. walking past west lake jr. high school as we did several times a week at night because it was between his house and mine. there was a fence to the right of us and aaron was on my right side and we were on the west side of the street. the sky was very dark but there was the usual house lights and lighting from the jr. high school. the street 3500 s. to the south of us has a mcdonalds on the north west corner which was directly in front of us. we were casually walking along talking when i looked up above the mcdonald's and saw some lights above it that were never there before, for a second i thought maybe mcdonalds had constructed some new parking lot lights. i couldn't believe my eyes and i stared intently at it and wondered if what i was seeing was real. i had to look away to make sure it wasn't just my imagination or my eyes playing tricks on me. so i looked down at the sidewalk in front of aaron then returned my gaze to the object which remained hovering silently above mcdonald's i was afraid to tell aaron immediately thinking for some reason if i said anything that it would vanish. it was a large solid black triangle larger than the mcdonald's restaurant and appeared to be hovering directly over it maybe 100 or 200 feet but it could have been a little further away perhaps across the street. the object had 3 somewhat large circular lights in each corner of the equilateral triangle which was pitch black, blacker than the sky. the lights were very evenly lit and looked almost exactly the same as what i've seen on ufo investigation shows and scifi shows except there was no circle in the center as i've seen on several shows. so, i look back at aaron's face to tell him about the object and perhaps my peripheral vision caught something moving and i looked back and it was gone. so doubt entered my mind and i said nothing to aaron or anyone. i had a feeling it was monitoring me. it seemed silly at the time and continues to seem silly that a ufo would be hovering above a mcdonald's of all places in the middle of the salt lake suburbs. i do have a somewhat active imagination but i always know what's real and what's not. i know i saw something in the sky that night. that area is a high traffic area for commercial jets coming into the salt lake airport but i don't remember seeing any planes that night and i can always hear and see the jets moving. which of course was completely different from what i saw. i could be wrong but i am also fairly certain that this happened long before i had seen any unsolved mysteries tv shows with the black triangle which is where i believe i first saw a depiction of a black triangle. when i saw the show i said to myself \"that's what i saw\" and then i started telling a few close friends about my experience including aaron who says he saw nothing that night. and most other people laugh at the thought of advanced technology floating over mcdonald's. which i don't blame them. so, i laugh along with them. but, still wonder about what i saw.","distance":"501 Feet - 1 Mile","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":14303,"landingOccurred":false,"latitude":40.7656093,"location":null,"logNumber":"US-12082008-0011","longitude":-111.8887874,"occurred":565340400000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":565340400000,"summary":"Equilateral black triangle with 3 circular lights, 1 in each corner.","tags":["triangle","lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Salt Lake City, Utah","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291377"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Thousand Oaks","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In late 1988 or early 1989 this event took place in southern california in the town of newbury park right next to thousand oaks, ca.\r\n\r\nhiking down from the santa monica mountains in point mugu state park, it was dark and when we cleared the oak trees while nearing potrero road at the edge of the park, my wife and i noticed a strange vertical shaft of light high in the sky. it appeared to be over thousand oaks to the north east of us, perhaps a mile or two away. we thought it was a beam of light from a searchlight but then noticed that it did not move nor did the shaft of light reach all the way to the ground. we could not tell whether the source of light was from below or from above. the intensity of the light was constant, there was no pulsating nor was there any noticable movement. the light seemed to have mostly bright white and a mix of blue and green streams. an unusual characteristic of this shaft of light is that it was not uniform from top to bottom but rather appeared as if it were a twisted ribbon of light. it was not unlike a high velocity jet exhaust where it varies from bright to dark to bright to dark and continues to repeat. a similar effect can be seen when stretching a ribbon tight and winding several twists to it.\r\n\r\nthere was no sound coming from the light. we observed it for about 10 minutes or more while we continued to hike from the park to my house which was right across the street from the park entrance. i ran into the house to get my binoculars and when i returned outside the light was gone. looking all around in every direction i could not locate it again.\r\n\r\nabout a month or two later while watching one of the network evening tv newscasts there was a story about an unusual shaft of light that several people had seen. there was even video of it and i recognized it right away. this news story took place in japan (i think) and appeared to be seen out beyond a sports playing field. this time it appeared to be resting on the ground while someone was seen running over to investigate it when it disappeared.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":14301,"landingOccurred":false,"latitude":34.1349215,"location":null,"logNumber":"US-12082008-0009","longitude":-118.9877942,"occurred":594360000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":594360000000,"summary":"Vertical shaft of light suspended high in the air. did not reach the ground and did not move or pulsate.","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Thousand Oaks, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:291378"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"North Huntingdon","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This was 6 years ago, so i am not exactly sure of the dates.  i know it was between late november and early january.  \r\n\r\ni was returning from a late meal with a friend between 2200 and 0100 on route 30 traveling from north versailles to north huntingdon, heading home with my friend, now my wife.  as my friend and i were approaching the traffic light at malts lane, i saw a triangle shaped object with steady green lights at the corners, just hovering in the area above or just behind the former chesterfields resturant.  i pointed out the object to my friend.  the traffic light was red, so we stopped there just staring in amazement.  the traffic light had just turned green, but we still sat there watching it hover, trying to figure out what it was.  about a minute later, the object took off like a jet, heading north from our position.  i had looked in the past online, and tried to find somewhere to report our experience, but was unable find anywhere.  \r\n\r\nthe other day we were watching a special on your investigation in bucks county pa.  on the program, one of the drawings depicted exactly what the object we saw looked like.  my wife actually jumped up in excitement upon seeing the rendering of the object we saw.  it was electrical seeing that someone else had seen the same object that we had.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":14300,"landingOccurred":false,"latitude":40.3317083,"location":null,"logNumber":"US-12082008-0008","longitude":-79.7264314,"occurred":1038549600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Boomerang,  Triangle","source":"MUFON","status":null,"submitted":1038549600000,"summary":"Object was hovering over chesterfields restaurant for 2 min. when we saw it.  it took off like a jet and was gone.","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"North Huntingdon, Pennsylvania","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:291379"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2316}
