{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Alameda","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife came in from briefly stepping outside our home , she was rather excited and telling me to hurry outside and look .I saw a bright red oarnge object passing across our view about the speed or a airplane i assume color had no glare and made no sound , i fumbled with my phone to try and get a picture but lost sight over our home , i then ran to the street but the object was gone . we returned inside our home excited about what we just wittnessed and i decided i would go back outside hoping to catch another glimpse of this thing, i was having a cigarette looking at the mufon website when i noticed either the same or a very similar object to the nw of my view , i began to record video with my phone and yell for my wife my neighbor n heard the commotion and also wittnessed the object pass from nw to sw where it seemed to fade or dissapear . as the object faded i think i saw a grey /white possibly mettalic rectangular silhouette with a smaller square in center , that was the last i saw.My wife is very skeptical but is baffled at what this was .I myself have allways believed that humans are not the lone intelligent beings in this universe and allways look up hoping to see somthing , this is my first sighting of somthing i'm sure i can't explain and am more than happy to share .Ps please excuse the crappy video i was rather excited and sorry for moving so much and the use of profanity.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Unknown","formattedAddress":null,"id":49918,"landingOccurred":false,"latitude":37.77092907096854,"location":null,"logNumber":"US-08172013-0004","longitude":-122.26717388924439,"occurred":1376716200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376729930000,"summary":"Bright red oarnge object passed nw to sw observed twice then seemed to fade or dissapear","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49918_submitter_file1__20130816211109.mp4","http://www.mufoncms.com/files_jeud8334j/49918_submitter_file2__20130816211106.jpg"],"weather":null,"zipcode":"94501","daysBetweenOccurrenceAndSubmission":0,"locationName":"Alameda, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268113"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Connellsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went into my backyard on 8-16-2013 around 9.25 pm to sky watch due to some other things i've been seeing really high in the sky since 8-10-2013. as i sat down in my chair that is against my chainlink fence facing east i noticed a strange bright light coming from the southeast torward me. i was amazed with it cause it changed from orange to red then back to orange then red again. the object seemed to come out of nowhere. this was now 9:30pm.That's when i ran up on my porch opened my door and yelled for my wife to come outside and look. as she got outside the object seemed to get smaller as it started moving west like it was heading for the moon for cover. then as it moved it got dimmer and dimmer then finally vanished into thin air. on a side note the area where i first saw this there was nothing in the sky i know this cause that's the first area i looked at when i walked out my back door into my yard. we got a couple pic and a small video on our cell phones but they didn't come out very good. when i first noticed this object i had mixed emotions i had no idea what it was i've never seen anything like it. i felt a little fear but at the same time my adrenalin was pumping.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":49917,"landingOccurred":false,"latitude":40.0226022,"location":null,"logNumber":"US-08172013-0003","longitude":-79.5826228,"occurred":1376713800000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376728294000,"summary":"Moving then hovering object that changed direction and color from red to orange then disappeared.","tags":["video"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49917_submitter_file1__20130816213123.jpg","http://www.mufoncms.com/files_jeud8334j/49917_submitter_file2__VIDEO0012.mp4"],"weather":null,"zipcode":"15245","daysBetweenOccurrenceAndSubmission":0,"locationName":"Connellsville, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268114"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Windsor","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The ambassador bridge is an international bridge between windsor, canada and detroit, michigan, there have been reports of 5 orange orbs hovering on top of it in the beginning of month of august 2013, so while in peace fountain park next to detroit river, i was looking in that direction, strangely i noticed a very bright star above the west sky, in the direction of bridge, as i was sitting with a few people around i brought to their attention the very bright star, mind you the sky was clear and no other star were showing except this unusually big and glowing star,  after more than 30 minutes a jet fighter passed close to it and my companion noted that there were 2 stars very close to each other, jet plane flew close to the orbs, since i think air-force noted the star-orb on international water/river , jet plane quickly circled and left, orb still stayed there for another 10 minutes and disappeared suddenly.\r\ni took many pictures of the orb or 2 close orbs with my cellphone\r\nprobably 20 miles away. many people noticed them, assuming it is a helicopter , but it was too high and stayed stationary for a very long time. i focused on it because of previous orange orbs report earlier.\r\ni`m sure governments on both sides know about it, since they sent the jet plane to investigate it or them.\r\nit must be something really interesting for orbs to visit that area regularly, may be an underground base ???\r\ni`m pretty sure police and military know about them, since they were right on top of both sides downtowns, so i assume it is a secret or something  for now.\r\ni prefer to be anonymous. \r\ntonight date is : august 16, 2013, and it happened 3 hours ago.\r\n\r\n","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":49916,"landingOccurred":false,"latitude":42.279609,"location":null,"logNumber":"CA-08172013-0002","longitude":-83.0085329,"occurred":1376712600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere,   Star-like","source":"MUFON","status":null,"submitted":1376726902000,"summary":"Hovering brightly in clear sky in evening, on detroit river area for 40 minutes, appear to be visiting or monitoring an underground sructures ","tags":["hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"N8R2H7","daysBetweenOccurrenceAndSubmission":0,"locationName":"Windsor, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268115"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Miami","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"\r\n i was observing this star-like object that i have reported multiple times and the i notice this \"drone\" patrolling the area, i recorded both with a sony hd camcorder and when checking the footage i noticed that this drone does not have tail and does not have noticeable engines, but it have ant-collision lights. the footage shows that clearly. i got close-up footage of the star-like object using a telescope and that footage shows that this star-like object have structure and \"eject\" something from time to time.","distance":"Over 1 Mile, Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Wings,  Other,  Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":49915,"landingOccurred":false,"latitude":25.665106814022668,"location":null,"logNumber":"US-08172013-0001","longitude":-80.39049980740106,"occurred":1376707200000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1376726434000,"summary":"Star-like object and unknown drone, video footage of both","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49915_submitter_file1__Droneunknown.mp4"],"weather":null,"zipcode":"33176","daysBetweenOccurrenceAndSubmission":0,"locationName":"Miami, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268116"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 9 pm, on a very clear, non-humid, cloudless august night, in the very crisp night air, i was walking across my yard on a tree-lined suburban street to get into my car. a bright half-moon was shining at the end of my street. i glanced at the moon and saw a very distant light as it emerged from behind the tree cover to the southeast. this light/form was halfway between the moon and the horizon to the south. it seemed as far away as a commercial aircraft would typically be, and initially that's what i thought it was. but after a few seconds i knew this was not a craft typical for the night skies in my area. it had no characteristics associated with an airplane at night from one of the area airports (o'hare and midway in chicago). it was one very bright, orange light that pulsated a bit. very bright, even dazzling. no sounds, and on a steady, slow course. later my son said it was boomerang-shaped. it floated across the sky for a minute, before altering its course to the southwest. as it moved away, it faded from view, growing smaller ... only to re-appear a few minutes later in the same spot to the southeast!! with the same appearance and track, and moving at the same speed. it re-appeared in this manner four times. i left the scene to run an errand. my son and husband watched the shape re-appear another two times. on its final pass, its path altered a bit, in a zig-zag manner.\r\ni'm no expert on aerial phenomena, but this recurring bright orange form looked and behaved like no plane i've ever seen. so i am mystified. i don't imagine satellites acting like this did. it seemed to trace a slow circle, low in the sky, as it re-appeared in the same spot so many times. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":49914,"landingOccurred":false,"latitude":40.6352049,"location":null,"logNumber":"US-08162013-0029","longitude":-89.3903183,"occurred":1376712300000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1376721732000,"summary":"1 to 3 people saw bright orange sphere over suburban area, move from behind tree line, float across sky, change direction slightly and fade...Then reappear same spot, 7 times.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268117"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Vaughan","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were outside and our friend dave called us and told us to look south west and we saw 3 glowing red orbs to that direction right under the moon. they werent moving in a straight line like a plane and were just fading in and out. we live in vaughan, ontario right at hwy 27 and langstaff. our friend dave has a video on instagram: @dangleydave, this video shows about 20 of them. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":49913,"landingOccurred":false,"latitude":43.8372079,"location":null,"logNumber":"CA-08162013-0028","longitude":-79.508276,"occurred":1376717400000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere","source":"MUFON","status":null,"submitted":1376721199000,"summary":"Red glowing orbs hovering southwest near vaughan, ontario. instagram: @dangleydave has a video","tags":["video","hovering"],"timeZone":"America/Halifax","timeZoneName":"America/Halifax","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Vaughan, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268118"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St. Charles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Walked outside and looked at a let going to mbs judging by the altitude. thought the object was a star until the jet passed behind it getting completely blocked by the star.After the jet passed by it .It shot strait up .Got smaller and diapered in a matter of seconds .It was amazing.You all migh6t want to check with m.B.S to see if anything was reported.   ","distance":"Unknown","duration":"00:01:30","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":49912,"landingOccurred":false,"latitude":43.2673170681624,"location":null,"logNumber":"US-08162013-0027","longitude":-84.13271891107922,"occurred":1376716500000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376720567000,"summary":"Hovered then shot straight up in the ski .Went past a passenger jet. going towared m.B.S","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"48655","daysBetweenOccurrenceAndSubmission":0,"locationName":"St. Charles, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268119"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Barberton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in our hot tub and suddenly i noticed a floating fireball moving from the ne to the sw directly above my sight of vision. our house faces the south. the object came over our back yard from my left and slowly traveling to the right which is sw. i jumped out and called for my husband who was in awe! he served in the air force in the 80's.  we watched it move in a straight but wobbly line for about 1 minute then it appeared to stop directly sw and descend gradually up until it disappeared.  so i said im gonna sit out here for a bit and just keep my eyes up at the sky~ he went back inside.  almost seconds later another one with the same characteristics but travel at a much lower altitude appeared and went slower but in the same flight pattern and disappeared in the same direction and manors as the first. i called him out as soon as the second one appeared, so we both saw this one too.\r\nin february on the 18th we witnessed the same thing this year at the same approximate time.\r\nwe discussed meteors, weather balloons, hoaxes, you name it! but with my husband being a usa air force vet,  we are both in awe and wonder. he said that was amazing and not of this earth. i agree","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":49911,"landingOccurred":false,"latitude":41.04397331638849,"location":null,"logNumber":"US-08162013-0026","longitude":-81.61057376943099,"occurred":1376712180000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere","source":"MUFON","status":null,"submitted":1376718057000,"summary":"Glowing orb moving ne to sw, soundless and tailess. followed by a 2nd one 1 to 2 minutes later","tags":["sound"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"44203","daysBetweenOccurrenceAndSubmission":0,"locationName":"Barberton, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268120"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Well this is not the first time these orangish red orbs have been spotted by my boyfriends house. we first seen one on aug 3rd with the same orangish red pulsating orb large we watched as 4 smaller red orbs appeared randomly around te larger orb..Tonight was similar to the large orb we seen few weeks back we spotted it while driving onbendix rd by the air port and we both knew it wasn't a plane because it was redish glowing.My boyfriend seems scared since the laft ufo\"s we seen but i am much more curious as to know what's goin on with these ufo's we have seen..So i told him to go down te road more so we could get to a darker area without streetlights and carlights..We stoped at a graveyard and watched as the light slowly would go up into the air a little and than would slowly come back down ...The light was moving farther away from us as we started heading down a country road to get abetter look..I seen several other lights while we parked by a cornfield but as they got closer we realized they were just planes.The redish orange light we followeed and observed for so long however was not a plane..We both agree we have been lucky and also scared to expierance these sightings recently.","distance":"Over One Mile","duration":"09:45:11","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":49910,"landingOccurred":false,"latitude":40.2755841,"location":null,"logNumber":"US-08162013-0025","longitude":-86.1336619,"occurred":1376714640000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1376717908000,"summary":"Orange red and white flashing slow moving orbwell ","tags":["flash"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268121"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ringwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking in the western part of the sky for meteorites and saw this triangle object very high up (miles). it had a faint rose color light at each point of the triangle object. while it was traveling from south west to north east at a speed much much faster than a jet an slower than a meteorite  it turned bright white for a 1/2 to 1 second while traveling. the entire sighting was approx. 7 seconds and im guessing during this time it traveled a 1000 miles and disappeared when it travelled over the trees.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":49909,"landingOccurred":false,"latitude":41.086483583476216,"location":null,"logNumber":"US-08162013-0024","longitude":-74.26854563753214,"occurred":1376539500000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1376717190000,"summary":"This triangle object had 3 faint rose color lights at each point of the triangle that traveled very fast","tags":["triangle","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"07456","daysBetweenOccurrenceAndSubmission":2,"locationName":"Ringwood, New Jersey","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:268122"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Levittown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in my backyard like i do every night.I always look up at the sky. i have never seen anything in the sky like this. it was brighter than a star, but getting brighter and dimmer, brighter and dimmer.It was absolutely, positively stationary. i couldn't believe what i was seeing, i was fascinated and completely puzzled. i watched a few minutes, went in my house and got my camera, but all i got was 2 seconds of nothing, and no stills. i watched about 10 minutes, waiting for some movement, but all it did was eventually fade out. i posted about it on facebook and two of my friends came up with goce (flaring satellite) but this was definitely stationary and quite bright.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":49908,"landingOccurred":false,"latitude":40.701820044516275,"location":null,"logNumber":"US-08162013-0023","longitude":-73.52708145664346,"occurred":1376712600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Star-like,   Other","source":"MUFON","status":null,"submitted":1376715692000,"summary":"I saw a red-orange, pulsating, stationary light in the nw sky, brighter than a star, but about the same size, maybe a little bigger as it brightened.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"11756","daysBetweenOccurrenceAndSubmission":0,"locationName":"Levittown, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268123"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New Fairfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Similar or same object as seen on 8/15/2013 at exact same time 9:29pm. tonight the objects flight path was farther east (by approx. 7 to 10 deg.) but kept to the s to n flight path.\r\n\r\nobjects speed seemed consistent with last sighting. i would estimate that the object covered approx. 30��� in 30 to 50 seconds (at least twice to three times as fast as any \"orbital\" object that i have ever seen).\r\n\r\nmy belief is that this is a high altitude reconnaissance carft. man i would love to be in that bird.","distance":"Unknown","duration":"00:02:15","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":49907,"landingOccurred":false,"latitude":41.50286233778101,"location":null,"logNumber":"US-08162013-0022","longitude":-73.47596746305341,"occurred":1376713740000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1376715070000,"summary":"Star like object repeats previous flight time and basic path.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"06812","daysBetweenOccurrenceAndSubmission":0,"locationName":"New Fairfield, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268124"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Worcester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Observed a extremely bright orb going west overhead blinking then fading away","distance":"501 Feet - 1 Mile","duration":"00:02:12","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":49906,"landingOccurred":false,"latitude":42.2695532,"location":null,"logNumber":"US-08162013-0021","longitude":-71.8007434,"occurred":1376712300000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376714003000,"summary":"Bright orange light traveling west under cloud cover","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Worcester, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268125"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Downers Grove","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am writing this for my wife, who experienced this event. she was driving home from work westbound along the stevenson expressway, route i-55, near downers grove. as she approached the cass avenue exit she noticed an object hovering what seemed like 6-8 feet off of the ground near the next exit - lemont road - on the right side of the road approximately 25 feet from the highway and somewhat close to the exit area. it was raining at the time, but the object was very visible as a disc shape, about 15 feet wide, about 12 feet tall, with a dome, silver in color, just hovering close to the ground. she watched it was she passed cass avenue. about halfway between cass avenue and lemont road, she noticed the object shoot straight up in the air at a very rapid speed. just prior to it moving away, she looked around the highway at the other cars and noticed other drivers also seemed to be staring at the object. she did not notice any sound because the wipers were on and and car radio was on at the time and the windows were up. she is unsure of the exact date, but seems to remember it was a tuesday, definitely in september 1988, and approximately 6:45 p.M.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Unknown","formattedAddress":null,"id":49905,"landingOccurred":false,"latitude":41.7265784,"location":null,"logNumber":"US-08162013-0020","longitude":-88.0100865,"occurred":590204700000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1376710600000,"summary":"Silver-colord, disc-shaped object hovered near ground and shot straight up","tags":["disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":9103,"locationName":"Downers Grove, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268126"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Louisville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the night in question, my niece and myself decided to take the binoculars and go outside to look for possible ufo's. standing in the front of the house on the concrete walkway, we were talking quietly, and searching the sky. we weren't out there long when i was looking toward the south in the sky. about then she had said to me that she really would like to see one. as i was turning my head left to right, my eyes stopped on the ufo hoovering above the back of the house where i lived. it was as if it appeared there out of thin air. just as calmly as if i saw them all the time, i tapped her on the right side and just as i started to say, yeah jea, i, i stopped because i saw it, and i said 'look'. we were both in awe at what we were seeing, looking at each other with our mouths wide open, in a frozen state. it only lasted what we think was seconds. she then went to the right side of the house, as i went further into the yard, still looking up. i could see that the surface of the craft was a patterned surface, through the binoculars. which i knew right away that i didn't need to use. and that i could actually see it better. moving slightly to the right, and turned very slowly to the left in a snails pace, as to line itself up to the direction in which it was going. it then went over the top of the neighbors trees,(to the right of me) at this time i had went out into our street, still watching it moving slowly in the direction of the end of the street. over top of the house that set there and the trees. i watched it until i could only see the lights. i then went over to my niece jeannie, as she was coming to me. i said jean, don't say anything about what you just saw, lets go in the house, you get in one area away from me and i'll get in the other and we'll both draw & write what we had seen. after we did this, we then compared what we had written and drawn. it was no real surprise to us that what we had drawn was exactly the same. of course when we told the others we know, they laughed and thought we were crazy. we didn't care though because, we knew what we had seen, and nothing or no one\r\ncould change our minds. later on, not for sure when it was, the trees in the neighbors yard started dying and they had them cut down, they were hugh trees. now, i'm not saying this is what caused them to dye, but, you can use your own judgement. maybe it was, and maybe it wasn't. i do know one thing for sure, we both saw a u.F.O. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Other","formattedAddress":null,"id":49904,"landingOccurred":false,"latitude":38.1304674,"location":null,"logNumber":"US-08162013-0019","longitude":-85.6803654,"occurred":1244790000000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1376705329000,"summary":"Hoovered over house, then moving snail pace until out of sight","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"40219","daysBetweenOccurrenceAndSubmission":1526,"locationName":"Louisville, Kentucky","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:268127"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"St. Petersburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went into my back yard to take some pictures of an approaching storm. i was facing s/sw when i took these photos . when taking these pictures i did not notice anything in the sky, i had been looking for birds or aircraft as i did not want anything in the sky other than the clouds in the picture. had i noticed these objects in the sky i would have attached the zoom lens to the camera for a closer picture. after i had put the photo in question on the computer, thats when i noticed these objects. the one object farthest to the right appears cylindrical and the other object appears cylindrical but there seems to be some sort of winglets at either end of this object. ","distance":"Over One Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":49903,"landingOccurred":false,"latitude":27.717850031925426,"location":null,"logNumber":"US-08162013-0018","longitude":-82.65584502606264,"occurred":1373935560000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1376704645000,"summary":"Taking pictures of sky before approaching storm, did not notice these objects until pictures were looked at.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49903_submitter_file1__IMG6861.JPG"],"weather":null,"zipcode":"33712","daysBetweenOccurrenceAndSubmission":32,"locationName":"St. Petersburg, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268128"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Concord","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Almost nightly these lights land in the trees i have many videos please come to my house and look this  is my 3rd report someone come i don't have the program to cut them all up over 100 videos on phones,, cameras, video camera, surveillance system. i even have a video of these 3 things beaming down a little silver gray looking alien with pointy ears a black cube like a rubics cube, but all black with something on it  about the same size as them the last one comes they all floated down together like on a fireman's pole. please someone come look at them. i'm not joking, an all black fbi car was parked in front of my house for 2 weeks after my first two attempts to notify your organization about these sightings. we almost crashed into each other in front of my wife's job because i was going a different way (while my wife was in the car). he was in front of my house 24 house a day for 2 weeks after we almost crashed, i stopped seeing him parked there. plus the air force chases them for hours with helicopters' that have special colored lights under them green, gold, red. planes with 2 headlights in front like a car, and 2 jets.   ","distance":"21-100 Feet","duration":"03:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":49902,"landingOccurred":false,"latitude":37.98312971506823,"location":null,"logNumber":"US-08162013-0017","longitude":-122.04199537259383,"occurred":1338534000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1376703135000,"summary":"I have many videos of these lights landing in the trees","tags":["crash","lights","video"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49902_submitter_file1__ECV00006glowingeyes.mp4","http://www.mufoncms.com/files_jeud8334j/49902_submitter_file2__ECV00009crazylights.mp4","http://www.mufoncms.com/files_jeud8334j/49902_submitter_file3__ECV00008crazylights.mp4"],"weather":null,"zipcode":"94520","daysBetweenOccurrenceAndSubmission":441,"locationName":"Concord, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268129"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Puyallup","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was late july in 1972, i had about six friends over.  i had a ten-acre farm with a small house and an old chicken coop we fixed up.  i left the chicken coop with my friends inside and went up the little hill to the house to get a record.  when i came out of the house there was a dark saucer hovering in the pasture by the chicken coop.  this was so big i could only see part of it.  it was just getting dark. it was slient, and did not notice it as i was going up to the house. coming out of the house i saw it and ran down to the chicken coop and told my friends, \"you have to check this out\". they came out the door and saw the saucer and ran up the hill and jumped in their cars and left me alone.  my wife was pregnaugt and sleeping in the bedroom.  i crawled in bed with her scared as hell, and was under the covers when i saw bright lights coming through the window and moving around the room. the saucer was dark and it had a cargo door on it.  this was a few years before star wars, and it seemed to have tubing on the outside.  not being able to see the whole craft i do remember seeing something like that.  the cargo door was angled a little and looked like a rectangle that was at a slant.\r\n \r\none of my friends that was there, the only one i am really in contact with anymore, i talked to him about this after years after it occurred.  he got really quite and left.  a few weeks later he came over and told me what he remembered since i jogged his memory.  what i remember and what he remembers are two different stories.  after the sighting he believes his memory was tampered with and didn't really think about what happened until i brought it up in 2003. since then he has memories that the both of us were abducted and he said he communicated with the aliens and i was too scared and didn't want them to put this tracking device up my nose.  he talked them into putting it in my hand.  he remembers way more then i do.\r\n\r\nfor several years i have been trying to find someone that can put us under hypnosis separately to find out who has the real truth about this.  i have contacted people like bill birns from ufo mag and several others, and no one ever gets back to me.  i can remember being very young like four or five years old and seeing strange things out of the bathroom window late at night before dawn.  i have always been fascinated with ufo's since i was around ten years old.  when i was younger i thought it would be really cool to meet an alien, when this sighting occurred i wasn't scared until everyone ran up to their cars and drove away.  then i was really scared.  \r\n\r\ni would really like to skype with an investigator or talk to someone about how we can look deeper into this with hypnosis to see if this actually happened.  i know what i remember like it was yesterday.  my friend has to speak for himself, he seems to know a lot more then i remember and has no problem talking to anyone about it.  he is interested in finding out the truth as well.  if you cannot help me, do you know someone that can?\r\nreally appreciate your time and any thing you can do to help us with this.\r\n","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":49901,"landingOccurred":false,"latitude":47.16828,"location":null,"logNumber":"US-08162013-0016","longitude":-122.350331,"occurred":81147000000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Cigar,   Sphere","source":"MUFON","status":null,"submitted":1376698843000,"summary":"Came from no where, hovering close, we were scared and left, object very close.  we have different accounts what happened","tags":["hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"98371","daysBetweenOccurrenceAndSubmission":14994,"locationName":"Puyallup, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268130"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Bauxite","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my husband's truck in the passenger seat, he was driving. we were on our way back from the lake. i saw a metal object that had a rather odd spherical shape, and i made a joke that it was a ufo. i looked it at and figured it had to be some kind of airplane, as it was shiny and silver, but the shape was too strange. it was moving in a line from the s to sw. it then stopped and hovered, then completely disappeared. the whole event did not last long. i lost sight of the object as it disappeared into air. i had immediately checked to find out if there were satellites in the area, there weren't. it was also still light outside. unfortunately, my husband did not see the object. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":49900,"landingOccurred":false,"latitude":34.54241069669961,"location":null,"logNumber":"US-08162013-0015","longitude":-92.53025391097636,"occurred":1376621100000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376696281000,"summary":"Saw what i thought was an airplane, disappeared in air. ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"72011","daysBetweenOccurrenceAndSubmission":0,"locationName":"Bauxite, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268131"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Brampton","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 10:10pm aug 15 2013 i was outside having a smoke looking towards the south west at 3 stars when i saw a plane then in the corner of my eye i saw a red object moving.I first thought it was a plane but then i noticed it had no flashing lights and it came to a slow down then started to go north which i then said to myself this has to be a ufo. i watched it do crazy things like hover....Move from side to side very fast and then slow....Move up in different directions and same thing going down...While all that was going on it looked like it was under the moon....It hightailed south in a rate of speed i could no belive with a pulsating flash then it was gone....Within 10 seconds i was seeing yet another one or even the same one around the moon agian going up when another one crossed it at a high speed which then pulsated and was rotating in a oval shape.All in all 4 to 5 times this orb would hightail south only yet to show up under the moon again...This lasted about 1 hour and 20mins with the 2 orbs dancing around.....Location seemed to be milton/cambridge/guelph area from the location i was watching these orbs (brampton) orb colour was red,height of orbs i have no clue but the whole time planes were flying at all heights...This was witnessed by myself and 2 others...","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":49899,"landingOccurred":false,"latitude":43.6865933,"location":null,"logNumber":"CA-08162013-0014","longitude":-79.7585267,"occurred":1376629800000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Oval,   Sphere","source":"MUFON","status":null,"submitted":1376696123000,"summary":"2 orbs dancing","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Brampton, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268132"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mount Albert","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife seen her first ufo last night !!! \r\n me and my wife where sitting out side around 11:30 at night when i notice several small balls of light ..Very tiny and way up in the air like a small white dot.. going by ...2 small spots...Whizzing by at a very hi rate of speed.. and then to the left .. the same ball of tiny light when all of a sudden , it lite up in huge ball of white red and orange colours about 50 times the size of light it was giving off .. it did it twice.. like an huge explosion ... then it stopped ..And reduced its light to the original size and disappeared ..\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":49898,"landingOccurred":false,"latitude":44.136076,"location":null,"logNumber":"CA-08162013-0013","longitude":-79.3083392,"occurred":1372314600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Fireball,   Flash,   Star-like","source":"MUFON","status":null,"submitted":1376688217000,"summary":"Ball of light that expanded to a big bell shape of light","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"l0g1m0","daysBetweenOccurrenceAndSubmission":50,"locationName":"Mount Albert, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268133"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Vancouver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On tuesday, august 13th as i was leaving for work, 3 military jets flew over & as i was looking up,jets were no longer visible, i noticed two white objects fly in opposite direction of the jets. my roommate was outside also so i asked him if he just saw the same thing, he did. one of the objects disappeared. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":49897,"landingOccurred":false,"latitude":45.6401381,"location":null,"logNumber":"US-08162013-0012","longitude":-122.6574361,"occurred":1376409900000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1376687349000,"summary":"3 jets flew over & i was looking up & my roommate & i saw 2 white round objects, one disappeared. ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"98660","daysBetweenOccurrenceAndSubmission":3,"locationName":"Vancouver, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268134"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Fortville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Fishers, indiana. hamilton county, se. object due east, flashing reddish orange lights.\r\n\r\n9:45 pm saw red orange object flashing to the due east at approx. 28 degrees above the horizon.\r\n\r\nlooked thru binoculars. saw flashing dark object in red, orange, lights. white sparkling lights around the object.\r\n\r\napprox 20-30 white objects descended from high up. went infront of and around the red object. descending rapidly and arching to the south east to out of sight.\r\n\r\nas the white objects descended the red orange lights went off. a green light to the left, white center light and red light to the right came on. also, a white strobe occurred on the right and then turned off.\r\n\r\nthe object commenced flight to the west slowly picking up speed to a passenger jet speed and ascended to above the cloud layer.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":49896,"landingOccurred":false,"latitude":39.93798050610862,"location":null,"logNumber":"US-08162013-0011","longitude":-85.92306643517962,"occurred":1376628300000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Disc,   Flash","source":"MUFON","status":null,"submitted":1376686716000,"summary":"Reddish orange flashing due east. changed lighting to mimic a passenger jet. moved at jet speed heading west.","tags":["flash","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"46040","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fortville, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268135"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife and i were leaving her parents house outside red rock arizona (between tucson and phoenix) at 8:45pm on august 12th 2013 when we saw 3 large glowing lights a few miles away from us towards the silver bell mountains. we pulled over and watched the lights light up from the bottom to the top, fading out, then sequentially lighting up in order again. after this they lit up to the right doing the same. they were perfectly still. the event lasted around 4 minutes, then we sat waiting for more and saw helicopters with search lights begin to fly in and search the surrounding areas. after waiting a bit we didnt see anymore strange lights. we began driving down the frontage road (parallel to the 10 freeway) towards phoenix, then saw 2 more glowing lights in the same area again. as we watched the 2 lights fade out, we spotted weird lights that we assumed were a helicopter flying towards us from phoenix. as the flying object approached us approximately 500ft above us, traveling at a slow pace, we could only make out 2 bright white lights on the bottom, and a small pulsating blue/white light in the back. it was impossible to determine the shape due to the bright lights. we then compared the light pattern to the helicopters also flying in the area at the time and they didnt match. the helicopters had a typical red blinking light, with a search light. \r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path,Other","formattedAddress":null,"id":49895,"landingOccurred":false,"latitude":32.2262729,"location":null,"logNumber":"US-08162013-0010","longitude":-110.920509,"occurred":1376365500000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Fireball,   Unknown","source":"MUFON","status":null,"submitted":1376686113000,"summary":"Lights in the sky turning on and off followed by a small ufo flying overhead ","tags":["ufo","lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":3,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268136"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Long Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Walking out of my home (just east of downtown long beach) at about 5:20am, noticed a steady slow-moving deep-violet light almost directly overhead. kept observing because the color was unusual for an aircraft. it was traveling in towards the southwest over la harbor. after about two minutes of travel, it began circling very tightly. too tight for a terrestrial-based craft, i believe. i dug in my pocked for my phone to snap a photo, but by the time i had, it ascended into the cloud coverage that morning.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Other","formattedAddress":null,"id":49894,"landingOccurred":false,"latitude":33.78682431151554,"location":null,"logNumber":"US-08162013-0009","longitude":-118.15147548462492,"occurred":1376137200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1376681203000,"summary":"Single deep violet light.","tags":["photo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"90813","daysBetweenOccurrenceAndSubmission":6,"locationName":"Long Beach, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268137"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Muscatine","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"All 4 witnesses, were sent to variouse government facilities.  she and her two daughters were returned like they were made retarded from \"medication\" or something.  i was sent to u of iowa and forced into a government program something like, artichoke!\r\n\r\nwe watched this large object somewhat diamond shaped, come from the east of us and moved west. it appeared to be very slow!  the mother of the two girls called the police aboute it. it was out of sight when officer barclay arrived.\r\n\r\nboth side of my grandparants have sighted things in the past. grandma pearl, \"had close encounters & communications\"!  she said they promised to take her when she died.  the day of her funeral, multiple reports of sightings happened in , muscatine.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":49893,"landingOccurred":false,"latitude":41.401464705753405,"location":null,"logNumber":"US-08162013-0007","longitude":-91.07131721559205,"occurred":-166208400000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1376680517000,"summary":"Size of a football field, w/ icecycal lke lights on bottom","tags":["police"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"52769","daysBetweenOccurrenceAndSubmission":17857,"locationName":"Muscatine, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268138"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Fullerton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling south bound on ca57 freeway at approx. 8:50 pm.  off to my left (east) i noticed a bright light, and thought it was an airplane.  as i looked up at it again a few seconds later, i noticed that it was 3 bright white lights.  the lights were very bright, and a very pure white.  still thinking it was an airplane i looked for normal port and starboard flashing red and/or green lights.  the only flashing light was a dimmer white flashing strobe.\r\n\r\nas i continued to watch, (and tried to also to pay attention to traffic), it flew directly over my car.  as it flew over, i noticed that there were 4 lights in a square shape, flying with a point forward.  the flashing strobe was not as bright, but placed perfectly in the center of the 4 lights.  \r\n\r\ni could not see the shape of any structure, just the lights, which seamed odd as the lights were so bright.  \r\n\r\nthe object was relatively low.  i would estimate 3-5,000 feet off the ground.  it was quite large, about the size of a jumbo jet (747).  the windows were up on my car, so i have no idea if there was any sound.\r\n\r\nit continued to fly in a straight line, traveling towards the west.  it was too far south to be landing at lax, and too far north to be landing at long beach.  could have been on a landing path to los alamitos air station (but i am not familiar with their runways).\r\n\r\ni lost sight of it as buildings were in my way.  there was normal air traffic in the air before and after the sighting, and nothing unusual.\r\n\r\ni still think it was probably some sort of aircraft (military or civilian) - maybe with landing gear down??  i was just so surprised by the apparent size and the lack of red and green strobes.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":49891,"landingOccurred":false,"latitude":33.8776923,"location":null,"logNumber":"US-08162013-0006","longitude":-117.924178,"occurred":1376625000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1376678779000,"summary":"4 very bright lights in a square or diamond pattern flying over fullerton.","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fullerton, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268139"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Oscoda","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Wife and i observed 3 solid red lights in sky in cloud formation. lights were stationary for appx 2-3 minutes. lights began to ascend to cloud line then vanished. 3rd light vanished half way up cloud line. planes visable in area. clear night aside from cloud formation. no associated events.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":49890,"landingOccurred":false,"latitude":44.4224688,"location":null,"logNumber":"US-08162013-0005","longitude":-83.3259874,"occurred":1375426800000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1376675844000,"summary":"3 hovering lights ascended then vanished","tags":["lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":14,"locationName":"Oscoda, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268140"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lawrence Township","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and my girlfriend were heading out of lawrence square village, and i spotted a extremely bright disc star like object pulsating in the sky. i knew it was not a star because it was very bright and way closer to be a star. it was pulsating super bright, then it would flicker. .  ive seen stars my whole life so i can tell the difference. my girlfriend seen it to.. it was hovering in the sky for over an hour or so. then as it started to get dark out, it would get dimmer. and it started traveling slowly towards the right of the power lines that we were near.  as i looked through my binoculars i could see a smaller object towards the right of the bigger disc object. the smaller one was only visible through the binoculars. unfortunately i was only able to get a picture with my cell phone camera zoomed in. not the best quality but its better then nothing. \r\n\r\nwhen i was younger i thought ufos were fake. until you see one with your own eyes, your an instant believer, i have been seeing them through out my life since i was 11 years old.  when you see a disc shaped object traveling at an incredible rate of speed with no sound. you know its nothing from this earth. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change","formattedAddress":null,"id":49889,"landingOccurred":false,"latitude":40.3064375,"location":null,"logNumber":"US-08162013-0004","longitude":-74.7296313,"occurred":1376537400000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Disc,   Star-like","source":"MUFON","status":null,"submitted":1376673724000,"summary":"Bright white pulsating star like disc shape object, very bright. ","tags":["disc"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/49889_submitter_file1__20130814203330.jpg","http://www.mufoncms.com/files_jeud8334j/49889_submitter_file2__20130814203328.jpg"],"weather":null,"zipcode":"08648","daysBetweenOccurrenceAndSubmission":1,"locationName":"Lawrence Township, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268141"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Frankfurt","country":"Germany","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Last night (15/08/2013) i was out on my balcony smoking a cigarette, facing the direction of the frankfurt international airport, when 3 aircraft caught my attention. i could plainly identify a commercial airplane flying in a normal fashion... but what caught my attention was 2 other aircraft i couldnt identify approaching this airplane at a high rate of speed. one was ascending at a 45 degree angle to the jet, and the other was a bit lower than the jet. they slowed down to the speed of the airplane, circled it, flashed a light at the airplane, and took off at an incredible speed. i ran inside to tell my girlfriend who was just stepping out of the shower at the time, but by the time we both came back outside they were gone. the whole event only lasted a couple minutes. this is not the first time i witnessed strange objects flying over our airport. and they always seem to come in groups of 5 or more... ","distance":"Unknown","duration":"00:02:06","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path with directional change,Path then hovering","formattedAddress":null,"id":49888,"landingOccurred":false,"latitude":50.1136821,"location":null,"logNumber":"DE-08162013-0003","longitude":8.6850367,"occurred":1376550000000,"potentialRelations":[],"rating":"Unrated","region":"Hesse","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1376658800000,"summary":"2 ufo's observing airplane ","tags":["none"],"timeZone":"Europe/Berlin","timeZoneName":"Europe/Berlin","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Frankfurt, Hesse","triangle":false,"type":"UFO Sighting","$$hashKey":"object:268142"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1266}
