{"content":[{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Independence","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have been seeing lights moving the sky for about 3 weeks now, mostly at night, starting around nine oclock. but july 27th, 2014, i noticed a bright light in the distance. i got my binoculars and watched it. it was very bright. sometimes flashed across the sky. i watched all night until 6:00 am. i have been watching every night now. now there are many of them and they are getting closer. the sky is very busy with them. the outside of the object is red and the inside is pulsating blue and white. i noticed tonight they make a humming noise. my feelings at first was that i was excited, but now i feel worried, because they are getting so close and there are so many of them. i have not lost contact with them. they are there every night.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome, Patterned Surface","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":58566,"landingOccurred":false,"latitude":39.13624314276212,"location":null,"logNumber":"US-08012014-0005","longitude":-94.36898315948307,"occurred":1406790000000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1406880798000,"summary":"I was outside at night and saw a very bright light and got my binoculars and watched it all night. it  has pulsating red lights on the outside and blue and white lights in the inside or i should say, in the middle.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"64058","daysBetweenOccurrenceAndSubmission":1,"locationName":"Independence, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124522"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Poteau","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ok.... so i was at the drive in theater with my buddy watching a double feature. the sun had just gone down and the sky was that dim gray color from the city lights. the moon was bright that night so very little stars were visible adding to the weird glow of the sky. we were watching the movie speed racer and i was becoming rather disinterested. i noticed how clear the sky was except for one small cloud floating north on the left of the screen, towards the screen from my perspective(we were facing east), so i decided to watch it until it would pass behind the screen. i noticed it was moving pretty quick and i thought that there must be some pretty strong winds up there, but i have seen other clouds moving that speed. as it moved closer towards the screen it slowed and then stopped all together! i then slapped my buddy on the shoulder and pointed towards the cloud saying look! the cloud then proceeded in the opposite direction gaining speed and altitude. what happened next is difficult to describe. it's like the cloud condensed into a spot and 3 rings of green lights with a kind of oval shape (i'm guessing because of the angle) appeared on that spot. they kinda randomly went in different directions. they then went up and seemed to gather in formation, then dive down what i assume was in a se direction with incredible speed below the tree line and i lost site of them. this part happened very quickly.\r\n\r\nmy buddy saw the lights too but he didn't see the cloud. i don't think his eyes had enough time to adjust as he had been looking at the screen. i have no idea if anyone else there had witnessed this.\r\n\r\nplease after years of scouring the internet i have never found a similar incident. it kinda threw me for a loop as i never believed in ufos and thought people were just making things up. it has been driving me crazy.  any information on this would be greatly appreciated. i have never publicly told this story for fear or ridicule. i have tried telling my friends but they always dismiss me. even my buddy that was there does not want to dig into it but i simply cannot let it rest and be lost.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":58565,"landingOccurred":false,"latitude":35.0537094,"location":null,"logNumber":"US-08012014-0004","longitude":-94.6235579,"occurred":1211084400000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406880112000,"summary":"Cloud stopping, changing directions, then turning into rings of lights.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"74953","daysBetweenOccurrenceAndSubmission":2266,"locationName":"Poteau, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124523"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Cape Coral","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have had multiple sighting and i would like to talk to someone about it in great detail. i know i am not crazy. first sighting was of a flying square with and x in the middle rotating in an odd pattern, the shot up in sky and disappeared. i had 2 more sightings of a bright red ball of light flying slower then modern airplanes. they flew across the sky then dropped hundreds of feet, and then shot up in the sky and disappeared. there is a bunch of activity in sw florida. i also have a brief video of the glowing red light just before it shot up in the sky. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering,Other","formattedAddress":null,"id":58564,"landingOccurred":false,"latitude":26.67815202265699,"location":null,"logNumber":"US-08012014-0003","longitude":-81.98552775523524,"occurred":1388730600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406879278000,"summary":"Multiple sightings of red lights. square with x in it, shot up in the sky and disappeared","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"33993","daysBetweenOccurrenceAndSubmission":210,"locationName":"Cape Coral, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124524"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Sevan","country":"Armenia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was the only child still up after midnight, sitting by the campfire with all the adults.  \r\ni was gazing at the stars when i noticed some light becoming larger and larger and approaching the campsite. i thought it's from space, definitely. i was trying to get the adults' attention since they were loud with their laughters and jokes etc.  finally, i pulled at my mom's shirt and said, \"mom, mom, look, look, what is that?\"  then everyone just got silent and looked up at the object coming very close and hovering over the campfire.  everyone was speechless.  there were strong lights projecting all around its silver surface.  it looked like a large disk.  very large! \r\ni was happy that i got to experience that. i was not afraid at all, i felt a special connection of some sort because if i noticed it first.  the story will remain so special to me for the rest of my life, although i understand skeptics… the object flew silently towards the little hills in the not-to-far distance and stayed there for hours, by dawn, it was gone.  i had an exciting story to tell all the kids who went to bed early that night. i was 8 years old, still living in armenia. there were no other campers nearby. just my family and two or three others with us.  it  was quite magical actually.  \r\ni don't know if humans have invented such a large flying disk that makes absolutely no noise…i have no doubt that it was from outer space. unfortunately, no one had a handy camera to snap pictures….We're talking 1989…soviet-armenia in the middle of nowhere  (by a high-elevation lake--lake sevan) after midnight when all you can hear was crickets.   ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":58563,"landingOccurred":false,"latitude":40.555,"location":null,"logNumber":"AM-08012014-0002","longitude":44.953611,"occurred":616057200000,"potentialRelations":[],"rating":"Unrated","region":"Gegharkunik","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1406878457000,"summary":"Huge ofo hovering silently over campfire at lake sevan in armenia ","tags":["hovering"],"timeZone":"Asia/Yerevan","timeZoneName":"Asia/Yerevan","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":9153,"locationName":"Sevan, Gegharkunik","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124525"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Puyallup","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving home from taco bell when i looked up and saw red pink light moving north by a commercial airplane","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":58562,"landingOccurred":false,"latitude":47.1914785,"location":null,"logNumber":"US-08012014-0001","longitude":-122.2897674,"occurred":1406865600000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1406877788000,"summary":"Pink reddish color traveling north","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"98371","daysBetweenOccurrenceAndSubmission":0,"locationName":"Puyallup, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124526"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Milwaukie","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"July 27th, 2014 approximately 10 p.M.. after receiving a call from a coworker i stepped out to my backyard to observe the skies south east of my home in oak grove, oregon. the following account documents my observations over the next 2 hours. \r\nwithin minutes i spotted  over a half dozen stationary objects in what appeared to be a \"v\" type formation, in symmetrical and near perfect alignment. using my binoculars and a tripod to steady my view, i concluded these things were motionless, and displayed in common, a distinct array of multi-colored flickering lights, green, red and yellow.\r\nwithin the first 20 minutes 2 additional objects appeared from the south taking positions flanking the formations southeast wing. these two objects appeared more distant than the others and  not as bright, still displaying colored lights and assuming symmetrical positions in reference to the other objects.\r\nseparate from the formation was an object with the same features including the colored lights in a stationary position. this object was positioned more north from the other objects and shined brighter.\r\nduring my observation of this activity i was drawn to observe an entirely different type of object which appeared much closer to my home and much larger as it moved from dead south in a northwesterly direction. it's elevation was extremely low, and it was traveling at a low rate of speed very similar to the way the goodyear blimp might travel. because of its low proximity to the ground i was only able to observe it briefly, as it passed by the trees across from my home, obstructing my view. i would describe its shape to be similar to that of the bottom of a pie pan. the entire shape was lit up as if its exterior was amplifying a bright light from within. i made no further observations of this object for the remainder of the evening.\r\napproximately 11:30 p.M. i made the most astounding observation. appearing from the south directly headed over my home and my neighbors i saw two lights approaching my location in a direct south to north flight path. as it approached i was able to get a clear view as it passed directly overhead. its frame was shaped like a \"v\" bearing one large, dimly lit, milky white  spherical light, toward the outer most portion of each wing. these lights were not projecting any light they were more or less just a steady glow, with no fluctuating characteristics. i can only guess that this craft was flying at an altitude near 3000 to 5000 feet. i could make out it's shape as it displaced the background of the sky above me. as for its size, it appeared larger than anything i've ever seen, military or otherwise. what also seems very strange is that as this craft moved in a slow steady northward direction, it made absolutely no sound. no sound whatsoever.\r\ncurious about the previous nights observations, i decided to observe the skies again the following night at 9:30 p.M., making similar observations with the stationary lights \"v\" type formation.  this time there weren't as many. i counted five, one in the center, flanked by two on either side set apart by identical distance, each bearing the same colored light signatures.\r\nas with the night before, there was one singular object shining brightly above my house, slightly westward.\r\ni woke up at 4 am and stepped out to see if the lights were still there, only to find they were nowhere to be found.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Straight-line path","formattedAddress":null,"id":58561,"landingOccurred":false,"latitude":45.39646677602221,"location":null,"logNumber":"US-07312014-0026","longitude":-122.66162963171588,"occurred":1406523600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1406875540000,"summary":"Dark triangular shaped  object flying low and with no sound, with one dull lit orb on each wing","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"97267","daysBetweenOccurrenceAndSubmission":4,"locationName":"Milwaukie, Oregon","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:124527"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Asansol","country":"India","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was quite a hot night so i and my parants decided to go to our roof top where some wind was blowing .We sat on on a matress.My parents were sitting while i was just laying down.Suddenly i saw abeam of light which dashed across the sky stopped at a place in the sky almost perpendicular to my sight .I saw a ship's base which consisted of 3 pentagons .It gave off a very bright white glow and and at the centre of each of these 3 pentagons twas also asmaller blafk coloured pentagon also.I was was just stunned to see it.\r\nit stopped for only about a sec. and dashed out of my sight at an incredible speed.Yesterday i discussed about this event with my friend and i was really surprised when he told me that he too had one such ufo experience\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":58560,"landingOccurred":false,"latitude":23.6929609,"location":null,"logNumber":"IN-07312014-0025","longitude":86.9566535,"occurred":1341117540000,"potentialRelations":[],"rating":"Unrated","region":"West Bengal","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406871678000,"summary":"It just came as a beam of light  stopped for  a moment and just flew away","tags":["light"],"timeZone":"Asia/Kolkata","timeZoneName":"Asia/Kolkata","tweeted":0,"urls":null,"weather":null,"zipcode":"713301","daysBetweenOccurrenceAndSubmission":761,"locationName":"Asansol, West Bengal","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124528"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kamloops","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Late one eve...Up watchn tv..Went out on deck to have a cigerette,not seconds after i light a cigerette..I heard an intense sound of bass..Slowly increasing....I looked up to see jets in the area,as an aircadet when younger..Always been into fighter pilots....As the sound increased.. and not seein any sight of a jet..I started lookin into the clear night stary sky to see if i could see a jet in the sky...After a few seconds i thought i was watchin the space station crossin the sky..Until it went from a slow crawl..To an imediate movement of \"beyond human tech\" capabilities...I watched this light...From a wide panaramic view go from far left,to far right within milliseconds while doin acrobatic manouvers and coming to complete stops and and burstin off the complete oposite directions..Repeatedly, spinning and spiralling,as the sound of jets was increasing..The view i have from the deck looks down into a large valley where the river is...And in one spot there is a mountain infront of a mountain,but there is a small area where there is a platue where you can see behind the first mountain.The bass of afterburners got so loud..I could feel the bass ....As this star like object bounced around the sky ...After a few minutes ...In between the mountains,flew at ungodly speeds, about 1000 feet,maybe more but enough to hide between the mountain ridges...Flew what i could count atleast 6 to 10 jets.....Its a small window of sight so after about 6 jets.. i lost count being so fast..And loud...While the object still danced around the stary sky.Its been years since and never told a soul..Till a few months ago i spoke w family member..Who now think i am crazy.But this incident..Has made me look up every stary nite and watch for it again..It was not our(mankind) tech..And i need not proof..I know thus..I just want to see if any incidents have been sighted of this incident and possibly air control of a pack of jets shootn thru our valley so low i can bet they were not on radar.Shortly after the jets ripped thru the valley..The starlike object shot straight up ..And i stared at the sky for well over an hour after the light and jets were gone.. smoking repeatedly i was at aww for the jets..And really sketchin on the star object with abilities i have never seen even in a movie befor.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":58559,"landingOccurred":false,"latitude":50.681252,"location":null,"logNumber":"CA-07312014-0024","longitude":-120.3204874,"occurred":1193909400000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406867564000,"summary":"Mach 100 star,with stop n go abilities","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2464,"locationName":"Kamloops, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124529"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Oxford","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in the garden smoking a cigarette looking at the sky and saw a dull star. the star moved across the sky stopped, changed direction and then again moved across the sky i watched it until it blended with the light pollution and went off into the distance. no sound was heard and was way higher than any plane or helicopter. left a trail at one point. was 90 degrees straight above me when it was moving most erratically","distance":"N/A","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Path with directional change,Other","formattedAddress":null,"id":58558,"landingOccurred":false,"latitude":51.7273918,"location":null,"logNumber":"GB-07312014-0023","longitude":-1.2110825,"occurred":1406881860000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1406867155000,"summary":"Star moving erratically over oxford uk ","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":null,"weather":null,"zipcode":"ox43rn","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Oxford, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124530"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Asansol","country":"India","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was quite a hot night so i and my parants decided to go to our roof top where some wind was blowing .We sat on on a matress.My parents were sitting while i was just laying down.Suddenly i saw abeam of light which dashed across the sky stopped at a place in the sky almost perpendicular to my sight .I saw a ship's base which consisted of 3 pentagons .It gave off a very bright white glow and and at the centre of each of these 3 pentagons twas also asmaller blafk coloured pentagon also.I was was just stunned to see it.\r\nit stopped for only about a sec. and dashed out of my sight at an incredible speed.Yesterday i discussed about this event with my friend and i was really surprised when he told me that he too had one such ufo experience\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":58557,"landingOccurred":false,"latitude":23.6917909,"location":null,"logNumber":"IN-07312014-0022","longitude":86.9548835,"occurred":1341117540000,"potentialRelations":[],"rating":"Unrated","region":"West Bengal","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406867111000,"summary":"It just came as a beam of light  stopped for  a moment and just flew away","tags":["light"],"timeZone":"Asia/Kolkata","timeZoneName":"Asia/Kolkata","tweeted":0,"urls":null,"weather":null,"zipcode":"713301","daysBetweenOccurrenceAndSubmission":760,"locationName":"Asansol, West Bengal","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124531"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Asansol","country":"India","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was quite a hot night so i and my parants decided to go to our roof top where some wind was blowing .We sat on on a matress.My parents were sitting while i was just laying down.Suddenly i saw abeam of light which dashed across the sky stopped at a place in the sky almost perpendicular to my sight .I saw a ship's base which consisted of 3 pentagons .It gave off a very bright white glow and and at the centre of each of these 3 pentagons twas also asmaller blafk coloured pentagon also.I was was just stunned to see it.\r\nit stopped for only about a sec. and dashed out of my sight at an incredible speed.Yesterday i discussed about this event with my friend and i was really surprised when he told me that he too had one such ufo experience\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Straight-line path","formattedAddress":null,"id":58556,"landingOccurred":false,"latitude":23.6876509,"location":null,"logNumber":"IN-07312014-0021","longitude":86.9522235,"occurred":1341117540000,"potentialRelations":[],"rating":"Unrated","region":"West Bengal","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406866832000,"summary":"It just came as a beam of light  stopped for  a moment and just flew away","tags":["light"],"timeZone":"Asia/Kolkata","timeZoneName":"Asia/Kolkata","tweeted":0,"urls":null,"weather":null,"zipcode":"713301","daysBetweenOccurrenceAndSubmission":760,"locationName":"Asansol, West Bengal","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124532"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Martinez","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We all looked up in the sky at about 5:30 pm and thought we saw a planet until an app on my friends phone says no planets were in the area we were looking. it sat there for about 10min. then i saw it move west at a very fast rate with no sound and reflecting light then sort of faded away then not more than 5 min. after, we all saw it closer and at a lower elevation moving south-east at a fast rate and again, no sound. this is when we all saw it disappear for a second time.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":58555,"landingOccurred":false,"latitude":38.0330155532679,"location":null,"logNumber":"US-07312014-0020","longitude":-122.1397922887679,"occurred":1406853300000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406866415000,"summary":"Stayed stationary 90° above us for 10min then moved west and came back at a lower elevation east then disapeared","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"94553","daysBetweenOccurrenceAndSubmission":0,"locationName":"Martinez, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124533"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Gate City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Looked out my window to the sports complex near my house. saw a orb of light that appeared out of thin air, trail of material that looked like glowing particles streaming from the object. the object hovered slowly across the field around 40-50 feet in the air and vanished before i could get any closer.   ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":58554,"landingOccurred":false,"latitude":36.6412829,"location":null,"logNumber":"US-07312014-0019","longitude":-82.5592806,"occurred":1406781000000,"potentialRelations":[],"rating":"Unrated","region":"Virginia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1406863243000,"summary":"Pulsating orb hovering slowly ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"24251","daysBetweenOccurrenceAndSubmission":0,"locationName":"Gate City, Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124534"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Westbrook","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On my back deck smoking a cigarette when i noticed a dim light moving very fast across the sky the size of a star, solid light never blinking as a plane does. i have seen many of these unexplained starlike light moving an changing direction so i decided to try flashing a flashlight at it. as the object passed over my residence i flashed my flashlight in rythmes multiple times, an my porch light trying to get its attention as it flew overhead. i got a response, an this object came back around only significantly lower an brighter an i got a second responce witnessed by myself, my sister, and nephew. \r\ni live very close to portland international airport, i know this was no plane, or helicoptor. an i have in fact seen these objects trailing planes towards the airport. i would love to show an expert what i have seen, and am currently seeing on almost a nightly basis. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":58553,"landingOccurred":false,"latitude":43.65429036192829,"location":null,"logNumber":"US-07312014-0018","longitude":-70.37496779028426,"occurred":1406780040000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406859498000,"summary":"Light approached from one direction flew over, came back from another direction, disappeared, and the another came again from se i flashed a high powered led flashlight in rythme at it and got a response several times in the same rythme. an came back","tags":["flash","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"04092","daysBetweenOccurrenceAndSubmission":0,"locationName":"Westbrook, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124535"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Lafayette","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While observing the night sky we witnessed an object traveling at a speed greater than the normal commercial air traffic in the area. it traveled in the direction of magnetic north. we don't believe it was a normal satellite because the light never changed intensity during its observed path. as it traveled approximately 115 degrees of visibility.There was a power transformer that blew as it passed over the area just to the north of us. there was no noise emitted. it was similar to watching the iss and supply ship docked fly over. \r\n\r\n","distance":"Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":58552,"landingOccurred":false,"latitude":40.4264375,"location":null,"logNumber":"US-07312014-0017","longitude":-86.8542905,"occurred":1406787600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406858733000,"summary":"Extremely bright blueish white light object traveling at a high rate of speed","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"47905","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lafayette, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124536"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Albuquerque","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband and i just arrived home around 9:00 pm.  my husband took our dog out for a short walk. a couple of minutes later he ran back in the house and said you need to see this!! i went out with him and we watched around 30 of these objects going up from the west. one at a time. they started off bright red and slowly hovered and then would move a short distance and stop.  then they would move again and each time would start to change from red to white. each one would rise and then hover and would slowly move towards the north from our home. one by one they woul rise, some times we could see five or six but then they would go away. i filmed the objects on my phone for about 20 minutes.  eventually, we could not see them, they just dissappeared. i have lived in nm all my life and have never seen such a thing.  there was lightning going on at the time so it made it easy to see them. i will be happy to send the videos however i am not sure how to attach them.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":58551,"landingOccurred":false,"latitude":35.21125022728627,"location":null,"logNumber":"US-07312014-0016","longitude":-106.66134190547723,"occurred":1405743600000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1406857355000,"summary":"Came up from the west heading ne. bright red and then would fade to white. approximately 30 of them.  i have video of the objects.","tags":["video"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":null,"weather":null,"zipcode":"87144","daysBetweenOccurrenceAndSubmission":12,"locationName":"Albuquerque, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124537"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Parkesburg","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"July 4th 2014 was a mild day. not humid for a change. my boyfriend and i were home in bed at the time of the sighting (10:45pm). since it was mild, i had the window open which is right at the head of our head. the community at large were setting off fireworks. i was on my stomach watching the (sparatic) fireworks from all directions when something different caught my eye. \r\nwe live atop a hill overlooking the city of parkesburg. there is a large wooded area visible from our window. it was there i noticed a reddish glow coming from that wooded area. i initially thought someone's fireworks caught the woods on fire. my boyfriend was about to fall asleep when i made him get up to help me figure out what i was viewing. \r\nit was then, the reddish color cast a glow on the treetops and began to change directions quickly. almost in a zig zag pattern. the object began to move above the treetops but not much higher than the trees. as we discussed this, we began to freak out as the object was now flying directly toward our home. initially, i wasn't scared. we just needed to find out what this thing was. we couldn't come up with any reasonable explanation for what this was, we couldn't even make a guess. nothing we've ever seen would ever have changed direction like it did. although, when we noticed it flying toward our home, it seemed to have a direct path and flew s-sw. \r\nit's rural here and that time of night there is no noise. as it flew closer and closer, we were amazed that it was going to fly right over our home. i quickly ran to the bathroom as it's flight pattern suggested it was going to fly over the side of our house. i quickly opened the bathroom window which is on the side of our home. it was then, it passed within 20feet of our tree on the side of the house. i could see approx 3 lights which were orange-ish/yellow. the lights seemed to be glowing from the inside. as if a candle was burning in front of a window. it appeared to have a dull appearance to the craft. since the leaves are on the trees, i could only see portions of it. although, while flying toward our home, it seemed to be almost round but it was dark and farther away at that time and cannot fully say for certain it was round. \r\nwe lost sight of it when it flew just past the tree. a friend lives exactly 1 mile from here and in it's flight path. we tried calling him to see if he could run out and see what we saw. however, our cells phone wouldn't work. no tv either. our clock was even blinking as if we lost power. however, if it was a power outage, it wouldn't explain why our phones wouldn't work. i never have problems getting a signal here or with them working.\r\nmy boyfriend and i do not understand what we saw. we have no reasonable explanation for it. after it was gone, i was scared. simply because all of this made no logical sense to us. \r\n","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Hovering then path","formattedAddress":null,"id":58550,"landingOccurred":false,"latitude":39.94320867579241,"location":null,"logNumber":"US-07312014-0015","longitude":-75.93086871615787,"occurred":1404539100000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1406856018000,"summary":"Watched object ascend from wooded area. took direct path towards our home and flew directly over our home. boyfriend was also witness. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"19365","daysBetweenOccurrenceAndSubmission":26,"locationName":"Parkesburg, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124538"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Cornell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While watching delta aqua-rid meteor shower 07/29/14 @ 0034 est my wife and i observed what looked like a typical satellite moving from south to north. the object stopped abruptly at roughly 90 degrees overhead and suddenly changed direction to the east, from our point of view the distance traveled in the easterly direction was maybe an arms length, the object stopped immediately again and stayed in a stationary position roughly 90 degrees overhead.  withing 10-15 seconds another object slightly dimmer but moving in the same south to northwest direction made a slight curved pass around the stationary object.  within a few minutes after the first observation the stationary object seemed be taking in four small blips light.  i finally became tired of staring at the now stationary object and retired for the night.  where we live observing satellites and meteors is almost a nightly occurrence, both objects witnessed did not look like a meteor or act like a satellite. ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":58549,"landingOccurred":false,"latitude":45.9013507,"location":null,"logNumber":"US-07312014-0014","longitude":-87.2223591,"occurred":1406617200000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1406855136000,"summary":"While watching delta aquarid meteor shower my wife and i observed what looked like a satellite stop and change direction to the east then object stayed in stationary position.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Cornell, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124539"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Cancún","country":"Mexico","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My girlfriend and i were at our hotel in cancun. i noticed a strange object i the sky\r\nat first i thought it was a bird, but it was descending rapidly and the closer it came down\r\ni grabbed my iphone and started recording it. got good footage \r\n\r\nit descended and hovered for a moment then shot off rapidly. i don't know what this could be? ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change","formattedAddress":null,"id":58548,"landingOccurred":false,"latitude":21.166928,"location":null,"logNumber":"MX-07312014-0013","longitude":-86.8447079,"occurred":1400569200000,"potentialRelations":[],"rating":"Unrated","region":"Quintana Roo","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1406853075000,"summary":"Got 59sec of footage. something really strange. help me to find out what this is please. ","tags":["none"],"timeZone":"America/Cancun","timeZoneName":"America/Cancun","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/58548_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/58548_submitter_file2__trim.BAB9226026594695952C70E3C44565E5.MOV","http://www.mufoncms.com/files_jeud8334j/58548_submitter_file3__image.jpg","http://www.mufoncms.com/files_jeud8334j/58548_submitter_file4__image.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":72,"locationName":"Cancún, Quintana Roo","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:124540"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Coppell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Having trouble sleeping on night of july 30, 2014, i decided to step outside and watch netflix on my ipad and smoke a cigarette.  i sat down in one of two patio chairs facing east and put my earbuds in attached to my ipad.  this was before midnight.  i lit a cigarette and looked straight ahead at nothing and a bluish-white object dashed in from the low horizon(40 degrees above the horizon?)from the east to a spot ahead of me and completely stopped.  this arrival took no more than 1 second.  after stopping, the light flashed bright white all across the object.  it looked like a do-nut in shape and the lights appeared to be moving in a clockwork direction.  the lights changed from blue to pink and purple and orange, orangeish-red, red, etc.. in quick succession.  the object spread the colors (for instance, the right side would be blue and the other side appeared white or some other color at the same time.  it did not appear the same color at the same time and there appeared to be no pattern).\r\n after some 30 seconds, it dropped down beneath the tree line in about a 3 second descent.  i just stared the whole time and then realized my iphone was in my shorts pocket.  i should have video'd!\r\n  my immediate neighbor to the east of me has trees in the back yard but i thought if i climbed onto the roof, i might be able to see the object again.  i managed to climb onto the roof and stood on the crest of the roof but could see nothing.  weird strobe-like lightning was above and to the north of me behind a huge cloud bank as a storm was blowing in from the north.  i decided to video where i had seen the light as long as i had the vantage point.\r\n  it was during the video play on my iphone that the object reappeared.  it ascended above the tree line and returned to about the same distance away and spot that i had first saw it.  this time it appeared to be more circular (ball shaped). the video is almost 5 minutes long.  after it dropped below the tree line again, i somehow got down from the roof without injury, ran inside and woke our daughter's mother (who was not happy to be awakened and told me to leave.  i was excited and tried to get her to come out but could not convince her), and went back out to see if it reappeared.  over the next thirty minutes (and about 4 cigarettes), nothing reappeared.  \r\n  i called coppell non-emergency number and asked if they had many calls about the lighted object.  the operator said they had not.  i briefly explained what i saw and gave my name and number. this was about 1:00am in the morning on the 31st of july.  she said she could send out an officer to take a report and that was when i hesitated.  i let her know that if anyone else called in, i could collaborate the story and provide some video from my iphone.  i googled how to report an odd sighting in the sky, called the number on the website, left a message, and received a call this morning asking me to fill out a report and send in the video.\r\n  i wish i had not spoken during the video as it diminishes what occurred and wished the video quality was better.  my eye caught much better detail and even though there was no moon in sight in the sky, the surroundings that i could see at the time do not appear in the video.  everything looks black except for the lighted object in the sky and you can briefly see street lights and neighbor's lights when i pan the camera around.\r\n\r\naddendum:\r\nunfortunately, the video is 347 mb so i was not able to attach.  i spoke with a gentleman at the mufon website telephone number who asked me to post the video on the internet and send written report without.  i will send link connection when i do this.  i will have to ask for help as i don't know how to directly post to the internet.","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path then hovering","formattedAddress":null,"id":58547,"landingOccurred":false,"latitude":32.9622287,"location":null,"logNumber":"US-07312014-0012","longitude":-97.0123178,"occurred":1406790000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1406846400000,"summary":"Coppell tx july 31, 2014 bright blue streak from east stopped over coppell, revolved, glowed in different light patterns, descended below tree line.  reappeared, hovered and descended again.  video taped","tags":["video","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Coppell, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124541"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Terre Haute","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have had encounters of the 4th kind, and i do have physical evidence, i have tryed reporting every time i have had an encounter,but i never hear back from anyone, i called this morning, and it does not even show that i have reported anything as well. you may not got this one cause no other reports make it threw ","distance":"Unknown","duration":"00:14:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Hovering then path","formattedAddress":null,"id":58546,"landingOccurred":false,"latitude":39.49137272171181,"location":null,"logNumber":"US-07312014-0011","longitude":-87.3919030593672,"occurred":1399273200000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1406844862000,"summary":"I se them very often. this was just my last sighting. ","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":null,"weather":null,"zipcode":"47807","daysBetweenOccurrenceAndSubmission":87,"locationName":"Terre Haute, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124542"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Farmington Hills","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Witness (a) was 12 years old on his way to the shopping center with a friend, it was just before sunset on dec 09, 1965 on a partly cloudy day. he felt a persisting presure change or presence, looked up to the nnw.    witness (a) observed for 10 seconds, a bright white segmented ring with a dark, black center which was emitting/flashing, blue/green flames similar to a space capsule re-entry which were spreading out like flower pettals. he called out to his friend, witness (b) a short distance away, \"do you see that?\" he said \"yes, what is it\".","distance":"Over One Mile","duration":"00:00:10","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":58544,"landingOccurred":false,"latitude":42.4986648,"location":null,"logNumber":"US-07312014-0010","longitude":-83.3782305,"occurred":-128130300000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1406838016000,"summary":"Stationary bright white, segmented ring, 3x size of moon, black center with blue green flames shooting out","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"48334","daysBetweenOccurrenceAndSubmission":17765,"locationName":"Farmington Hills, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124543"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside to get some things out of my car and when i started to go back inside i looked out to the ocean and thats when i seen it. i ran inside and got my smart phone and turned on the video recorder and started filming. this was my second sighting over the ocean in almost the same location. my first sighting was in november of last year 2013. i also have that one on video but this last sighting was much better and clearer on the video.","distance":"Over One Mile","duration":"00:05:51","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Hovering then path","formattedAddress":null,"id":58543,"landingOccurred":false,"latitude":32.57769719148093,"location":null,"logNumber":"US-07312014-0009","longitude":-116.9904833456121,"occurred":1400128260000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1406833592000,"summary":"It was huge at least a mile wide","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/58543_submitter_file1__May2014001.mp4","http://www.mufoncms.com/files_jeud8334j/58543_submitter_file2__UFO2187.mp4"],"weather":null,"zipcode":"92154","daysBetweenOccurrenceAndSubmission":77,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124544"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"New Delhi","country":"India","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my house roof and was roaming. then suddenly i noticed a light moving on igi airport which is near my home. i thought it was an aeroplane but an aeroplane doesn't stay at a particular place. then after 5-6 sec it started moving towards south around 100 mtrs and then it took an incredible around 120degrees turn. and it moved with a high speed and disappeared in west direction.I come daily on the roof but this was the first incident.I took my phone out to make a video but i think due to low grade phone it is not visible but still i have the video. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":58542,"landingOccurred":false,"latitude":28.5961279,"location":null,"logNumber":"IN-07312014-0008","longitude":77.1587375,"occurred":1406785860000,"potentialRelations":[],"rating":"Unrated","region":"Delhi","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1406826253000,"summary":"The ufo was on igi airport with three blue lights and it took an incredible turn of around 120 degrees in a moment.","tags":["ufo","lights"],"timeZone":"Asia/Kolkata","timeZoneName":"Asia/Kolkata","tweeted":0,"urls":null,"weather":null,"zipcode":"110010","daysBetweenOccurrenceAndSubmission":0,"locationName":"New Delhi, Delhi","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:124545"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cape May","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At ~9:30pm est, two friends and myself were on the second floor deck enjoying an after dinner cigar discussing the days events and looking at the stars and occasional airplane. i was positioned facing se, one other was facing nw, and the final witness was facing sw. we witnessed a helicopter head up the coast (ne) and about 15 minutes later the helicopter retraced its previous course(sw). two of us are aviation followers and were discussing the planes flying over, as well as the helicopter.\r\n\r\ni had just finished watching the helicopter disappear and at 9:47pm(+/- 1 minute) i spotted three faint white (almost amber like) lights in a triangular formation coming from the direction where the helicopter was last seen, sw of our location, out over the water. the lights were moving very fast in formation to the ne, up the coast of cape may over the ocean. the lights were ~20 degrees above the horizon. we could not determine the size or distance from us, but we estimate the speed at 800 to 1000 mph based on other aircraft that were in the area.\r\n\r\nabout 8 seconds after initial sighting the craft was lost in the light pollution and appeared to perform a slight rotation. it was that quick, no time for cameras or anything else to document.\r\n\r\nneedless to say we were quite amazed at what we had just witnessed and kept recounting the sighting and trying to determine what they could have been by ruling out all possibilities. as we watched other aircraft traversing the area, we were still amazed at the speed at which the lights moved.\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":58541,"landingOccurred":false,"latitude":38.92849988622542,"location":null,"logNumber":"US-07312014-0007","longitude":-74.95185281281434,"occurred":1406782020000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1406822564000,"summary":"Three white lights in triangular formation moving rapidly sw to ne with slight rotation before end of sighting in cape may nj","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cape May, New Jersey","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:124546"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Newtown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Although i am hesitant to say with certainty that it was a ufo, i can attest to the fact that i have yet to see an aircraft - passenger, corporate or military - that looked anything like the object i witnessed tonight. the very large size and bright light radiating from this object gave me the impression that it was an extraordinary air transport vehicle, to be sure. \r\n\r\nmy son had just come home after eating at a local restaurant with friends -- it was approximately 11:11 pm (july 29, 2014; tuesday). once inside he urged me to go outside to our front lawn and to look high above the fields approximately �� to one mile southwest. \r\n\r\ni dashed out to the front lawn of our home and searched the dark, nubilus sky. indeed, the spectacle above could hardly go unnoticed, not with the long, radiant spears of light projecting from the craft���s entire circumference, giving it a classic ���star��� shape. i did not count the number of star-like projectiles surrounding the craft.  the whole object appeared silver or chrome-colored.\r\n\r\nthe ufo remained stationary.  i did not see any airplanes in the sky during the ten seconds or so that i observed this spectacle. witnessing yet another ufo-type occurrence in bucks county left me awestruck and  anxious to summon both of my sons so that we could later compare our individual observations of the event and perhaps take photos.\r\n\r\nmy older son wasted no time. my other son was in the bathroom and told me he would be outside to join us in a minute.  by the time my older son and i made our hasty retreat from the house to the same spot on the front lawn where i had stood only several seconds earlier, the space machine had vanished. my son and i scanned the skies hoping to find its new spot in the heavens but we were unable to locate it in any overhead direction. \r\n\r\napproximately one minute or so later what looked to be a commercial passenger plane flew overhead, destined most likely for the mercer county (nj) airport, about 20 miles east of newtown, bucks county (pa.), which is in or near the area where this star-shaped craft was seen in the sky. the aforementioned airplane flying in such proximity to the location where this \"foreign\" craft had been a minute or more earlier did not seem odd or coincidental to me, since airplanes routinely use those designated fly/sky lanes enroute to or departing the airport.  \r\n\r\nfootnote: bucks county, incidentally, as you know, is no stranger to astral interlopers.  approx. five or six years ago my daughter and i saw the now ���infamous��� orange-colored crafts in the western sky above bucks county community college or thereabouts. these ���softly pointed��� triangular shaped craft traveled in a trio and seemed intent on perfecting their formation in the skies before literally and instantaneously disappearing to a destination we could not see. like the spaceships or flying saucers depicted in comic strips, i imagined a bubble containing the word, ���poof!��� because surely no other word could describe the three orange crafts supersonic, extraordinary speed during their departure.  but that���s another report for another day���.\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":58540,"landingOccurred":false,"latitude":40.23308155922748,"location":null,"logNumber":"US-07312014-0006","longitude":-74.95737310361251,"occurred":1406700660000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406809720000,"summary":"Observed a very large silver/metallic object in sky.  night sky was nubilus, but craft  apparently came to rest beneath the clouds considering the brilliant , clearly visible luminosity it projected.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"18940","daysBetweenOccurrenceAndSubmission":1,"locationName":"Newtown, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124547"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Grand Rapids","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving my truck (i am a professional driver) i spotted from a distance what appeared to be a large aircraft crossing the freeway towards the near by airport. as i approached i realized the craft was moving much slower than a standard aircraft and it's three lights on the side showed an outline of a rectangle shape. as i continued towards the craft i  appraised a position of being nearly under and behind the craft. that is when i realized it was triangle shaped. the lights where very bright and showed an indentation on the craft that cast shadows due to the lights.Being in a semi truck i could not stop or take pictures. about 2-3 miles down the road i saw a much smaller craft which had 5 white lights and one red. move very slow and appeared to hover . once again due to driving i was unable to get pictures or video. this area has a near by airport . i have seen flights come and go from the road many times. nothing has ever moved or appeared the way these two crafts did. the triangle shape had three lights on the side. it also had one light in the front and two more going to the rear of the craft. very bright. almost so bright it showed a haze of light.","distance":"101-500 Feet","duration":"00:00:15","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":58539,"landingOccurred":false,"latitude":42.9676799,"location":null,"logNumber":"US-07312014-0005","longitude":-85.6660463,"occurred":1406529000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1406806090000,"summary":"Spotted first large triangle craft while driving. then small craft minutes later","tags":["triangle"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":3,"locationName":"Grand Rapids, Michigan","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:124548"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Powell River","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 12:15am on july 31, 2014 i walked out onto my north facing deck to cool off, and noticed how brilliant the stars were, and then after looking all around i saw a flashing/blinking star shaped light, it was going first down and then back up and then making a diagonal line towards the east and then back up to the same point on top, then back straight down and then back up again then moving straight across eastwards and back again and then another eastward diagonal, then straight up. it did this many, many times before i saw another coming to the treeline that looked the same as the first one, as if they were moving/making a grid, one just below and to the west of the first one i saw. they were star like in shape but emitted flashing colors of red, green/blue and gold-ish lights, i watched them for almost an hr and they appeared to be moving north, slightly east all the while doing this same like grid pattern, getting smaller as they moved more northward. very cool..Stars and or planes or satellites do not move in this fashion..I do believe i witnessed a ufo.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":58538,"landingOccurred":false,"latitude":49.934635700530286,"location":null,"logNumber":"CA-07312014-0004","longitude":-124.63904999838043,"occurred":1406790000000,"potentialRelations":[],"rating":"Unrated","region":"British Columbia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1406805870000,"summary":"Watched it make a grid lke pattern from up to down, and back up, then a diagonal line east, back and then from top to right east, ti was making square grids as it moved slightly north and east.","tags":["light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"v8a 0c5","daysBetweenOccurrenceAndSubmission":0,"locationName":"Powell River, British Columbia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124549"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Ambikapur","country":"India","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am standing at the terris i saw a light coming from east with a blue coloured light the object is like a circular disc and it was very bright and fast and soon disappeared in the west","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":58536,"landingOccurred":false,"latitude":23.1354921,"location":null,"logNumber":"IN-07312014-0002","longitude":83.1817856,"occurred":1382841000000,"potentialRelations":[],"rating":"Unrated","region":"Chhattisgarh","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1406797970000,"summary":"I saw an object flying with a blue coloured light","tags":["disc"],"timeZone":"Indian/Mahe","timeZoneName":"Indian/Mahe","tweeted":0,"urls":null,"weather":null,"zipcode":"497001","daysBetweenOccurrenceAndSubmission":277,"locationName":"Ambikapur, Chhattisgarh","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124550"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Eugene","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Seven of us witnessed this new sighting. this is my third mufon repot. the picture will speak for itself...","distance":"501 Feet - 1 Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Path with directional change","formattedAddress":null,"id":58535,"landingOccurred":false,"latitude":44.078839450098926,"location":null,"logNumber":"US-07312014-0001","longitude":-123.12233088072139,"occurred":1406782440000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1406793779000,"summary":"Caught inbetween cloaking phase rotation (believed)","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/58535_submitter_file1__UFOinEugene.jpg"],"weather":null,"zipcode":"97402","daysBetweenOccurrenceAndSubmission":0,"locationName":"Eugene, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:124551"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1010}
