{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Coronaca","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at my boyfriends house when the incident happened. he lives in coronaca, this very tiny, obsolete place outside of greenwood, sc. going up 221 towards lake greenwood. we both work second shift, so we are always up late cooking a late dinner. (this was sunday night, teqnically early, early monday, july 31st around 12:30am). we both smoke cigarettes so while we were waiting for our food to cook, we stepped outside to smoke. i remember him saying it was around 12:30am around this time, but it may not be the exact time. (could have been shortly before 12:30am). anyway, this is nothing out of the norm, you could say it's our nightly routine-ish. so we were outside, smoking, and i always look at the sky while we talk. i've never seen anything weird before, just the stars and the moon. we were talking and he was saying something, but out of the corner of my eye i saw this bright light flash in the direction of the sky.. it was bright enough it caught my attention and i wasn't sure if it was a firefly or what, but i kept looking  and saw nothing for a few seconds....Until i saw this bright flash of light again and then disappear. it was definitely not a firefly and it was pretty high in the sky, higher than plane level maybe. i can assure you it wasn't a plane, because yes, planes do have constant blinking lights on them and fly in a straight directional path. so after this bright blink of a light caught my attention, i kept staring at the sky just to make sure i wasn't seeing things, and i saw it again!! it was kind of a slow blink, maybe 1-3 seconds. it would shine really bright, like the brightest star in the sky (about that size) for a couple of seconds and then dissapear for about 5 seconds. i was in disbelief and by the second blink i blurted out to my boyfriend, \"look! do you see this?\" he looked and by the third blink he saw it. so you have two witnesses. he sat there for a few minutes with me witnessing it. it started ne near the cassiopeia constellation. what was crazy about this flashing light was that it had no directional path, it was completely random with its movement and would reappear maybe a thumb length the next time it flashed. (like if you're holding your thumb up about 8 inches from your face, it moved about that far each blink). it's movement was random, but it seemed to be moving right with every blink. it would flash up, then down, but always a little more to the right. i kept looking because this was crazy, i've never seen anything like this in the sky, and i do my fair share of staring at the stars and whatnot. we had both finished our cigarettes and he wasn't as amazed as i was so he went in to check on the food but i stayed outside to witness this. i didn't count how many times the blinks  occurred, but for about 15 minutes it blinked for about 1-3 seconds, disappeared, and then reappeared in a random spot, not too far from the precious spot, and repeated. but like i said, no directional path, just moving right, up or down. i watched this for about 15 minutes and then it just disappeared. it stopped blinking. there were no clouds, and i know it didn't move out of sight, it just stopped. the flashes were really bright at first and gradually got dimmer and dimmer until i didn't see it at all, almost like it was running out of energy? i just want to say i have a bachelors degree in psychology, i'm a real person, i would never, ever make up something like this. i truly saw this and i will have to say this is the craziest thing that i've seen in the sky. i've seen constant, non-flashing lights move across the whole sky in a constant direction which i've chalked up to as satelites (maybe?), but this. this is something i cannot explain. i have no idea what would be in the sky, flashing and moving in a non-straight direction.... i tried taking a video but even with an iphone 6s, it was just a black screen. ","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":85635,"landingOccurred":false,"latitude":34.2598459,"location":null,"logNumber":"US-08042017-0006","longitude":-82.0942855,"occurred":1501459200000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1501820306000,"summary":"It was a blinking light. it would blink for 1-2 seconds, then disappear for about 5 seconds, then blink again in a new location. no directional, constant path. ","tags":["video","lights","flash"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501835220292,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":16,"meanvisi":10,"mintempm":14,"mintempi":57,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":16,"meanvisi":10,"mintempm":14,"mintempi":57,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":4,"locationName":"Coronaca, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3335"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Culver City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Of course it is so many years now since this happened i am uncertain as to the year or month, but i do remember it was close to midnight because my friend, paul, and i often talked about the girls at the event we went to every week end and the dance ended at 11:00 pm...So we would park in the alley behind where he lived on sawtell blvd. (between venice blvd. and washington blvd.)...I was leaning on the front of my mother's white corvair which was pointed approximately se and from over the tops of some palm trees at the far end of the alley i noticed something very strange looming larger and larger until it cleared the palms and i could see it was a something shaped like a stingray...But the tail wasn't that long...It was glowing pink in a very strange way...The way a black light appears if you stare at it...With fuzzy edges but a very distinct shape...And it was obvious to paul that i was no longer listening to him and he said \"what's wrong?\" and i pointed to the object as it loomed larger and larger, perfectly silently, moving in a steady slow motion until it was right over us, quite high but quite big...I don't know why i could determine this except it stirred tremendous emotion in me because of this...I had never seen anything even remotely like it...And now paul too was staring up at it as it came to a halt right above us. we were staring straight up at it's underside which had two fuzzy dark ovals in the center...I think we were both so dumbfounded we said nothing...Everything was glowing pink in the alley, the tree tops, the white corvair, our clothing, everything...And i noticed a strange metalic taste in my mouth...How strange, i thought, that it paused right above us like that...Also, i knew for a fact that we were witnessing the very first real contact with extraterrestrials and that all of culver city must be witnessing the same thing...It was sooo huge...Suddenly it departed, kind of sliding off sideways and climbing, but at a speed so fast it left a series of fading images of itself...Then it disappeared altogether in a somewhat northerly direction. so then paul and i run inside his place and wake up his parents and tell them to turn on the television because this is going to be on every channel!...But nothing...His parents say \"have you two been drinking?\"...We are totally blown away that there is no mention of it on the radio or televsion...Nothing...We keep checking the news for weeks...Nothing...We talk about it together all the time for years...We think we must be mutually crazy...We write our observations and compare notes...It all matches...What should we do? we wonder...If we mention it to others they always say...Oh sure, how come no one else reported it? no one believes us. how could this be, we ask ourselves...What the hell is this? we are frightened and weirdly traumatized by the fact that there is no corroboration of any kind except ourselves...We know we experienced something so profound together. we know it has bonded us for life...That's a laugh...I don't even know if he's still alive...Here i am nearly 70 years old and reliving that night over and over...I often return to that alley and park there and just stare up at an indifferent sky...Once someone said: \"what are doing here?\"...Naturally i couldn't say...I don't really even know...It's all very peculiar...But still vivid in my mind...And when i think of it i can taste that weird metalic taste in my mouth...It's like taste memory...And i can still see those fading trace images of it in it's sudden departure.","distance":"501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":85634,"landingOccurred":false,"latitude":34.026812400000004,"location":null,"logNumber":"US-08042017-0005","longitude":-118.38976650000001,"occurred":-138240000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1501813985000,"summary":"Glowing, pink, fuzzy edges, stingray shaped, two dark ovals on bottom, metalic taste in mouth as it hovered","tags":["light","contact"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501828920297,"urls":["http://www.mufoncms.com/files_jeud8334j/85634_submitter_file1__Photoon20170803at23.312.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":85,"maxvism":null,"maxvisi":null,"meantempm":24,"meantempi":76,"meanvism":null,"meanvisi":null,"mintempm":19,"mintempi":66,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":85,"maxvism":null,"maxvisi":null,"meantempm":24,"meantempi":76,"meanvism":null,"meanvisi":null,"mintempm":19,"mintempi":66,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":18982,"locationName":"Culver City, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3336"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Fort Saskatchewan","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went outside to have a vape and looked over towards the south end of town and notice an orb glowing in the horizon. i went inside to grab my phone and recorded it. \r\n\r\nit pulsated and hovered and then eventually faded away. it appeared to be over sherwood park which is over 10 km away. the event lasted about a minute or so. see video. \r\n\r\na few days prior, july 31st at 21:15, i saw a bright orb in the distance but this time it was a bright white. as bright as a light tower would have been. i saw it a bit east of the location of the video. it was hovering in the distance for about 10 seconds and then faded away about a min later it appeared further east of the original location and moved east. it then did an 180 degree turn and then faded away. the sighting lasted about 10 seconds. i didn't have my phone with me at this time but made sure that i had it with me afterwards. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":85633,"landingOccurred":false,"latitude":53.7007157,"location":null,"logNumber":"CA-08042017-0004","longitude":-113.2094659,"occurred":1501630920000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501813105000,"summary":"Glowing orb south of ft saskatchewan","tags":["video","light","hovering"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1501828020304,"urls":["http://www.mufoncms.com/files_jeud8334j/85633_submitter_file1__20170801234236.mp4"],"weather":{"history":null},"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Fort Saskatchewan, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3337"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lumberton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"(409) 697-0179  i was outside smoking a cigarette in my backyard i love looking up at the sky at night i noticed a light coming from the northwest it had a yellowish white light,  it was kind of dim  no clouds in the sky i noticed it coming from the north west it went all the way across the sky in a curved motion it went south east of lumberton tx  when i first saw the light at first i thought it might have been a meteor but i know it was not a meteor because it  curved in the sky not an abrupt curve but it was curving  immediately i knew that it was something that i have never seen before in my life it was too fast for a plane it went completely across the sky in about five six seconds and it was not a meteor because it was too slow for a meteor  i am positive that i seen something that i have never seen before in my life and i hope to see another one i hope somebody else reports it to  after i saw it i called my mother and told her about it and she said that i should reported to mufon  i don't believe that i will be able to sleep tonight i will keep my eyes focused on the sky ","distance":"501 Feet - 1 Mile","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":85632,"landingOccurred":false,"latitude":30.263023883802052,"location":null,"logNumber":"US-08042017-0004","longitude":-94.20315316734828,"occurred":1501804800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501810623000,"summary":" went across sky very fast with a turn ","tags":["ufo","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501825321190,"urls":[],"weather":{"history":{"dailySummary":[],"dailysummary":[]}},"zipcode":"77657","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lumberton, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3338"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Lumberton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"(409) 697-0179  i was outside smoking a cigarette in my backyard i love looking up at the sky at night i noticed a light coming from the northwest it had a yellowish white light,  it was kind of dim  no clouds in the sky i noticed it coming from the north west it went all the way across the sky in a curved motion it went south east of lumberton tx  when i first saw the light at first i thought it might have been a meteor but i know it was not a meteor because it  curved in the sky not an abrupt curve but it was curving  immediately i knew that it was something that i have never seen before in my life it was too fast for a plane it went completely across the sky in about five six seconds and it was not a meteor because it was too slow for a meteor  i am positive that i seen something that i have never seen before in my life and i hope to see another one i hope somebody else reports it to  after i saw it i called my mother and told her about it and she said that i should reported to mufon  i don't believe that i will be able to sleep tonight i will keep my eyes focused on the sky ","distance":"501 Feet - 1 Mile","duration":"00:00:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":85631,"landingOccurred":false,"latitude":30.24310989650018,"location":null,"logNumber":"US-08042017-0002","longitude":-94.21177950816869,"occurred":1501804800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501810411000,"summary":" went across sky very fast with a turn ","tags":["ufo","light"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501825320874,"urls":[],"weather":{"history":{"dailySummary":[],"dailysummary":[]}},"zipcode":"77657","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lumberton, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3339"},{"address":null,"addressResolution":null,"altitude":"Treetop, Unknown","city":"Rockville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching t.V. about muon and u.F.O.In my living room (but i've seen this same object several times before in same location).I noticed it because saw a round like up structure. it moved around back and forth left to right then stood still for about 45 minutes.My reaction was o.K. because i've seen this several times before and was not as scared as i was first time i saw it. also i dont stare at iy anymore, after the other time when it hit my eye and hurt it previously.Also the previous times it moved very quickly back and forth, then disappeared and shortly after reappeared. one time i looked straight at it for a long time and a very strong beam if light hit my left eye and i have never felt such ibtense pain before-i got scared and thought i may go blind. i went to doctor for eye visit and tgey said you a a big mole in back of your eye-which i was never told that before.Alost always happens at night time while i'm watching t.V.I glanced at it non-stop every now and then and realized it didn't disappear until 45 minutes later.I finally took 10 pictures of it many from me still sitting on my sofa and some standing up. again i'm not sure if it's a u.F.O. but i think that it is and i have photos to submit for you (mufon) to be the judge of that.","distance":"20 Feet or Less","duration":"00:45:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":85630,"landingOccurred":false,"latitude":39.09907416754043,"location":null,"logNumber":"US-08042017-0001","longitude":-77.09715279845726,"occurred":1501793640000,"potentialRelations":[],"rating":"Unrated","region":"Maryland","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1501805627000,"summary":"Saw light round like circle or moon outside my living room window and light brand emitted out around but emitted different from top vs. the bottom. it moved around then stayed stationary for approx. 45 minutes, then finally disappeared,this is not first t","tags":["photo","ufo","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501820745722,"urls":[],"weather":null,"zipcode":"20853","daysBetweenOccurrenceAndSubmission":0,"locationName":"Rockville, Maryland","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3340"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"June of 1979 at lake travis near austin,texas. a friend, and i were on motor cycles, and it was about 9 pm,and totally dark. just as we put down the kick stands a large disc uncloaked, or came from a higher dimension over the lake. it moved over to the bank about 50 yards to the west right by one of the light poles, and just above the pole. it was silver with green, and orange lights near the edges of the disc, and rotated counter clock wise. it hovered for a few seconds as we stared in shock. it then lit a very bright light in the center of the bottom, and moved out over the lake at about 4,000 miles an hour, and zig zaged over the lake a the same speed, and then shot up, and left the light on, and it looked like a star. the total time was about 10 minutes or less. many other people have seen a disc there, and it seems to still be visiting from time to time too.","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path then hovering","formattedAddress":null,"id":85629,"landingOccurred":false,"latitude":30.274693,"location":null,"logNumber":"US-08032017-0027","longitude":-97.73714079999999,"occurred":297896400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1501801580000,"summary":"A disc uncloked over the deep end near hippy hollow, and moved over to the bank near us, turned on a bright light and ziz zaged over the lake, and went stright up.","tags":["lights","disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501816545716,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":81,"maxvism":32,"maxvisi":20,"meantempm":23,"meantempi":74,"meanvism":29,"meanvisi":18,"mintempm":19,"mintempi":66,"minvism":11,"minvisi":7,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":81,"maxvism":32,"maxvisi":20,"meantempm":23,"meantempi":74,"meanvism":29,"meanvisi":18,"mintempm":19,"mintempi":66,"minvism":11,"minvisi":7,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":13934,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3341"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Nashville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"One was egg orb shaped moving towards moon in and around i saw something falling down like snowflake type material the other one looked mechanical in the last pic.","distance":"N/A","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface, Other","flightPath":"Stationary,Path then hovering","formattedAddress":null,"id":85628,"landingOccurred":false,"latitude":36.074268520615206,"location":null,"logNumber":"US-08032017-0026","longitude":-86.72233678910897,"occurred":1499640900000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Egg","source":"MUFON","status":null,"submitted":1501800582000,"summary":"Looked like an orb the other looked like a mechanical barge made of grey or metal?","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501815346021,"urls":["http://www.mufoncms.com/files_jeud8334j/85628_submitter_file1__IMG20170709232235.jpg","http://www.mufoncms.com/files_jeud8334j/85628_submitter_file2__IMG20170709232310.jpg","http://www.mufoncms.com/files_jeud8334j/85628_submitter_file3__IMG20170709232545.jpg","http://www.mufoncms.com/files_jeud8334j/85628_submitter_file4__IMG20170709232638.jpg","http://www.mufoncms.com/files_jeud8334j/85628_submitter_file5__IMG20170216190710.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":33,"maxtempi":91,"maxvism":16,"maxvisi":10,"meantempm":26,"meantempi":78,"meanvism":16,"meanvisi":10,"mintempm":18,"mintempi":65,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":33,"maxtempi":91,"maxvism":16,"maxvisi":10,"meantempm":26,"meantempi":78,"meanvism":16,"meanvisi":10,"mintempm":18,"mintempi":65,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"37211","daysBetweenOccurrenceAndSubmission":24,"locationName":"Nashville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3342"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"South Daytona","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my family room watching tv.\r\n\r\ni noticed strange reddish lights in the distance.\r\n\r\ni knew something seemed unusual about these lights. we have an aeronautical university about 5 miles away, and i often see planes in the same general vicinity and about the same height as these objects were, but they never looked like this, so i went out on my back porch to see them better.\r\n\r\nwhen i first saw them, i suspected they were ufo's since they looked like nothing i'd ever seen before.\r\n\r\nat first there were 4 of these orb like, glowing reddish orange things in the sky. they had moved from west to east and as they did so, they hovered in two rows of two, close to each other. then, as i watched, one by one more of them started coming up. as the others rose to the same height, the first ones began to fly away slowly. they moved in a curved pattern. as they headed north, they vanished. it was as if the lights just went dim. they seemed to be moving slowly, but in a matter of seconds they had gone from looking large to very tiny, and then just disappeared. there was no sound. i thought perhaps it was someone playing with friends with drones or something, but the things just didn't look like drones, airplanes or anything else familiar. they were round to teardrop shaped- almost like a fat bottomed egg. all were about the same size and all glowed the same. there seemed to be almost a handle effect over them. the \"handles\" on top were slightly lighter and more blurry than the bottoms. i couldn't discern any exterior lights as the entire things were glowing. they were deliberate in movement- not choppy or irregular. they almost gave the feeling of candles in bags floating in the air, except they were too bright, not the right shape and the way they moved was as if there was a deliberate path, curving up from a lower point, heading east, then stopping, hovering in formation, and curving northwest for a second, and then north, in single file until they went out like a match being blown out! if it had been drones, there would have been noise. no noise at all. no engine sounds. a small plane was in the sky heading north as they were going out of sight.\r\n\r\ni watched until they simply disappeared. it was very strange. i wanted to grab my camera, but knew if i did, i could miss it. the thing i thought was the most odd was that even though they seemed to be moving very slowly and gracefully, they went from being quite large and hovering in a pattern two over another two, and as they drifted away, they seemed to become very small very quickly, though they didn't appear to be going fast at all. oddest thing i ever saw!\r\n\r\ni am uploading a rough sketch of what i saw. ","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":85627,"landingOccurred":false,"latitude":29.174058487462336,"location":null,"logNumber":"US-08032017-0025","longitude":-80.99098504199127,"occurred":1501796400000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1501800474000,"summary":"Several unexplained orbs flying in close proximity, one at a time, hovering and slowly flying north and vanishing","tags":["sound","ufo","lights","floating","disc"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501815345768,"urls":["http://www.mufoncms.com/files_jeud8334j/85627_submitter_file1__z1059.jpg"],"weather":null,"zipcode":"32119","daysBetweenOccurrenceAndSubmission":0,"locationName":"South Daytona, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3343"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Lancaster","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was working at the public pool. there was a pool party going on, but we were taking a break due to lightning. i was sitting on a bench, facing south, when i looked up from my phone to see an orb with pulsating red light flying away from me. it looked to be flying lower than airplanes tend to do, and as i watched, i saw it move suddenly to the west, without banking or turning. it didn't move terribly fast, but that turn struck me as very unusual. i watched it until i lost sight of it behind the trees, then i filmed it on my phone as it reappeared from behind the trees and flew towards the lightning. it eventually flew behind a building, and i lost sight of it. ","distance":"501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":85626,"landingOccurred":false,"latitude":39.73959147195895,"location":null,"logNumber":"US-08032017-0024","longitude":-82.5612138006004,"occurred":1501796760000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501799222000,"summary":"Red pulsating orb flying towards lightning","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501814146217,"urls":["http://www.mufoncms.com/files_jeud8334j/85626_submitter_file1__trim.A74CFCA7FF964AC4ACDB40055D69D186.MOV"],"weather":null,"zipcode":"43130","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lancaster, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3344"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Layton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It looked like a sphere i was at a military air show watching the thunder bird's and when they came together to go straight up and broke off is when i seen it just sitting there in the sky luke it was watching the air show and then i'm the following weeks i went back to work and i went for training on base they were showing a video of the air show they recorded the object and didn't even know it until i pointed it out. lol","distance":"Unknown","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Other","formattedAddress":null,"id":85625,"landingOccurred":false,"latitude":41.0657616,"location":null,"logNumber":"US-08032017-0023","longitude":-111.9634729,"occurred":1055376000000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501796985000,"summary":"Witnessed during utah, hill a.F.B air show","tags":["video"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1501811752445,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":11,"maxvisi":7,"meantempm":21,"meantempi":70,"meanvism":11,"meanvisi":7,"mintempm":15,"mintempi":59,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":11,"maxvisi":7,"meantempm":21,"meantempi":70,"meanvism":11,"meanvisi":7,"mintempm":15,"mintempi":59,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"84041","daysBetweenOccurrenceAndSubmission":5166,"locationName":"Layton, Utah","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3345"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Alvin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This report encompasses three separate orb sightings, all three of which were nothing short of profound and all three of which were witnessed by my brother and one of which also was witnessed by my then sister-in-law.  it would be difficult to say which of the three was the most profound, but if pressed to do so, i would say that the third encounter was the most profound because it was the longest in duration (perhaps 15 minutes); it was clearly a function and result of intelligence (followed aside our vehicle for several miles and coordinated with our turns and the like) and, because of subsequent time and memory loss.  some 38 years have gone by since the encounters (all three within 1 1/2 years at three different locations), of which i rarely speak for fear of ridicule.  at one point we turned right, but the object continued on its previous course and out of sight.  we then tuned left, then right and approached an elevated irrigation canal (rice canal) and when we reached the top of the canal and bridge, the object was stationary approximately 100 feet in front of us and perhaps 3-4 feet above the pavement.  it was clearly waiting.  i (none of us) have any memory of what transpired after we saw the object in front of and below us.  for whatever it is worth, i am not a nut.  i am an officer of a $160 million oil & gas manufacturing and service company; i earn between $500,000 and $900,000 per year; i manage a very successful business unit and i direct the efforts of a team of engineers and craftsmen representing multiple disciplines.  having said all that, i would very appreciate consultation with a professional in this field because, well, i need and want to talk to someone; it troubles me.  i also bore witness to an enormous triangular-shaped object (perhaps 500 feet in length from the front tip to its tail)having nine lights on its underbelly.  i would put the altitude at less than 3,000 feet, but it was night, so the altitude and size of the object would be difficult to swear to.  stranger than the size and shape was that it made no sound, yet was obviously under propulsion as it moved slowly overhead.  now, in addition to all this, i have one nagging memory of finding myself heavily sedated inside of a craft and being lowered from upper level through a hatch into a lower level.  the hatch is best described as being akin to a hinged bank vault door, although only four or so feet in diameter.  it is the structure and details of the hatch that i best recall, although while in transit and passing through the upper level, well, a cockpit.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":85624,"landingOccurred":false,"latitude":29.4297872,"location":null,"logNumber":"US-08032017-0022","longitude":-95.2382109,"occurred":300844800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501794067000,"summary":"Three separate sightings; one involved orb following at highway speed for several miles","tags":["sound","lights","disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501809052471,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":33,"maxtempi":91,"maxvism":24,"maxvisi":15,"meantempm":30,"meantempi":86,"meanvism":18,"meanvisi":11,"mintempm":27,"mintempi":80,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":33,"maxtempi":91,"maxvism":24,"maxvisi":15,"meantempm":30,"meantempi":86,"meanvism":18,"meanvisi":11,"mintempm":27,"mintempi":80,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"N/A","daysBetweenOccurrenceAndSubmission":13899,"locationName":"Alvin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3346"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"De Pere","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In de pere, wi, at the end of sept, 2015 about 8:30 pm. it was dark. i took my dog out for her potty. we were on the sidewalk going back to our driveway. there was suddenly a large orange oval shaped object over the tree next to driveway.It appeared lit from within, larger in front than in back, at least the part that i could see that was lit. it appeared to be smooth on the outside, no viable means of propulsion.It was about 1\\2 as high as a news or police helicopter would fly. it came towards us a short way and then stopped and hovered over the tree closest to our driveway. it had small orange lights in a v, underneath starting in front and spreading towards the back. i could see the shadowy form of the object above and behind the lights. i watched it for probably 1-2 minutes. it was totally silent. it was a clear night, no clouds, stars were out but no moon. no airplanes or helicopters and no cars came by when it was there. we live on a quiet street.Suddenly it was just gone. no light, no sound, just vanished. it was so close, i had no doubt that i was seeing a ufo. something i've never seen before. i was quite fascinated by it, not afraid. my dog and i just stood there watching it until it vanished. i felt calm and would have liked to watch it longer.\r\nwe just went inside and i thought about reporting it to authorities and then didn't, reluctant as they might not believe me. i did tell friends. ","distance":"101-500 Feet","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Path then hovering","formattedAddress":null,"id":85623,"landingOccurred":false,"latitude":44.428894533520356,"location":null,"logNumber":"US-08032017-0021","longitude":-88.01536944965898,"occurred":1443299400000,"potentialRelations":[],"rating":"Unrated","region":"Wisconsin","reportedWeather":null,"shape":"Egg","source":"MUFON","status":null,"submitted":1501793849000,"summary":"Object seen above trees next to sidewalk then vanished.","tags":["sound","ufo","lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501808752449,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":65,"meanvism":14,"meanvisi":8,"mintempm":12,"mintempi":54,"minvism":4,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":65,"meanvism":14,"meanvisi":8,"mintempm":12,"mintempi":54,"minvism":4,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"54115","daysBetweenOccurrenceAndSubmission":677,"locationName":"De Pere, Wisconsin","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3347"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Bristol","country":"GB","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was standing alone at the bottom of my garden, heard a throbbing hum and when i looked for the source, saw a doughnut shaped, dirty, yellow-brown cloud, that bubbled & spun (in the direction of something i now know as an accretion disc), above our neighbour's house. after watching it for, i suppose above a minute, it instantly vanished with a single, deep thump-sound. i've hardly ever mentioned it to anyone, except in recent years, maybe cos i've had no decent explanation. but i do now remember feeling quite impartial at the time. there was no one else with me to wonder at at it.","distance":"21-100 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":85622,"landingOccurred":false,"latitude":null,"location":null,"logNumber":"GB-08032017-0021","longitude":null,"occurred":492973200000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1501793586000,"summary":"Although transfixed, ive hardly felt compelled to much about it till now.","tags":["sound","disc"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":1501808452496,"urls":[],"weather":null,"zipcode":"bs13 oba","daysBetweenOccurrenceAndSubmission":11676,"locationName":"Bristol","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3348"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Donald","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at the end of my driveway looking for the cat to bring inside for the night. i almost always look at the stars when i am out at night and noticed one that was brighter & pulsing. at first i thought it was a plane but after just a few seconds i discarded that thought. i have no idea what it was but my best description would be a hovering sphere that tapered at the ends with 2 \"pulsing beams\" (i guess would be the best way to describe them) which were coming down & away at approx. a 45 degree angle...1 on either end of the main object. the beams went from not visible to fully extended in 3 separate, equal length, segmented pulses and then repeated. when the beams when fully extended they were about 1/2 again longer that the diameter of the main object. full cycle for the beams to extend was about 3-4 seconds.\r\nthey would do a varied amount of cycles and then quit only to start again after about 1 minute. \r\ni have done a lot of skydiving during the day & night, so i have been in and around a good deal of conventional & military aircraft and this was something i have never seen before. i observed it for about 10 minutes and took a photo and a couple videos on my phone. unfortunately, i had to use max zoom and between that & the hand movement at that setting it is pretty lousy video. after about 10-15 minutes i went in to wake up my wife to show her. i was gone about 5 minutes and when we came back out it was no longer visible.","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":85621,"landingOccurred":false,"latitude":45.21207319554561,"location":null,"logNumber":"US-08032017-0020","longitude":-122.83247971187805,"occurred":1501464600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501790404000,"summary":"Observed disk shaped sphere with dual pulsing beams ","tags":["photo","video","pulsing","disc","hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501805152547,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":34,"maxtempi":94,"maxvism":16,"maxvisi":10,"meantempm":24,"meantempi":76,"meanvism":16,"meanvisi":10,"mintempm":15,"mintempi":59,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":34,"maxtempi":94,"maxvism":16,"maxvisi":10,"meantempm":24,"meantempi":76,"meanvism":16,"meanvisi":10,"mintempm":15,"mintempi":59,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"97020","daysBetweenOccurrenceAndSubmission":3,"locationName":"Donald, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3349"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Glenburn","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"If you look in your files you will see that mufon reps actually came to my house in bloomington mn and took my statement...Hypnosis was offered but being in college at the time my free time was very limited....Over the years i have been called everything in the book...Liar...Drunk...Drug addict...Imaginary fool...Etc etc etc...I am retired now and more than willing to undergo hypnosis if that would help you folks out any...I know the people working on the flight line would have seen this ufo as it flew right over me out into the minot afb area and was highly visible by the naked eye...Feel free to contact me anytime....Regards...S","distance":"Unknown","duration":"02:00:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Straight-line path","formattedAddress":null,"id":85620,"landingOccurred":false,"latitude":48.5130744,"location":null,"logNumber":"US-08032017-0019","longitude":-101.2207138,"occurred":269136000000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1501789698000,"summary":"Mufon investigators came to my house at 9500 park avenue south...Bloomington mn 55423...It is on file with you","tags":["ufo","light","contact"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501804552497,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":32,"maxvisi":20,"meantempm":18,"meantempi":65,"meanvism":25,"meanvisi":16,"mintempm":9,"mintempi":48,"minvism":24,"minvisi":15,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":32,"maxvisi":20,"meantempm":18,"meantempi":65,"meanvism":25,"meanvisi":16,"mintempm":9,"mintempi":48,"minvism":24,"minvisi":15,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":14266,"locationName":"Glenburn, North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3350"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Vancouver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting in a grassy field starting at about midnight. i was watching my daughter's house because the night before they had a prowler enter the house. i was armed with a baseball bat and a hunting knife. i had a flashlight and a pair of 10 power binoculars. at right near 2 am two bright lights appeared from my left from a stand of fir trees. they were moving in a sawtooth manner and going rather slowly. the sawtooth movement was uneven. some moving up higher than other times. the two lights were not moving up and down together, but they stayed the same distance apart and at the same speed. i watched them with the binoculars until they went out of my sight behind another stand of tall fir trees. there was never any sound from them. they were totally silent if they were at the distance they appeared to me to be. about two minutes later two more lights, exactly like the first two suddenly appeared from behind those trees and the whole thing was repeated exactly like the first two lights. still no sound. i estimated their distance above ground as 5 or 6 hundred feet. their distance from me seemed to be about 7 or 8 hundred feet. the glasses i was watchung them with only made the lights brighter and larger. if there was a shape, it would probably be round because the light was round as just a light is. i am especially puzzled by the fact that the newspaper did not mention it at all. i don't see how i could have been the only witness to that strange event. the lights moved slowly enough that i could actually see their movement. they did not appear at the top or the bottom of their pattern as would the lights on a plane or helicopter that had two lights blinking on and off. do you understand what i am saying? i am a long time and well trained pilot, but there is nothing in my experience that could explain those flying objects and their strange movements. i only told my family about that experience because i didn't want to appear to be crazy. their speed in mph would be about 10 or 15 mph if they were at the distance and height that i estimated. i realize that judging light distance is extremely difficult if not impossible, so my estimate could be way off. but, that is what it seemed to be. the glasses helped me arrive at that estimate. had they been a long distance they wouldn't have become as large under the glasses as they appeared. under the glasses they doubled in size and brightness.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Other","formattedAddress":null,"id":85619,"landingOccurred":false,"latitude":45.64252658172738,"location":null,"logNumber":"US-08032017-0018","longitude":-122.66358064905242,"occurred":1467770400000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1501782250000,"summary":"Two bright lights, one a short ways behind the first. moving in a sawtooth fashion. not synchronized going slowly. followed seconds later by two more.","tags":["sound","lights","flash"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501797052486,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":56,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":56,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"98663","daysBetweenOccurrenceAndSubmission":393,"locationName":"Vancouver, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3351"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Mashhad","country":"Iran","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While was in a traffic jam in koohsangi street in mashhad, iran, i was looking at sky randomly and then i saw a shinny and bright object croosing a straight path in the sky with a very high speed, hieght certainly much less than an airplane's. the first thought was either an airplane or a shooting star. then i realized it was way faster than a normal plane and i didn't hear any sound referring a plane and it didn't have any tail to be a shooting star. when i mentioned to others, they said they didn't pay any attention to sky. \r\ni lost sight of it the moment its path passed behind a building, the same way i noticed it as it appeared.","distance":"Unknown","duration":"00:00:02","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":85618,"landingOccurred":false,"latitude":36.2649923,"location":null,"logNumber":"IR-08032017-0017","longitude":59.6232549,"occurred":1501796400000,"potentialRelations":[],"rating":"Unrated","region":"Razavi Khorasan Province","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1501775882000,"summary":"A bright and shinny object flying in a straight path, very high speed, height almost like an aiplane in destination city","tags":["sound"],"timeZone":"Asia/Tehran","timeZoneName":"Asia/Tehran","tweeted":1501790752554,"urls":[],"weather":{"history":null},"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mashhad, Razavi Khorasan Province","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3352"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chancy","country":"Switzerland","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"L'm very sorry because my english is very bad. l'm witness ufo triangular with great light white. date 1997 8 mars at 11 pm. my home geneve switzerland. another witness in uk looking the same triangular object.","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":85617,"landingOccurred":false,"latitude":46.150873629454836,"location":null,"logNumber":"CH-08032017-0016","longitude":5.963726495383368,"occurred":857779200000,"potentialRelations":[],"rating":"Unrated","region":"Genève","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1501774528000,"summary":"Triangular ufo with strong light white","tags":["ufo","light"],"timeZone":"Europe/Zurich","timeZoneName":"Europe/Zurich","tweeted":1501789252466,"urls":[],"weather":{"history":null},"zipcode":"1284","daysBetweenOccurrenceAndSubmission":7453,"locationName":"Chancy, Genève","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3353"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On saturday, 7/29/17 at 4:41am pst, as if out of nowhere i noticed a fiercely glowing object from my glass-walled home office windows. living on the 15th floor of a high-rise in downtown san diego affords my family spectacular city views and on an intermittently clear early morning like last saturday this object was unequivocally visible. heading outside onto our south-facing balcony, i was able to capture some remarkable pictures and video although i was only using my iphone 6 as i don’t own any proper photography equipment. \r\n\r\nof particular significance, i was able to simultaneously record both the object and a commercial airliner on its westbound arrival path into lindbergh field from 4:53am-4:59am pst. although the plane did not seem to respond to any advised deviation from air-traffic control during its normal course, it's runway approach was not very far to the south of the object and it eventually passed underneath the object's stationary elevation prior to landing. for any downtown san diego resident with regular visibility of arriving flights, it's nearly always customary to see multiple planes landing in staggered groups of two to three or more, yet after the initial red-eye arrival there were no subsequent incoming aircraft. \r\n\r\ni'd be eager to learn from faa records if any post-5:00 am pst arriving flights were diverted or delayed as a result of the object's presence considering the extremely high probability that the pilots viewed the object for many miles before and during their descent. prior to the object's astonishingly rapid ascent out of view, i took several 1-3 minute video clips and also a couple dozen pictures from 4:41am-5:31am pst that i’m confident are worthy of taking the time to view and scrutinize.\r\n\r\nas for the morning of 7/30/17, this is where i got much more than i bargained for. as a casual follower of dr. steven greer's contributions to the ufo community, i recall reading once how he used coherent thought to manifest the presence of eti's and so i half-jokingly decided i'd give it a shot the next morning, not thinking with any genuine expectation whatsoever that something would come of it. throughout the entire next evening while burning the midnight oil working on corporate contracts (yes, i'm a white collar stiff unfortunately), i attempted to allocate conscious thought towards that same object appearing in the same location at the same time. to my bewilderment at 4:18am pst on 7/30/17, i began witnessing another aerial object with identical characteristics in the same location.\r\n\r\nwhat occurred and i was able to document on 7/30/17 from 4:18am-5:27am pst has candidly made me quite uncomfortable ever since but i feel compelled to share it. as i was viewing and recording the object i began experiencing a heightened physiological response, but unique to me, it was coupled with a strong dulling of my motor skills. moving past my fear, i started to sense some kind of palpable connection with the object and reciprocal communication directly with it via mental energy and nonverbal messaging. on 7/30/17 at 5:14am pst after several minutes of singular focus on my request that the object \"show me something special\", the object tilted vertically and projected an unmistakable \"face\" encompassing its halo which, thankfully for my own sanity's sake, i was to photograph. the \"face\" appears to perhaps be wearing a crown with 4 or 5 points atop a very wide face with large, round cheeks, a broad nose, dark but non-threatening eyes and of all things, a broad slit-smile. as the sun began to rise over the east county foothills, the object remained highly visible in half-lit sky and i continued taking pictures for another 13 minutes before retiring to bed, still completely awestruck but very grateful i was able to document what i'd witnessed.\r\n","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"00:50:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":85616,"landingOccurred":false,"latitude":32.70788288855283,"location":null,"logNumber":"US-08032017-0015","longitude":-117.13133289662953,"occurred":1501303260000,"potentialRelations":[85592],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1501772557000,"summary":"Captured digital video of an aerial object appearing on consecutive mornings and took digital pictures of it projecting an unmistakable \"crowned face\" encompassing its halo. ","tags":["photo","video","landing","ufo","lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501787452647,"urls":["http://www.mufoncms.com/files_jeud8334j/85616_submitter_file1__72917at441amPSTFirstSighting.jpg","http://www.mufoncms.com/files_jeud8334j/85616_submitter_file2__72917at444amPSTFirstzoomedpicwithglowinghalo.jpg","http://www.mufoncms.com/files_jeud8334j/85616_submitter_file3__72917at445amPSTFirstunzoomedpicwhereringwithhollowcenterisvisible.JPG","http://www.mufoncms.com/files_jeud8334j/85616_submitter_file4__72917at509amPSTFirstzoomedpicwhereentityistiltedvertically.jpg","http://www.mufoncms.com/files_jeud8334j/85616_submitter_file5__73017at514amPSTFirstunzoomedpicoftheprojectedfacejustremarkable.JPG"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":16,"meanvisi":10,"mintempm":20,"mintempi":68,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":24,"maxtempi":76,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":16,"meanvisi":10,"mintempm":20,"mintempi":68,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"92101","daysBetweenOccurrenceAndSubmission":5,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3354"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Medford","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"(541) 778-8205  strange unknown vapor trail witnessed by many especially since i pointed it out to them ","distance":"101-500 Feet","duration":"00:15:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":85615,"landingOccurred":false,"latitude":42.33933418022307,"location":null,"logNumber":"US-08032017-0015","longitude":-122.84545456796192,"occurred":1463961600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1501762741000,"summary":"Strange unknown paper trail","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501777552509,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":22,"maxtempi":71,"maxvism":16,"maxvisi":10,"meantempm":14,"meantempi":58,"meanvism":16,"meanvisi":10,"mintempm":7,"mintempi":44,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":22,"maxtempi":71,"maxvism":16,"maxvisi":10,"meantempm":14,"meantempi":58,"meanvism":16,"meanvisi":10,"mintempm":7,"mintempi":44,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"97501","daysBetweenOccurrenceAndSubmission":437,"locationName":"Medford, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3355"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Medford","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" observed white or making very quick erratic 90° angle flight pattern changes ","distance":"101-500 Feet","duration":"00:00:04","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":85614,"landingOccurred":false,"latitude":42.3138954,"location":null,"logNumber":"US-08032017-0014","longitude":-122.8007589,"occurred":1473120000000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1501762055000,"summary":" observed object making strange flight pattern leaving a trail that regular flight could not do ","tags":["light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501776952622,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":64,"meanvism":16,"meanvisi":10,"mintempm":9,"mintempi":49,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":64,"meanvism":16,"meanvisi":10,"mintempm":9,"mintempi":49,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"97501","daysBetweenOccurrenceAndSubmission":331,"locationName":"Medford, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3356"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Glendale","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was going thru some video camera snap shots from surveillance camera and came across three rod shaped objects floating it was there then it was gone, bright white with arms or wings there is 3 so far i have 34,000 to go thru but all three have different number of arms and about the same length very clear pictures but nothing around for it to have been there.\r\nall 3 where on different dates and times ","distance":"N/A","duration":"00:00:03","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary","formattedAddress":null,"id":85613,"landingOccurred":false,"latitude":33.66281745453291,"location":null,"logNumber":"US-08032017-0013","longitude":-112.16222209810763,"occurred":1474774920000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1501760241000,"summary":"Was found on a snap shot taken by my security camera, at seperate occasions","tags":["video","floating"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1501775152567,"urls":["http://www.mufoncms.com/files_jeud8334j/85613_submitter_file1__Frame2.jpg","http://www.mufoncms.com/files_jeud8334j/85613_submitter_file2__Frame29.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":35,"maxtempi":95,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":16,"meanvisi":10,"mintempm":21,"mintempi":70,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":35,"maxtempi":95,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":16,"meanvisi":10,"mintempm":21,"mintempi":70,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"85308","daysBetweenOccurrenceAndSubmission":312,"locationName":"Glendale, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3357"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Mena","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"April 13, 2017 approx 10:30pm polk county ar, near hatfield. my eleven year old daughter and i, routinely star gaze together. we had not been outside more than 5 minutes when over us a \"star\" seemed to appear or move into view. i asked her if she noticed it there before, then it began to move. it did not twinkle. it did not make a sound.  no flash, no color. just very bright. the size and distance above us was impossible to speculate. larger and closer, & brighter than any other object  \r\nmy daughter said mom! video this! afraid to look away for fear i would miss something, i quickly turned on my phone's video recorder. the object paused for me! long enough to get it into view, then it began to move again.  we ran across the yard following it into  to the east, stopping at the garden, out from under tree cover in the clear. the object seemed to be moving away faster but was getting brighter, maybe larger. then with a blinding flash of light, it was gone. i heard a very faint noise, like a quiet thump. for a second i was blind, & disoriented. i couldn't hear my daughter. then i snapped out of it with my daughter saying \"mom! mom! where did it go? it just disappeared!\" we immediately tried to watch my video. but surprisingly, there wasn't a video. my phone was dark. not off, but like i hadn't been filming or using it at all. although it was extremely hot to the touch. i felt like the object was aware of us. i felt like it purposely paused long enough for us to keep up with it, & although i did not get a video, my daughter got a short one. this was a very positive event experienced between my daughter and a i. we've seen several strange lights and apparitions since. only when we are alone together, at the same location. her video was cut off with a flash of light, yet you can still her voice after the video goes white, it then cuts off by itself.","distance":"501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":85612,"landingOccurred":false,"latitude":34.500422246961875,"location":null,"logNumber":"US-08032017-0012","longitude":-94.34819341736826,"occurred":1492122600000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1501759720000,"summary":"4/13/17 south polk county, arkansas. star like object moved slowly into view over us. very bright, silent paused, began to move slowly building speed, disappeared with blinding flash","tags":["video","sound","lights","flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501774552620,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":10,"meanvisi":6,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":10,"meanvisi":6,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"71953","daysBetweenOccurrenceAndSubmission":111,"locationName":"Mena, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3358"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Mena","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"April 13, 2017 approx 10:30pm polk county ar, near hatfield. my eleven year old daughter and i, routinely star gaze together. we had not been outside more than 5 minutes when over us a \"star\" seemed to appear or move into view. i asked her if she noticed it there before, then it began to move. it did not twinkle. it did not make a sound.  no flash, no color. just very bright. the size and distance above us was impossible to speculate. larger and closer, & brighter than any other object  \r\nmy daughter said mom! video this! afraid to look away for fear i would miss something, i quickly turned on my phone's video recorder. the object paused for me! long enough to get it into view, then it began to move again.  we ran across the yard following it into  to the east, stopping at the garden, out from under tree cover in the clear. the object seemed to be moving away faster but was getting brighter, maybe larger. then with a blinding flash of light, it was gone. i heard a very faint noise, like a quiet thump. for a second i was blind, & disoriented. i couldn't hear my daughter. then i snapped out of it with my daughter saying \"mom! mom! where did it go? it just disappeared!\" we immediately tried to watch my video. but surprisingly, there wasn't a video. my phone was dark. not off, but like i hadn't been filming or using it at all. although it was extremely hot to the touch. i felt like the object was aware of us. i felt like it purposely paused long enough for us to keep up with it, & although i did not get a video, my daughter got a short one. this was a very positive event experienced between my daughter and a i. we've seen several strange lights and apparitions since. only when we are alone together, at the same location. her video was cut off with a flash of light, yet you can still her voice after the video goes white, it then cuts off by itself.","distance":"501 Feet - 1 Mile","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path","formattedAddress":null,"id":85611,"landingOccurred":false,"latitude":34.52165044321876,"location":null,"logNumber":"US-08032017-0011","longitude":-94.35986574664624,"occurred":1492122600000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Flash","source":"MUFON","status":null,"submitted":1501759025000,"summary":"4/13/17 south polk county, arkansas. star like object moved slowly into view over us. very bright, silent paused, began to move slowly building speed, disappeared with blinding flash","tags":["video","sound","lights","flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501773952577,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":10,"meanvisi":6,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":10,"meanvisi":6,"mintempm":13,"mintempi":55,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"71953","daysBetweenOccurrenceAndSubmission":111,"locationName":"Mena, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3359"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Kalispell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at a house on whitefish stage road in kalispell close to jagz restaurant, and i started watching the stars come ou on july 29th at 1:00 amt. i noticed some were kind of fluttering but not twinkling with light, i started to look around more and seeing that the stars all low to the horizon were like that and they had a reddish orange tint to them.  these were no stars, and i was so curious as to what they were, that i stayed up all night watching them hover around the area in sequential order. they seemed to surround themselves around one large bright \"star\". this happened till i fell asleep at 4 am. the whole week i've been watching them all night; seeing them get almost 35+ feet away from our house. some looked like drones with red white and blue lights, some looked like jets, and some looked like stars that formed into triangles,diamonds, and pairs. i only witnessed them at my house on garland other than the first siting by whitefish stage. they seem to be watching us, surrounding our neighborhood and getting uncomfortably close to my home and my friends who also saw them' homes. they are extremely loud and sound like a vacuum cleaner or jets; sometimes the lady bug fireworks that shoot into the sky. they glow orange when high up,blink  blue red and white in sequences, or hover low with just a bright light. one large light in particular stays hovering in the ne e all the way until complete daylight and it seems to have a powerful almost invisible light beam shining in slow 360 degree circles. not to mention, a few nights, we watched the smaller orbs form lines and surround the large bright light. the lights usually start to come from the east behind a hill or mountain and just disintegrate after crossing the complementary direction of the earth. i don't know what's going on with kalispell, but this is not normal at all. \r\n\r\npicture 1: hovering above kms, the bright light doesn't fade like stars -5:36 am 8/4/17 \r\nvideo 1: this was extremely close to our house by kms -3:06am 8/3/17 \r\nvideo 2: one of the hovering orbs that look stationary (building lights under it)  -8/1/17 4:37 am\r\nvideo 3: the first video i have of the objects on whitefish stage road -7/29/17 4:37 am\r\nnote: i had recordings with better quality with the ufo's even closer but my phone immediately died after the aircraft flew over us. my phone was at 62%, i was still at the same percentage when i turned it on, but the video was no where to be found, along with starred websites with what little info i could find online...There's something very suspicious about this. \r\n\r\n\r\n\r\n","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","duration":"05:00:00","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary,Hovering then path,Path with directional change","formattedAddress":null,"id":85610,"landingOccurred":false,"latitude":48.22270600000001,"location":null,"logNumber":"US-08032017-0010","longitude":-114.33590720000001,"occurred":1501545600000,"potentialRelations":[],"rating":"Unrated","region":"Montana","reportedWeather":null,"shape":"Square,  Rectangular","source":"MUFON","status":null,"submitted":1501758260000,"summary":"Orange moving/stationary orbs, red white and blue aircrafts, bright big light until sunrise","tags":["video","sound","triangle","ufo","lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1501773052486,"urls":["http://www.mufoncms.com/files_jeud8334j/85610_submitter_file1__IMG0505.JPG","http://www.mufoncms.com/files_jeud8334j/85610_submitter_file2__trim.B273B0A3066B4EA5A024939ECBFB72F5.MOV","http://www.mufoncms.com/files_jeud8334j/85610_submitter_file3__trim.C2C98AF755C14120A3AF656D25F4EDCD.MOV"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":15,"meanvisi":9,"mintempm":12,"mintempi":53,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":15,"meanvisi":9,"mintempm":12,"mintempi":53,"minvism":11,"minvisi":7,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"59901","daysBetweenOccurrenceAndSubmission":2,"locationName":"Kalispell, Montana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3360"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lockwood","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sitting on my back porch. just enjoying the nice evening. i happened to look up at the sky, as i often do. then some movement caught my eye. it seemed to be far off in the distance, so i just thought that it was an airplane or maybe a large helicopter. i noticed it's strange shape, like two diamonds connected together. i was hopping it would come closer so i could get a better look at it. unfortunately a moment latter it disappeared, like it was never there! it didn't change direction, it didn't descend, it was just gone! i couldn't believe my eyes it was the craziest thing i have ever seen. i hope i get to see it again, closer up. ","distance":"Over One Mile","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":85609,"landingOccurred":false,"latitude":42.0911853,"location":null,"logNumber":"US-08032017-0009","longitude":-76.5499445,"occurred":1501607040000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1501754124000,"summary":"It looked like two dimonds conected to each other.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":1501768852518,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":30,"maxtempi":86,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":8,"meanvisi":5,"mintempm":17,"mintempi":63,"minvism":0,"minvisi":0,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":30,"maxtempi":86,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":8,"meanvisi":5,"mintempm":17,"mintempi":63,"minvism":0,"minvisi":0,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Lockwood, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3361"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Kalispell","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I noticed a few twinkling stars in the sky about a week ago. i pointed them out to a friend and he mentioned how stars are not that low to the horizon. the longer we watched them, we noticed that they were blinking red and blue. we labeled it as a drone and the next day at the same time, we realized that these were everywhere. more than the day before and there was also one bright light hovering closer than the rest; it moved in a slow 360 degree circle and every time it turned our direction, it made our eyes sting with the brightness. we watched how the \"stars\" orange orbs surround it in different patterns and take off way up high or scatter around near the horizon line. they hovered high with a swaying motion. we watched them escalate in numbers and closeness surrounding our home and friends home. at least 3 of these objects have gotten about 30-60 feet close to us and they flash red, blue, and white in sequence. the bright, large aircraft is usually in the northeast and it stays bright until about 6:30 am; while the smaller less bright aircrafts go away as soon as the sun sets. some look like tiny jets, and others look like an unusual drone of some sort. in all, i've watched orange orbs, drone like objects, a large bright light, and one or two jet like objects every night for the past week. i need answers and i can't find websites with any explanation... the first picture is the bright big light, three of the videos are the flashing hover crafts, and the sunrise video is also the large star that stayed bright and in the sky until 6:20. they're really loud when they are close and the orange orbs sometimes travel across the sky quickly without leaving a trail and they disappear when they get close to the horizon line. ","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","duration":"05:00:00","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Hovering then path,Other","formattedAddress":null,"id":85608,"landingOccurred":false,"latitude":48.21510600000001,"location":null,"logNumber":"US-08032017-0008","longitude":-114.3370672,"occurred":1501286400000,"potentialRelations":[],"rating":"Unrated","region":"Montana","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1501752692000,"summary":"Continuous red and blue blinking aircrafts, every night for past week/ orange flickering orbs","tags":["video","flash","light","hovering"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":1501767652528,"urls":["http://www.mufoncms.com/files_jeud8334j/85608_submitter_file1__IMG0509.JPG","http://www.mufoncms.com/files_jeud8334j/85608_submitter_file2__trim.88BB7691213D4508AF7CFEFEA46876AD.MOV","http://www.mufoncms.com/files_jeud8334j/85608_submitter_file3__trim.A60AD156FB2741F08D69B2AFBF9D0CCC.MOV","http://www.mufoncms.com/files_jeud8334j/85608_submitter_file4__trim.29EDEA5914344AB5A961AFAE1D79BE2C.MOV","http://www.mufoncms.com/files_jeud8334j/85608_submitter_file5__trim.E87D8B17DF6842019513C02FC1EE4566.MOV"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":34,"maxtempi":94,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":73,"meanvism":16,"meanvisi":10,"mintempm":11,"mintempi":51,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":34,"maxtempi":94,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":73,"meanvism":16,"meanvisi":10,"mintempm":11,"mintempi":51,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"59901","daysBetweenOccurrenceAndSubmission":5,"locationName":"Kalispell, Montana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3362"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Creston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching hulu on the tv with my mom. my step dad cam inside from the porch and said \"honey come check out this crazy noise.\" to my mom. i stayed inside because i didn't think it would be anything important by the way my step dad reacted. then my mom burst in the door from the porch and said \"madeline come here as fast as you can.\" i go out side and there is this really loud deep humming sound. so loud it felt like maybe there were fine vibrations going through my body. looking back it sounded what i would imagine a three mile long wine glass to sound like if you used a giant wet finger to continuously rub the rim. when i step on the porch my eyes are instantly drawn to the long and very close string of white lights. my heard feels like it's sinking and i ask my mom to pray. there could have been one hundred lights that were pulsing or blinking in a sequence on this string that could have been a dish or ring but i could not see anything but the lights. i'm surprised the lights were so clear to see because it was so smokey out today. i am loosing my train of thought because this just happens tonight. i could never be more sure about anything that this is an unknown craft flying right over lake rosevelt , right past my moms house. i would be able to explain this better in person. ","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":85607,"landingOccurred":false,"latitude":47.7584877,"location":null,"logNumber":"US-08032017-0007","longitude":-118.519718,"occurred":1501804500000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1501734376000,"summary":"Huge craft right over our lake. loud hum vibrating ground like deep low wine glass vibration. maybe hundreds of blinking lights but obviously one craft. very low and close . i'm so scared. reported this as soon as possible","tags":["sound","lights","pulsing"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":1501749352543,"urls":["http://www.mufoncms.com/files_jeud8334j/85607_submitter_file1__trim.54150A58777440D2A185D52857899DC0.MOV"],"weather":{"history":{"dailySummary":[],"dailysummary":[]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Creston, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:3363"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Benton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was out walking my dog with my girlfriend when we noticed a hovering craft across the street in the open field.  we were casually strolling in our yard with our dog and the sky is pretty and clear. we realized that it was hovering and then it danced a little before shooting a white beam of light across the sky.  at first we thought maybe it was an airplane, but it didn't move whatsoever. it was triangular in shape, two surface  lights pulsated reddish orange and yellow, and they were definitely pulsing in a pattern or code. we then saw a light beam pass over our heads again. i was shocked at first and thought maybe i wasnt really seeing it,until my girlfriend spoke up and then we noticed a lot more of the ufos were surrounding us and communicating with each other. it was terrifying yet thrilling at the same time. after watching for fifteen minutes or so we decided t go inside. it's. an experience i will never forget, and i know my girlfriend wont eiher. ","distance":"21-100 Feet","duration":"00:15:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Path then hovering","formattedAddress":null,"id":85606,"landingOccurred":false,"latitude":36.8997389,"location":null,"logNumber":"US-08032017-0006","longitude":-88.3182834,"occurred":1501723800000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1501733867000,"summary":"Triangle shaped, hovering, no sound, pulsating lights, communicating with light beams, observing ","tags":["sound","triangle","ufo","lights","pulsing"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":1501748752459,"urls":[],"weather":null,"zipcode":"42025","daysBetweenOccurrenceAndSubmission":0,"locationName":"Benton, Kentucky","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:3364"}],"last":false,"totalElements":82749,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":175}
