{"content":[{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (under cloudcover)","city":"Twin Falls","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was upstairs in 2 story house on my computer.It was during lunch break of the elemen school down the street @12-1 pm.Suddenly the doors started rattling in their frames throughout the 2nd story and the upstairs swayed violently.I know earthquakes,was sure it was one, then huge thud, thought perhaps explosion or something ran into the house.Began shouting at those on 1st floor below and they shouting back at me.When i was able to go down the stairs (felt stunned & afraid to go down at first)they gave me a different scenario, not feeling the house sway or doors rattle, but heard huge sound like \"wowwwww wowwwww wowwww\" over and over,very deep and also stunning.Then heard the kids at the school start screaming,which they often do,but not the same as play,but like fear. before i made my way downstairs i went from window to window to look out to see if any vehicle had hit the house and saw about 5 large cloud-like discs, like pin-wheels standing on edge,separate, hanging in the sky over large elm trees down the block.It was a completely overcast day,except for this one open spot of blue sky filled with huge round pinwheel clouds.I thought them very odd, but was very rattled and was not thinking clearly and didn't think of my cellphone camera to take pictures and wish i had. nor did i think more about the pinwheels until the next day as i watched evening local news kmvt when they asked if anyone had any additional information regarding the cause of the unknown sound of a large explosion on the 13th, monday at noon.It wasn't until that moment that i realized what i had seen in the sky,puffy contrail of those whatever they are: drones,jets,ufos that create fluffy trails that expand in grids over everywhere today,first noticed by me in portland,or. i did call the station and advise of what i had seen, but after that time, didn't hear anything more about it.Strange thing, time seemed locked in place during this event and we all laughed (nervously) about \"the mother ship\" stealing time from us because we felt disoriented for quite a long time after.We have no idea what it was, military aircraft? ufo? drone? if anyone knows, they aren't talking.Am attaching sketch of disc clouds.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Unknown","formattedAddress":null,"id":27459,"landingOccurred":false,"latitude":42.5669168,"location":null,"logNumber":"US-01202011-0001","longitude":-114.4585111,"occurred":1292275200000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Circle,   Other","source":"MUFON","status":null,"submitted":1296288000000,"summary":"Sound vibrations so deep as to effect earthquake-like and stunned effect","tags":["sound"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27459_submitter_file1__mufonunkwn.bmp"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":46,"locationName":"Twin Falls, Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75808"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Everett","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I saw something in the night sky that moved very fast that would move faster in an air plane and no flashing lights. as i was heading to a gym i saw something in the sky no other color than white moving fast. when i first noticed it was very fast not as fast as a comet. first i thought is was an air plane but when i realized even though i am a huge fan of starwars the clonewars it was nothing i ever saw. the object was only white and a fast moving object. at the time i was a little scared but later i thought it was nothing to worry about. as i saw the object moving ans moving it sudenly went away. still a little creepy and i did not get any recording and or photo's because it was to small.  ","distance":"Unknown","duration":"00:05:16","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27458,"landingOccurred":false,"latitude":47.9847048,"location":null,"logNumber":"US-01192011-0008","longitude":-122.1962494,"occurred":1295489100000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1295510009000,"summary":"Very fast moving object with no flashing lights.","tags":["lights","photo"],"timeZone":"America/Vancouver","timeZoneName":"America/Vancouver","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Everett, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75809"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dunedin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was stopped at a stoplight and i looked up to see a glowing changing colored orb flying around and i decided to record it. i was shocked as to what i saw.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27457,"landingOccurred":false,"latitude":28.0237004,"location":null,"logNumber":"US-01192011-0007","longitude":-82.7633784,"occurred":1295404920000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1295501522000,"summary":"Multi-colored changing ufo changes direction in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27457_submitter_file1__CRAZYUFOSHIT.MOV"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Dunedin, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75810"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bradenton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in the house watching tv and my daughter just came home and was still outside when i heard her call for me to come out side and look at what she is looking at.  i went outside to see a very larges dark in color triangle with a very bright white light on each cornerand fast blinking white lights (they looked like a sparkler)oddly spaced between the bright white lights. it was about 1/4 mile away and about 400 ft up.  the triangle was at an odd angle with the top point at not at the very top and the blinking white lights were between the bright lights and blinking about once every 2 seconds and all not at the same time,  much faster than the lights i see flying to the sarasota airport.  the craft was about 400 ft up and traveling south toward  sarasota about 50 mph.    it headed south for 15 minutes.  i came in and heard my daughter calling me again and again i went out and found out it had changed direction and began heading northeast.  i followed it for another 15 minutes until i lost sight of it as it was too far away to see anymore.  it was still traveling at the same slow speed.  \r\n\r\nwhen i first saw it i thought it was a plane but as i looked at it better with the odd shape and slow speed i knew it could not be.  planes cannot fly that slow and helicopters make noise.  this thing did not.  then i realized it was a ufo.  even my wife (a skeptic) saw it and believes it was a ufo.\r\nof course at the time i could not find a camera until it was too far away to take","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":27456,"landingOccurred":false,"latitude":27.5021878,"location":null,"logNumber":"US-01192011-0006","longitude":-82.5732794,"occurred":1295493300000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1295495762000,"summary":"Large triangle  lights on each corner with fast flashing lights at different locations moving very slow 200 ft up  no noise","tags":["lights","triangle","ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Bradenton, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:75811"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Hamilton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"These images appeared on photos i was taking of the moon.  i was utilizing a canon rebel xti tripod mounted.  i spent about thirty minutes taking pictures.  the shutter speed was varied between 1/40\" and 25\".  i took about thirty pictures.  the variation in shutter speed was intended to assist in capturing the clouds and ring around the moon.\r\n\r\nthe tripod was set in three different positions during this entire shoot.  there were only two pictures that have a multi-color object.  i have assumed this might have been created by a reflection of light on the lens but there was no light other than the moon.  what i find interesting is the picture where the object is sphere shaped and stacked is how the clouds appear to be effected by the object.  it also appears there are shadows on the spheres.  these images are exactly as shot and have not been altered in any manner.\r\n\r\n1. in our driveway taking pictures of the moon.  i've done this many times before and never had these types of objects in my photos.\r\n\r\n2. i didn't really notice the object until i uploaded the pictures to the computer.  i would glance at each photo on the display screen before taking another to see if i was capturing the image in the manner i was seeking.  i saw the color which i thought was odd but was not able to really see anything by just looking at the moon.\r\n\r\n3.  i've had several people look at the photos that i took that night.  in some ways it seems like it's just a reflection of light on the lens; but it's not uniform in how it appears.  in the two photos it looks like something flying into the picture and then hovering over the moon.  in the hovering photo with the three spheres the clouds seem to be affected by the object.\r\n\r\n4. i did not see the object with my eyes.  i really wasn't paying attention to the moon; more like i was looking at the sky, the clouds, and the ring around the moon.\r\n\r\n5.  seeing the picture was very strange.  as i said, we've shared this with a few friends who have little to no explanation as to what might have caused this on in the picture or if it is some kind of object.\r\n\r\n6.  see above.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Unknown","formattedAddress":null,"id":27455,"landingOccurred":false,"latitude":32.7634806,"location":null,"logNumber":"US-01192011-0005","longitude":-84.8703211,"occurred":1295235000000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Oval,   Sphere,   Teardrop","source":"MUFON","status":null,"submitted":1295493734000,"summary":"See attached images","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27455_submitter_file1__16Jan11031.jpg","http://www.mufoncms.com/files_jeud8334j/27455_submitter_file2__16Jan11032.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Hamilton, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75812"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Boone","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Working on a site taking photos of landscape because of fall colors. did not see the object until afterwards when viewing photos. based on the series of photos, which were consecutively taken, the object appears in three frames. knowing how the photos were taken, it appears the object descended in the first frame and then assumed a horizontal flight pattern. time between photos was in a matter of 15 seconds. based on this time frame, the object would have to of been travelling much faster than conventional means, therefore would not be a plane or flying creature. photos have been mosaiced together; first is the descending object; the second is the object in horizontal flight. both photos are zoomed in. second photo frame of reference determines the object is approximately 1/2 to 1-mile from my vantage. it definitely assumes a classic saucer shape in second photo.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27454,"landingOccurred":false,"latitude":36.218845,"location":null,"logNumber":"US-01192011-0004","longitude":-81.6697217,"occurred":1129186800000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1295477220000,"summary":"Photos of ufo - did not witness","tags":["photo","saucer"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27454_submitter_file1__ufos.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1924,"locationName":"Boone, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75813"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Braggs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was looking out a east window at home last evening and saw a bright white light above the tree tops its position was around 4 oclock. this object did not belong there, at first i thought it was a plane but it did not move.  no stars in sky that i saw at that time.  between 9pm to 9:45pm this light was stationary and did not move, i checked out the window every 10 minutes to see if it was still there and at 9:45 it had disappeared.  no video or picture taken.  who knows what it was.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":27453,"landingOccurred":false,"latitude":35.6634306,"location":null,"logNumber":"US-01192011-0002","longitude":-95.1980169,"occurred":1295337600000,"potentialRelations":[],"rating":"Unrated","region":"Oklahoma","reportedWeather":null,"shape":"Circle,   Star-like","source":"MUFON","status":null,"submitted":1295462371000,"summary":"Bright  white stationary light present around 45 minutes  then it disappeared. ","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"Braggs, Oklahoma","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75814"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" january 16 2011: part 1 of 2:  (i am uploading one of the video segments later on today.  my story?  ok. i woke up early as usual and checked the sky for venus and the \"death star ufo\" that has been reported here in chicago...Spotted in the southeast by multiple witnesses on december 15th, 2010...Early in the morning. so...I always just take a look to start my day...Usually lately...It is cloudy and you cannot see the stars or anything as storm systems have been hanging around this area for a while. (like everywhere else in the united states...This has been a rough winter world wide so far.)\r\n\r\ni immediately noticed something irregular up there.  i saw this unusual flashing, sparkling and pulsating light.  it is important to note...This thing was not in the spot that venus usually aligns in the morning.  this thing was lower than venus normally is and it was drifting back and forth.  i grabbed my camcorder and filmed it with a mini tripod to keep it steady.  i did the best i could for just waking up.  sure you can say it is venus...Until i zoom in.  i tried to zoom in and out to give the object some background and some points of reference as the sun was just starting to come up.  i tried to keep quiet too, but lost it a few times, so i am sorry for the language.  (disclaimer for the youngsters)\r\n\r\nright click and select \"open with\" and select \"windows images and fax viewer\" then zoom in...Use the little zoom icon to zoom in...And point it to the right of the white object you will then see 2 objects.  i saw only 2...The white one (the disk) and red one (mars maybe?) (i say that later on in the footage you will get later), but then there is also a blue object below it. you can see the white object is leaning downward is is clearly a disk shaped object.  you can also see the rotation and motion in the footage and the photo.  at some points in the video you can clearly see it is a silver disk with an electromagnetic glow around it.  the red object could be mars, but i swear...As i was filming...I did see the red object moving too. video footage to come later.\r\n\r\nwhen i upload my camera footage...There are few doubts left over after you watch the whole thing, but i took 2 photos and this is one of them.\r\n\r\nplus...When i zoom in and it goes nuts...There is without a doubt some type of rotation.  the object made absolutely no noise and it is camouflaged as a star. that has been my theory and they are always up there...At night and it is top secret because there is nothing we can do about it. if that is not a security threat, then what is?\r\n\r\nto the avid sky watcher...Dig in...Take your camera and zoom in on any large shining object and eventually we will all expose them by simply zooming in our cameras...And you will see for yourself that my camouflage theory has always been correct. uncover the truth...They are up there for you to see if you make the effort. \r\n\r\ni have seen one seriously close...You will not be able to see the details on the craft until it comes close, but then you will run and no freaking way you will worry about proving it was real and you will not be interested in filming it.  trust me on this...Your curiosity will be satisfied and you will know within one second that is not from earth.\r\n\r\nyou will know what it is and you will run.\r\n\r\nmost people are not even close to being ready to film and hoaxes ruin all credibility for the real sightings and that is a damn shame.\r\n\r\nwas i filming different stages of an abduction?  were they observing or exploring?  why did this thing show up near chicago 2 times in a one month period?  who knows?  anyway...I filmed from a 2nd floor (open) window, then i moved outside to get another angle in the 15 degree weather here in park ridge, il.  you can see the object move slowly.\r\n\r\ni totally admit i am an insignificant person. i am not a doctor, scientist, or anyone even remotely important...I am a complete and total nobody, so for what it is worth...Here is my opinion...And advice...(which i know it is not worth much of anything..And you are reading this saying who the hell is this clown and who the hell cares about his opinion?)\r\n\r\ni am here to tell you...You see something...Zoom in on it...Not all stars are stars...But i advise you...Do not get close...If it comes near you...Get the hell away from it.  \r\n\r\nthey know full well venus sits in the southeast sky in chicago right now...And most people will explain it away.  yes...It is in the southeast, but not where venus usually is.  it was much lower and it was moving and changing shape...And something was coming off the object several times.  the video...You can see what i mean, but here is one of the 2 photos i took.\r\n\r\ni have nothing to prove.  i already know aliens are real and i just have this feeling that many of you out there will have your own experience and i have no doubt what i have seen up close before this event...Was extraterrestrial and not of this earth.  within one second...All my questions were answered.\r\n\r\nno one has to tell me. if the cia were to tell me they are not for real and scientists or skeptics that are smarter than i am...Their opinions would only matter to me if they saw the object up close too.\r\n\r\notherwise...They are wasting their breath and time.\r\n\r\ncome talk to me when you have been close...And a beam comes down at you. once you can explain that away...After experiencing that...You can have your own opinion, but you will never be able to change my opinion.\r\n\r\nyou want to see a ufo?\r\n\r\nyou have to be active about it and put some effort into seeing one.  in nice weather...Take a glance up in the sky at night.  summer time...Take an hour per night and watch...I bet you will eventually see it.  \r\n\r\nsearch youtube for: \"ufo in hd\" there are multiple videos uploading now.\r\n \r\nkeywords or tags:\r\nufo ufos orb orbs alien aliens extraterrestrial experimental aircraft mufon real close details disk unidentified flying object unexplained lights chicago il illinois sighting sightings spotted spots footage ","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"01:34:00","entityEncountered":false,"favorited":0,"features":"Dome,  Patterned Surface","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":27452,"landingOccurred":false,"latitude":41.8867536,"location":null,"logNumber":"US-01192011-0002","longitude":-87.6226882,"occurred":1295183460000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Diamond,   Disc,   Star-like","source":"MUFON","status":null,"submitted":1295453529000,"summary":"Electromagnetic camouflage over silver disk","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27452_submitter_file1__DrakeDietrickStudio016.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75815"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"St George","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was traveling alone on i-15 from los angeles on my way to davenport, ia during september 1978.  (at that time in my life i did not drink nor take drugs or medication of any type.) i spent the evening outside las vegas at a rest stop, then left las vegas at about sun up and traveled straight through nw arizona into utah.  it was a clear day, no clouds, no rain, no fog, sun was bright and the skies were clear.  entering utah, near st. george, at approximately 8 a.M., i noticed on my left a shimmering orb floating without moving, just sort of hanging in midair about 30-50 feet above the ground.  the road wound so i lost track of it occasionally, and there were cars ahead and behind me who also saw the object as i could see them pointing to it.  finally, we, myself and the other cars, came to a stopping point.  i got out of the car, as did the others, and looked at the object as it was about 300 or 400 feet away from where we had parked. there was almost a translucency about it, kind of silvery-grey. i saw no lights, or portals, windows, or markings of any kind on it.  it made absolutely no sound.  i saw no source of how the orb was powered.  if it weren't so huge, it seemed to be approximately 100-200 feet in diameter, i would have thought it a hologram.  it was translucent not transparent so i could not see through it.  after watching it just hang there for about a minute it blinked out.  if i had turned my head i would have missed it.  i scanned the skies but saw no trace of it.  strange, the others standing there all had the same response i did, we looked at each other and some of us just shrugged then we got into our cars and left.  i have wondered all these years why we didn't talk to one another, exchange numbers, names, something.  ","distance":"Unknown","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"","formattedAddress":null,"id":27451,"landingOccurred":false,"latitude":37.0975178,"location":null,"logNumber":"US-01192011-0001","longitude":-113.5732856,"occurred":274374600000,"potentialRelations":[],"rating":"Unrated","region":"Utah","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1295437163000,"summary":"Perfectly spherical, approx. 100-200 ft. diameter, 30-50 ft. above ground, floating still","tags":["floating"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":11817,"locationName":"St George, Utah","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75816"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Aurora","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The event took place in the eastern suburbs of denver, colorado. it was a perfectly clear fall night, no moon, no clouds. i was admiring the beautiful sky, looking straight up. down from very far away, came three disks in formation - one in front, two behind forming a triangle. they were green in color, semi-transparent and seemed to glow somewhat. they went from being the size of stars to the size of a quarter, held at arm's length, in about one second. i could see them arc into level flight as they slowed down. they slowly flew across the sky for about two or three seconds, then took off in level flight at about the same speed they came down, disappering over the mountains to the west in about one second. the speed they were travling was incredible. i could see the whole event in perfect perspective. the disks were flat descending and turned on edge when they flew away. the disks were quite clear and in focus. i've never talked to another person that has seen anything quite like this, and since then, i've watched many tv shows about ufo's hoping to see  somthing similar reported, but never have. even though it was a long time ago, i thought you folks might want to hear about it.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":27450,"landingOccurred":false,"latitude":39.7334519,"location":null,"logNumber":"US-01182011-0007","longitude":-104.8271695,"occurred":-8010000000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1295422148000,"summary":"Three disks descending from above","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":15086,"locationName":"Aurora, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75817"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Atchison","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was home for winter break during my freshman year of college, so this happened in very late december 1991 or early january 1992.  i was in my bedroom with the lights off listening to a casette tape and looking out the window to the north.  there was a very bright star that held my attention as i sang along to sanitarium by metallica.  suddenly the light changed and the star began moving to the west.  as it did so, another \"star\" came from the east to replace the star in the north.  once it got to the relative location of the first craft it stopped moving and just hovered there, looking like a very bright star.  i was astounded and kept watching.\r\n\r\nafter approximately 15 minutes, the craft in the north moved off to the location in the west, another craft from the east took its location in the north.  at this point i donned a coat and went outside to get a view of the entire sky.  sure enough, the original craft was now in the south hovering with one in the west, one in the north, and another in the east.\r\n\r\nwhen they changed positions again, the craft in the south continued on to the east over the missouri bluffs, leaving 3: north, west, south.  there they hovered.  after another 15 minutes or so, they changed positions again with the southern craft continuing on toward the east.  \r\n\r\nthis time i saw the lights on the underside of the craft and could make out a silhouette against the moon.  the lights on the underside formed a chevron (as opposed to a full triangle).  i can't remember how many lights there were but i've drawn an approximation on the attached image. i remember no sound.  against the moon, it appeared the craft had wings like a standard military jet except the wings angled up from the body of the craft.  i'm pretty sure there was a stabilizer, too.  \r\n\r\none by one, the objects would hover silently like stars for a period of time then switch positions with the southern object flying over the eastern horizon.  based on the silhouetted view of the craft i've always believed they were military.  indeed, there's an afb in the st. joseph, mo area.  i acknowledge other possibilities, though, such as holographs.  how a winged aircraft hovers silently and completely still is a mystery to me!\r\n\r\ni check mufon's ufo stalker almost every day and am always irritated by \"new\" sightings reports from years ago - it honestly never occurred to me until recently to add my own.  i've never heard another story like this but would love to know if anyone else has ever seen something like it.\r\n\r\nkeep up the good work, mufon!  and please keep an eye on the sky, america.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary,Hovering then path,Path then hovering","formattedAddress":null,"id":27449,"landingOccurred":false,"latitude":39.5630521,"location":null,"logNumber":"US-01182011-0006","longitude":-95.1216356,"occurred":694166400000,"potentialRelations":[],"rating":"Unrated","region":"Kansas","reportedWeather":null,"shape":"Chevron,   Star-like,   Other","source":"MUFON","status":null,"submitted":1295387551000,"summary":"\"stars\" traded positions then flew off the the east one by one","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27449_submitter_file1__Sighting.jpg"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":6958,"locationName":"Atchison, Kansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75818"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Davis City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I got the idea from the guy in washington state. he would shine a bright light and most often get a flash back or one that would grow and grow then return to normal.It truly does work.But not airplanes who have the red blinkind underneath. that`s a no no. try it with an led that has a tight beam so as to see where your aiming.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":27448,"landingOccurred":false,"latitude":40.6448684,"location":null,"logNumber":"US-01182011-0005","longitude":-93.8075831,"occurred":1279782000000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1295385179000,"summary":"To possibly see ufo`s,  at night shine an led at stars walking to next  twice now it worked.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":180,"locationName":"Davis City, Iowa","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75819"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Newtown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Exiting from i-84 at exit 11 in newtown, i observed 5 very bright lights in the shape of an arc at approximately 3000-5000 ft. east of our car (seemingly near the oxford airport). we knew immediately that it wasn't something normal and opened the car window but heard no sound whatsoever. my 40 year old son was driving the car and opened his window to watch and listen. i was in the front passenger seat, my wife in the back.  they slowly drifted toward the east but the configuration of the lights was unchanging.  again, the lights were not blinking as you would expect on an aircraft.  the arc was tilted approximately 30 degrees towards us.  the lights disappeared one by one but we couldn't determine if it was behind wisps of clouds or not.  the moon was out (a little larger than half) and there didn't appear to be any significant cloud cover. unfortunately, we were too stunned to take out a camera.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":27447,"landingOccurred":false,"latitude":41.4169018,"location":null,"logNumber":"US-01182011-0004","longitude":-73.2945822,"occurred":1295152200000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Circle,   Other","source":"MUFON","status":null,"submitted":1295382229000,"summary":"5 very bright stationary lights in an arc shape.","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2,"locationName":"Newtown, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75820"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Holden","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At around 2am my dog needed to go out.  i went out to the fenced off back yard and was admiring the beautiful orange red \"full moon\" in back of my house i saw through the trees.  i realized at this time the moon should be over my house.  when i turned around there was the moon and when i turned back the orange/red \"full moon\" was gone. i noticed three head lights below tree top level coming through the woods at me about 200? feet away.  the vehicle looked the size of a vw bug but was black and rectangular about four feet high? and 10 feet long?  i was scared and ran inside to wake my then husband.  he would not wake up.  i looked outside standing on our deck but saw nothing.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":27446,"landingOccurred":false,"latitude":42.3517585,"location":null,"logNumber":"US-01182011-0003","longitude":-71.8634062,"occurred":1049184000000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Square,   Rectagular","source":"MUFON","status":null,"submitted":1295371872000,"summary":"Black rectangular vehicle with three headlights","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":2849,"locationName":"Holden, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75821"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Calexico","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"These events i will never forget as long as i live.Back in july 20th 1969 we were summer vacationing in the border town city of mexicali baja california mex.I was almost 7 years of age back then.Earlier that day my family and i ,like most of the world were watching the lunar landing event on the tv.Later that day all of us kids went to play outside on that warm evening.While we were running and jumping one of the neighborhood kids stopped and pointed to the clear dark sky and yelled for all of us to look.I looked up to where he was pointing at and i could see 7 or 8 low flying yellow-orange lights, flying at a great speed and out of formation but near to one another and absolutely no sound of engine or any noise of anykind from them. now as an adult i calculate their speed at around 600 mph flying  low from north to south.About 20 miles nw of mexicali thers is the u.S.Naval air base station near el centro ca.As years have gone by i often remember that event but have not looked further in to it, untill now.Do you have any records of this event?There had to be thousands of witnesses.What all of us kids did after looking at these lights flyby was that we ran inside to tell the adults but by the time they came out to see, the lights were long gone.I would really appreciate anybody e mailing  me with any info to *(email address removed -- cms/sg).","distance":"Unknown","duration":"00:00:20","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27445,"landingOccurred":false,"latitude":32.6789476,"location":null,"logNumber":"US-01182011-0002","longitude":-115.4988834,"occurred":-14230800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle,   Sphere","source":"MUFON","status":null,"submitted":1295351724000,"summary":"1969 lunar landing day ufo's sighting.","tags":["landing","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27445_submitter_file1__UFOsflightcourse.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":15157,"locationName":"Calexico, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75822"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":null,"country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Only took this picture because i take pictures of birds when ever i see them.Also my conure really seemed intrested in the area when i saw her looking in the tree's derection,she was making a low purr sound(sounds like a purr)\r\n\r\nwhich means she intrested in somthing,and was very still.When i looked and saw the black birds she was intrested in i got my camera and took these shots,while secound snap she got scared and flew of to the other side of the room.\r\n\r\ni still continued to take the pictures of the birds.\r\n\r\ni did not notice anything untill i looked at what i got on camera.Here are the pictures.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27444,"landingOccurred":false,"latitude":51.256025,"location":null,"logNumber":"CA-01182011-0001","longitude":-85.3200239,"occurred":1295045340000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1295348683000,"summary":"Black vortex? ufo","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27444_submitter_file1__ufo.rar"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3,"locationName":"Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75823"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Sarasota","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" at 6:50 pm i saw a slow moving triangler shaped object with a red light at each point moving south in the sky. it was big ,twice the size of a jet liner. i know what i saw it freaked me out a little, it looked just like the descriptions of other red triangle's. also there was no sound, none at all. i am greatful, this is my second sighting within a month.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":27443,"landingOccurred":false,"latitude":27.3454447,"location":null,"logNumber":"US-01172011-0017","longitude":-82.5248827,"occurred":1295319000000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1295323686000,"summary":"Three red lights in triangler form","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Sarasota, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:75824"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Saskatoon","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This account was relayed to me by my father. please let me make it clear that my father was not a story teller, very seldom did he talk about his life unless asked. he called me one day in the early 90's, him calling me was odd in and of it's self, as i was the one that called him usually. his voice seemed different, tense, then out of the blue he said he had some thing to tell me, i got rather conserned as there was an urgency in his voice that i had \" never \" heard before. he proceeded to tell me about an event that took place near pike lake sask. can. at my grandparents place. he and his brother paul were sitting around the kitchen table just talking passing time, killing the after noon together when they desided they would head outside and putts around in the yard, as they headed out the back door my uncle paul in the lead and my father close behind, paul stepped into a \"bright \" light that was coming from above and my father was frozen in the door way, literaly. he said he tried to move but was unable to, he stood there and watched as his brother carried on a conversation with what ever was up there as his gaze was fixed up at the source of the light. dad said he was not speaking in any language that he could recognize. he (dad) had no idea how long they were there for. when the light left he fell forward through the doorway, and asked his brother \"what the hell just happened, and who the hell were you talking too\"? his brother just turned around looking at him like 'he' was crazy as he didn't know what he was talking about. his brother had no memory of what had just happened, and left my father with the heavy burden of keeping the secret because who would beleive him. he followed that up with another event that took place on that same property but to my grandfather some years before that. after he was done i could hear the relief in his voice, and we never talked about it again. i myself am sure i saw what i would call ufo's back in the 70's, so i didn't write my dad off as a nut. i have great respect for my father, and only known him to be a man of his word. i happen to be channel serfing and caught an episode of mufon on the id channel, and something triggered the memory and i thought i would share it. if you are intrested i can relay the rest pertaining to my grandfather. i am not much of a typer, and would prefer an actual conversation.  thank you for your time, regards *(wit's name deleted--cms/sg).","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":27442,"landingOccurred":false,"latitude":52.13573,"location":null,"logNumber":"CA-01172011-0016","longitude":-106.641346,"occurred":488185200000,"potentialRelations":[],"rating":"Unrated","region":"Saskatchewan","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1295321908000,"summary":"This is an encounter as relayed to me by my father","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":9341,"locationName":"Saskatoon, Saskatchewan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75825"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving south on 2nd avenue in manhattan from 128th street, when a strange pulsating orange light appeared in the southern sky, heading eastbound.  pulsating like the flame of a candle or a star, not like a plane's lights.  my only guess at the time would have been a blimp, but a blimp unlike any i've ever seen.  also, it was more spherical than blimp-like.  soon other identical lights came into view, passing from behind tall buildings on the west side of 2nd avenue.  i pulled onto the next street i could, 119th street, and immediately hopped out and started filming on my cell phone.  total i would say there were 7 lights that were in the sky, but i was only able to capture 4 on my phone.  three seemed to fly together in a pyramid formation before the 4th came flying into view.  they didn't fly in consistent patterns either, sometimes changing directions distinctly.  at the end of this experience, which lasted about 4 or 5 minutes, each light seemed to climb higher into the clouds until they were no longer visible.  if they were balloons, they were definitely producing light and massive in size.  i didn't see any smoke trails or quick, random movements to make me think they were flairs.  the flight patterns, while they did change directions, didn't alter in velocity, from my point of view.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":27440,"landingOccurred":false,"latitude":40.7212128,"location":null,"logNumber":"US-01172011-0014","longitude":-74.0002731,"occurred":1295244720000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Circle,   Fireball,   Sphere","source":"MUFON","status":null,"submitted":1295306233000,"summary":"Orange pulsating lights, flying in random patterns, over nyc","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27440_submitter_file1__2011-01-16_22-12-07_828.3gp"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75826"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Cottage Grove","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":" probably should've reported this a long time ago, but it never occurred to\r\nme to do so. better late than never (i hope).\r\n\r\ntime: it was around 1989-1990, so i was about 13 or 14. it was around 4:30\r\nor 5:00 am.\r\n\r\nplace: just outside of cottage grove, oregon (right next door to the delight\r\nvalley elementary school). \r\n\r\nbasic background info: mom was a single parent, & to make ends meet she had\r\na rural paper route. i was \"lucky\" enough to get to help before school.\r\nshe'd drive, pull up to the boxes, & i'd stuff the papers in the boxes. so\r\nthat's why we were both out there so early in the morning. \r\n\r\nwe had stopped to get some more paper-bundles from the back of the truck. in\r\nfront of us, against the night sky we saw 3 lights in an\r\nequilateral-triangular pattern. the thing just hovered in the sky. there was\r\nno sound. after a few moments (a minute, perhaps) it went from \"not moving\"\r\nto \"moving blindingly fast\" and zig-zagging in an apparently random\r\npattern....Then it would stop, & stop instantly. \r\n\r\nafter the \"zig-zagging\", it zoomed away. at the instant it disappeared, i\r\nsaw a bright flash that filled up the entire sky for a fraction of a second.\r\nthis next part is very difficult to describe, but i'll try my best....\r\n\r\nat the instant it disappeared, during the moment it flashed, the flash was\r\naccompanied by something i can only describe the following way:\r\n\r\ny'know how in the opening credits of star trek: the next generation, the\r\nenterprise zips into \"warp drive\", & at the instant it does there's that\r\ndiamond-shaped flash? it was kind of like that, except the flash wasn't\r\ndiamond-shaped. it was sort of like a tangled-web of lightning-bolts (the apparent size of my hand at arms-length), but only visible for the tiniest fraction of a second. i'm not sure if this was\r\na real effect of the object, or if it was some kind of effect the flash had on my eyes, like when someone turns on a light when you're not ready for it, & you have that afterimage in your vision for a moment...I only saw the \"lightning effect\" for the briefest of moments, & there was no afterimage so it was probably real, but i'm not sure. my mother didn't notice the \"lightning effect\", or if she did, she doesn't remember. \r\n\r\nafter the \"big flash\" it was gone....For a minute or two. then we saw it (or\r\nwas it another, separate object of the same kind?) drift over the hills to\r\nour left. then it drifted back over the hills & was gone.  \r\n\r\nhere's where the plot thickens:\r\n\r\nmom & i have talked about this many times & she would occasionally reference\r\nthe metallic appearance of the thing. i never understood how she could\r\ndiscern the appearance of the surface because even though it was close, it\r\nwas still far enough away that all i could see was 3 lights in a triangle\r\npattern. i would tell her this. she would always respond with, \"but it was\r\nright over us!\". i would think, \"ummm.....Nooo....It was off in the distance\r\nin front of us just above the hills\". it turns out that, at some point mom\r\nlooked out of her window & looked up...And it was directly over the truck.\r\nshe said it was \"maybe 2 or 3 tree-lengths\" above us, & so big she couldn't\r\nsee the sky. that's when she started the truck & drove off (fast!). i don't\r\nremember this happening...Probably because this thing could travel huge\r\ndistances virtually instantaneously without making any noise, so perhaps it\r\nwas only above us for a second or two, & i just didn't notice.  \r\n\r\nyears later, i found out that others have seen similar triangular objects\r\n(like the one sighted over belgium) \r\n\r\nsome other points (i'm sure you've heard this stuff before...I certainly\r\nhave, but regardless here it is)\r\n\r\n-it could go from \"not moving\" to \"moving blindingly fast\" instantly\r\n\r\n-it could turn on sharp angles without slowing down\r\n\r\n-it could stop without decelerating\r\n\r\n-it could go in any direction at any time without changing its orientation\r\nrelative to its direction (ie, it didn't have to \"face\" the direction it was\r\ntraveling)\r\n\r\n-it didn't make any noise\r\n\r\n-it didn't have any apparent exhaust or contrail\r\n\r\n-it was obviously a piece of manufactured hardware, & not an amorphous blob\r\nof light or comet or meteor or any sort of natural meteorological\r\nphenomenon. \r\n\r\n\r\nso there you have it. i'm sure you've all heard this stuff before, but now\r\nyou've got one more account.","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":27439,"landingOccurred":false,"latitude":43.797623,"location":null,"logNumber":"US-01172011-0013","longitude":-123.0595246,"occurred":628432200000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1295306303000,"summary":"Triangular ufo","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":7718,"locationName":"Cottage Grove, Oregon","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:75827"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"South San Francisco","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I live in the outer richmond district in san francisco (8 blocks from ocean beach) where i have a vantage point overlooking south san francisco.  i was standing on my apartment building roof smoking at night when i spotted a bright blue light moving erratically in the sky above the south san francisco area (i think).  it was hard to pinpoint its exact location as the fog was steadily increasing and gradually obstructing my view, but it was located not too far from the coast.  if i had to guess, id say it was flying/hovering about 200-400 feet from the ground.  since it was hard to tell where the light/orb was coming from, it was hard to judge its speed as it moved from side to side and up and down in a somewhat erratic fashion.  it didnt seem to be moving at a tremendous speed, but if it was indeed above south san francisco, id guess it was moving at varied speeds, crossing a mile or two in about 5-10 seconds (again, very difficult to judge).   it would move one direction, slow down, and move the other direction in no apparent pattern, sometimes gaining some altitude, sometimes descending.  there was never a sudden jolt in speed.  there didnt seem to be any other lights and i didnt notice a spotlight coming from it.  im not aviation expert, but it didnt seem to behave like a helicopter.  i watched it for about 5 minutes then it seemed to descend and disappear.  i went back inside and looked out my window with the same viewpoint and about 10 minutes later saw it emerge again.  i then went back out on my roof and watched it for another 5 minutes until the fog became heavy enough to completely block my view of it.  i dont believe it was blinking, but its luminosity seemed to vary - but i attributed this to the fog.  very weird.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":27438,"landingOccurred":false,"latitude":37.654656,"location":null,"logNumber":"US-01172011-0012","longitude":-122.4077498,"occurred":1295164800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like,   Unknown","source":"MUFON","status":null,"submitted":1295305120000,"summary":"Blue orb moving erratically above south san francisco","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":1,"locationName":"South San Francisco, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75828"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Orange","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Monday morning outside working in the yard with my 7yr old son.Looked up when jet flys over toward john wayne.See stationary object much higher than plane.Grab my 10by70 binos & see craft moving around.I thought maybe ballons but too high.Another craft shows up and remains stationary.The boomerang starts to move behind the trees.I take a few pictures with my old pentax and zoom lens.I was pretty exited and my son obseved them too.I have also seen ufos at lake mead and thru my dobsonian but never reported them.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":27437,"landingOccurred":false,"latitude":33.7957644,"location":null,"logNumber":"US-01172011-0011","longitude":-117.8448219,"occurred":1295288400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Boomerang,   Sphere","source":"MUFON","status":null,"submitted":1295301034000,"summary":"Silver boomerang or arrow shape,second one was a silver shere","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Orange, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75829"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Davis","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving along covell blvd west bound about 1.5miles east of wildhorse golf course.  there's a large open field we were driving by and i saw white lights in a triangular formation outlining what appeared to be a dark triangular object.  i don't remember exactly how many lights, but i want to say 4 lights per side, including the corners - all white.  one light was blinking about once per second - i think recall the one blinking light to be the \"leading\" light.  it appeared to be 15-20 yards wide and was about 150' to 200' in the air.  it was about 200 yards from us.  it seemed to be flying at about 10-20mph. i thought it was a small plane, but then noticed the triangular formation which caught my attention.  i rolled down my window as we were passing it in the opposite direction and could not hear a sound over the \"driving wind\".  my wife saw it, but she was driving and we didn't really discuss it, nor did i reveal to her how peculiar i thought it was.  if i were driving by myself, i would have pulled over, but i was only able to watch it for a little less than 2 minutes until houses eventually blocked my view of it.\r\n\r\ni don't mind mufon contacting me by email if my event is of interest. i would like to know if anyone else in the area reported similar occurrences.\r\n\r\nplease don't post my name online.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":27436,"landingOccurred":false,"latitude":38.5514965,"location":null,"logNumber":"US-01172011-0010","longitude":-121.7358867,"occurred":1294992000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1295300945000,"summary":"Triangle lights flying slowly in davis california","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":3,"locationName":"Davis, California","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:75830"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is a third hand story came from my grandmother that she ha heard from my aunt [first name removed-cms/dr] from long time ago.\r\n\r\nmy [relatives names removed-cms/dr] are relaxing enjoying a warm indian summer evening on the porch over, out in san diego ca. as everyone had gone inside, my aunt [first name removed-cms/dr] was left outside as she was cleaning up the porch. she had encountered something strange, something she believes is a ufo. my aunt [first name removed-cms/dr] feels it is her duty to tell the world, but soon she had found out that lots of people are not so quick to believe that life may exist in other worlds. so she had dropped the case and nothing in the news media was not had been reported...","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27434,"landingOccurred":false,"latitude":32.7196892,"location":null,"logNumber":"US-01172011-0008","longitude":-117.1485451,"occurred":244105200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1295297097000,"summary":"My aunts [first name removed-cms/dr] flying saucer story","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":12166,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75831"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"East Brunswick","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Last summer while walking my dog, i observed a low flying object passing over tree tops. as i waited for it to clear, not moving my possition, i realized it had disappeared. i figured i was halucinating and said nothing to no one. the same summer of 2010 i also witnessed two jets flying over the skys of middlesex county, nj when one cloaked for about three seconds reappeared, recloaked for about three seconds, reappeared for about three seconds and recloaked. the amazing thing about the event is that the cloaked jet also lost,masked,or cloaked it's contrails. what spurred me to recount this was a mufon show on history where a gentleman out west recounted a simslar experience to your investigators. i had never mentioned this to anyone before now. \r\n1. in my front yard sky watching\r\n2. jets often fly over leaving chem trails\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Path with directional change","formattedAddress":null,"id":27433,"landingOccurred":false,"latitude":40.4397255,"location":null,"logNumber":"US-01172011-0007","longitude":-74.3981878,"occurred":1279868400000,"potentialRelations":[27306],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1295296308000,"summary":"A low flying object that appeared to cloak or disappear","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":178,"locationName":"East Brunswick, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75832"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hoffman Estates","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"This is a second hand story that was told by my aunt flo from long time ago.\r\n\r\nmy aunt flo has what she thinks, this was supposedly to be a close encounter of the third kind, when she was startled when a brilliant bright light up in the sky while she was in the storeroom of her own diner that shad used to own back during the 1970s. she had heard a strange sound and she had rushed out of the backdoor and then she apparently sees a ufo. however, my aunt flo was having a hard time convincing everyone of what she saw, while my uncle melvin does his best to try to capitalize when aunt flo becomes a local celebrity in hoffman estates il.\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27432,"landingOccurred":false,"latitude":42.0665115,"location":null,"logNumber":"US-01172011-0006","longitude":-88.1137699,"occurred":415267200000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Star-like,   Unknown","source":"MUFON","status":null,"submitted":1295295488000,"summary":"My aunt flo sees a light in the sky","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":10185,"locationName":"Hoffman Estates, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75833"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Woudrichem","country":"The Netherlands","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was outside taking photos of a beautiful sky at dusk. it was very peaceful and warm outside. i din't notice anything in the sky at the time only when i was going through the photo that i've noticed something. ufo is clearly seen on the picture its hard to mistake it for anything else as it is close and bright. i was amazed by the founded. you can clearly see a ufo\r\n\r\n","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"","flightPath":"","formattedAddress":null,"id":27431,"landingOccurred":false,"latitude":51.8164712,"location":null,"logNumber":"NL-01172011-0005","longitude":5.0077792,"occurred":1286413920000,"potentialRelations":[],"rating":"Unrated","region":"Noord-Brabant","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1295287085000,"summary":"A bright disk at dusk","tags":["none"],"timeZone":"Europe/Amsterdam","timeZoneName":"Europe/Amsterdam","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/27431_submitter_file1__IMG_3176-Copy.JPG","http://www.mufoncms.com/files_jeud8334j/27431_submitter_file2__IMG_3176.JPG"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":102,"locationName":"Woudrichem, Noord-Brabant","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75834"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Denver","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The dog woke me up at approximately 4:45 am to use the bathroom.  i saw what looked like a huge star hoovering in a southeasterly direction and had 4 little lights hoovering around it. i woke up my daughter to be sure i wasn't seeing things, and her and her friend sleeping over also saw the light.  it was 4 times the size of the stars in the sky and my daughter took a picture of it with her cell phone. didn't come out very clear.  we watched it move slowly up and back for around an hour until we all got tired and went back to bed. i woke up again about ten minutes ago, and its still there.  smaller now, but very bright.  i am watching the news, there is nothing about it.  i am suprised, because it's in plain sight right now! 6:39am - it is now gone.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":27430,"landingOccurred":false,"latitude":39.7440036,"location":null,"logNumber":"US-01172011-0004","longitude":-104.9764234,"occurred":1295268300000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Teardrop","source":"MUFON","status":null,"submitted":1295282440000,"summary":"Thin on the top thicker on bottom. all bright white light. had 4 smaller multicolored lights circling around it. ","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Denver, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75835"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fayetteville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving alone from fayetteville, arkansas to harrison, arkansas on u.S. highway 68 (now u.S 412)at about 10:30 pm. i was not under the influence of alcohol or drugs; nor was i tired. i was in a very rural area of carroll county with not many farm or house lights.  while driving i noticed that the embankment in front of me and to my left lit up brighter than what i expected my headlights to illuminate. i looked over to the right hand side of my windshield and saw a ufo.  i was traveling north-northeast and the ufo was traveling from southeast to northwest.  i was probably driving at about 45 mph but slowed down when i saw the ufo.  when i first saw the ufo it appeared at least 4-5 times larger than a full moon would appear to the naked eye.  in the course of a few minutes with what appeared to be a constant speed it had completely disappeared.  it did not quickly accelerate nor did it dissolve or blink out. the ufo was spherical in shape with 6 rows of windows equally spaced from an equatorial line and evenly spaced within the row.  the windows were oval or elliptical.  a butterscotch yellow light emanated from within the craft through all the windows.  i did not see occupants.  from both the 1 o'clock and 7 o'clock positions (as in a clock face) there were appendages resembling lightning bolts. from what i remember there were 3 angles on each of the appendages.  at each bend or angle change there was a small white light. the white lights blinked on and off in succession starting from the tip of one appendage and ending at the tip of the opposite appendage and reversing. as soon as i got home i made a drawing of what i saw.  i don't recall losing time or having any physical problems related to the sighting.  there was absolutely no sound from the ufo.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s),  Appendage(s)","flightPath":"Straight-line path","formattedAddress":null,"id":27429,"landingOccurred":false,"latitude":36.0708795,"location":null,"logNumber":"US-01172011-0003","longitude":-94.1535863,"occurred":407572200000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1295274906000,"summary":"Driving on highway at night large spherical ufo passed in front and above car.","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":10274,"locationName":"Fayetteville, Arkansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75836"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friends and i were at the cobalt in woodland hills, california leaving a shoe, when all of a sudden i saw a huge blue light in the western sky.  it hovered for a moment, then shot to the right and disappeared. it wasn't a plane because it moved so fast, and it shot across the sky so fast , never ascending or descending.  it just simply vanished into thin air.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None,  Unknown","flightPath":"Other","formattedAddress":null,"id":27427,"landingOccurred":false,"latitude":34.169657,"location":null,"logNumber":"US-01172011-0001","longitude":-118.5998852,"occurred":1295243100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Flash,   Other","source":"MUFON","status":null,"submitted":1295256301000,"summary":"Blue light in the western sky","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":0,"locationName":"Los Angeles, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:75837"}],"last":false,"totalElements":82758,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":1914}
