{"content":[{"address":null,"addressResolution":null,"altitude":"Landed, Treetop, 500 Feet or Less, Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover), Unknown","city":"Playa El Médano. Sta. Cru","country":"Spain","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Señores:  no hablo ni leo bien el inglés. soy ciudadano sueco pero vengo a  tenerife (sur) 2 veces al año por 3 meses en cada ocasión ya que tengo 2 hijas viviendo aquí. (tambien 2 en suecia y dos en miami,usa.\nsolo quiero relatarles lo que vi por si esto sirve de algo para uds. o la nsa.\nyo estaba sentado en la escalera de salida del edificio donde vivo que mira hacia el sw (south west), observando el planeta venus, la luna y dos esttrellas que hay mas abajo de ambos, separadas unos 15 grados.\ncuando observo una pequeña luz ue venía hacia mi  desde el cielo...Esta luz fue aumentando de tamaño pero  como a unos  50 grados de angulo con el horizonte terrestre (muy difuso a esa hora) esta luz describió un círculo hacia arriba...1-3 segundos despues describió de nuevo un circulo  o semicirculos de unos 10 grados (angular) y se dirigió hacia abajo...Según mi apreciación, posiblemente sobre o cerca de la isla del hierro al sw de mi posicion en la isla de tenerife, donde vivo.\nlo inaudito o incomprensible es que. según mis experiencias  que en mi joventud fuí radionavegante de un tbm caza de la navy, en la armada cubana;\nlos aviones que veo pasar constantemente casi sobre mi casa ya que vivo muy cerca delaeropuerto sur reina sofía; posiblemente tambien he visto pasar aviones de pruebas o quizá missiles sobre los cielos de tenerife;  considero que está \"luz\" u objeto no identificado viajabga a cerca de 10 veces la velocidad de un 747  o un a-380.\nno creo poder aportar mas datos ya que el \"objeto\"  se me percdió cuando descendía, tras los edificios que  hay al south de mi casa.\n\nafectuosamente. vidal fajardo real.\nnota...Yo no he comunicado esto a ninguna autoridad, ong u otra persona física o juridica. son a uds. a los unicos que se lo he informado.\nautorizo a mufon para hacer, incluso citando mi persa, lo que deseen con este escrito sin queharé ningún reclamcación por ello.\nvidal d","distance":"20 Feet or Less, 21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Over 1 Mile, Unknown, N/A","duration":"","entityEncountered":false,"favorited":0,"features":"None, Dome, Window(s), Patterned Surface, Insignia, Appendage(s), Louvres, Wings, Other, Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other,Unknown,N/A","formattedAddress":null,"id":76701,"landingOccurred":false,"latitude":28.0710336,"location":null,"logNumber":"ES-05302016-0017","longitude":-16.5067607,"occurred":1463349600000,"potentialRelations":[],"rating":"Unrated","region":"Canarias","reportedWeather":null,"shape":"Blimp,  Boomerang,  Bullet,  Missile,  Cigar,  Cone,  Chevron,  Circle,  Cross,  Cylinder,  Diamond,  Disc,  Egg,  Fireball,  Flash,  Oval,  Saturn-like,  Sphere,  Square,  Rectangular,  Star-like,  Teardrop,  Triangle,  Other,  Unknown,  N,  A","source":"MUFON","status":null,"submitted":1464638417000,"summary":"Mi zona horaria es  gmt objeto descrito  abajo.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":14,"locationName":"Playa El Médano. Sta. Cru, Canarias","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:77338"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. i was in my backyard and putting up my kids pool.\r\n\r\n2. i saw a black object coming towards my back yard that was flying close.\r\n\r\n3. i thought it was a motorized glider.\r\n\r\n4. the object came over my yard and i looked up with my kids and saw that it wasn't a motorized glider. my son asked dad what is that. i said i have no idea of what it is. i said its an alien. the object made no noise. it was black.\r\n\r\n5. i told my kids to go get my wife. i really have no idea of what it is. i told my parents the next day i seen a weird object in the sky.\r\n\r\n6. the object was just floating in the sky and going north west.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Other","formattedAddress":null,"id":76700,"landingOccurred":false,"latitude":40.4191871,"location":null,"logNumber":"US-05302016-0016","longitude":-82.90276300000001,"occurred":1464381600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1464637200000,"summary":"I was putting up my kids pool in the back yard and seen a weird object fly by.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":62,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":62,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:77339"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Jose","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Greetings,\r\n\r\nlast year i was on my patio photographing the moon and i what i thoght were stars around it. i pulled out my cellphone to capture what was on my dslr viewfinder. \r\n\r\nunfortunately, i never looked at the cellphone shot until last night as i was cleaning old images from my phone. \r\n\r\nthe dslr was shooting in 3 second long exposures, which you can see on the viewfinder, i don't know if i have the image from the dslr anymore as i tend to go out and shoot randomly. we are seeing more and more usual things in the sky west of us. \r\n\r\nthank you for all that you do,\r\ndorothy","distance":"Unknown","duration":"00:00:03","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":76696,"landingOccurred":false,"latitude":37.26757110941049,"location":null,"logNumber":"US-05302016-0015","longitude":-121.82661606625769,"occurred":1434758400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1464615121000,"summary":"Object/orb captured on camera","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76696_submitter_file1__SkyObject.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":80,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":56,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":80,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":56,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"95123","daysBetweenOccurrenceAndSubmission":345,"locationName":"San Jose, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77340"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cumming","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife and i were hosting an event at our home and just said goodnight to the last guest, my brother. a moment later, we heard knocking at the door. i knew it was my brother and assumed he forgot his phone or wallet and needed to get it before leaving. when i opened the door, my brother asked me to come out and see something strange. when i walked outside he pointed to two orange lights just above the tree line towards the northeast. i immediately dismissed the lights as aircraft. he corrected me and said they were moving unlike normal aircraft. he described the objects having moved parallel to each other before rotating and changing direction. again, i dismissed him as i only saw two orange lights. one was stationary and the other was moving similarly to an airplane. he asked me to note the orange nature of the objects and compare them to the light blue stars and the light blue lights of another obvious aircraft behind us. after the comparison, i did admit to the variation in light but simply dismissed the one moving object as an airplane. the other object i assumed was a planet due to its stationary position and orange glow. by this time, the moving object had disappeared behind the tree line while the stationary object remained in view. my brother attempted to explain the strange nature of the object's movements when, suddenly, the stationary orange dot began to move. this startled me. i watched with astonishment as the object moved along the sky and was temporarily obscured by the tree line before coming back into view. a moment later, the object faded away like an ember flickering and going out. i was honestly shocked and embarrassed by what i saw. i am not the type of person who likes attention or believes in intelligent extraterrestrial visitors. but i do believe in ufos... in the purely defined way of something being unidentified. and what i saw could not be identified. these dots of light were orange, looked like bright stars and appeared to be distant. my brother and i discussed the possibility of drones but these objects appeared to be quite high. i don't know much about drones, but i don't think they go that high and i don't think they have orange lights that flicker off. it was strange.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":76695,"landingOccurred":false,"latitude":34.082719935194,"location":null,"logNumber":"US-05302016-0014","longitude":-84.1937739858402,"occurred":1464560100000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1464615008000,"summary":"Two orange objects moving unlike a plane ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":62,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":87,"maxvism":16,"maxvisi":10,"meantempm":23,"meantempi":74,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":62,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"30041","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cumming, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77341"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fall City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driveway. 0310 hrs. facing south. smoking cigarette. i see a bright object (not flashing) appearing in brightness as bright if not more than jupiter as bright as venus (our brightess celestial object.) travels briskly through the trees from the south-west and as it breaks through the trees facing south it appears to slow down as it sees me. it's flying as low if not lower than the aircraft flight paths that fly north and south of here and is unusual as it is flying between normal flight paths. it appears to slow down around south observation, bank and turn (still slowly) towards the east and continues slowly in the almost eastern direction. while i observed this change of direction observing towards the south i did see two other faint objects make a cross pattern behind the bright object: one to the right (w) and the other up (n?) after they passed and i could no longer see the first and initial brightest ufo fade east i seen the forth object come from north-e travelling south west. these can't be our satellites...Most of our newer ones are geo synchronous so they orbit the sun with the earth and do not move in the sky. older sats orbit the earth equatorially so the appear to cross the southern sky west to east (low earth orbit) in a rather slow appearance of time (or travel across the horizon north from the southern hemisphere) within a low degree should be less than 20 degrees. we do however have polar obit satellites but are rarely used to observe the earth and they travel north-south. they should not change direction as they have and will appear almost 90 degrees above if they do. i am an amateur astronomer and by the way, i have seen these occurances many times. i have witnessed more than 50 of the strange ufo occurances. this one topped the sightings since last summer and i felt estranged to report it. i have documented many of them but sometimes i have seen a few flying and hovering over my work at night (while on break 2230 hrs.) sometimes i've seen them flash brightly fade, then flash brightly and do this for less than 10 seconds and see them re-appear in another part of the sky and do this for less than 5-10 seconds. somehow they have ultralight craft...They skip off the upper atmopshere. they're not e.T. they're from our planet, some kind of advanced insect-or dolphin fish race","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"01:03:05","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":76694,"landingOccurred":false,"latitude":47.5718437,"location":null,"logNumber":"US-05302016-0013","longitude":-121.88540689999999,"occurred":1464577800000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1464592470000,"summary":"Sw towards east direction aditional three slow cross pattern objects observed.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fall City, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77342"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friend in canada took this picture he was fishing on the bridge in tagish yukon and he posted these pictures on his page, he didn't notice it until i mentioned to him the black dot might be a ufo, idk what it is but it's out of place in both pictures. like it was moving towards and away, at first i thought it might be their fishing hooks but still it looks out of place like there is a energy around the area of the black dot. one of the pictures it's farther away and hard to see,  but i'm posting this for him in hopes it is something, i'm hoping it is??? unsure of the time me took the pictures ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Unknown","formattedAddress":null,"id":76693,"landingOccurred":false,"latitude":64.2834474,"location":null,"logNumber":"CA-05302016-0012","longitude":-134.99213,"occurred":1464480000000,"potentialRelations":[],"rating":"Unrated","region":"Yukon","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1464591734000,"summary":"Fishing on tagish bridge ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76693_submitter_file1__FBIMG1464601705570.jpg","http://www.mufoncms.com/files_jeud8334j/76693_submitter_file2__FBIMG1464603326639.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Yukon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77343"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Tehran","country":"Iran","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went shopping. first i want see the buildings but i see the ufo. i dont have any mobile phone to take a picture but i remember it. i lose it when i went to mosque. but i know that(that was a ufu)","distance":"21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Window(s), Other","flightPath":"Path with directional change","formattedAddress":null,"id":76692,"landingOccurred":false,"latitude":35.6891975,"location":null,"logNumber":"IR-05302016-0011","longitude":51.3889736,"occurred":1444851000000,"potentialRelations":[],"rating":"Unrated","region":"Tehran","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1464591455000,"summary":"I went to shopping when i saw it","tags":["none"],"timeZone":"Asia/Tehran","timeZoneName":"Asia/Tehran","tweeted":0,"urls":[],"weather":null,"zipcode":"1461937491","daysBetweenOccurrenceAndSubmission":228,"locationName":"Tehran, Tehran","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77344"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Leigh","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just gone into my rear yard to put an empty bottle into the bin. as i lifted the lid i saw flashing lights in the sky. 4 red lights flashed brightly and when then faded there was a constant green band of light across the middle,seperating the top half from the bottom. at first i thought the police helicopter was out again, but as i watched i realised there was no noise. no noise at all. there were planes flying over as i live about 12 miles from manchester airport and i could hear those. it didnt seem to be moving at all. just flashing. i ran into the house and woke my partner up. i was excited. when you have cancelled everything else out, it could only be one thing. a ufo. i grabbed my phone and went back outside. my partner joined me and we both tried to work out just what it was. we both watched and agreed we had never seen anything like it before. after about 15 mins my partner went back in and left me to it. it seemed to be moving extremely slowly. in the 50 minutes i was watching i would say it had travelled approimately 10 miles. it seemed to be stopping at points. the lights looked to be brighter then but that might have been my eyes because it was dark. i watched planes of all altitudes travel across the sky and all were gone in less than five minutes. eventually it vanished behind the roof of the house behind ours. i tried to video it but my phone would zoom in far enough and being dark you couldnt see any thing but a small light. the video is jumpy because im at full zoom, so it is the phone not the object moving. you can see it flahing though.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Straight-line path,Path then hovering","formattedAddress":null,"id":76691,"landingOccurred":false,"latitude":53.49430169999999,"location":null,"logNumber":"GB-05302016-0010","longitude":-2.4964313,"occurred":1464566400000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1464588198000,"summary":"In the back yard. looked and saw the object. watched it for 50 mins. got my partner out of bed to see it","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76691_submitter_file1__20160530104855.jpg","http://www.mufoncms.com/files_jeud8334j/76691_submitter_file2__20160530001138.mp4","http://www.mufoncms.com/files_jeud8334j/76691_submitter_file3__20160530000825.mp4","http://www.mufoncms.com/files_jeud8334j/76691_submitter_file4__20160530005340.jpg","http://www.mufoncms.com/files_jeud8334j/76691_submitter_file5__20160530005336.jpg"],"weather":null,"zipcode":"WN72LG","daysBetweenOccurrenceAndSubmission":0,"locationName":"Leigh","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77345"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Red Wing","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Upon taking our puppy outside to go to the bathroom at approximately 9:41pm on sunday may 29th, 2016 my fiance and i observed a bright white light with (what looked to be) an orange colored ring or aura around it in the sky from our backyard. the direction in which the light was observed was nw from our home and very quickly disappeared there after. we decided to sit an watch for a while to see if it came back... it did at approximately 9:52pm. the light first appeared bright white, but when it dimmed, had an orange glow, flickered, pulsated-like, then dove down quickly at an angle out of view from our horizon focal point. over the course of about 3 hours, the light came and went but did not stay in view for very long. the light seemed to dim too much for video. however, i was able to take a few pictures in between observations (at full zoom on my iphone 6s plus). during that time, we witnessed the light change direction (from north to south and west to east), descend and ascend (from beyond the horizon out of view to above the horizon at about 10 degrees), emit orbs of light, disappear and re-appear, hover and sometimes follow a path or fly together with the orbs of light it had emitted.         ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":76690,"landingOccurred":false,"latitude":44.48491010294846,"location":null,"logNumber":"US-05302016-0009","longitude":-92.62126374841075,"occurred":1464558060000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1464590212000,"summary":"Two bright orange-white lights emitting orbs in the sky","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76690_submitter_file1__ufo.JPG","http://www.mufoncms.com/files_jeud8334j/76690_submitter_file2__ufo2.JPG","http://www.mufoncms.com/files_jeud8334j/76690_submitter_file3__ufo3.PNG","http://www.mufoncms.com/files_jeud8334j/76690_submitter_file4__ufo4.PNG","http://www.mufoncms.com/files_jeud8334j/76690_submitter_file5__ufo5.PNG"],"weather":null,"zipcode":"55066","daysBetweenOccurrenceAndSubmission":0,"locationName":"Red Wing, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77346"},{"address":null,"addressResolution":null,"altitude":"Treetop, Over 500 Feet (no cloudcover)","city":"Coolidge","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my back patio smoking when i saw what i thought was a meteor above the horizon.It changed direction 6 or 8 times.I watched for about.60 seconds until it.Dropped below the tree line . it was to fast for a plane and the turns and altiude variations were unlike anything i have ever seen.As a trained forward observer on a p3 orion,that is saying a lot.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":76689,"landingOccurred":false,"latitude":32.983669000000006,"location":null,"logNumber":"US-05302016-0008","longitude":-111.511094,"occurred":1464480000000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1464588612000,"summary":"Observed a bright light above horizon moving rapidly changing altitude and direction then dipped below the tree line","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"' 85132","daysBetweenOccurrenceAndSubmission":1,"locationName":"Coolidge, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77347"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Anchorage","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My son's and i were observing a rare display of thunder and lightning here in anchorage, and i was taking some video hoping to catch a cool streak of lighting and some thunder crashing and the like as we don't often get that sort of weather behavior in our part of alaska.  i noticed something out of my peripheral vision that seemed to climb rather quickly and seemingly close by.  the shape was peculiar, and i would describe as oblong, perhaps rectangular and the color was dark/black.  it ascended in a seemingly controlled manner, perhaps it was taking off, i'm not sure.  i called my children's attention to it and after ducking under a short overhang on our building and using the corner of the building to steady my arms as i tried to get the object into frame.  i noticed as it proceeded on its path across the city heading west from n/ne .  it was in the general vicinity of both merrill field, a small light aircraft  airport and jber (joint base elmendorf richardson) formerly elmendorf afb.  perhaps jber or merrill field has witness or radar confirmation as well.  the object seemed to turn and tumble in a very peculiar fashion.  it was quite larger than any balloon i've ever seen let loose and the way it moved and only ascended to a certain height seemed quite un-balloon like.   i was able to follow it for about 3 minutes or so until it was blocked out by buildings and a tree in the distance.  i have a cell phone video of the entire sighting, minus perhaps the first ascent.  ","distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","duration":"00:02:30","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":76688,"landingOccurred":false,"latitude":61.23351322455724,"location":null,"logNumber":"US-05302016-0007","longitude":-149.81325509272145,"occurred":1464545280000,"potentialRelations":[],"rating":"Unrated","region":"Alaska","reportedWeather":null,"shape":"Square,  Rectangular","source":"MUFON","status":null,"submitted":1464588327000,"summary":"Saw black oblong/rectangular object ascend slightly, and continue on straight heading, tumbling and turning in an odd fashion","tags":["none"],"timeZone":"America/Anchorage","timeZoneName":"America/Anchorage","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76688_submitter_file1__20160529180748001.mp4"],"weather":null,"zipcode":"99508","daysBetweenOccurrenceAndSubmission":0,"locationName":"Anchorage, Alaska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77348"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kennewick","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. my friend was watching television in the living room on the couch, the window is north from the couch. she looked to the window and saw some lights. she quickly jumped up and started yelling \"look look\" as she ran out the front door to the right of the window. we all got up and and ran outside watching the ufo fly slowly by.\r\n\r\n2. my friend saw a moving light in the dark sky, thinking it was a shooting star she got up to look to quickly find out it was actually a ufo looking object.\r\n\r\n3.Shooting star\r\n\r\n4. spun downward slowly. had two lights that blended together but also pulsed slightly at the source of the lights.\r\n\r\n5. at first we felt in awe. then after we lost sight of the ufo the shock of the rare sighing finally set in.\r\n\r\n6. we lost sight of it as it went behind our house, all of us being fairly short, we could not see in after it flew off.\r\n\r\n ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":76687,"landingOccurred":false,"latitude":46.23504531313862,"location":null,"logNumber":"US-05302016-0006","longitude":-119.15434270143535,"occurred":1464561300000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1464575762000,"summary":"Oval like ship, flying from n to w, spinning while heading down slowly.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"99336","daysBetweenOccurrenceAndSubmission":0,"locationName":"Kennewick, Washington","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77349"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Santa Barbara","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On porch talking with friend on phone when a shape i suspected was a plane or helicopter due to red pulsating though it flew in odd directions \r\n, no sound and white and blue colors \r\n. got off the phone and took pictures of it moving slowly then drop then straight up down to the side and down again. what the heck was it? a drone i thought but have not found any such launch of a drone. it was in sight about 10 minutes off and on because i called my friend back after it flew towards the mountains then it cam back so i took another video.It finally dropped quick after slowly going straight up then down to the side and down .","distance":"101-500 Feet, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering,Other","formattedAddress":null,"id":76686,"landingOccurred":false,"latitude":34.40487290873019,"location":null,"logNumber":"US-05302016-0005","longitude":-119.70303044592708,"occurred":1464556800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1464574360000,"summary":"Closer before i started vrecording it hovered and flew in quick angles no soundwhen magnifying still photo iy looks blue cylinder shape.","tags":["photo","sound"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"93101","daysBetweenOccurrenceAndSubmission":0,"locationName":"Santa Barbara, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77350"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Yuba City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Out smoking looking at jupiter like i always do..\r\ninstantly appearing above jupiter 2 gigantic star looking crafts appeared..\r\ni yelled for my husband and he came out and we watched this gigantic crafts change direction and moved in unison and then instantly disappeared..","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":76685,"landingOccurred":false,"latitude":39.169713250996615,"location":null,"logNumber":"US-05302016-0004","longitude":-121.64435173552495,"occurred":1464561900000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1464574253000,"summary":"Out smoking looking at jupiter like i always do.. instantly appearing above jupiter was 2 gigantic star looking crafts.. i yelled for my husband and for 10 minutes we watched these gigantic stars move together in unison.. they changed direction twice.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"95991","daysBetweenOccurrenceAndSubmission":0,"locationName":"Yuba City, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77351"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Hoffman Estates","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While driving west on golf rd in a convertible with the top down my 11 year old son noticed what he believed was a satellite moving rapidly in a northeast direction. as we watched another light began moving southeast and they passed each other and both stopped at different points.  thinking this was odd we pulled over to observe more closely.  we then noticed the lights change direction and make smaller movements and turns.  we decided to head home to get a cel phone to record the lights.  on the way home we lost sight of the lights and went on the back deck to observe more if possible.  we noticedmore lights moving and tried to catch them  on film but it was difficult to see because they were so far away.  we also saw several airplanes which were much lower and distinctive by their navigational lights and beacons.  after taking these videos we noticed less movement and went inside.","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path then hovering","formattedAddress":null,"id":76683,"landingOccurred":false,"latitude":42.0629915,"location":null,"logNumber":"US-05302016-0002","longitude":-88.12271989999999,"occurred":1464557400000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1464569045000,"summary":"While driving observed starlike lights move then stop and move again.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"60169","daysBetweenOccurrenceAndSubmission":0,"locationName":"Hoffman Estates, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77352"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bakersfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"First of all, i want to express gratitude to this forum for allowing me to share my husband and i experience with a ufo. i recently found out about mufon and just have to report what happened to us a few years ago.\r\n\r\nin april of 2012, my husband and i were walking to the market, which was directly across the street from us, when we observed an odd light directly above the apartments next to us. at first, we thought it may have been a reflection of the street lamp on something in the sky. as we continued walking, we kept looking at this light, which resembled a \"tap light\". the other odd thing was that neither of us spoke until my husband asked me if i was seeing what he was seeing. when we both acknowledged this \"tap light\", we stopped walking and stood there observing this light for about 10 minutes. we even looked around to see if anyone was seeing this \"little moon\" in the sky. the sky was dark but where this light was, it was even darker and when we continued to look at it, we noticed that behind the light was something that i still can't find the words to describe, so please bear with me.\r\n\r\nthe object behind the light didn't have a discernable shape. i couldn't see the object at first but i could see that this \"tap light\" was inset on the surface of something. the surface of the object was like the scrolling numbers on the movie \"the matrix\", that cut at angles to show that it had a shape but nothing i can definitively describe. it was as if a projector was shining on a plane surface rather than a white screen. also, the sky around this light was extremely dark. darker than the surrounding night sky. we stood there in disbelief because it was a friday night, and lots of people outside, yet no one but us was reacting to this thing in the sky. if my husband wasn't there with me, i may have thought i'd become insane. he confirmed what i was seeing with my own eyes and haven't told to anyone since then.\r\n\r\nfinally, after standing in the parking lot for what felt like a long time, we just walked away and went to the market. the object and its \"tap light\" was still there but wasn't there when we returned home. to me, i felt that this strange object was making itself invisible to everyone but because we first observed it from it's side, we were able to see it. \r\n\r\nthough this in itself was a strange occurrence for both my husband and i, what happened the next few days after this event was even more strange. we started to notice our sleeping patterns were off and we both experienced a high sexual energy between us that felt very wrong to us, yet we had no control of.  it was like we couldn't keep our hands off each other and we couldn't be sated. also, my husband had a small puncture on his chest, like from a hypodermic needle. \r\n\r\nwe don't have any pictures or video of this event because it was such a normal day, nothing warranted us to have our phones on us to take any. i wish we did because it was a truly amazing experience and has opened my eyes to things outside of the norm.\r\n","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":76682,"landingOccurred":false,"latitude":35.30182855970482,"location":null,"logNumber":"US-05302016-0001","longitude":-119.05191318903435,"occurred":1333220400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1464568381000,"summary":"Strange light with an odd object behind it that had a matrix-like surface","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":23,"maxtempi":74,"maxvism":16,"maxvisi":10,"meantempm":17,"meantempi":63,"meanvism":15,"meanvisi":9,"mintempm":11,"mintempi":51,"minvism":3,"minvisi":2,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":23,"maxtempi":74,"maxvism":16,"maxvisi":10,"meantempm":17,"meantempi":63,"meanvism":15,"meanvisi":9,"mintempm":11,"mintempi":51,"minvism":3,"minvisi":2,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"93313","daysBetweenOccurrenceAndSubmission":1520,"locationName":"Bakersfield, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77353"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Nashua","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Just before twilight on a overcast evening, my wife and i had just finished walking our dog and my wife sat down on a chair on the deck. i was standing across from her and looking across the road when i saw two strange large red orange lights rise from behind the white pine trees in the southern part of the sky heading in a south west - westerly direction. these orbs moved in a floaty but controlled way, but unlike any aircraft i know. as they traveled, they seemed to have subtly moved around as they headed on their trajectory. these two orbs were followed by four more in an identical way. my wife and i were completely amazed. i captured this event on my iphone. my wife told me that she saw two of them move together then apart as they were departing. it was difficult to believe what we were seeing. to our surprise, 10 minutes after the fist sighting, we saw two more of these same orbs acting in a similar manner to the first sighting and traveling in the same direction. these orbs were below cloud level and disappeared by fading into a small dot into the cloud covered sky.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":76681,"landingOccurred":false,"latitude":42.69877145879122,"location":null,"logNumber":"US-05292016-0025","longitude":-71.49780838573136,"occurred":1464554460000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1464564741000,"summary":"My wife and i saw 6 red orange orbs floating but controlled pattern while on our deck.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76681_submitter_file1__trim.E227FE14048E40A5938C9BABD3F82D6E.MOV","http://www.mufoncms.com/files_jeud8334j/76681_submitter_file2__trim.AFAF3331D03A46FAB3F3FD225595CF36.MOV"],"weather":null,"zipcode":"03602","daysBetweenOccurrenceAndSubmission":0,"locationName":"Nashua, New Hampshire","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77354"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Dallas","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Watching thunderstorms on my balcony. an orange ball flew overhead parallel to us 35. this was very different from the hundred of aircraft i see taking off or landing at dfw or love field, which are also visible from my balcony. at first i thought it was a plane but within a couple of seconds i realized this was different. i went from that's weird, to i need to film this, so i turned on my iphone 6s to video. my wife was with me and observed it as well. i lost sight of the object when it ascended above the cloud deck in the direction of dfw airport. i went inside to get a better camera when a second object appeared, identical to the first i tried to get the lens cap off, and focus the camera quickly but it disappeared before above the clouds before i could. this was distinctly different from the landing lights or other aviation lights i see all the time. i'm not sure the cell phone video does it justice but it's the only thing i had to quickly capture the object.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":76680,"landingOccurred":false,"latitude":32.79234792037682,"location":null,"logNumber":"US-05292016-0024","longitude":-96.81799810614704,"occurred":1464559080000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1464564518000,"summary":"2 orange fireballs on identical path, approximate 30 seconds apart","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76680_submitter_file1__trim.78130A8E34D54B758D2EDC1E452010F3.MOV","http://www.mufoncms.com/files_jeud8334j/76680_submitter_file2__trim.D464A75D6C5740D59B4C324EA4B9A6BB.MOV"],"weather":null,"zipcode":"75207","daysBetweenOccurrenceAndSubmission":0,"locationName":"Dallas, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77355"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Louisville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"An ufo appeared  suddenly on the 11:00pm weather broadcast on the wlky tv station on may 19, 2016 on tv in broad daylight while the weather man was showing the partly cloudy skies earlier in the day. there is no mistaken identity here..It is clear as can be then it just disappeared in thin air. not a drone...No weather balloon...No tricky lights etc. my friends kentucky is a hotbed for these things.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Path with directional change","formattedAddress":null,"id":76679,"landingOccurred":false,"latitude":38.257274699999996,"location":null,"logNumber":"US-05292016-0023","longitude":-85.7560657,"occurred":1463616000000,"potentialRelations":[],"rating":"Unrated","region":"Kentucky","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1464563395000,"summary":"Ufo appeared during wlky tv 11:00p weather report during first 5min of show. appeared in the sky moving fast across the screen then disappearing in mid flight. very clear object had 8 sides and apparatus at top & bottom.","tags":["ufo","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":23,"maxtempi":73,"maxvism":16,"maxvisi":10,"meantempm":16,"meantempi":61,"meanvism":16,"meanvisi":10,"mintempm":9,"mintempi":49,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":23,"maxtempi":73,"maxvism":16,"maxvisi":10,"meantempm":16,"meantempi":61,"meanvism":16,"meanvisi":10,"mintempm":9,"mintempi":49,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":10,"locationName":"Louisville, Kentucky","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77356"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Knoxville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1: i was inside in my room when my dad called me outside.\r\n2: my dad had gone out to get a briefcase out of the car, and he looked up and saw them. then called me outside.\r\n3: i had no clue what it was. unidentifiable of course. \r\n4: it was a very large triangle. you could see three lights which was how we identified it. each side looked to be over a mile long at the least. you could see a slight outline that was a bit lighter in color than the night sky. it was moving in a straight line, then took a slow turn to head north east. it was flying too perfectly synchronized to be planes or helicopters to be it. also there were no blinking lights. \r\n5: at first i was thinking to myself \"holy crap i have to get the camera.\"  i ran to get the closest thing which was my camcorder. i was not able to get a video though. if the picture is too dark it cannot take a video. i was amazed because, i am a strong believer in aliens, so i never thought i would have an actual sighting. so i was excited and slightly scared at the time.\r\n6: at first the object went behind a tree, but then moved out from behind the tree where we watched it for several minutes before it suddenly started a slow turn away from us. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":76678,"landingOccurred":false,"latitude":35.90294765116871,"location":null,"logNumber":"US-05292016-0022","longitude":-84.14677782762243,"occurred":1464557880000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1464559887000,"summary":"Dad called me outside and when i came out there were three lights pulsating and moving together, triangle form, very large","tags":["triangle","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"37932","daysBetweenOccurrenceAndSubmission":0,"locationName":"Knoxville, Tennessee","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:77357"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Lamesa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Bounced and pulsated along a path then shot off at a 90 degree angle and left a long white streak of light in sky. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":76677,"landingOccurred":false,"latitude":32.73508806150025,"location":null,"logNumber":"US-05292016-0021","longitude":-101.98770205679298,"occurred":1464492900000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1464552132000,"summary":"Bounced and pulsated along a path then shot off at a 90 degree angle and left a long white streak of light in sky.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"79331","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lamesa, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77358"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At the beach in wilmington nc my brother and his wife fishing sister in law notice rough waters and took pic after posting on fb noticed this strange object that she didn't notice when she took pic","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"N/A","formattedAddress":null,"id":76676,"landingOccurred":false,"latitude":35.762813099999995,"location":null,"logNumber":"US-05292016-0020","longitude":-79.0160897,"occurred":1464348600000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1464548782000,"summary":"Took pic of ocean then noticed this strange object in air of pic","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/76676_submitter_file1__image.jpeg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":16,"maxvisi":10,"meantempm":26,"meantempi":78,"meanvism":15,"meanvisi":9,"mintempm":20,"mintempi":68,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":16,"maxvisi":10,"meantempm":26,"meantempi":78,"meanvism":15,"meanvisi":9,"mintempm":20,"mintempi":68,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77359"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Kitty Hawk","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Standing on our balcony on the outer banks looking west toward the mainland we saw five orange globe-like objects flying up the sound.  we often see military aircraft in the area and these did not fit any observed description of one of them.  they flew north then in front of us arched to the west.  there was no observable sound.  all of the aircraft we see in the area make some type of noise.  the almost looked like hot air balloons that were on fire but the all followed the same path and turned west.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change","formattedAddress":null,"id":76675,"landingOccurred":false,"latitude":36.21938175349766,"location":null,"logNumber":"US-05292016-0019","longitude":-75.75084679540409,"occurred":1464470400000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1464548330000,"summary":"5 orange fire-like orbs came from the south then turned west. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":83,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":15,"meanvisi":9,"mintempm":17,"mintempi":62,"minvism":2,"minvisi":1,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":83,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":15,"meanvisi":9,"mintempm":17,"mintempi":62,"minvism":2,"minvisi":1,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Kitty Hawk, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77360"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Cincinnati","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had just taken a shower and was walking to my bedroom when i noticed something out of my western facing windows.  i live on the top (6th) floor of a building in downtown cincinnati which has a commanding view of the western part of the city including union terminal.\r\n\r\nit appeared to be spherical / oval in shape and intermittently flashed bright red light and silvery white lights on it's surface.  it's speed and altitude was fairly constant and not overly fast as it flew due north over the western part of the city at ~300 ft, then it climbed to ~1,000 ft and turned nne -- finally appearing to climb straight up into the clouds.\r\n\r\nat first i thought it might be a helicopter (bell type) due to it's spherical shape but observed no tail or rotors.  the lights were strange because they almost looked like sunlight glinting off of the object or through it but the sun was almost directly above and behind cloud cover.\r\ncolor of light was red particularly when the object was close, then almost bluish white when it was higher and farther away.  no noise.\r\n\r\ni finally realized i had a camera nearby but it was pretty far away at that point and i didn't check the camera settings and unfortunately overexposed the picture.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":76673,"landingOccurred":false,"latitude":39.10549449037639,"location":null,"logNumber":"US-05292016-0017","longitude":-84.54545596186881,"occurred":1464534000000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1464538505000,"summary":"Observed sphere/oval object traveling n at low altitude, then and turning nne and climbing straight into clouds. craft emitted bright red and white light almost like reflections but brighter.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"45214","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cincinnati, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77361"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A friend and i were camping along the russian river in california, not far from novato, ca, on the pacific coast on a clear night, in 1971, probably during the late summer or early fall. \r\n     we were neither drinking nor under the influence of any drug. we were simply lying back, talking and looking at the starry sky.\r\n     i noticed a fast-moving point of light from the northeast sweep into view, almost directly overhead. it was whitish with a faintly greenish cast to it, slightly larger and brighter than any of the stars in the background. against the backdrop of the starry sky, this light certainly appeared to be in motion close to earth, well within a distance measured in 100s to a few 1000s of feet. it was not a helicopter nor an airplane. \r\n     it also was not a \"celestial\" object such as a star or planet. it was not a firefly. it was not a campfire spark; we had no fire going. this silent point of light behaved with intention and swift precision within the atmosphere.\r\n     both of us saw this light and watched it perform a short series of maneuvers: the point of light would swiftly and silently move to a new spot in the atmosphere (taking approx. 1 second) and then \"stop on a dime\". it would then remain stationary for several seconds, approx. 5 to 10 seconds at most. then, at an oblique angle, it would swiftly move to another position where it would again sit or hover silently.\r\n     with our depth perception and an approximate sense of this moving light's distance away/above us, an estimate of 1000 feet would be the distance it traveled in approx. 1 second between the \"pause points\".\r\n     this pattern -- a swift straight line movement to a single stopping point; remaining still for several seconds, then moving to another point -- repeatedly continued for about 5 to 7 minutes. finally, it shot out of sight in a straight line into a northerly direction, slightly to the west.\r\n     we did not know then, nor know now, of any aircraft or aerial phenomenon that could account for such activities, especially when no sound was associated with the movement. we noted that the hamilton air force base was somewhat nearby, yet the aerial movement of this light-object was unlike any aircraft technology known to us.\r\n     so, indeed, we were experiencing an unidentified flying object. \r\n     ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Straight-line path,Path then hovering","formattedAddress":null,"id":76672,"landingOccurred":false,"latitude":36.787701,"location":null,"logNumber":"US-05292016-0016","longitude":-119.4151024,"occurred":51143400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1464537716000,"summary":"Silent lighted small form swept fast into view, hovered perfectly still, then bee-lined fast to hover at another position. this activity continued for 5-7 minutes.  ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":35,"maxtempi":95,"maxvism":24,"maxvisi":15,"meantempm":27,"meantempi":80,"meanvism":21,"meanvisi":13,"mintempm":18,"mintempi":64,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":35,"maxtempi":95,"maxvism":24,"maxvisi":15,"meantempm":27,"meantempi":80,"meanvism":21,"meanvisi":13,"mintempm":18,"mintempi":64,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":16358,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77362"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Ottawa","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was a darker cloudy sky that night, just before sunset, many darker grey clouds in the sky.\r\n\r\nthere were really two phenomenons in this one sighting, one that i have seen before in a sky similar to the one that night, darker clouds.  here and there at sunset in this kind of sky i became aware of what looked like headlights in the dark clouds as if something was looking through high beams to see through the dark clouds.  i know this to be a strange phenomenon because the distance between the 'headlights' seemed the same in the pairs of 'headlights' i saw that night and on other occassions in a similar sky as i have said.  if the two 'headlights' were different in spaces between them i probably wouldn't have noticed.\r\n\r\nalso i noticed that here and there in that sky there were also groups of 3 white bright lights like the 'headlights' but they seemed to form a solid object, triangle.  i saw maybe a dozen or more sets of 'headlights' and maybe 3 or 4 triangles.\r\n\r\nboth the triangle lights and 'headlight' lights were bright white as headlights would be on earth and white.  they didn't move but started to dim here and there and then poof they were gone.  others would appear then dim and out like the others.\r\n\r\nfor some reason i found myself looking at one point between two very dark clouds that had a lighter grey area inbetween them and all of a sudden i witnessed a white fuzzy edged solid looking disc moving from the dark cloud to the right across the lighter grey area to the dark cloud to the left - a trip that lasted about 5 seconds max.  startled me.  it was moving to hide behind a second cloud is what it looked like.  it didn't move too quickly, just changing location.  it moved on a bit of an angle up, like just under say 45 degrees.  i didn't see that disc again that night.\r\n\r\nas i said before i have seen these 'headlights' often in this type of sky.\r\n\r\n","distance":"Over One Mile","duration":"00:25:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":76671,"landingOccurred":false,"latitude":45.4268896,"location":null,"logNumber":"CA-05292016-0015","longitude":-75.6877631,"occurred":1463343000000,"potentialRelations":[],"rating":"Unrated","region":"Quebec","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1464535237000,"summary":"In dark clouded sky at sunset 'headlights' of something in sky, approx 10 or so at a time plus disc shaped object going from one cloud to another","tags":["lights","disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":null},"zipcode":"0","daysBetweenOccurrenceAndSubmission":13,"locationName":"Ottawa, Quebec","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77363"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my backyard smoking a cigarette and noticed 5 lights above my head that looked like stars flying in a v formation from west to east/south east at about the one o'clock position i could see a dull grey outline around each object as if reflecting light from ground below at about the 2 o'clock position the objects looked like lights again then they changed from in a v formation and lined up in a straight line from 2'oclock position to 3'oclock position then back to v formation at about the 4'oclock position and traveled across the sky all the way until they couldn't be seen anymore still traveling east/southeast\r\n  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":76670,"landingOccurred":false,"latitude":44.0750519,"location":null,"logNumber":"US-05292016-0014","longitude":-114.7354008,"occurred":1464474660000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1464531806000,"summary":"5 boomerang objects in v formation then to a straight line then back to v formation","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":16,"maxtempi":61,"maxvism":null,"maxvisi":null,"meantempm":6,"meantempi":43,"meanvism":null,"meanvisi":null,"mintempm":-4,"mintempi":25,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":16,"maxtempi":61,"maxvism":null,"maxvisi":null,"meantempm":6,"meantempi":43,"meanvism":null,"meanvisi":null,"mintempm":-4,"mintempi":25,"minvism":null,"minvisi":null,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77364"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Rensselaer","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My neighbor and i were outside at night and we witnessed something that was definitely not a plane.  we noticed it was flying over really slow like it was scanning or looking for something.  it changed speeds going slower and made absolutely no noise and it was as low like a plane getting ready to land.  we had watched it come from nowhere then after almost 10 minutes it just was gone.  we were both amazed and did not leave us feeling scared like the other ones.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":76668,"landingOccurred":false,"latitude":42.68448249373344,"location":null,"logNumber":"US-05292016-0013","longitude":-73.68133262633016,"occurred":1464552840000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1464531234000,"summary":"It came out of no where and we waited to hear noise but it was no plane and it flew to slow to be a plane. it was a amazing sight ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"12144","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Rensselaer, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77365"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Taos","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Taos,believed these objects flew out from the rio grande gorge,i first spotted the objects when i turned on road 110,they looked to be  fly over my neighborhood,dancing and circling,then merged as one. i called my brother at approximately at 9:32pm to tell him to look outside,he didn't answer so i rushed thru the neighborhood home and got him to come outside.We watched for about 5 minutes trying to get cameras etc then the object flew west very fast,unable to get film or video,damit!","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":76667,"landingOccurred":false,"latitude":36.385452906043746,"location":null,"logNumber":"US-05292016-0012","longitude":-105.60426762595334,"occurred":1464471000000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1464522761000,"summary":"2 glowing fireball dancing in the sky that merged into one then flew quick west at phenomenal rate of speed","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":21,"maxtempi":69,"maxvism":16,"maxvisi":10,"meantempm":10,"meantempi":50,"meanvism":16,"meanvisi":10,"mintempm":-1,"mintempi":30,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":21,"maxtempi":69,"maxvism":16,"maxvisi":10,"meantempm":10,"meantempi":50,"meanvism":16,"meanvisi":10,"mintempm":-1,"mintempi":30,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"87571","daysBetweenOccurrenceAndSubmission":0,"locationName":"Taos, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77366"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Jupiter","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was on my back patio having coffee and i saw a white oval object in slow motion moving across the sky in a straight line and there was another one 15 minutes later doing the same thing and then they just blended with the sky.It was partially cloudy.There were no planes in sight or heard.What is going on in jupiter's skies ?","distance":"21-100 Feet","duration":"03:00:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":76666,"landingOccurred":false,"latitude":26.95239286054912,"location":null,"logNumber":"US-05292016-0011","longitude":-80.11289601803134,"occurred":1464507300000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1464521715000,"summary":"I saw 2 of these objects within 15 minutes of each other.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"33458","daysBetweenOccurrenceAndSubmission":0,"locationName":"Jupiter, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:77367"}],"last":false,"totalElements":82750,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":450}
