{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Atalandi","country":"GR","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Im from greece, from atalandi town.A small town of about 10.000 people.A town that is away from big city lights.A country place.It was a summer night of july,that the sky was beautifull,clear night sky without any clouds and you could see clearly the planes passing by, time to time and in great highs,but you can see its a plane,with usually red flashing lights making a course over the sky and fight with the wind.But this was different.I was eating at my balcony and watching the sky,when a cyrcle object,a bright white in the center and orange at the edges of the cyrcle,was flying too slow for a helicopter and the light was too big to be a helicopter,in that small distance and no sound.It was coming from west to east ,with not excactly straight line.It was doing a little to the left, after some to the right,with a way that no helicopter can do,or other known objects for me.It was obvious that this light was coming from a great energy sourse.No human objects can admit such a great fire-kind cyrcle light.The lamps of our human objects have a small light,you can understand that is a lamp.This was close to me about 600-1000m max not straight above me and passed over the edge of the town,300m above the last houses of the town.I knew its was a ufo and it was leaving behind a small tail of light,like fire,like if you move a candle with your hand and the fire leaves a small trail.The movement was very very slow,with the same slow speed as it gradually dissapierd in the horizon above the sea that is 6 kiliometers from me,it continued the flight above the sea ,but after some minutes you couldnt see it well.With no voice at all and in my town that time at about 10 o clock at night,if a helicopter passes over us we always can hear it.At 12 o clock at night if you shout loud defenetly other people will hear you at the other edge of my town.Actually its not the first time a have seen a ufo.That summer and i mean the summer of 2014,the last year ,i saw again at my balcony,two bright objects,white weard lights again with weard movement,but this time it was in much greater high than this one.They flight straight line side by side and the one make a rapid movement and pass infront of the other.Also some other three-four times objects with not straight line course ,to be a satelite and mabe outside the atmosphere,seems so distaned.And not just one,but alot of them if you stay alot of time observing the sky.I ve tried to observe the sky at winter time,but i never see anything like that.Only the summer,mabe because the sky is clear that time.At summer you can see if you observe well and dont have clouds,you can see the shape of our galaxy,if im not wrong.A small like a triangle shape,like dust and luminus in the center shape,like the hubble telescope images we see,the shape.To tell you a story that happened here at atalandi,at 1992 and it shocked the villagers that time,it called the greek roswell,because many witnesses saw at night many ufo objects about ten or less  flying the night sky and one of them crashed down or land in the fields close to us and some said they saw figures,human shape entities from distance and some took some small metalic souvenirs.The news came and document that time,the police thought it would be some plain crash,but at the end it was not found anything.It was saturday night and as a kid that time i remember that i woke up at sunday,going out of my house with my bicycle to find my friends and we ve heard rummors that something crashed in the area of megaplatanos village very close to our town and we deside to go and see what happened.But the two roads leading there where closed by police cars and they said to us that we cannot pass and they didnt say much(to notice,we have a big cyrcle ball radar-antenna in that area its a n.A.T.O base and it have a small military base).It was weard because even if an accident was happened,its difficult the cops to close the road with the police cars,here in the country.If you search you tube and google,it has some stuff about that incident and some local documanter in greece.And im not the only one that said that he saw a strange ufo light,last night,there are others too here.In my opinion there is a lot of activity here,but you must come at summer time and stay to observe the sky for some days and you will be emazed,you can see many ufos outside the atmosphere, lights and sometimes close,but you can easely seperate them from aeroplanes and stuff.Mabe its a passage here ,because the place has small towns and villages and a few will notice.In my opinion ,if i wanted to hide and i was flying a ufo,i would also choose to fly above my area to go to other places in greece after,its a good path depending on how many city lights are below on the ground.Anyway thats my story and im not lying or being decieved.One is for sure,there are ufo for me-the two times im sure wich was close,the others that i said was outside the atmosphere i cant be sure,but for me there are also strange-,wich means we dont know the identity,but how many things wich is known to us have those characteristics ,special lights ,weard movements and felling weard when you watching them??????????????I tell you and you judge,but if i had the proper eguipment,im sure the summer will be interesting...Exc my eng","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change","formattedAddress":null,"id":69769,"landingOccurred":false,"latitude":null,"location":null,"logNumber":"GR-08252015-0016","longitude":null,"occurred":1405894500000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1440511054000,"summary":"A slow weard  movement bright object with too much energy admited.White in the center of the fireball and orange at the edges that was leaving behind a small orange trail.","tags":["fireball"],"timeZone":"Europe/Athens","timeZoneName":"Europe/Athens","tweeted":0,"urls":[],"weather":null,"zipcode":"35200","daysBetweenOccurrenceAndSubmission":400,"locationName":"Atalandi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10800"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Woodbury","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On 8/17/15 at 7:00 am (cdt) i woke up to find my feet caked in dried mud\r\nwith no recall of how it could have happened.\r\n\r\non 8/21/15 i was awaken 3 times during the night due to hear noise\r\ncoming from my living room. the first and second time i checked the living \r\nroom all was normal. however, on the second check, i found myself having a full blown allergy attack (related to hay fever). this could only have occurred if i had been awake and aware for 10 minutes.  the third time i checked the living room was at 4:00am and i found that the dishwasher was going. i felt a strange feeling and said to myself \"they are here again.\" i immediately blacked out. in the morning i woke up 2.5 hours late. i felt\r\nshaky and out of sorts mentally. at 6:00pm i left a message for my sd\r\nindicating i needed help and assistance and it was ufo related. by 7:00pm\r\nmy mental condition was back to normal. i remember feeling very angry\r\nthat something was \"messing with me.\" i just had a benevolent et event on\r\n7/29/15, therefore it didn't make sense that they would come back and start\r\nsneaking around and abduct me twice and leave me in a mentally impaired\r\ncondition.\r\n\r\non 8/15/15 prior to these two events i had been in contact with stan and\r\nlisa romancek to invite stan to speak at a mufon meeting. i had corresponded with lisa to set up the details.\r\n\r\non 8/22/15 contacted lisa romancek to see if anyone else they knew had\r\nsignificant ufo related events after being in contact with them. she\r\nreplied \"yes. many have been contacted in different ways after contact with\r\nus.- they have had sightings, are taken, or begin to have lucid dreams.\r\nit maybe the same group of beings.\"\r\n\r\nin my opinion it could be the same group of beings or it could be milabs. \r\n\r\non 8/23/15 i passed a black light over all my sleeping clothes and bed\r\nlinens. i found florescence on my bathrobe and bedroom entry carpeting.  ","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":69768,"landingOccurred":false,"latitude":44.911336513330575,"location":null,"logNumber":"US-08252015-0016","longitude":-92.981921959031,"occurred":1439794800000,"potentialRelations":[],"rating":"Unrated","region":"Minnesota","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1440507220000,"summary":"Woke up with mud caked feet","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":22,"maxtempi":72,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":63,"minvism":8,"minvisi":5,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":22,"maxtempi":72,"maxvism":16,"maxvisi":10,"meantempm":20,"meantempi":68,"meanvism":16,"meanvisi":10,"mintempm":17,"mintempi":63,"minvism":8,"minvisi":5,"rain":true,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":true,"tornado":false}]}},"zipcode":"55125","daysBetweenOccurrenceAndSubmission":8,"locationName":"Woodbury, Minnesota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10801"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Unknown","city":"Worcester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My wife and i smoke cigarettes on our front porch,  not in home because it's gross and more importantly our children. we have been watching a lot of activities that appears to be airplanes going on in the sky during the day,  and strange lights in the night sky.  i got the sky map application to see if we could identify the lights we have been watching to see if it was a star or what because it's not acting like stars.  could not be identified by the application. very difficult to hold phone steady.  finally asked my dad if he had binoculars and he let us borrow a pair last night. that is when we or i was able to see more closely.  i was using them,  while my wife was using her naked eyes.  what i saw  was just unbelievable.  we kept our eyes in the area of the sky where this object usually appears,  it was not there right away but within a couple of minutes it did appear as it does first as a white looking circle starting off white like a star but pulsating or vibrating and changing sizes and colors.  when i pulled up the binoculars to see closer i could see a large white and red circle that seemed to change like getting more stronger or something,  now remember i am leaving out a lot of details because i am looking for othrs in my area to see if anyone else seen and been seeing what we have.  anyway looking at this large bright changing light all of a sudden went from lrge to so small like a dot flashed or something like that,  my wife's naked eyeys describe what i couldn't see.  the dot then moved straight across a point in the sky,  we use the house one street over to have a point of reference from one side to another and seemed to instantly get large and disappear.  me and my wife were speechless but not it was so amazing in a scary mind opening way and i was so happy i didnt see this alone because no one would believe me.  me aand my wife came in and couldn't stop talking about it and thinkig everything and nothing,  with a lot of fears.  about an hour later about our frequency of smoking a cigarette i came out to the porch wiyh my wife shortly to join when i opened the porch door i looked right away at the spot that this thing is always in and right away i can see its there and it was big and white like usuall this was me looking without the binoculars i verbally said  dont worry dont leave i wont use the binoculars and as i was saying that it went red and flashed and skiped within the first area like a beam of some sort stopped and went to the spot whweree it dissappear bot everything was like a red clearly defined,  unbelievable spectical i ran in because my wife wasn't out there yet and i wanted to tell her so fast what i seen again and thjn she once again told me our first sighting  about an hr earlier  and she told me that what she saw was like a fire like thing comming from below towrds the light i didn't see that i had limmited vision with the binoculars and i can't even believe but i can.  i wish i had some way of having to relly capture a video properly.  thete is alotmore to this a ton of coincidence like lights in my neighbors outside that were flashing all while this was going on the first time and my wife had pointed that out i hadnt notice and when i did it really looked like someone was communicating with someone.  i hope you believe but this is unbelievable. ","distance":"Over 1 Mile, Unknown","duration":"00:11:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Other,Unknown","formattedAddress":null,"id":69767,"landingOccurred":false,"latitude":42.31289712447356,"location":null,"logNumber":"US-08252015-0014","longitude":-71.81851568186897,"occurred":1440457200000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440507135000,"summary":"Red circle that change colors and sizes been watching for a couple months but yesterday finally borrowed binoculars and wow saw this thing do amazing unbelievable things. ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":26,"maxtempi":78,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":7,"meanvisi":4,"mintempm":18,"mintempi":65,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":26,"maxtempi":78,"maxvism":16,"maxvisi":10,"meantempm":22,"meantempi":72,"meanvism":7,"meanvisi":4,"mintempm":18,"mintempi":65,"minvism":0,"minvisi":0,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"01606 ","daysBetweenOccurrenceAndSubmission":0,"locationName":"Worcester, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10802"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Cape Girardeau","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Saw what i thought was an airplane at cruising altitude coming from the south towards the southeast.  except, there were no blinking airplane type of lights.  it was solid white.  it suddenly stopped and another white light appeared.  this light was not initially noticeable.  it just 'turned on'.  the second light merged into the first primary light and then it flew away.....Very quickly.  i've never seen anything disappear that fast.  ","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":69766,"landingOccurred":false,"latitude":37.308183899999996,"location":null,"logNumber":"US-08252015-0013","longitude":-89.5097476,"occurred":1440450900000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1440506856000,"summary":"Bright light is merged with smaller light and disappear.","tags":["lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":67,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":55,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":26,"maxtempi":79,"maxvism":16,"maxvisi":10,"meantempm":19,"meantempi":67,"meanvism":16,"meanvisi":10,"mintempm":13,"mintempi":55,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Cape Girardeau, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10803"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I came out of the garage at 10:05 a.M. with a lawn chair.  clear sky.  i looked up and saw the shiny object which looked like an aircraft, but odd in some way.  i went back in to get the binoculars.  went out back door to relocate it.  looked through binoculars to verify that it had no wings, but it did have a black band around it where the wings should have been.  this could have been some new or experimantal blimp that i am not aware of, but what i saw matches exactly to what others have seen.  it's diameter was maybe 10'+ dia or more. as long as a commercial jet.\r\nit moved steady but not in a hurry. it was just moving. it was on course as if it knew exactly where it was going.  very much as a jet airliner only much slower. i do not have any feelings on this subject. it is what it is. it traveled out of site. this is the second time in two weeks it has been seen by me.  my wife and i both saw it at 7:30 p.M. two weeks ago.  i reported it then also.  reported by a retired school teacher, 62 years of age.\r\n\r\n","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69765,"landingOccurred":false,"latitude":35.5274513,"location":null,"logNumber":"US-08252015-0012","longitude":-86.5785773,"occurred":1440497280000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1440506184000,"summary":"Looking up at the sky, saw it (seen 2 weeks ago) went back in, got the binoculars, checked it up close, saw the same thing as  last time","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10804"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ross","country":"Australia","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Lights and an orb over macdonnell ranges australia\r\n\r\n\r\n\r\n\r\n\r\nin july this year over two weeks, a friend of mine and her fellow university students from  sydney  were doing geological field excursions in and around  the n’dhala gorge, east macdonnell ranges in the northern territory of australia.\r\nthey were staying at a homestead called ross river, which was situated about 65km east of alice springs. in their first week over three nights 13th, 14th and 15thof july they came across a find that was totally out of the ordinary. \r\nwhile returning back to their cabins after dinner, my friend and seven other students witnessed rays of coloured lights (red, blue and yellow) rising up behind the ranges to their southwest .This display lasted for at least thirty minutes. she said over this period the lights would fade and become bright again, and their colours would mix producing more complex colours. unfortunately these lights where over 2km away, too far to get a suitable photo with their  i phones. she said at the time they were all totally bewildered by these lights. after the second and third night of witnessing these lights they decided that the next day they would actually go to the area where these lights were appearing from. when they got there they could not find any evidence at all that would cause the appearance of these lights!                                                                                                                                                             \r\n\r\nbut the best was yet to come. on the night of the 21st of july while again returning to their cabins from dinner, my friend and four other students witnessed a much closer sighting of a bright white orb(see photo) .It was about 500 meters to the north at angle of  45 degrees and was travelling slowly  from west to east, no sound was heard. the orb was roughly the size of your thumb nail with your arm out stretched. she was very lucky to get a photo because the sighting only lasted about 5 seconds. this photo was taken at 8.06 pm. also if you look at the photo i’ve included, you will notice what looks to be like flaring shooting out from the top and bottom of the object and also coming out of the objects left hand side. these are not camera flares, this is what it looked like with the naked eye, according to my friend. and the clincher is, the top and bottom flares were actually ‘horizontal’ before she took the photograph!!! so it actually rotated in a split second into this position just before it disappeared. some of you might say it looks like a full moon but if you check the records it was just over a half moon on the night of the 21st july 2015\r\nshe also said that if you look closely, the orb actually looks slightly oval shaped!\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":69764,"landingOccurred":false,"latitude":-23.733453,"location":null,"logNumber":"AU-08252015-0011","longitude":133.870265,"occurred":1436817600000,"potentialRelations":[],"rating":"Unrated","region":"Northern Territory","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440503605000,"summary":"Rays of lights shinning behind range, also witnessed a white orb with flaring at night lasting 5sec following week ","tags":["lights"],"timeZone":"Australia/Darwin","timeZoneName":"Australia/Darwin","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":42,"locationName":"Ross, Northern Territory","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10805"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover), Unknown","city":"Lawndale","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"\r\ni was laying in the bed trying to go back to sleep watching what i thought was an airplane through my bedroom window (it was bright like a star and seemed to blink) it was about to disappear out of my view and the thing started going the opposite direction and the \"star\" that was near it started moving the same direction with it! no kidding! they were going side to side while moving, then up and down, kinda like a circular pattern, then the second one stopped and the first one caught up to it and they both just sat there in the sky and didn't move anymore except to \"dance\" in a circular motion next to each other. the one on the right appeared to just stop completely and stayed still while the other continued its \"dance\".\r\n\r\nthe hair on the back of my neck stood straight up! that's when i saw two more like them on the opposite side of my yard over the tree tops and they got side by side, then the one on the right appeared to change to a long skinny shape and red in color, took off while the one just stayed there, doing the same pattern and dimming to nearly nothing and getting bright again, it did that several times. i watched until it finally dimmed and disappeared, then i looked over to where the other was and it had disappeared too.\r\n\r\ni tried to go outside to see them closer before they left to get some video with my camera but my dog started barking when i started opening the door. i stopped, he stopped. when i tried to go out again, he barked harshly at me, as if to say no! so i stopped and he settled down. he stayed right at my bedroom window after that, watching and growling.\r\n\r\nhe was fine after they disappeared.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":69763,"landingOccurred":false,"latitude":35.393266235489556,"location":null,"logNumber":"US-08252015-0011","longitude":-81.62369882097377,"occurred":1440473340000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1440491731000,"summary":"4 star like objects, 1 apearing to get longer and turning red while the others stayed white and were in pairs and appearing to mimic each other.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"28090","daysBetweenOccurrenceAndSubmission":0,"locationName":"Lawndale, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10806"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Doraville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Looked out window saw a la large  object moving behind trees it had a very bright red light blinking as it moved. i heard a humming noise before i actually saw it. was moving fast. ","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":69762,"landingOccurred":false,"latitude":33.86284541875951,"location":null,"logNumber":"US-08252015-0009","longitude":-84.22773923361049,"occurred":1440416640000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1440491481000,"summary":"Looked out window saw a really large object with a bright red light flashing in the bottom. moved fast.","tags":["flash","light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":32,"maxtempi":90,"maxvism":16,"maxvisi":10,"meantempm":27,"meantempi":81,"meanvism":16,"meanvisi":10,"mintempm":22,"mintempi":71,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":32,"maxtempi":90,"maxvism":16,"maxvisi":10,"meantempm":27,"meantempi":81,"meanvism":16,"meanvisi":10,"mintempm":22,"mintempi":71,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"3030","daysBetweenOccurrenceAndSubmission":0,"locationName":"Doraville, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10807"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"East Peoria","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Around 430 in the morning i walked out looking northeast over the house three times i saw a sparkly light look like a disco ball got my telescope out 430 in the morning i walked out looking north east over the house treetops . sparkly light look like a disco ball got my telescope and i looked at it was a black circle lights moving around it really fast changing colors there tonight. this is the second night in a row i'm hoping it will be there tomorrow morning\r\n\r\ni lost sight of the object due to trees and the sun coming up and me having to go to work. please contact me the wife has got the pictures on her phone will try and submit them later","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":69761,"landingOccurred":false,"latitude":40.766414942741726,"location":null,"logNumber":"US-08252015-0008","longitude":-89.55401633774838,"occurred":1440480600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1440486838000,"summary":"Look like a disco ball in the sky the center was black and lights going around it constantly changing colors i looked through it through a telescope simply amaze there two nights in a row today is tuesday i'm hoping it'll be there tomorrow would love for ","tags":["lights","disc"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"61611","daysBetweenOccurrenceAndSubmission":0,"locationName":"East Peoria, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10808"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Graham","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving south on meridian street at 1:10 am. while driving i noticed what appeared to be an aircraft with three bright white lights in a triangle pattern and one red flashing light in the center in the sky directly south if my position. \r\n\r\ni have spent the last 12 years as an aircraft mechanic and have worked on and around many aircraft. i am very familiar with how they normally appear at night. at first glance i had assumed this was a normal aircraft, but the white lights were brighter than normal and the craft was moving slowly at what appeared to be a rather low altitude. \r\n\r\ni continued to watch the craft as it crossed in front of me and came to stop just to my right side above a wooded area near the road. i thought this was very abnormal, i pulled off to the side of the road and turned of my radio. i rolled down my windows and opened my sunroof and observed the craft for about 30 seconds. the craft appeared to hover a little above the tree line. judging by the spacing of the lights, the craft appeared to be about the size of a large cargo plane, but since it was stationary i had to rule that out and then considered that it may be a large helicopter. i listened closely for any engine or propeller noise and heard nothing. \r\n\r\nthe craft slowly began to drift north and was blocked by trees. i pulled forward and turned right on 204th st so i could get a better view. i could still see the craft and observed there was a flashing red light on top of it as well. another thing that struck me as odd was that i could still see all three white lights, typically when aircraft move past you, the lights in the front are forward facing and cannot be seen from the rear. after about ten more seconds the craft suddenly appeared to move quickly north and out of view. it remained at a very low altitude the entire time.\r\n\r\nthere is a local airport nearby and i am used to seeing small planes in the area. also, joint base lewis mcchord is not far away and it is not uncommon to see and hear various helicopters. i am completely sure that what i saw was not a normal helicopter or small plane. it was very dark, and i was not able to distinguish the body shape of the craft and could only see the lights. the lights however were very clear and appeared to be within a hundred feet above the trees. the white lights were solid and were visible regardless of what angle i viewed them from. the red lights flashed once followed by a double flash, repeating. there were no other cars on the road, the sky was clear, and it was quiet. \r\n\r\nafter i lost sight of the craft i immediately called a friend that is a pilot and often flies a small plane in the same area. after describing what i saw he suggested it was a c-17, i said it was hovering, he suggested a chinook, i told him it was just above the trees and made no noise, he said he had no idea what that could be and told me perhaps i should go home and get some more sleep.\r\n\r\n i know what i saw, i just don't have a great explanation for it.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":69760,"landingOccurred":false,"latitude":47.0591189,"location":null,"logNumber":"US-08252015-0007","longitude":-122.28504389999999,"occurred":1440465000000,"potentialRelations":[],"rating":"Unrated","region":"Washington","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1440486118000,"summary":"Observed silent ufo slowly flying overhead come to standstill then quickly fly away","tags":["ufo"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"98338","daysBetweenOccurrenceAndSubmission":0,"locationName":"Graham, Washington","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:10809"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Unknown","city":"Qingdao","country":"China","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had a sighting here in jiaozhou, qingdao, shandong, china this saturday. it was spectacular, but i think as with many other sightings, you dont really do much or think much about it after because it simply is an unknown. there is not really any room for assumptions or even considerable thought about it, it is just unknown.\r\n\r\nwe were by a sort of promotional event for the company i work with, in a rather busy supermarket area (lots of tall buildings, neon lights all around, billboards, you get the jist of it).\r\n\r\nsuddenly, with the crescent sienna tinted moon in view to the right, we saw a brilliant multicolored sphere/circle rise from behind the trees to the left of the moon, it rose up across the sky, across over our heads and finally decended (or passed further away) behind the buildings on the other side of the sky. over the course of perhaps 1-2 minutes.\r\n\r\nit was basically like 8 lights in a circular arrangement with 1 central light in the middle as well. all equal size. all attached (i assume). all glowing in different shimmering colors, pink to teal to turquoise to red to yellow to green etc. not synchronized, each light was slighly offset in the color shifts. seemed random.\r\n\r\nit moved slower than a jet, but faster than a balloon.\r\nit certainly was no helicopter or aircraft, because nobody in their right mind would set up those kind of lights on an aircraft (nor would the local military airbase in this city allow that, obviously).\r\nyes, there is a local airbase in the smack middle of this town, usually you see mig's flying low over the town, sometimes in wingman formations, engines roaring on full afterburners, its quite glorious xd\r\n\r\nas this happened though, as the lights passed overhead slowly, sort of with the same speed and \"awe\" as in close encounters of the third kind, you know. how the speed is sort of intentionally slow enough to allow people to observe it, but fast enough not to linger too long? idk.\r\nanyway as this happened, first all the kids in the area pointed to the sky and gasped and said \"woah! how beautiful!!\" (in chinese obviously). as about 60-80 kids have this reaction, naturally the adults paid attention as well, and then we have about 100-150 grown men and women also staring up at this thing gasping at what it is.\r\n\r\nand then as it passed behind the nearby supermarket skyscraper, the show went on. the night went on as if nothing happened. because thats life on earth, right? we all have a job to do, plans to finish, i mean.. what else would you do? sit on the ground and let moss grow on you?\r\n\r\nso thats it, it was simply an unknown, witnessed by almost everyone there. but as annoying and frustrating as it is with these things, it just remains \"unknown\". i cant say what it was. i wanted to know for sure, that it was something spectacular, you know.\r\nbut i cant lie to myself like that, the only truth i know is that it was an unknown, a true ufo.\r\n\r\nsome argue that there is a conciousness aspect to it as well, if it is a real sighting. that you can kind of \"feel\" the intelligence there. well, when being surrounded by hundreds of people who point to the sky and gasp, i suppose that is kind of a conciousness aspect, but not from \"that\" direction, more just from the human direction.\r\nso, i dont know..","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile, Unknown","duration":"00:02:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69759,"landingOccurred":false,"latitude":36.26468,"location":null,"logNumber":"CN-08252015-0006","longitude":120.033382,"occurred":1440273600000,"potentialRelations":[],"rating":"Unrated","region":"Shandong","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1440485424000,"summary":"8 lights in circular arrangement, 1 central light, equal size. overflying large crowd near qingdao, china. all witness it.","tags":["lights"],"timeZone":"Asia/Shanghai","timeZoneName":"Asia/Shanghai","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Qingdao, Shandong","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10810"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Bakersfield","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am still being tracked/minipulated and decieved everyday since the sighting. it seems an extreme interest has been taken into me and getting me to sleep seems to be task # 1 amongst others.  i constantly see outlines and shadows and the wave energy/gravitational atmospheric distortion (resembling refraction) of their invisible tech that is only senced by my perifrial vision and a feeling of magnitism,also senced by my dog. eiry and unusall sounds fill the days noises also heard by other  people and animals. i have many more realizations and accounts of this entity and its seems to be malevolant and has only increased in its interest in me and has even answerd inaudible questions with the minipulation of lights in the room. please help me with this.  prayer doesnt seem to help and i need to try a different form of energetic defense. this is a knowing that my family cant sence conciously but i can tell that subconciously they feel something happening around them.  how couldnt they with the ammount of other dimensional activity going on around them everyday.  i feel like a target and that they might be waiting for me to go into the darkness alone or they might have already taken me in the night and the  only defense ive mounted is the fact that ive divulged info about them and doing something drastic could jepordize their viel of secrecy.....  please contact me and help me get my life back. ..   i can see them and feel them poking body whenever i try to ignore it and live my life. i can elaborate on every instance and give many more examples of observations that seem to increase in awarness and blantency.... ","distance":"20 Feet or Less","duration":"00:00:01","entityEncountered":true,"favorited":0,"features":"None","flightPath":"N/A","formattedAddress":null,"id":69758,"landingOccurred":false,"latitude":35.29369013354389,"location":null,"logNumber":"US-08252015-0005","longitude":-119.06256893122772,"occurred":1439769600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"N,  A","source":"MUFON","status":null,"submitted":1440474536000,"summary":"It was a definant first hand sighting of a small being i beleive to be transdemsional.  aprox. 1-3 feet tall, slinder build, without clothes, and a larger proportioned head. i hid behind a bush untill i un intentionally did a double take and saw it run.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":43,"maxtempi":109,"maxvism":16,"maxvisi":10,"meantempm":34,"meantempi":93,"meanvism":13,"meanvisi":8,"mintempm":24,"mintempi":76,"minvism":3,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":43,"maxtempi":109,"maxvism":16,"maxvisi":10,"meantempm":34,"meantempi":93,"meanvism":13,"meanvisi":8,"mintempm":24,"mintempi":76,"minvism":3,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"93313","daysBetweenOccurrenceAndSubmission":8,"locationName":"Bakersfield, California","triangle":false,"type":"Alien Encounter","$$hashKey":"object:10811"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Quincy","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was fall. my mother had asked me to take out the dog. i put the dog on her leash and went out into our large backyard. i was outside for a few minutes. then noticed the huge ufo hovering over the tree i was standing under. i never saw or heard it coming. it never made any noise. i just stood there staring up at it, i am not sure really how long. long enough though that my mom walked to the patio door to check on me. i heard the door slide open, looked at my mom, looked back up, and it was already a mile away. it was shooting south and was gone in a couple seconds.","distance":"21-100 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":69757,"landingOccurred":false,"latitude":39.922977752634026,"location":null,"logNumber":"US-08252015-0004","longitude":-91.37926509362751,"occurred":370728000000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440472520000,"summary":"Hovered at tree top directly above me.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":32,"maxvisi":20,"meantempm":25,"meantempi":77,"meanvism":16,"meanvisi":10,"mintempm":19,"mintempi":66,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":31,"maxtempi":88,"maxvism":32,"maxvisi":20,"meantempm":25,"meantempi":77,"meanvism":16,"meanvisi":10,"mintempm":19,"mintempi":66,"minvism":10,"minvisi":6,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"62301","daysBetweenOccurrenceAndSubmission":12381,"locationName":"Quincy, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10812"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Edmonton","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While sitting outside my rv i noticed a flashing object north of where i was standing. \r\nthe object was slowly moving in various directions and increasing and decreasing elevation. \r\nit then began to move west from where i first seen it still flashing and what seemed to become a wobble. changing from a bright light on the bright side to a darker side. \r\nit then continued to change course again to a northerly direction and decreased elevation until i couldn't see it any longer behind some trees.  ","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Other","formattedAddress":null,"id":69756,"landingOccurred":false,"latitude":53.546009000000005,"location":null,"logNumber":"CA-08252015-0003","longitude":-113.4820467,"occurred":1439378400000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440463555000,"summary":"North west edmonton alberta sighting","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/69756_submitter_file1__0S2A1836.MOV","http://www.mufoncms.com/files_jeud8334j/69756_submitter_file2__0S2A1837.MOV"],"weather":{"history":null},"zipcode":"0","daysBetweenOccurrenceAndSubmission":12,"locationName":"Edmonton, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10813"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Gold Hill","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My husband and i had just come home from town. we were having dinner on the front deck of our home that faces east.  we both looked up at the same time and observed a white ball shaped object traveling from west to east.  we used binoculars and a 600x zoom camera to observe the object.\r\n\r\nthere were no blinking lights, no sound, and it was too low for a satellite. we also observed how slow it was traveling. after about 4 minutes, the object turned red and got extremely small in an incredible amount of time.\r\n\r\ni will not submit evidence, as the last time i did, it went viral on youtube and i gave no permission.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69755,"landingOccurred":false,"latitude":42.456095852037805,"location":null,"logNumber":"US-08252015-0002","longitude":-123.03189488253905,"occurred":1439942400000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440464275000,"summary":"White ball passing over head extremely slowly, then speeded up and disappeared after turning from white to red.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":39,"maxtempi":102,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":11,"meanvisi":7,"mintempm":16,"mintempi":61,"minvism":6,"minvisi":4,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":39,"maxtempi":102,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":11,"meanvisi":7,"mintempm":16,"mintempi":61,"minvism":6,"minvisi":4,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"97525","daysBetweenOccurrenceAndSubmission":6,"locationName":"Gold Hill, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10814"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Hamilton","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Unexplained activity over stoney creek/hamilton ontario.  over two occasions i have witnessed strange lights happening throughout the month of august 2015.  in particular on the night of august 22, 2015 around 8:00pm i was walking the dog when i noticed two strange lights glowing in the sky coming towards my direction.  at first i dismissed the lights as planes but once the lights got closer it grabbed my attention as something else.  as i stopped walking to observe the lights, coincidently the lights stopped moving as well.  once i begin walking towards the lights they started to move away in the opposite direction from me and slowly began to fade until it eventually disappeared.  i continued my walk and minutes later both lights reappeared out of nowhere and once again the two lights were at a standstill hovering in the sky.  \r\n\r\nwhen i reached the school park a group of teenagers were there but unaware of what was happening in the sky.  i approached the kids and brought there attention to the lights in the sky to at which point we were all observing the lights together.  i then decided to quickly walk back home to drop the dog off and got into my vehicle and headed up the escarpment to get a broader view of the city and to see if i could catch the lights and where they were heading.  \r\n\r\nit didn't take me long to find the lights as they appeared everywhere (20-30 orbs of lights now at my eye level) in the northwest direction over the stoney creek and hamilton skyline.  at the initial first viewing upon heading up the mountain the lights were together in a cluster hovering in the sky, not moving and what i would describe as looking like frozen fireflies until they all started to move around making all sorts of shapes and patterns in the sky.  at times there were approximately 20-30 lights then it decreased to around 10 lights.  at one point only three lights were visible forming into a triangle.  the lights would then all reappear and at one point formed into what looked like the dna structure.  \r\n\r\nit appeared as if the lights were trying to tell a story and communicate by patterns and shapes.  at one point it felt as if the lights were trying to send me a direct message.  \r\n\r\nthe lights were continuously disappearing/reappearing and reforming shapes for about a half an hour with me getting in and out of the car multiple times due to anxiety and excitement.  at another point i observed three additional orbs of lights rising simultaneously from behind the houses/horizon (roughly around hamilton harbour) and joined the other lights.  the lights eventually all disappeared quickly except for one which faded away slowly.     \r\n\r\nwhile this was all happening, i tried phoning family and friends but was having difficulty holding onto a connection to having no signal at all.       \r\n\r\na couple of days before the event i had a overwhelming feeling inside of me of some sort of presence that would make itself aware to me.  ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Straight-line path","formattedAddress":null,"id":69754,"landingOccurred":false,"latitude":43.2348082,"location":null,"logNumber":"CA-08252015-0001","longitude":-79.7181086,"occurred":1440201600000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440462673000,"summary":"Unexplained activity over stoney creek/hamilton ontario.  massive ufo sighting ","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":null},"zipcode":"0","daysBetweenOccurrenceAndSubmission":3,"locationName":"Hamilton, Ontario","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10815"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Boston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In yard saw attractive bright light shuddering and moving rapidly looked like in sequence of dropped elevation. lasted about 2 seconds and went over a mile. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69753,"landingOccurred":false,"latitude":42.35318524453796,"location":null,"logNumber":"US-08242015-0030","longitude":-71.0562254427257,"occurred":1440459000000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440460094000,"summary":"Sitting in back yard saw a white flash across the sky extremely fast that fluttered and then disappeared.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"02127","daysBetweenOccurrenceAndSubmission":0,"locationName":"Boston, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10816"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Raleigh","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Was a passenger in a car heading south as sun was setting, looking at a cloud with sun rays all around that got my attention how awesome it looked. saw a white oval blob shape resembling a car hovering just above cloud. after about 8 seconds it instantly disappeared.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":69752,"landingOccurred":false,"latitude":35.785279700000004,"location":null,"logNumber":"US-08242015-0029","longitude":-78.6284787,"occurred":1440445800000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1440458851000,"summary":"White car-shaped blob above cloud hovered and disappeared","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Raleigh, North Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10817"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Sackville","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Three friends and i were walking through the woods of our small rural town one day after high school. we decided to go the gravel pit nearby and climb atop one of the huge mounds of gravel for fun. incidentally, this also put us above the tree line for a good view. we were sitting atop the gravel pile just chatting and hanging out, around the time of dusk. it was not dark at all, but certainly not fully light either. as i was looking towards the horizon above the tree-line, i noticed a really big bright white \"star\" right on the horizon, or what i thought to be a star at first, just above the tee line. being quite familiar with the sky, this object looked out of place to me. no stars were at this position at this time of the day/month, at this brightness, nor did this look like some far away street or house lights. i looked at it for about a minute, then i pointed to it brought it to the attention of my 3 friends. slowly, it started moving up from the horizon to the right, held its position, retaining the same point like, bright, white light qualities. it then began moving across the sky to the left, and held its position. i remember thinking \"heck, this isn't a star, but what kind of craft can do that sort of maneuver, planes and jets have to fly strait and can't stop\". \r\n\r\nwe were all watching at this point. then it started getting bigger as if it were moving closer and we realized it was coming towards us. as it got closer we realized it was not one light, but three lights in a triangular form on a clearly outlined dark black \"craft\"  (i believe the three lights, appeared blurred into one white light at first, because it was too far for our eyes, and upon coming closer we were able to view it correctly). the craft came directly at us and proceeded to move directly in front of us, above our heads, at an extremely low altitude, at a height i would roughly estimate to be a 100-200ft. there was no sound. nothing. no combustion process whatsoever, no exhaust trail. just what seemed like the sound of an object moving through the air, almost inaudible. it was completely black and i couldn't make out any surface features on the object, except for 3 lights, one on each corner. it slowly flew over and past us, maybe at about a speed of 40-60km/hr. then it just proceeded to move out of sight towards the horizon at the same speed.\r\n\r\nwe were completely wild and distraught, stunned and bewildered at what we had seen. we realized this was something truly unconventional. i think about this incident quite often, and have even driven back out to the spot with one of the witnesses.  only now have i felt compelled to say something about it -- was this advanced military technology, or other-worldly?","distance":"101-500 Feet","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":69751,"landingOccurred":false,"latitude":45.89121127990983,"location":null,"logNumber":"CA-08242015-0028","longitude":-64.40837250636734,"occurred":1084147200000,"potentialRelations":[],"rating":"Unrated","region":"New Brunswick","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1440458663000,"summary":"Silent, large, dark black triangle flew over the heads of 3 friends and i, at a low elevation. ","tags":["triangle"],"timeZone":"America/Halifax","timeZoneName":"America/Halifax","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":4123,"locationName":"Sackville, New Brunswick","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:10818"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Cherry Valley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Directly above 5 people , round pulsating several colors . ( myselk ,two sons    sons & two  friends,  one of these friends had polorid pictures of him {charlie) his pickup & a hovering ufo. he would not let me have picture. earlier in the evening he said he could call in ufo . i thought he was nuts. then thrre it was right above us. i never reported the ufo sighting because i worked at lockheed propulsion in mentone calif.","distance":"101-500 Feet","duration":"00:20:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":69750,"landingOccurred":false,"latitude":33.96465122987369,"location":null,"logNumber":"US-08242015-0027","longitude":-116.98359575274759,"occurred":109023600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440456992000,"summary":"Hovered above house approx 20 min lett at richt angle  & dissapered","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":22,"maxtempi":72,"maxvism":8,"maxvisi":5,"meantempm":15,"meantempi":59,"meanvism":5,"meanvisi":3,"mintempm":9,"mintempi":48,"minvism":3,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":true,"hail":false,"maxtempm":22,"maxtempi":72,"maxvism":8,"maxvisi":5,"meantempm":15,"meantempi":59,"meanvism":5,"meanvisi":3,"mintempm":9,"mintempi":48,"minvism":3,"minvisi":2,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"sanberdino","daysBetweenOccurrenceAndSubmission":15410,"locationName":"Cherry Valley, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10819"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Plum","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Ufo take off","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":69749,"landingOccurred":false,"latitude":40.5003456,"location":null,"logNumber":"US-08242015-0026","longitude":-79.7494911,"occurred":1440362760000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440454526000,"summary":"Ufo take off","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/69749_submitter_file1__MyMovie.mp4jcw82315.mp4"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":70,"meanvism":16,"meanvisi":10,"mintempm":16,"mintempi":60,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":28,"maxtempi":82,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":70,"meanvism":16,"meanvisi":10,"mintempm":16,"mintempi":60,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Plum, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10820"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Ballston Spa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I went out of my apartment onto my steps landing outside to have a cigarette. i sat in my chair and looked out at the sky as i usually do. it was 8:25pm edst and it was well into dusk with a large dark cloud directly ahead of me with edges of light sky framed against the large hills across the valley. a minute went by when i noticed an orange glowing object come into view around the corner of my building. it was traveling about the speed of a small plane and making no sound that i could hear.(there is a small airport across the valley where i see small planes and jets take off and land all the time. i can't actually see the airport because of the small hill and treeline.) when i saw this glowing object i got very excited and ran into the house to get my cheap camera. i came back out and it had stopped moving south and was apparently hovering for a few minutes. it seemed to be in the approximate area near the airport or a little bit closer to me. i struggled to find a setting to capture some pictures and snapped some, but my hands were shaking so i was getting light trails instead of a solid object. (i had put the setting on fireworks.) after a few photos the object then rose up into the dark cloud overhead and i lost sight of it immediately. i stayed out hoping to get a glimpse of it again when it came out of the edges of the big cloud but i never saw anything of it after that. i have tried to download my pics, but i am not very good with electronics. the pics are in my windows media pics and not in my normal picture storage for some reason. ","distance":"Over One Mile","duration":"00:04:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":69748,"landingOccurred":false,"latitude":43.00495096386584,"location":null,"logNumber":"US-08242015-0025","longitude":-73.81574626562481,"occurred":1440361500000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1440448884000,"summary":"Witnessed a fiery orange object come from the north. it came into my view as it cleared the edge of the building corner.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":84,"maxvism":16,"maxvisi":10,"meantempm":24,"meantempi":76,"meanvism":16,"meanvisi":10,"mintempm":21,"mintempi":69,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":29,"maxtempi":84,"maxvism":16,"maxvisi":10,"meantempm":24,"meantempi":76,"meanvism":16,"meanvisi":10,"mintempm":21,"mintempi":69,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"12020","daysBetweenOccurrenceAndSubmission":1,"locationName":"Ballston Spa, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10821"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Casa Grande","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Next day back about same time. lights flew slowly south east. turned all lights off. later all on about ten miles south east then off again. saw one craft in colorado with three lights. it climbed up and down. went down fast then stopped in air, at that time a noise of metallic bang. it hovered. got bored and went about business. could be man made hover craft. neither sightings had high speed, lights did not rotate. colorado lights during day. i guess so someone on ground could see it.","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":69747,"landingOccurred":false,"latitude":32.8830822,"location":null,"logNumber":"US-08242015-0024","longitude":-111.7533221,"occurred":1439665200000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1440446809000,"summary":"Three objects emitted three lights apiece, one would shine lights then turn them off, then the middle would shine same then off, third also. then all three shined together. middle one kind of tilted a little, all hovered. then all turned lights off. next ","tags":["lights"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":44,"maxtempi":111,"maxvism":16,"maxvisi":10,"meantempm":36,"meantempi":96,"meanvism":16,"meanvisi":10,"mintempm":28,"mintempi":82,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":44,"maxtempi":111,"maxvism":16,"maxvisi":10,"meantempm":36,"meantempi":96,"meanvism":16,"meanvisi":10,"mintempm":28,"mintempi":82,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"85122","daysBetweenOccurrenceAndSubmission":9,"locationName":"Casa Grande, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10822"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Ellington","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Going to the gas station.\r\ni just saw it in the sky.\r\nfirst thought was a ufo but was sceptical thinking it might be a plane .\r\n","distance":"101-500 Feet","duration":"00:15:01","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":69746,"landingOccurred":false,"latitude":41.881833854506674,"location":null,"logNumber":"US-08242015-0023","longitude":-72.50520937232878,"occurred":1440444900000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1440446682000,"summary":"First i saw a cigar shaped object in the sky bright whiter whiter than any plane i've ever seen then saw another and another the n saw 3 in a triangle shape one appeared red","tags":["triangle"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ellington, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10823"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Altoona","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Investigator beverly trout is entering this report with consent from witness, who phoned trout 5 minutes after incident occurred at 9:10 p.M. on friday, 8/21/2015.  witness was standing on 2nd storey deck looking ne when he saw airplane traveling w to e.  he then noticed a red mist-like object below the plane's elevation, which was the apparent size of a full moon at 38 degrees elevation speeding from se to nw.  as it traveled, object seemed to phase into red dots, then midway in the 60 degree transit, was perceived as a transparent/translucent triangle with red lights, all of this taking place within an estimated 3 seconds.  witness then went into house and was back out on the deck within a minute or two, and at 9:11 or 9:12 p.M. a 2nd object (or a re-run of the first object?) traveled the exact same flight path, going through the exact same \"phasing\" as the first object's transit.  witness has had previous sightings of ufos.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69745,"landingOccurred":false,"latitude":41.64836039404624,"location":null,"logNumber":"US-08242015-0022","longitude":-93.48067505434318,"occurred":1440191400000,"potentialRelations":[],"rating":"Unrated","region":"Iowa","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1440445522000,"summary":"Two objects apparent size of full moon traveled 60 degrees from se to nw one minute apart in 3 seconds","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":80,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":70,"meanvism":16,"meanvisi":10,"mintempm":16,"mintempi":60,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":27,"maxtempi":80,"maxvism":16,"maxvisi":10,"meantempm":21,"meantempi":70,"meanvism":16,"meanvisi":10,"mintempm":16,"mintempi":60,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"50009","daysBetweenOccurrenceAndSubmission":2,"locationName":"Altoona, Iowa","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:10824"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Sullivan City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While swimming in the pool with my mother and a friend we witnessed a bright light coming from the northwest flying towards the southeast, once the object was directly on top of us, another light appeared right behind it following it in the same direction. only 2 minutes later another light popped up flying from southwest to north east. finally a fourth light appeared to be going in the same direction as the first 2.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering,Other","formattedAddress":null,"id":69744,"landingOccurred":false,"latitude":26.2775706,"location":null,"logNumber":"US-08242015-0021","longitude":-98.56363300000001,"occurred":1440365400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440444697000,"summary":"Four ufo's following each other in same path.","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":38,"maxtempi":100,"maxvism":16,"maxvisi":10,"meantempm":33,"meantempi":91,"meanvism":14,"meanvisi":9,"mintempm":28,"mintempi":82,"minvism":8,"minvisi":5,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":38,"maxtempi":100,"maxvism":16,"maxvisi":10,"meantempm":33,"meantempi":91,"meanvism":14,"meanvisi":9,"mintempm":28,"mintempi":82,"minvism":8,"minvisi":5,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"78595","daysBetweenOccurrenceAndSubmission":0,"locationName":"Sullivan City, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10825"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Biloxi","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While i was on break at work,i was texting a friend of mine and told them i was overlooking the gulf and watching a dolphin in the water. i snapped this photo and zoomed in on the dolphin swimming. i then scrolled up to the clouds to look at them while zoomed in and found something unusual. coming out of the center cloud, bottom left side there is a strange object jetting through the clouds. also to the very left there seems to be another aircraft which, imo was a helicopter, but i'm not sure. i did not see this object or objects until after the picture was taken, had i known i would've taken more. i did however take another photo five minutes after discovering those objects but did not see anything else. you must zoom in to these. i was hoping that maybe you can analyze these and maybe produce a better photo. thank you very much for your help and time","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":69743,"landingOccurred":false,"latitude":30.3933314,"location":null,"logNumber":"US-08242015-0020","longitude":-88.930674,"occurred":1440089040000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440444282000,"summary":"I snapped this photo while on break and found this in the clouds, though you could research and let me know ","tags":["photo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/69743_submitter_file1__image.jpg"],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":32,"maxtempi":89,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":16,"meanvisi":10,"mintempm":25,"mintempi":77,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":32,"maxtempi":89,"maxvism":16,"maxvisi":10,"meantempm":28,"meantempi":82,"meanvism":16,"meanvisi":10,"mintempm":25,"mintempi":77,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"39531","daysBetweenOccurrenceAndSubmission":4,"locationName":"Biloxi, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10826"},{"address":null,"addressResolution":null,"altitude":"Treetop, 500 Feet or Less","city":"Youngstown","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"As i was driving west on midlothian blvd at about 5:40am i noticed a light above the entrance ramp to the freeway.  from a distance it looked like a helicopter but as i drove closer i could see the lights better.  the lights formed a triangle shape with a white light in each corner and one in the middle and a red light right below the middle light. it was stationary at about the height a helicopter would fly but it was close enough to me that i would definitely  be able to hear it as a helicopter.  it made no noise and as i drove past it never moved it stayed completely stationary until i made it down the road and it was out of my line of sight.  i am familiar with this route as i take it to work everyday and i have never seen anything quite like it before.  a coworker lives in the neighborhood in the distance behind the spot where i saw it and he stated that he heard a loud crash at about 3-330 am and he went outside and sat on his back porch and saw the lights about the same time i did.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":69742,"landingOccurred":false,"latitude":41.1079003,"location":null,"logNumber":"US-08242015-0019","longitude":-80.6433394,"occurred":1440135600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1440443404000,"summary":"Shape of triangle with white lights in each corner and a red light in center, no noise and didn't move ","tags":["triangle","lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":25,"maxtempi":77,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":64,"meanvism":16,"meanvisi":10,"mintempm":11,"mintempi":51,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":25,"maxtempi":77,"maxvism":16,"maxvisi":10,"meantempm":18,"meantempi":64,"meanvism":16,"meanvisi":10,"mintempm":11,"mintempi":51,"minvism":16,"minvisi":10,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"44515","daysBetweenOccurrenceAndSubmission":3,"locationName":"Youngstown, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:10827"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Long Beach","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I witnessed a strange light emanating from the moon, i grabbed my camera and took photos of the moon which captured the light and then i noticed two orbs which appeared behind the moon that moved very quickly in all directions (see photos). i figured since the activity was over the ocean, i directed my camera towards los angeles and i captured the collection of orange lights over the city. this happened all within an hour. the photos i took were taken seconds apart and capture the orbs motion. did anyone else see this last night? ","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":69741,"landingOccurred":false,"latitude":33.7745004,"location":null,"logNumber":"US-08242015-0018","longitude":-118.18425950000001,"occurred":1440374400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1440442682000,"summary":"Orbs around the moon, moon eminating light and orange lights over los angeles","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/69741_submitter_file1__IMG20150824241256809HDR.jpg","http://www.mufoncms.com/files_jeud8334j/69741_submitter_file2__IMG20150824241246515HDR.jpg","http://www.mufoncms.com/files_jeud8334j/69741_submitter_file3__IMG20150824241015659HDR.jpg","http://www.mufoncms.com/files_jeud8334j/69741_submitter_file4__IMG20150824240644091HDR.jpg","http://www.mufoncms.com/files_jeud8334j/69741_submitter_file5__IMG20150824240617285HDR.jpg"],"weather":null,"zipcode":"90802","daysBetweenOccurrenceAndSubmission":0,"locationName":"Long Beach, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:10828"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Goodyear","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I found myself standing on back patio (facing west) watching object in sky coming right towards me (25 mph?) from the northwest heading northeast. i think it was just around 4:00 am-4:45 am (it wasn't totally dark. seemed like was just before it got light, before the sun rose). i do not remember walking outside. i was just \"there\" on the patio. i was concerned that it would hit high tension wires but it didn't. it flew just above them. there was no landing gear. the cockpit was a small tinted black dome. i could not see in. i thought \"i wonder if they can see me.\" and \"i wonder if i should be scared.\" i heard low sounding but a little high-pitched jet-like sound - like a water cooling system moving through the pipes on the bottom of the craft. the entire object was a grey-greenish color. the \"pipes\" on the bottom were like large 10\" pvc pipe. the pipes were not all over but rather along the underside edge of the sides\"wings?\" and maybe across the middle. there were absolutely no markings (usa, air force, etc.) that i saw (and i had a pretty close view).\r\n\r\ni thought it might have been a military craft from luke air force base but then thought \"why would they take this path, the normal practice path (for f16s, etc.) is to the west of me and goes from north to south.\"\r\n\r\ni think there was a random light blinking, very occasionally (can't remember where it was on the craft) that i saw when i first saw it. it only blinked 2 or 3 times. i do not remember what color it was.\r\n\r\nit passed right over me and i was in awe of how close it was and slow it was moving. i remember thinking \"from wing to wing, it must span 4 or 5 houses.\"  i just watched it continue on and went back under my covered patio just before it was out of my sight. if i wanted to see it disappear, i would had to have put on shoes because my yard was gravel. i walked out but it hurt my feet so i came back to the patio. i do not remember going back inside to bed.\r\n\r\ni remember waking up a little groggy but very quickly felt extremely rested. the thought of what i saw popped into my mind within 10, maybe 15 minutes after i woke up. i laughed and said \"boy, maybe i was abducted.\" but quickly dismissed the idea.\r\n\r\nduring the sighting was more curious and a bit excited than scared. i never felt the need to panic. i do not take drugs. i was not on any medication. i drink wine on occasion but remember thinking \"glad i didn't drink any wine, last night, so i can remember this.\"  i felt very safe. i have never recounted this story online - i may have told a few friends - who either didn't care or didn't believe me. feel free to email/call me.  kind regards,\r\npatti hansen","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":69740,"landingOccurred":false,"latitude":33.33496501434452,"location":null,"logNumber":"US-08242015-0017","longitude":-112.44850470652507,"occurred":1262234700000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1440438669000,"summary":"Found myself standing on patio watching object in sky come towards me (25 mph?). i was afraid it would hit high tension wires. no landing gear. cockpit was a tinted black dome. i could not see in. i heard jet-like sound - like a water cooling system.","tags":["sound","landing"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":{"history":{"dailySummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":18,"maxtempi":64,"maxvism":32,"maxvisi":20,"meantempm":11,"meantempi":52,"meanvism":32,"meanvisi":20,"mintempm":4,"mintempi":39,"minvism":32,"minvisi":20,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}],"dailysummary":[{"snowfallMillimeters":0,"fog":false,"hail":false,"maxtempm":18,"maxtempi":64,"maxvism":32,"maxvisi":20,"meantempm":11,"meantempi":52,"meanvism":32,"meanvisi":20,"mintempm":4,"mintempi":39,"minvism":32,"minvisi":20,"rain":false,"snow":false,"snowfalli":0,"snowfallm":0,"thunder":false,"tornado":false}]}},"zipcode":"85338","daysBetweenOccurrenceAndSubmission":2062,"locationName":"Goodyear, Arizona","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:10829"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":662}
