{"content":[{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Aurora","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"A light that disappeared","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":62963,"landingOccurred":false,"latitude":39.6728223,"location":null,"logNumber":"US-01292015-0019","longitude":-104.8684545,"occurred":1422576180000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1422601396000,"summary":"Saw it north on parker road","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62963_submitter_file1__20150129170114.mp4"],"weather":null,"zipcode":"80016","daysBetweenOccurrenceAndSubmission":0,"locationName":"Aurora, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63436"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Keizer","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Beautiful summer morning.About 10:00 am.Looking at the sky and there it was. just sitting there for a minute or so. afraid to tell anyone but my wife. it was gone when i looked around to see if it was a reflection off a air plane.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":62962,"landingOccurred":false,"latitude":44.976771922986245,"location":null,"logNumber":"US-01292015-0018","longitude":-123.02441306531739,"occurred":774687600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1422600456000,"summary":"It was just there to the right of a cloud.","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"97303","daysBetweenOccurrenceAndSubmission":7498,"locationName":"Keizer, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63437"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Mesa","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"[link moved to fi section/cms/tg]\r\n\r\nyou will be seeing 2-3 glowing orbs over mesa/salt river reservation in arizona. as i watched in awe, it looked like energy was charging up and the orb was flashing various colors, then my camera got blurry and the focus stopped working. it almost seemed as if it were some sort of energy like pulse. the orbs aligned into triangular formations as well as a line. previously to starting video there was 4 orbs that moved fast across the sky in a way that i could only say compares  to a star realigning in the sky. at the end the orbs grew closer and combined into one orb that ended up fading out and slowly grew harder to see.\r\n\r\nthis video was captured by [name removed/cms/tg]\r\n\r\nthis video is copyright approved ©","distance":"Over One Mile","duration":"00:35:00","entityEncountered":false,"favorited":0,"features":"Wings, Unknown","flightPath":"Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":62961,"landingOccurred":false,"latitude":33.4241643,"location":null,"logNumber":"US-01292015-0017","longitude":-111.8233424,"occurred":1422414900000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422597957000,"summary":"[link moved to fi section/cms/tg]","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Mesa, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63438"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Deepcar","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In mid october 1996 (date unsure)i was a uniformed police officer with\r\nsouth yorkshire police working in sheffield.At the time of the incident  stationed at deepcar police station.This is in the north of the city\r\nand covers a rural area which borders the peak district national park.\r\n\r\nin the early hours of a night shift (say between 0300 to 0400hrs) i was\r\nout on mobile patrol duties unaccompanied in a marked police vehicle (a\r\ndiesel engined land rover defender model) and in st.Margaret avenue\r\ndeepcar when i had noticed a male on foot near some dwelling houses\r\nwho i decided to confront about his presence on the street at that time\r\nof day.In turning the vehicle around to confront the male he had then\r\ndisappeared from my view.I decided to park and wait in the street to\r\nsee if the male re appeared again.\r\n\r\nwhilst waiting and carrying out my observations for the male a short\r\nwhile later my attention was attracted to an incident on my horizon in\r\nthe night sky ahead of me.What i saw was something ahead of me in the\r\nnight sky that was projecting a white beam of light similar to a\r\nsearchlight downwards towards the ground at an angle.I would estimate\r\nthe event (craft) to be 1.000 yards or more ahead of me in the north.\r\n\r\ni believed it to be taking place above or near the a616 stocksbridge\r\nby pass road which has (had) a bad history of vehicular accidents with\r\nfatalities.So i was concerned about my sighting.However i had had no\r\nradio messages relayed to me that any incident was taking place in the\r\narea.I was carrying a police uhf (ultra high frequency) personal radio\r\nand the vehicle was fitted with a vhf (very high frequency) radio.Both\r\nof these radios were operating on different radio channels.\r\n\r\nat that time all i could see was a beam of white light being projected\r\ndownwards towards the ground at an angle.I could see no other lights\r\nat that time.I could not see any shape or form of what (craft) the\r\nlight was being projected from.All i could see was a black sky with no\r\nlight pollution at that location.My own position was at an elevated\r\nposition in deepcar and the event was ahead of me on the horizon\r\nwhich meant that if it was taking place over or near the a616 road\r\nit was obviously quite elevated at that location (which is down hill\r\nfrom my viewpoint).\r\n\r\ni was concerned about the appearance of what appeared to be a search\r\nlight from the night sky.I could hear no noise from the sky at that\r\ntime.I knew that (at that time) the south yorkshire police helicopter\r\nsy99 was actually based in west yorkshire and did not (then) fly\r\nafter midnight unless it had some dire justification for a night\r\nflight after midnight.Despite what i knew my thought was that it may\r\nhave been a police helicopter using a searchlight ahead of it.\r\n\r\ni then used my uhf radio to contact the control room at ecclesfield\r\npolice station sheffield about my sighting and to ask whether the\r\npolice helicopter had been scrambled to any incident taking place\r\non or near the a616.I also used my vehicle vhf radio to contact\r\nforce operations room at police headquarters sheffield.I was told\r\ncategorically that the force helicopter was grounded at base.\r\n\r\nduring my radio transmissions i had continued to observe the event\r\nahead of me on the horizon.This may have lasted several minutes.\r\n\r\nwhat startled me was that when i made the radio transmissions (it\r\nmay have been coincidence or not-i personally do not think it was)\r\nthe beam of light switched off and then i suddenly became aware\r\nthat something of a vast size and dark in colour suddenly moved \r\nquickly towards me in a straight line and was then directly above\r\nmy vehicle in st.Margaret avenue.I heard no sound of any craft\r\napproaching me.The move was very quick for the distance traveled\r\nfrom the horizon.I saw no lighting or any illumination on the\r\nobject as it approached.I could just differentiate that there was\r\na large dark object moving in the dark sky directly towards me.\r\n\r\nthe next thing i knew was that as i was still seated in the police\r\nvehicle the whole street around my vehicle was suddenly illuminated\r\nby a fantastic bright blue light which was clearly coming from \r\ndirectly above my vehicle in the night sky.I had never experienced\r\nany such light before or since.It was similar to an intense blue\r\nneon sign light.Sodium street lighting was illuminated in the street\r\nat the time but this blue light was tremendous in its power.I bet\r\nyou could have found a needle on the road it was so intense.\r\n\r\ni sat in the land rover with the engine running (it did not stop\r\nat all during any of the incident).I tried to look up above the\r\nvehicle through the front windscreen but this is very difficult in\r\na land rover defender model as the screen is near vertical.At the\r\ntime i was actually scared to get out of the vehicle because of\r\nthe bright blue light which i believe was being directed down on\r\nmy vehicle lighting up the surrounding area also.It was very\r\nworrying what was happening and i was concerned what may happen to\r\nme if i alighted the vehicle with the blue light above me.\r\n\r\nthe blue light was illuminated for maybe a few minutes (or so it\r\nseemed) and then it went off.At that time i felt more reassured to\r\nexit the vehicle.I jumped out of the door and looked directly above\r\nme.At that time i could see that there was a very large black\r\ntriangular object hovering above me/moving forwards very slowly in\r\nthe night sky.At this time i could see the underside of the object\r\nonly.I could clearly see the triangular shape.It was black but\r\nvisible through contrast with the sky.It was making very little\r\nnoise other than a sort of whirring noise that would not be heard\r\nat a distance.No way was it noisy like an helicopter which you\r\ncan hear approaching from quite a distance.No way was it noisy like\r\nthe engine of a jet aircraft or turbo propeller aircraft either.\r\n\r\ni was shocked at what i was observing.It was not a conventional\r\naircraft that i would know.At that time i saw that the craft was\r\nshowing three red lights to the underside of it.These were near\r\nto the corners of the triangular shaped object.I thought they \r\nappeared like rotating red lights like parabolic beacons used on\r\ntop of old fashioned police vehicles (but red).The object was low\r\nflying (maybe at a few hundred feet altitude i estimate) and so\r\ni could see the three red lights which appeared small.I estimate\r\nthe triangle may have been a few hundred feet wide or more.\r\n\r\nat the time i thought about u.S.Stealth aircraft.At the time i saw\r\nit i thought why would one be over this area?.Why would such a\r\nstealth aircraft give away its position by operating a searchlight\r\n(the white beam of light projected in the first instance)?.Why\r\nwould such a stealth aircraft give away its position by then\r\nprojecting down vertically a source of brilliant blue light to\r\nilluminate the whole area?.Why would such a stealth aircraft have\r\nsome form of (what appeared primitive design) red position lights\r\nbeneath the underside giving away its presence?.\r\n\r\nas i watched the underside of the object move overhead it suddenly\r\nmoved forward again (southwards)without noise and with rapid\r\nacceleration.I watched it go southwards to the horizon beyond penn\r\nnook close (housing).I saw that it moved to the left beyond this\r\nhousing and then suddenly changed direction to go right  (as if\r\nthrown in reverse) and then suddenly left again on its original\r\ncourse of flight.The speed of the moves was very fast and i did not\r\nbelieve any conventional fixed wing aircraft capable of doing what\r\ni saw at that point.The object continued to move very rapidly in\r\nthis south westerly direction and i then lost sight of it.It was\r\nheading in the direction of stocksbridge golf club on royd lane\r\nand beyond that towards bolsterstone village/beyond to broomhead\r\nreservoir/beyond that the peak district national park.\r\n\r\nwhen i had initially used my police radios i had asked about the\r\npolice helicopter.I informed control of what i was seeing at that\r\ntime (ie only the white searchlight type beam at first).After the\r\nobject had moved towards me and overhead my position i did not use\r\nmy radio again at that point.I was in awe of what i was witnessing\r\nand wanted to give it my full attention.After i had witnessed the\r\nobject move away from my location in the south westerly direction\r\ni contacted my control room and told them what i had seen (ie.In\r\nmy own opinion a large black triangular ufo) and told them it was\r\nmy intention to proceed in the direction of the flight path of the\r\nobject for any further sightings.I did not seem to get any response\r\nfrom my own control room to the effect that they took me seriously.\r\n\r\ni did travel at speed in the police vehicle alone out in the\r\ndirection the object had flown without further sighting of it or\r\nany further lights in the sky.I drove some distance out towards the\r\npeak district national park. out there at night it is pitch black\r\ncountryside.I was alone.I had no interest shown from the control\r\nroom that anyone else might be attending the area with me so i\r\ncalled off my own pursuit. honestly i was afraid to go out into\r\nthe middle of nowhere and make myself vulnerable to whatever might\r\nhappen.\r\n\r\non the night of this incident three police officers were on duty\r\nat deepcar police station.We had to cover 100 square miles of our\r\narea.I was alone in one car and 2 other officers were together in\r\nanother marked police vehicle on mobile patrol at that same time.\r\nthey were on patrol in the oughtibridge area of sheffield about\r\nsix miles from my location during the event.\r\n\r\nlater that morning we spoke at deepcar police station about what i\r\nhad witnessed.The senior officer of the two stated they had seen\r\nthe brilliant blue light in the sky over deepcar but knew nothing\r\nelse of what it was.I know this officer had his own experience of\r\nufo sightings on a night shift during the early 1980's in sheffield\r\nwhen i was on the same shift as him.On the night of my sighting\r\nthis officer had a brother in the police working at attercliffe \r\npolice station sheffield (about 9 miles away as the crow flies)\r\nalso on a night shift.I know my colleague spoke with his brother\r\nat attercliffe and he and officers on his night shift had also\r\nwitnessed bright blue lights in the sky as well but i know no more\r\ndetail than that.\r\n\r\nwhen i had my own sighting there was no one around.The only person\r\ni had seen was the man in the street i had seen and was looking for\r\nbefore the event.I do not know of any other reports having been made\r\nthat night or subsequent about what i had witnessed myself.\r\n\r\nit may also be interesting to note that this area where i had my\r\nsighting/event has also been linked with other paranormal events.\r\n\r\nthese other events have not been experienced by me but have included\r\nsightings by a number of people of alleged ghosts of a group of\r\nyoung children in victorian style dress dancing around near an\r\nelectricity pylon off pea royd lane stocksbridge (about 1000 yards\r\nas the crow flies/different direction from where i first observed\r\nmy own ufo) and alleged sightings of a lancaster bomber \"ghost plane\"\r\nseen by people in the same locality (lancaster bombers apparently\r\ndid practice runs in the area for the bouncing bomb in ww2 using\r\nlocal reservoirs) and both these events have received media attention\r\nand i believe investigations.\r\n\r\ni never reported my own experience at the time or later to any media.\r\n\r\nsome years after the event i saw a tv programme titled \"open skies\r\nclosed minds\" which commented on sightings of black triangular ufos\r\nseen over belgium and witness testimony and photographs-one taken\r\nby a senior officer in the belgian air force.This was a black\r\ntriangular ufo with three red lights on the underside.When i saw\r\nthis programme on tv i said immediately that was the same object (or\r\nvery similar) to what i had seen over deepcar sheffield in mid \r\noctober 1996.I had never taken photographs myself as i was not in\r\npossession of a camera on duty.\r\n\r\ni know i did not lose any time the night of the incident as i did\r\ncheck my wristwatch sometime at the start of the event and after it.\r\ni did do this because i have read and heard that people who have\r\nundergone these type of experiences have told of \"missing time\"\r\nafter the event.\r\n\r\ni retired from south yorkshire police in 2001.I have never seen\r\nanything like what i saw that night before or after that night.I\r\ndoubt i ever will again.I was a police officer for 20 years and\r\nregularly worked night shifts as routine.This event was the one\r\nand only time i have ever seen or experienced anything like that\r\non a night shift.\r\n","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":62960,"landingOccurred":false,"latitude":53.47438589999999,"location":null,"logNumber":"GB-01292015-0016","longitude":-1.5767637,"occurred":845362800000,"potentialRelations":[],"rating":"Unrated","region":null,"reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1422583333000,"summary":"On duty police officer saw large black triangular ufo during night shift.","tags":["ufo"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":6680,"locationName":"Deepcar","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:63439"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Hazleton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hello my name is [name removed/cms/tg] , i have a question. over the summer i was working as a yard jockey in hazleton pa. at the humbolt industrial park. it was a slow night around 11 pm or so was standing out in the yard having a smoke it was a clear night but no moon shine i was facing south east with my back to a strong breeze looking at the stars i had turned around to face north west into the breeze still looking at the sky when i seen what looked like a big ball but dew to the light from the building and height of the building it limited my view time, but  what i saw looked like a big ball cut in half ,now with the darkness it was possibly red or orange very dull not reflective a ruff guess about 150 ft above me moving against the wind no sound no lights but big had to be about 3 to 4 feet in width looking at it at that height.And what i mean by that if it was right of front  of me it would be much bigger. it was moving quickly and level and again against the wind direction ,has anything ever been reported like this still has me puzzled . thanks [name. address, and phone number removed/cms/tg] if you need to talk much easier to describe that way!","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":62959,"landingOccurred":false,"latitude":40.92730479999999,"location":null,"logNumber":"US-01292015-0015","longitude":-76.0425274,"occurred":1408773600000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1422575861000,"summary":"Red, orange , or brownish ball shaped object moving fast ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"18201","daysBetweenOccurrenceAndSubmission":159,"locationName":"Hazleton, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63440"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Cleveland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were leaving knoxville and i looked up in the sky and there was an air plane flying in the sky with what look sky a big dome shaped drop of silver mercury covering the nose of a passenger airplane.It appeared to be leading it around.We also seen lights in the sky moving irratically like perpetual motion making the shape of an o and the other was making an u shape.They were lights in the middle of the day in the sky.And then there was the time when myself and someone else was on the camp grounds in charleston,tn and the guy called to my attention that there was a star in the sky moving ,ilooked up and it did a zig-zag and then dissapeared.Not to mention the phenominal events.I don't have pictures yet.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change","formattedAddress":null,"id":62958,"landingOccurred":false,"latitude":35.1667182,"location":null,"logNumber":"US-01292015-0014","longitude":-84.8750415,"occurred":1416522000000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1422570008000,"summary":"There were several people  that seen the last  one coming down the highway from knoxville toward cleveland in november of 2014.It was attached to the front of a passenger plane.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"37311","daysBetweenOccurrenceAndSubmission":70,"locationName":"Cleveland, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63441"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"West Alexander","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was watching tv ..\r\nwhat made me look out my front door was the loud noise it sounded like a helicopter it was very large n had very large green windows that were square shaped i couldn't see anything inside the windows just green lights. .At first i thought it was  military but after realizing military or not there's no way a helicopter could fit down over the hillside \r\nto many trees n shrubs in the way ..","distance":"20 Feet or Less","duration":"00:03:00","entityEncountered":false,"favorited":0,"features":"Window(s), Patterned Surface, Other","flightPath":"Other","formattedAddress":null,"id":62957,"landingOccurred":false,"latitude":40.07878609192424,"location":null,"logNumber":"US-01292015-0014","longitude":-80.54136749104141,"occurred":1220234400000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1422568343000,"summary":"It was so close to the front of my house i could throw a biscuit across the street and hit it..It was shaped like a helicopter sounded like one windows were square large n green but it was shaped differently its hard to put into words ","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"15376","daysBetweenOccurrenceAndSubmission":2341,"locationName":"West Alexander, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63442"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Dickinson (Grassy Butte)","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was doing archeogical work in the badlands of north dakota. the night was pleasant but tent was stuffy so  friend and i took our sleeping bags outside. the moon was full and the sky was full of stars because we were far from cities and the sky was very clear. we were talking about our work and our lives and staring up at the sky. i noticed a very bright round object that seemed to be just below and slightly to the right of the moon. it wasn't moving. i thought that it might be a planet or a satellite because it didn't twinkle like a star. i pointed it out to my friend, who was also looking at it. it abruptly moved very fast to our right, then stopped again. we were baffled as to what could do that. once again it moved fast at a 90 degree angle from its previous path and went out of sight. we weren't sure if it had been lit then the light turned off, or if it had moved too far away for us to see. we weren't afraid, just curious and baffled. we talked about it for a while but had no conclusions. (and we had not been drinking or anything.) this was before there were cellphones and the cameras were in the tent, although at the time we didn't think of photographing it. there is (and was) an air force ba north and east of where we were. when we got back to our field base a few days later we called the base and asked if they'd had aircraft out or had picked up anything on radar, after telling them what we'd seen. they basically told us we must have been hallucinating and that there was nothing there. my friend and i have discussed it since then, still wondering, and occasionally i dream about it. it was very clear, large (appeared about one-tenth the size of the moon but we didn't know how far it was from us or the moon) and very very bright. it was round, like the moon, and i couldnt be sure if it was reflecting light or emitting it. it did seem brighter than the full moon. i haven't seen anything like it since then, but i will never forget it. it was cometely silent.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path,Path with directional change","formattedAddress":null,"id":62956,"landingOccurred":false,"latitude":47.1189036,"location":null,"logNumber":"US-01292015-0012","longitude":-103.6221362,"occurred":332576100000,"potentialRelations":[],"rating":"Unrated","region":"North Dakota","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422567994000,"summary":"Bright round object seemed near full moon. suddenly moved fast then stopped. next made90degree  turn and shot away and out of sight","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"N/A","daysBetweenOccurrenceAndSubmission":12615,"locationName":"Dickinson (Grassy Butte), North Dakota","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63443"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Glendale","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Sitting outside waiting for my dog to go potty.Seen a short beam of light coming from a cloud.Then a flicker of lights in the ufo light up with lights tracing a saucer like shape and then like turning on and off a light swicth turn off its lights.It was definitely a space ship as big as one football feild id say in size.Went to grab my phone to take a picture and seen nothing there, if it was gone or not i didnt know ,as it was hiding inside this cloud.","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Unknown","formattedAddress":null,"id":62955,"landingOccurred":false,"latitude":33.65894602484787,"location":null,"logNumber":"US-01292015-0011","longitude":-112.12649282467507,"occurred":1422467700000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1422567589000,"summary":"Seen a flash in a cloud thought it was lightening then ship lite up.","tags":["flash","light"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"85308","daysBetweenOccurrenceAndSubmission":1,"locationName":"Glendale, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63444"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Senaca","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was at a military installation working as a military policeman in upper state new york. i was in a vehicle in charge of a special five man team that was patrolling on the base and outside the perimeter of the base. we were to stay away from the rest of the platoon of mp's that were on guard duty inside the restricted area. i can't remember the exact date ,but i kept my flak jacket on while in the vehicle to stay warm. also i remember it was a little after five am and it was still dark. i told my driver to park at the plant inside the restricted area and position the vehicle so that we could watch the civilians entering the site at six am. i told the team to rest until the civilian workers start to arrive. i was sitting in the passenger side up front and just looking out at the plant. a sphere of light dropped down out of the sky probably 800 - 1,200 ft right in my line of sight at the other end of the parking lot just above the tree line. it was just hovering there a sphere of light. best described as a ufo. never saw anything like it , just hovering spinning light? i starting yelling at the the other men in the team to look at this! just as i did that it zig  zagged , right left about five times while going up and disappeared in the sky. never saw anything move that fast and with a zig zag motion. nobody else on the team saw it.It was only a matter of 2-3 seconds and gone. never reported it. this is the first time writing about it. i am retired law enforcement and was watching a program today about mufon investigators interviewing some creditable witnesses about sightings today and decided to tell someone. end of report. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Hovering then path","formattedAddress":null,"id":62954,"landingOccurred":false,"latitude":42.7651891,"location":null,"logNumber":"US-01292015-0010","longitude":-76.8720961,"occurred":309272520000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422566129000,"summary":"Small sphere of light suddenly appeared in my line of vision above the tree tops.","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":12885,"locationName":"Senaca, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63445"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Prairie View","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The fall of 2009, my family and i were visiting prairie view, tx. it was night when i realized a meteor shower was in progress. when i saw a shooting star, i invited my family to stargaze with me. \r\n  we all laid down to stare straight up into the milky way above. i saw something like a bird flying in the night sky. i focused my eyes on it and that's when i realized it was not a bird, there were no flapping wings. this was no animal and furthermore, this was not a manmade aircraft. i could see the outline of the clouds behind it, through it. it's shape constantly changed from \"boomerang\" to triangular. it made no noise and seemed to glide in a nw direction while zigzagging abruptly, yet smoothly. the color kept changing like the iridescent swirl you see on a soap bubble. \r\n  it was only visible for a moment as it crossed the sky. i immediately asked my family what they saw, and of course everyone gave different description descriptions. my baby brother thought it was a bird. my mom said it could have been an angel. my sister never saw it. but i know what i saw. i couldn't speak until my eyes were completely focused on the object and i observed every detail. i just wanted to share this in case anyone else ever reports the iridescent, silent, transparent, flying object. \r\n  thanks.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":62953,"landingOccurred":false,"latitude":30.0932737,"location":null,"logNumber":"US-01292015-0009","longitude":-95.9877339,"occurred":1249706400000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1422565714000,"summary":"I observed  a flying object with no definite shape or color.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2000,"locationName":"Prairie View, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63446"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Blairsville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving to computer repair customer, notice chrome ball over a pasture with. few cattle grazing. buzzard was circling oblect in sky, then in front of it, object seemed to be about the length of a school bus across. i could see reflections of the cows on the bottom of the object, and clouds on the near side twards me. i was at a complete stop, window down, no radio playing, not sleepy or over worked. i watched the object for close to 60 seconds and the buzzard flying near it, the bird flew close enough for me to see its reflection in the chrome object in the sky, then it shimmered slightly and shot straight down into a stand of trees about 1/4 mile away. it left behind a heat wave or shimmering vapor trail of some type that disipated in approximatley 20-30 seconds. the buzzard was left circling, and i drove away.  entire event lasted around 60 seconds.  i informed the 911 operator when i reached my destination  about 8-9 miles down the road. while at dinner with friends, the sherrifs department called me back while i had my cell on speaker phone and asked me some questions avout an aircraft crash possibility.  i informed the deputy that it was not an airplane or helicopter and that it was a chrome spere about 40-60 feet across that shot straight into the ground in a small stand of trees.\r\n\r\nwhile driving the last 3 miles, i noticed at an intersection that there were 3 vehicles pulled over all pointing and talking in the direction of the object. i did not stop and speak with them, bey it was obvious that they were distressed and worried.\r\n\r\nat dinner the deputy put his phone on speaker so i could hear the dispatcher, and i heard the woman tell him that he was to return to base with dash cam footage.\r\n\r\ni am moving to mn. the third week of feb. but can be reached via email or cell phone if needed.  i can take someone to the exact spot where this occured up to the point that i move out of state.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":62952,"landingOccurred":false,"latitude":34.9209413,"location":null,"logNumber":"US-01292015-0008","longitude":-84.04309339999999,"occurred":1305010800000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422564799000,"summary":"Chrome ball hovering over pasture shot into ground","tags":["hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"30514","daysBetweenOccurrenceAndSubmission":1360,"locationName":"Blairsville, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63447"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Worcester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My boyfriend and i were shopping near the greendale area and on our way out of the store i looked up in the sky because there was a light show in worcester. i noticed ffour diamond shape object with yellowish orange lights in the sky. at first my boyfriend thought it was a group of helicopters but then we realized that they were not moving and didn't have the normal flashing lights that helicopters have. by the time my boyfriend was driving to get on 290 west i looked up toward the holden are and noticed another of the same object in the sky. when we were on the highway we looked looked again and there were just two left above worcester and the one above the town of holden had disappeared. we have never witnessed anything like this in our lives. we know what we saw and regardless of what some of our friends think that either it was part of the light show, it was not. the light show was moving white light but these were actual objects and the color was far fr! om white. it was an amazing experience that we would never forget. i just regret that i didn't take a video so i can show those who doubt what we saw.\r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":62951,"landingOccurred":false,"latitude":42.2914636,"location":null,"logNumber":"US-01292015-0007","longitude":-71.8029841,"occurred":1414220400000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Diamond","source":"MUFON","status":null,"submitted":1422560435000,"summary":"Diamond shaped orange lights","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"01606","daysBetweenOccurrenceAndSubmission":96,"locationName":"Worcester, Massachusetts","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63448"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Carlsbad","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was transporting some friends from a new years eve party and we noticed these spheres in the sky. the spheres were in a angle in a straight line. as the spheres entered they cloud they electrification of the clouds as they made what we assumed was contact with the clouds. we video filmed it as long as we cloud because the freezing cold weather. we drove off from the incident. end of report","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":62949,"landingOccurred":false,"latitude":32.43092443113002,"location":null,"logNumber":"US-01292015-0006","longitude":-104.25665844975036,"occurred":1420104720000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422558952000,"summary":"We observed these five spheres as they entered the cloud they sparked the cloud. we followed the changing spheres on video","tags":["video"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62949_submitter_file1__trim.23F6A14EBAF24F50BC4DCBA4FB0138FB.MOV"],"weather":null,"zipcode":"88220","daysBetweenOccurrenceAndSubmission":28,"locationName":"Carlsbad, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63449"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Città Giardino","country":"Italy","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am submitting this event since the actual witness chose not to be mentioned but gave me permission to post the photos and an account of what took place .\r\n\r\n\"exactly one year ago, 29 january 2014, while opening the front door to a salesman, i witnessed three disc shaped objects in the sky. i estimated their distance to be about 500 meters from me. they flew in a zig zag manner flying north-north east. the entire event lasted not more than 2 minutes. myself, the salesman and my spouse are witnesses to the event.\"  i submit two photos of the discs and a map of where the sighting took place.  i reported the event to the local authorities, but have heard back from them or anyone else.\"\r\n\r\nmap:https://goo.Gl/maps/gxq9f\r\n\r\nthe discs appear in the center of both photos and are small in size until the photos are magnified. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":62948,"landingOccurred":false,"latitude":37.104167,"location":null,"logNumber":"IT-01292015-0004","longitude":15.210833,"occurred":1391023800000,"potentialRelations":[],"rating":"Unrated","region":"Sicilia","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1422554052000,"summary":"Aound midday while answering a salesman at the doorstep, three disc shaped objects were witnessed in the sky. myself, the salesman and my spouse all observed the discs. they remained in the sky for one minute.","tags":["disc"],"timeZone":"Europe/Rome","timeZoneName":"Europe/Rome","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62948_submitter_file1__UFO2.jpg","http://www.mufoncms.com/files_jeud8334j/62948_submitter_file2__ufo6.JPG"],"weather":null,"zipcode":"96010","daysBetweenOccurrenceAndSubmission":364,"locationName":"Città Giardino, Sicilia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63450"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Palestine","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"First night, 1-27-2015.( yesterday )about 7:45pm. feeding horses. observed helicopter flying from local airfield. watched it fly over the trees and out over the city.\r\nwent back to feeding horses. noticed bright starlight blinking above the horizon. thought it was the helicopter again. stood still and observed it.\r\nit never moved, no sound, just flashing lights. started walking down the 1/4 mile driveway toward the front gate, stopping every 100 feet or so to observe this object.\r\nit still never moved. kept flashing lights and spinning. after stopping and observing this object 6 or 7 times, made it to the front gate and closed the gate. started walking back, keeping the object in sight, and stopping when there were no trees obscuring it. stopped another 6 or 7 times on the way back to observe it. made it back to the horses.My movement had caused the object to be behind a tall tree... i went inside and made dinner. ate.\r\ngot a call about an hour later and went outside to get cell reception.\r\n\r\nwhile talking on the phone to a friend in the next state over, saw the object again. described what i was seeing, and where it was in the sky in relation to the moon and orion.\r\nmy friend had to go into the front yard to be able to see it. then she could see it too, and was seeing the same object i was seeing, and was describing the flashing lights as they occurred, in the same color sequences.\r\nwe kept talking about it, and i went inside to get binoculars.\r\ni could see it a lot better,very clearly ( 60 x 90 binoculars ) and went back in to get the camera and a tripod.\r\nkept watching it and trying to take pictures until about midnight, and called it a night. i got some good photos, but the video i shot tonight is much much better, and will be posted with this report.\r\n\r\nmy friend called several of her friends in texas and louisiana. her friend in la is a photographer, and got some good photos and video as well... and she posted them to facebook. the photographer woman in louisiana watched the object until 3:30 am.\r\n\r\ni was too wound up last night to post this, but i did come to this site and look at the last 20 sightings.\r\ndisappointed no one else reported this obvious object.\r\n\r\n\r\n\r\nrough day today the 28th. felt drained and confused all day. grumpy.\r\njittery and honestly..... sort of insecure. had to take a long nap this afternoon to get back some \"ability\" to function.\r\n\r\nas it got dark here again tonight, i didnt want to go out and look for it or at it again, but i had to to feed the horses.\r\n\r\nthis time i took the camera and tripod and binoculars with me.\r\n\r\nsure enough... there it is.\r\n\r\nit was approximately 8:35 tonight when i went outside to feed.\r\nmade a few calls, and gave my friends the heads up.\r\n\r\ni set the tripod up, and because my photos from last night were not so clear, decided to do a video.\r\n\r\nself explanatory from there.\r\n\r\nunedited video is attached with this report.\r\n\r\nstar like object, literally in orbit ( at least out of the atmosphere )moving very very slowly west and losing some altitude while spinning, flashing, strobing colors of red, blue, green , bluish green and possibly some warm yellow. the background color of this object was white.\r\n\r\nset the camera up, finally got it in frame, and stepped back from the camera to let it record.\r\n\r\ni got 29 minutes total of video before the card was full, and about 17 or so full minutes of the object.\r\n\r\nzoomed in and out as best as possible. tried to show scale and landmarks...Used a laser pointer twice, and called it out on video when i did it, to make a tree and a telephone pole for scale and distance ( and to help find the object with the camera lens )\r\n\r\nwords mean nothing...\r\n\r\nwatch the video.\r\n\r\nthis is the second night it has been out there, basically same spot.\r\n\r\ni used orion and the moon as markers.\r\nits explained on the video, the direction and distance from orion as well as the elevation.\r\n\r\n\r\nits coming back tomorrow night.\r\n\r\ni seriously need much better camera equipment, or a long telephoto lens and flir or night vision would be awesome.\r\nanyone has that equipment, get ready tomorrow night where you are to look south and 20 deg above the horizon, and orion's left leg points right at it.\r\n\r\ni know it will be there.\r\n\r\ndont miss this change investigators. no joking. get ready.\r\n\r\nfrom east texas to central louisiana, you will be able to see it.\r\n\r\n\r\n","distance":"Over 1 Mile, Unknown","duration":"02:01:01","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":62947,"landingOccurred":false,"latitude":31.7514,"location":null,"logNumber":"US-01292015-0003","longitude":-95.59779999999999,"occurred":1422511200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1422541702000,"summary":"Night # 2 observed. flashing colors, spinning,","tags":["flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62947_submitter_file1__DSCN9672.MOV"],"weather":null,"zipcode":"75803","daysBetweenOccurrenceAndSubmission":0,"locationName":"Palestine, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63451"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Ohope beach","country":"New Zealand","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Taking pictures of the beach area when spotted the object in the sky.The object did not move at all,just vanished after a few minutes!\r\n\r\n","distance":"Unknown","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":62946,"landingOccurred":false,"latitude":-37.9666667,"location":null,"logNumber":"NZ-01292015-0003","longitude":177.0333333,"occurred":1421971200000,"potentialRelations":[],"rating":"Unrated","region":"Bay Of Plenty","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1422535915000,"summary":"You will see in the pictures as i still can not understand what this object is.","tags":["none"],"timeZone":"Pacific/Fiji","timeZoneName":"Pacific/Fiji","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62946_submitter_file1__DSC8995.jpg","http://www.mufoncms.com/files_jeud8334j/62946_submitter_file2__DSC8994.jpg","http://www.mufoncms.com/files_jeud8334j/62946_submitter_file3__DSC8993.jpg","http://www.mufoncms.com/files_jeud8334j/62946_submitter_file4__DSC8992.jpg","http://www.mufoncms.com/files_jeud8334j/62946_submitter_file5__DSC8991.jpg"],"weather":null,"zipcode":"3127","daysBetweenOccurrenceAndSubmission":6,"locationName":"Ohope beach, Bay Of Plenty","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63452"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Shasta","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Hi guy's, i was checking the ski cam at mt shasta and it looks like they got a good pic of an orb. so i did a save as and here you are.  i'm actually an experiencer of the 4th kind.  seen an orange one here in china last year flying east towards my school then slowly turned south towards mt. lu or lushan. the best one i ever saw was in dahab egypt, i was at the english pub rooftop bar when i noticed something coming across the red sea from soudi moving very fast, it was the orange light type, coming almost straight toward us. (i'm saying, look look look) well at about 2/3's across the sea it made the famous right turn at a very high rate of speed. the orange glow turned on and off a few times as it flew towards israel. my coolest siting so far. the one in china last year also the orange glow turned on/off then off, but i could still see it from the moon light. i've seen so many. before i left the states in 09, i had 3 neighbors 5 cops and a nurse in my front yard with binoculars looking at an orb, ahhh ha ha. so funny! they thought i was playing a joke, had to call them twice. hey keep looking up! cheers!","distance":"Unknown","duration":"00:01:01","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Unknown","formattedAddress":null,"id":62945,"landingOccurred":false,"latitude":40.598119,"location":null,"logNumber":"US-01292015-0002","longitude":-122.4907566,"occurred":1422505800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422520086000,"summary":"A light in the sky","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62945_submitter_file1__mtncam4.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Shasta, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63453"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Pensacola","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It looked golf ball like moving pretty fast very high in the sky and every now and then as it past a bright light would appear from it and then it would o invisible or something and then appear somewhere down the path it was flying.","distance":"501 Feet - 1 Mile, Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Other","formattedAddress":null,"id":62944,"landingOccurred":false,"latitude":30.5180259,"location":null,"logNumber":"US-01292015-0001","longitude":-87.2219698,"occurred":1422320520000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422519257000,"summary":"Small cause it was very high looked like golf ball moving fast and it would flash then go really fast and reappear ","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":2,"locationName":"Pensacola, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63454"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Langhorne","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I am reporting this now only because of all the reports i have been seeing on tv and i was just wondering if any body might have reported something like this it has been on my mind quite often.I was driving home from my girlfriends around midnight on rt 1 heading north near oxford valley road langhorne pa. my window was open and i was singing. i was straight(stating this for obvious reasons)i noticed this large cross shaped object to my left at about 300 hundred feet above me what really got me was that it was not making any noise and did not have the normal red and green aviation lights only 1 blinking white light towards the middle of the craft. each end of the cross shape was squared off not blunted or pointed, the section of each of the appendages or wings where it attached to the main section was not at 90 degree but rounded off kind of like webbed concave shaped that extended halfway up the wings this object was staying with me and i started to get scared and i needed to get off on oxford valley rd so i exited and then the object started to parallel me as i moved it moved when i stopped it stopped. i had to go down a road called big oak rd and i thought to my self that i was going to wait until i see a car coming up behind me and then i would go in case the thing tries to abduct me, at that moment the craft moved away from me over an area we call the 5 mile woods it was approx. 1/4 mile away from me when it started to flash multiple random white lights from all areas of the craft as if it was taking pictures this went on for about 20 seconds and then it immediately stopped and back to just 1 light that i could see. it just hovered in the same spot and about 5 minutes, a car came up and i took off trying to keep my eyes on the road and the craft it started to move as i did. i turned right onto big oak through the 5 mile woods and the car luckily followed me and i lost sight of the craft i thought it might have left. i came to a hard bend and just as i came around the bend the craft was just about above me lower than before (if i had a rock i could have hit it) i actually kind of yelled and stared at it and then looked ahead and i did not navigate the turn and was heading for tree i swerved and skidded and steered myself through a near accident. after that i did not see it anymore. i came up to a red light and got out of my car and ran back to the car behind and saw two people in the car and older man and woman with a look of terror in their eyes as i ran up to the car but i decided not to go any further because of the way they looked. i was quite shakened up and when i got home i woke my boarder and told him the whole story. he said i should report it but back then i didn't want to go through all the scrutiny","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Appendage(s)","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":62943,"landingOccurred":false,"latitude":40.1931923,"location":null,"logNumber":"US-01282015-0017","longitude":-74.86240289999999,"occurred":331801200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1422512786000,"summary":"Large silent cross shaped object barely a few hundred feet bove with 1 blinking white light which then then turned into mult lights","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62943_submitter_file1__samsung285.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":12623,"locationName":"Langhorne, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63455"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Port Gibson","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"No comment","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":62942,"landingOccurred":false,"latitude":32.0792282,"location":null,"logNumber":"US-01282015-0016","longitude":-90.8873342,"occurred":1422394200000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1422510052000,"summary":"Didn't know about it until i made it home and took a good look at the photo","tags":["photo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62942_submitter_file1__image.jpg","http://www.mufoncms.com/files_jeud8334j/62942_submitter_file2__image.jpg"],"weather":null,"zipcode":"39150","daysBetweenOccurrenceAndSubmission":1,"locationName":"Port Gibson, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63456"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Perth Amboy","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving over bridge took photo of sunset..Caught by accident.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":62941,"landingOccurred":false,"latitude":40.5067723,"location":null,"logNumber":"US-01282015-0015","longitude":-74.2654234,"occurred":1422405000000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1422509292000,"summary":"See photo and zoom in on orb","tags":["photo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62941_submitter_file1__20150127165943.jpg","http://www.mufoncms.com/files_jeud8334j/62941_submitter_file2__20150127165945.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Perth Amboy, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63457"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Austin","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Movement in all directions but stereotypical up, north, south, down. probably a private uav.  caught just the last moments of it before it went below tree line observed it for several minutes. about 3 miles away i'd guess. ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":62940,"landingOccurred":false,"latitude":30.29777278611639,"location":null,"logNumber":"US-01282015-0014","longitude":-97.7208814042323,"occurred":1422432000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1422505144000,"summary":"Movement in all directions but stereotypical up, north, south, down. probably a private uav","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62940_submitter_file1__20150128184506.mp4"],"weather":null,"zipcode":"78723","daysBetweenOccurrenceAndSubmission":0,"locationName":"Austin, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63458"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Glendale","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friend, bob conover and i, of high school age had decided to go up onto the flat roof of a three-car garage which was located right behind and next to the back fence of the apt. complex in which my family resided. it was a part of the property directly behind our apt. complex. we had two sleeping bags that we carried up there and the weather was incredibly clear for the los angeles area due to a so called 'santa ana condition' by the weather bureau. we were truly amazed at the clarity of the night sky with very little light pollution from the ground and we kept commenting about it as we laid ourselves down on the flat roof on top of our laid out sleeping bags. i would say that about an hour passed as be both lay there gazing intently at the unusual amount of stars and planets we could see. we both had a good interest in astronomy, and in my case, i had some rudimentary knowledge about the universe, our solar system, etc. my memory is vivid when it comes to the next stage in our experience. we both noticed and commented on how we were seeing the sky in a new way in that we became so accustomed to gazing at this wondrous scenario that we could actually perceive the stars and planets in 3-d to some degree. instead of seeing brighter or dimmer - we saw closer and further and were both amazed at the phenomenon. a few minutes passed after that last perception when bob, who was right next to me, suddenly was looking across my body toward the horizon of the east, pointing and excitedly saying, \"what is that?\" the direction of our bodies was, feet - south ~ heads - north and i was to bob's left. as i quickly followed his pointing arm and finger i saw what made my whole psyche vibrate with an uncanny and new feeling of awe. there were five greenish light circles or discs coming from the east horizon toward us. as we both gazed intently at these smoothly moving objects, we noticed that as they came directly over our position, that they had gotten there very quickly, and without a single sound. there was an eerie silence, especially for glendale, ca - a suburb of l.A. once they passed into the western horizon we jumped up and jumped off the roof, a risky feat, due to our super high emotional state. it was clear to both of us that the total time sequence of the straight trajectory of these objects from horizon to horizon took less than 9 seconds. we couldn't get over that there was no sound!\r\nas we hit the ground and ran into my family's apt. we told my parents who were moved by our state and helped us find someone to call on the phone. after a few minutes of discussion, we decided to call the california ground observers corps to report the incident in as much detail as possible. when we were able to speak to someone at the corps, and tell our story, they were very positive in their reception of the info and also told us that others had seen the same thing. they told us that no planes were in the area of the flight path of the objects and the everyone was mystified.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":62939,"landingOccurred":false,"latitude":34.1552512,"location":null,"logNumber":"US-01282015-0013","longitude":-118.2246678,"occurred":-445881600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1422502791000,"summary":"Five greenish disc-like circles in a perfect v formation - from horizon to horizon in 9 sec.","tags":["disc"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"91205","daysBetweenOccurrenceAndSubmission":21624,"locationName":"Glendale, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63459"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Clinton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At 5:55 pm on jan. 28th, 2015, i was walking my dogs and enjoying the cloudless sunset. i noticed a very plump, bright star in the western sky near that one that is always there, low to the horizon. i thought about how i had never noticed two stars out there, always just the one that i assume is venus. the dogs were doing their business, so i was standing still for a minute, just wondering how i could have missed this star in all my 53 years. i waited for another 30 seconds to see if it was a plane coming toward me. at that, it blinked out of existence. i stared at the same spot for another minute to see if i could detect any kind of aircraft that may have lost lights. i wondered if meteors can just hang motionless for over thirty seconds before descending, but i have always seen them falling earthward at extreme speed.\r\n   for now, i am assuming that it could have been a meteor coming directly toward me, giving the illusion that it was a star hanging in a fixed position.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":62938,"landingOccurred":false,"latitude":40.648442288651694,"location":null,"logNumber":"US-01282015-0012","longitude":-74.90402940411902,"occurred":1422496800000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1422499006000,"summary":"Bright, stationary star, observed for 30 seconds, then gone abruptly. no clouds at all. no earthward falling.","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"08809","daysBetweenOccurrenceAndSubmission":0,"locationName":"Clinton, New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63460"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Canal Winchester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was leaving my grandmas birthday at the time.  i walked out the front door of the house and saw a bright multicolored group of lights speeding toward me.  i thought it must be an aircraft in trouble.  i started screaming as the craft came into view seemingly instantly. it was shaped like a thin jar but was easily 50 ft tall.  it hovered very closely to the ground and the grass seemed to be pulled toward it instead of being pushed away. the grass wasn't wavering though.  all of a sudden a dull hum hit me and i couldn't breathe.  then at least 40 or so similar looking smaller craft burst into the scene where they seemed to be very oddly chasing the larger craft.  the larger craft sucked the smaller crafts inside and then zipped off with a loud zoom or whoosh it kind of sound like a really loud dogs bark.  ","distance":"21-100 Feet","duration":"00:01:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Path with directional change","formattedAddress":null,"id":62937,"landingOccurred":true,"latitude":39.84786702088067,"location":null,"logNumber":"US-01282015-0011","longitude":-82.70595206741389,"occurred":1422245100000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1422497519000,"summary":"In about a half of a minute i saw what seemed to be an aircraft land in the yard beep and then whip around uncontrollably.  it was then joined by similar craft that acted as strange as the first.  the first and largest landed then they all loudly shotaway","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"43110","daysBetweenOccurrenceAndSubmission":2,"locationName":"Canal Winchester, Ohio","triangle":false,"type":"UFO Landing","$$hashKey":"object:63461"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Puerto Varas","country":"Chile","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Estaba en un bote en el los saltos del petrohué y saqué fotos al volcán osorno. además de otras fotos tipo selfie. \r\nno le saqué la foto a nada más que al volcán y en una de las fotos apareció una pipa evidente al lado del volcán. \r\nsoy de chile y ocurrió en chile. \r\npuse argentina en la hora porque no existe la opción chile.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":62936,"landingOccurred":false,"latitude":-41.1041666,"location":null,"logNumber":"CL-01282015-0010","longitude":-72.4958333,"occurred":1317495600000,"potentialRelations":[],"rating":"Unrated","region":"Los Lagos Region","reportedWeather":null,"shape":"Cigar","source":"MUFON","status":null,"submitted":1422496879000,"summary":"Foto de pipa o cilindro en volcán... no lo ví, sólo apareció en la foto.","tags":["none"],"timeZone":"America/Argentina/Ushuaia","timeZoneName":"America/Argentina/Ushuaia","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/62936_submitter_file1__PIPA.jpg"],"weather":null,"zipcode":"0000","daysBetweenOccurrenceAndSubmission":1215,"locationName":"Puerto Varas, Los Lagos Region","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63462"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Summer of 65. hiking the john muir trail towards yosemite valley. late afternoon. one more camping night before getting into the valley the next afternoon. i was a quarter mile ahead of the rest of the hikers when i stopped to wait for them. as i turned back to look down the trail, i saw that they had stopped and begun to set up camp. i began to walk back towards them when i sensed movement behind me over my right shoulder. as i turned to look a the bird or whatever it was i saw a saucer shaped vehicle flying near horizontally and crossing (from my perspective) from open sky to down into the valley in which we were hiking. it continued on passing along a trajectory which contoured the base of the mountains on the other side of the valley. it flew from behind me for about 20 seconds and passed over and behind the trees in which my friends were setting up camp.\r\n\r\ni took particular note at the time to scrutinize what i was seeing. having had the two previous questionable sights earlier in my life i wanted to be able to remember what i had seen clearly. i looked for wings and saw none.It appeared as the classic disc with a flattened dome on top, and because of the tilt the craft had in making the sweeping turn, conforming to the shape of the valley the top was more clear to me than the bottom which also had the appearance of a lower dome. this was not as pronounced as i said because it the top was tilted slightly towards me. \r\n\r\ni looked at the back end, as figured by its direction of movement and could see no tail structure. the back side appeared exactly as did the front end. it was a disc. there was no sound and no exhaust to be noticed. and no moving parts such as propellers. once it was gone, it was gone and no one else beneath the cover of the trees had the sighting. i would guess the distance it traveled during the short time i saw it was maybe two miles.\r\n\r\nthe flight path was what one would expect a plane to take if flying through the valley.","distance":"501 Feet - 1 Mile","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":62935,"landingOccurred":false,"latitude":36.784131,"location":null,"logNumber":"US-01282015-0009","longitude":-119.4161124,"occurred":-139510800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1422496474000,"summary":"Disc sighted on flight path along a mountain ridge in the high sierras","tags":["disc","saucer"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":18078,"locationName":"California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63463"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Mount Shasta","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was camping in the castle crags area of shasta county. one evening i was looking at the stars overhead on a clear night. i was with a high school hiking club and we decided to watch for ufos. to help stay awake i began looking at the stars to see if i could find geometric patterns. i found a diamond pattern and another pattern which appeared like an old kite which had as it's top point, the bottom point of the diamond pattern. \r\n\r\nafter falling asleep i awoke and searched for the diamond pattern again to see if much time had passed. all was basically in the same position. i drowsed again and then again searched for and found the diamond pattern with the adjoining kite pattern.\r\n\r\nfinally, waking for the fourth time, i searched and found the diamond pattern but this time without the kite pattern present.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"N/A","formattedAddress":null,"id":62934,"landingOccurred":false,"latitude":41.3131346,"location":null,"logNumber":"US-01282015-0008","longitude":-122.3022366,"occurred":-205347600000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1422494804000,"summary":"Patterns of starlike objects disappeared","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":18840,"locationName":"Mount Shasta, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63464"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fremont","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Camping out in the back yard with friend as 9 year olds. the stars were bright overhead. one star appeared to be moving. it was moving from the horizon towards a very bright star directly overhead. i thought it an airplane at first but it had no flashing lights. it just looked like a star but it was moving. i do not  know of any human satellites in orbit at that time.\r\n\r\nas the light continued it's straight and slow path, it became clear that it would in a matter of moments come into a tangent position with the bright star over head. i recall thinking to myself about the cartoon with a fat wolf and his cartoon prey. where the fat wolf hides behind the skinny tree and sticks his head out first from one side of the tree and then the other. \r\n\r\nanyway, as the moving light got closer and closer to the bright light overhead it did indeed come into the bright star. like a golf ball slowly rolling towards the hole. as it came to the bright star, they merged and the moving star did not come out the other side.\r\n\r\nfrom this moment on i was moved to keep watching the sky. nothing more happened that night or for the next several years.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path,Unknown","formattedAddress":null,"id":62933,"landingOccurred":false,"latitude":37.58366890000001,"location":null,"logNumber":"US-01282015-0007","longitude":-121.9871217,"occurred":-426186000000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1422493692000,"summary":"Slow moving starlike light absorbed by stationary starlike light.","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"?","daysBetweenOccurrenceAndSubmission":21396,"locationName":"Fremont, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:63465"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":876}
