{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Wilton Manors","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At roughly 448pm-449pm i witnessed an orb in the sky by the sun and snapped a burst photo of 3 shots in under a second and within that time the object moves then disappears.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":63771,"landingOccurred":false,"latitude":26.171029817325433,"location":null,"logNumber":"US-03062015-0015","longitude":-80.14440528974082,"occurred":1425602940000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1425677748000,"summary":"Seen object snapped a burst photo capturing 3photos in 1second or less and the object moved then disappears ","tags":["photo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63771_submitter_file1__20150305163900.jpg","http://www.mufoncms.com/files_jeud8334j/63771_submitter_file2__20150305164017.jpg","http://www.mufoncms.com/files_jeud8334j/63771_submitter_file3__20150305164022.jpg"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Wilton Manors, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53383"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Concord","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I had recently started chemotherapy and although i have two dogs i really didn't have the stregnth to take both out side at once so i would take them out to their kennel to use the bathroom one at a time.  it was about 7pm and i was going to walk one of my dogs to his kennel to go to the bathroom.  it was super cloudy-very low clouds.  couldn't see a single star because the clouds were so fluffy and low.  as i left my front door i was walking across my yard and was looking around because i was amazed at how low the clouds were.  i happened to notice a light through the clouds but i live within a few miles of an airport - didn't think much about it.  i let my dog off his leash and put him in the kennel and locked the door and stood there waiting like i usually do.  on a clear night you can see all the stars and airplanes and sometimes satellites.  i looked up again and saw something coming my way through the clouds and by the time i realized what i was looking at it was coming through the clouds coming over the house across the street. it seemed to be a straiht line from the first point from where i saw it.  once it got over the house across the street i kept watching.  the first thing i thought was it was moving backwards-the wide part was heading toward me - it was shaped like a triangle so to me aerodynamically it should move forward point first. next thing i thought of was how is it staying in the air - it was wider than the house across the street and it was moving so slow - incredibly slow - how can it stay in the air.  there was no noise.  none. nothing that would tell you there was any type of engine - no wind, no sound - nothing. as it was slowly moving toward me i can see it had a circular recessed section in the bottom middle with 5 smaller circular lights inside the recessed circle.  the lights were yellow - i can only describe them as a creamy butter yellow - i thought the color was actually pretty.  they were steady.  this whole time not a single car drove by and my dog didn't notice anything either! i wanted someone to see what i was seeing.  it's funny i didn't feel excited, scared, nothing - i just watched this huge thing come toward me like it was nothing special. it finally came over me - the whole craft wasn't over me but the end of the craft had moved over me - this thing moved so slow.  as i was looking directly up at it i kept feeling tired and i kept telling myself \"don't close your eyes, don't close your eyes\". i wanted to go to sleep.  i must have gone to sleep because the next thing i knew i was standing on my steps to the house and had my dog on his leash.  i watched the craft move over the top of the trees and at one point it just stopped. how did it not fall out of the sky - why didn't it make any noise? again i was watching it - didn't feel scared didnt really feel anything.  then all of a sudden it went straight up through the clouds.  no noise - nothing. i opened the door to my house and went inside, unleashed my dog and walked to the window looking outside.  i had no feeling about what i saw - i was creepy calm when i think about it. then i walked to the back of the house and i finally started thinking holy crap i just saw a ufo - a real ufo.  so i looked out the window out the back of the house to see if i could see it again - of course i didn't but i started getting really excited.  i called my son and told him and i drew a picture of it and sent it to him and he told me i should report it.  no way was i going to report it or tell anyone else - i mean if this was written by soneone else and i read it - first i wouldn't believe them and then i would absolutely think they are crazy. so all this time i only told my son, a year later my mom and daughter.  thats it.  i know its years later but my son finally convinced me to report it.  this is my story...As crazy as it sounds.","distance":"21-100 Feet, 101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change","formattedAddress":null,"id":63770,"landingOccurred":false,"latitude":43.28287098453681,"location":null,"logNumber":"US-03062015-0014","longitude":-71.61660359175714,"occurred":1384329600000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1425676640000,"summary":"Watched ufo hover above me while i was in the yard and then missed some time because the next thing i knew i was on my stairs","tags":["ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"03303","daysBetweenOccurrenceAndSubmission":478,"locationName":"Concord, New Hampshire","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:53384"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Little Rock","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"Unknown","duration":"00:00:04","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"","formattedAddress":null,"id":63769,"landingOccurred":false,"latitude":34.744079,"location":null,"logNumber":"US-03062015-0013","longitude":-92.3540986,"occurred":1425196800000,"potentialRelations":[],"rating":"Unrated","region":"Arkansas","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1425674609000,"summary":"It hovered for a minute disappeared in wasnt the sun","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63769_submitter_file1__20150121083709.jpg","http://www.mufoncms.com/files_jeud8334j/63769_submitter_file2__20150121083701.jpg"],"weather":null,"zipcode":"72204","daysBetweenOccurrenceAndSubmission":5,"locationName":"Little Rock, Arkansas","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:53385"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"San Diego","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It took place at el salvador san miguel, near volcanic activity there was smoke and my sister took a picture we didn't notice until we downloaded the puc into a pc ....","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Stationary","formattedAddress":null,"id":63768,"landingOccurred":false,"latitude":32.723208,"location":null,"logNumber":"SV-03062015-0012","longitude":-117.1596338,"occurred":1387829100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1425667966000,"summary":"It just show up out no where and had round lights","tags":["lights"],"timeZone":"America/El_Salvador","timeZoneName":"America/El_Salvador","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63768_submitter_file1__image11687","http://www.mufoncms.com/files_jeud8334j/63768_submitter_file2__image11686"],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":437,"locationName":"San Diego, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53386"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (under cloudcover)","city":"Garland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was coming home from work at 4:15am.It was a flashing light that had shot up in the air and then changed course to the left. i got closer to my house when i witnessed the other stationary flashing lights. i was in complete shock.","distance":"21-100 Feet, 101-500 Feet, 501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Other","formattedAddress":null,"id":63767,"landingOccurred":false,"latitude":32.89807062252494,"location":null,"logNumber":"US-03062015-0011","longitude":-96.59224638131873,"occurred":1425644100000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425666598000,"summary":"White cigar shaped moving like a check mark up and down. other sifting were flashing lights ","tags":["lights","flash"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63767_submitter_file1__20150306042233.mp4","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file2__2015030604072811.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file3__201503060407332.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file4__2015030604073141.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file5__201503060422231.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file6__2015030604223041.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file7__2015030604221931.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file8__201503060422232.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file9__2015030604221911.jpg","http://www.mufoncms.com/files_jeud8334j/63767_submitter_file10__2015030604220121.jpg"],"weather":null,"zipcode":"75040","daysBetweenOccurrenceAndSubmission":0,"locationName":"Garland, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53387"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Waterford charter Township","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was in my house and came to my kitchen sink where my wife was and i happen to look out my kitchen window to see a light in the sky that was very bright and low to the ground.So i started to watch it and notice it started to move and change colors so i grab my binocolars and watch it move around and change colors and go in different directions and go up and down in altitude.I seen the craft for over and hour to i couldnt see it nomore as it went over clintonville rd. towards lk.Oakland.I saw other planes fly by it but seem to not notice the craft.This is not my first sighting of ufos i seem to see them every other night in the skys around my house my naighbors also see them around our homes. my wife also seen the craft that night.I seen a ufo when i was a teenager at my parents house with my brothers at night fly right over the roof so low that i saw markings on the bottom of it.It was as big as our house and made a low pulsating humming noise out of it .It flew over independence twp. fire station field and hover there and then it lit up and we could see windows in it.We told our parents and they told us then that this isnt the first time they had seen one before we were in shock after hearing them say that.Other people had to see it too because it was so close to the ground i thought it was going to land and it was only 30 feet from the road maybee rd. so cars going by had to see it too.So this is not my first time seeing ufos and i no the difference between a aircraft,ballons or any thing else. so i no what i saw in the sky and you can come by and probally see them for yourself if you dont believe me what im telling you.So please come and see for yourself. ","distance":"101-500 Feet","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Path with directional change","formattedAddress":null,"id":63766,"landingOccurred":false,"latitude":42.72376414903321,"location":null,"logNumber":"US-03062015-0010","longitude":-83.32146433101195,"occurred":1425616200000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1425664708000,"summary":"The ufo hovered in the sky moving very slowly back and forth and up and down changing colors and rotateing around in the sky.","tags":["ufo"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"48329","daysBetweenOccurrenceAndSubmission":0,"locationName":"Waterford charter Township, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53388"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less, Over 500 Feet (no cloudcover)","city":"Fairview Heights","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"  i had my blinds were partly open while i was on my computer. i was getting ready to lay down before going to work that night. i looked to my left out the window and through the open blinds and saw a bright star just showing over the other apartment complex across from mine. this bright star seemed to be moving closer and i started wondering if that was really a star. then after looking at it for about a minute it began to move laterally to the left slowly for several seconds and the it moved laterally towards the right for several seconds. then it ascended at an angle, again slowly, for several seconds. it ascended at least a hundred to possible a hundred and fifty feet before stopping. then it just hovered there for several minutes. i was feeling excited and uneasy. i called my father and told him what i was seeing and how it moved. i thought possibly a helicopter but there were no blinking lights; just a bright star like appearance. as i was talking to my father, a helicopter flying from the south and heading north flew directly in front of the star like object. that's when i realize the object appeared to be larger than the helicopter. the helicopter kept heading north and out of my view. than approximately two minutes later it ascended again another hundred feet or so, and began hovering again. i could just see it at the top corner of my window. i did look around to see if anyone else in the parking lot infront of me was looking at this, but unfortunately i didn't see anyone. a few minutes later i had to lay down to get some sleep in the other room. even in the other room i could see it at the top right corner on my bedroom window. two in a half hours later when i woke up, the bright star like object was gone. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change,Path then hovering","formattedAddress":null,"id":63765,"landingOccurred":false,"latitude":38.55024512661867,"location":null,"logNumber":"US-03062015-0009","longitude":-89.95806902533627,"occurred":1425609600000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1425663281000,"summary":"Bright star seemed to be getting closer, moved back and forth,and hovered.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"62208","daysBetweenOccurrenceAndSubmission":0,"locationName":"Fairview Heights, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53389"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Easley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driving west pickens sc and saw a ufo coming east to easley.I have never seen anything like this in my life.I was so excited !  we pulled over in a parking lot to get a better look at the object- i wanted to get out of the car to get a better look - my fiancé told me not to. it stopped and hovered right above us, approx.3 or 4 minutes. my fiancée was going to photograph the object but it went straight up behind the clouds, disappearing. all we saw was lights that were a strange orange red color not an outline of a vehicle. there was about 8/10 lights on the outside and 2 in the center. the outside lights were in a circle pattern and the lights were round. \r\nthe next day my fiancés face had a sunburn look and started peeling a day later. as a sidenote to the story - i am ab negative bloodtype - the rh negative registry says the bloodtype is subject to abductions.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path then hovering","formattedAddress":null,"id":63764,"landingOccurred":false,"latitude":34.7983628,"location":null,"logNumber":"US-03062015-0008","longitude":-82.5972283,"occurred":1420093800000,"potentialRelations":[],"rating":"Unrated","region":"South Carolina","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425644873000,"summary":"Ufo going east as we were traveling westwe pulled over and the ufo hovers above us. fiancée tried to photograph and ends up with facial burns and peeling.","tags":["photo","ufo"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"29640","daysBetweenOccurrenceAndSubmission":64,"locationName":"Easley, South Carolina","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53390"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Palm Springs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I have been waking up at 11pm every night for about 30-40 days now! i go outside to smoke cigarettes! as i go to smoke i see lights in the sky almost look like stars. but only thing that makes me think it's different is that i see planes fly over everyday and i see what the lights look like! also there are helicopters that hover over the freeway/ hwy so i see what they look like! the light i have been seeing are 3 spread across the nw/ north/ ne they stay hovering sometimes getting close to each other! but it seems like they use there lights like code blinking colors at each other! honestly strange to watch i tryed filming it with my phone but it goes to static! the other day i was having a bbq and seen lights on the mountain just above it! going on and off. we thought it was a truck on the top of the hill but the very next night my sister and i stood outside talking about the lights we seen because we seen light that looked similar but on the mountain to the right what got our attention was when orange lights went from left to right over the top of the two lights then they shut off one by one then each light went low then out?! idk what to think so i thought i would send this in.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Unknown","formattedAddress":null,"id":63763,"landingOccurred":false,"latitude":33.837896099999995,"location":null,"logNumber":"US-03062015-0007","longitude":-116.5436821,"occurred":1425283200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1425644221000,"summary":"3 ufos above mountains flashing and blinking lights at one another?!? this is every other night!","tags":["ufo","lights","hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"92220","daysBetweenOccurrenceAndSubmission":4,"locationName":"Palm Springs, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53391"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Calgary","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was observing low hanging clouds moving from west to east at approximately 50-100ft. an opening appeared in the clouds and a saucer-like craft appeared suddenly just emerging from the lower cloud layer. it stopped, abruptly turned right 90 degrees and another right 90 degrees and hovered. \r\n\r\nthe craft had what appeared to be several lights in a circular pattern around the outer base of the saucer in what appeared to be a rectangular configuration. there was no sound, no spinning of the craft that i could detect. no markings of any kind, i was not able to see the upper portion of the saucer above the outer rim. i had been straining my neck looking up at this ufo, readjusted my neck and looked up again and it was gone. nothing to indicate which direction it went. the entire experience lasted maybe half a minute. \r\n\r\ni was in the kitchen at the time looking outside to see what the weather was doing. my first observation was an opening that appeared in the clouds followed by this strange disc shaped object appearing. it hovered over my field near where my horses were. i said nothing to anyone fearing ridicule and embarrassment. i was the only person that i am aware of that witnessed this incident. i could not believe what i saw and thought perhaps it was an illusion. ","distance":"21-100 Feet","duration":"00:00:30","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Path with directional change","formattedAddress":null,"id":63762,"landingOccurred":false,"latitude":51.0531151,"location":null,"logNumber":"CA-03062015-0006","longitude":-114.0615859,"occurred":1402815600000,"potentialRelations":[],"rating":"Unrated","region":"Alberta","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1425642365000,"summary":"East bound saucer shape, lights underside made 2 - 90deg. turns and hovered. lights nappeared bright rectangular, no change like fluorescent","tags":["lights","saucer"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":264,"locationName":"Calgary, Alberta","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53392"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hebron","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Note: this is similar to a previous sighting i saw on 10/23/14\r\non the night of 10-28-14 i had a second sighting. it was orb-like and was in the exact same spot but it was around 10 or 10:30 pm.  again i was outside smoking and there it was. i ran inside and told my husband it’s back. i grabbed my camera and we both ran outside this time.   it was a bright orange light that was above the tree line again getting real bright and dimming almost out of sight. we both were taking pictures with my camera. it again rose up in the sky so slow that we really didn’t realize it. i took i think about 28 pics and one short, not so good video. we watched it this time for about 15 minutes. it moved this time westward across the northern horizon and southward across the western skyline.  for a couple of minutes it did appear to have blinking lights in a far distance (approx. 2 miles).  we lost sight of it in another tree line to the south-southwest direction.\r\nthe whole time we were taking pictures, all we could see with our naked eye is an orange, round object. we did not see what was captured in these photos. i have not been able to debunk these photos and have tried hard in my mind to think of every possibility of what it could be, but i come up with nothing. that’s why i’m filing this report. it was another clear night and again no noise. it felt weird and odd had that feeling that something just wasn’t right about it. i had never heard of “orange orbs” or mufon until after my sighting and i started looking things up on the internet.\r\n\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path with directional change,Path then hovering","formattedAddress":null,"id":63761,"landingOccurred":false,"latitude":39.94802107062897,"location":null,"logNumber":"US-03062015-0005","longitude":-82.55410185168499,"occurred":1414479600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425636814000,"summary":"Orange, round glowing light above tree line traveling from north to west then toward the south","tags":["light"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63761_submitter_file1__IMG9024.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file2__IMG9035.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file3__IMG9026.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file4__IMG9039.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file5__IMG9028.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file6__IMG9029.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file7__IMG9030.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file8__IMG9031.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file9__IMG9084.JPG","http://www.mufoncms.com/files_jeud8334j/63761_submitter_file10__IMG9034.JPG"],"weather":null,"zipcode":"43025","daysBetweenOccurrenceAndSubmission":129,"locationName":"Hebron, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53393"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"San Francisco","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My friend and i just sat down at a bench in awe, looking at the fine arts plaza building after taking a lap around. i looked at the stars above hoping for a shooting star, then i saw 3 orbs that slowly spun in a triangle formation. i didn't think of a ufo at first. i asked my friend, \"hey, what is that?\" we just starred at it for a few seconds appearing to go north, then it slowly disappeared, silently. she claimed she saw it too. then it hit me, we just saw a ufo.","distance":"501 Feet - 1 Mile, Over 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63760,"landingOccurred":false,"latitude":37.79818525361452,"location":null,"logNumber":"US-03062015-0004","longitude":-122.44996637849233,"occurred":1425610800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425634508000,"summary":"Spinning 3 bright orbs ","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"94123","daysBetweenOccurrenceAndSubmission":0,"locationName":"San Francisco, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53394"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Lewiston","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was waching tv in my livingroom then  i saw the bright light it took off at a high rate a speed flying low light up the whole block and disrupted my cctv cameras then took off in a zig zag patter alo no sound it was weird every thing went quit cars birds dogs nothing and had weird dimond shaped white light stobing in a group from the back i8 do have the whole thing on cctv camera at first i thought it was a helacopter but it had no noise at all after it took off i was spechless i have never seen anything like this befor the light the speed and te weird way it traveld i lost site after ti flew over some trees and vanished please contact me for the video i have no idea what i have but i want to make sure it goes to the right place ","distance":"21-100 Feet","duration":"00:00:41","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":63759,"landingOccurred":false,"latitude":46.429683067952524,"location":null,"logNumber":"US-03062015-0003","longitude":-117.0124887557861,"occurred":1425532320000,"potentialRelations":[],"rating":"Unrated","region":"Idaho","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425633962000,"summary":"Saw bright light with glowwing orb rising up outside my second floor window ","tags":["light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"83501","daysBetweenOccurrenceAndSubmission":1,"locationName":"Lewiston, Idaho","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53395"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Sitting outside on back porch with my mother and observed in the night sky a light which appeared to be a plane. one whiter yellowy one on bottom with a faint glow of red on top, possible one more yellow light in the middle, but was a bit far and blurry. it appeared to fade a bit, then get a little brighter. then the light separated into two, one slightly higher and further ahead than the other. it thought, were it a plane, the way it separated would have made a plane appear to turn sharply toward the ne, but instead no turn was made, and the lights stayed separated continuing their nw direction. they got just about to the tree line when they vanished completely. there were no clouds in the sky or view obstructions as it hit the point of vanishing. nor was there any sound. later, (approx 30 mins) after going inside, we did hear a plane. being indoors and hearing such a noise, we certainly would have heard that being outside were the object observed a plane. there was also no contrail, where in another part of the sky i had seen a lingering one from a previous airplane flyover.","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63758,"landingOccurred":false,"latitude":43.809003399999995,"location":null,"logNumber":"US-03062015-0002","longitude":-120.5517112,"occurred":1425620580000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425633851000,"summary":"Saw lights i thought were a plane, but the lights separated in a way unlike a plane","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53396"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hebron","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On the night of 10-23-14, i went out on my back porch to smoke. it was around 9:00 pm. i was facing north and i saw an orange, round, glowing light just above a tree line that was about ½ mile away. i watched the light for about 3 or 4 minutes (approx 7 min. total). it would get so dim that you could barely see it and then it would get real bright. i kept waiting to see the blinking lights or other separate lights because at first i thought it was an airplane coming in to turn west to go to the columbus airport and as low as it was, i should have been able to see some other green, white or red lights but i didn’t. i thought i’m going to grab my camera. i ran inside, grabbed by camera and managed to take 4 pictures. it had appeared to have risen three or four inches (if i were to judge it with my fingers) straight upward in the sky. i did not see it rise, that’s just where it was by the time i got back outside with a camera. it finally just dimmed or faded out and it was gone. it seemed very odd or weird to me. that’s why i grabbed my camera.\r\nthe columbus airport is 25-30 miles from my house and i have seen thousands of planes “with” blinking lights at low altitudes and high altitudes and still have been able to see them flashing. the object i saw on this night did not have a sound and it was a clear night. i dismissed as just weird and went inside. i had told by husband about it.\r\nnote: similar sighting happened on 10/28/14","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63757,"landingOccurred":false,"latitude":39.956289236918124,"location":null,"logNumber":"US-03062015-0001","longitude":-82.5565007111058,"occurred":1414123200000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425633621000,"summary":"Round, orange glowing light in north about 1/2 mile away above tree tops hovering and later rising and fading away after approximately 7 minutes","tags":["lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63757_submitter_file1__IMG9009.JPG","http://www.mufoncms.com/files_jeud8334j/63757_submitter_file2__IMG9010.JPG","http://www.mufoncms.com/files_jeud8334j/63757_submitter_file3__IMG9011.JPG","http://www.mufoncms.com/files_jeud8334j/63757_submitter_file4__IMG9012.JPG","http://www.mufoncms.com/files_jeud8334j/63757_submitter_file5__sharlottesnyderdrawing102314adj.jpg"],"weather":null,"zipcode":"43025","daysBetweenOccurrenceAndSubmission":133,"locationName":"Hebron, Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53397"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"My niece was in the kitchen when she noticed it. she yelled to everyone that there was something in the sky. sure enough there was. it was 10:15 and dark outside. the object was just hovering above the trees across the street in the farmers field. it was flashing red and yellow lights and then started to fab off like it was going dark and shot to the right . it immediately shot back to the left and remained in the spot originally seen . it would go back and forth and did this pattern for over an hour . then it moved to the left and disappeared . we still are creeped out about it .  the dogs were barking on and off during the event and everyone felt very uncomfortable . ","distance":"Over One Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path","formattedAddress":null,"id":63756,"landingOccurred":false,"latitude":40.4245171,"location":null,"logNumber":"US-03052015-0020","longitude":-82.89938300000001,"occurred":1425542400000,"potentialRelations":[63788],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425627832000,"summary":"Hovering light in the sky ","tags":["lights","hovering"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ohio","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53398"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Hoover","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Me and a couple of friends had decided to go out and camp in a big field on the outskirts of our town. we arrived around 9pm, set up our stuff, and went for a walk around the area. upon our return, we started hearing suspicious noises from the nearby woods, and fearing coyotes, which have been known to cause trouble in our area, we packed up our stuff and moved to the brighter lit area next to a nearby parking lot. eventually, we fell asleep (probably around midnight or 1:00 am), but at about 3:00 am i suddenly woke up, and noticed the craft. it came in from the northwest, over the parking lot, flying in a straight line, like a plane. however, there was no noise at all, and it was flying very low, i definitely would have been able to hear it were it a normal aircraft. physically, it was black, and triangle/chevron shaped, kinda similae to the infamous b2 bomber. it was very hard to make out though, so i can't really describe an exact shape. i probably wouldn't even have noticed it were it not for the lights, three of them if memory serves. one on each wingtip and one on the nose. i don't remember the exact position or color, as it was 3 am and i wasn't exactly functioning at maximum brain capacity, but i'm pretty sure all of them were red, maybe orange. i woke up my friends and tried to point it out to them, but before they could see the craft it flew behind the trees and out of sight. the rest of the night went pretty normal, we slept peacefully and went home safely, but i'm definitely keeping an eye out, especially after i saw another mufon report about a black triangular craft over i-459, in the same city.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Wings","flightPath":"Straight-line path","formattedAddress":null,"id":63755,"landingOccurred":false,"latitude":33.3195811907284,"location":null,"logNumber":"US-03052015-0020","longitude":-86.85544083356555,"occurred":1423393200000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Chevron","source":"MUFON","status":null,"submitted":1425627708000,"summary":"Saw a black, triangle shaped craft fly directly overhead with no sound emitted at all.","tags":["sound","triangle"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63755_submitter_file1__PhotoGrid1425616862126.png"],"weather":null,"zipcode":"35226","daysBetweenOccurrenceAndSubmission":25,"locationName":"Hoover, Alabama","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53399"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover)","city":"Liberty Hill","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was locking the patio door when i pushed back the curtain i saw a multitude of red lights in the sky(night).   i called my husband to come look.   we both counted the lights separately and both saw 12.   red-orange colored round lights that did not blink.   the intensity did not change.   the pattern was a random one.   two of the lights were very close together and then one of the two dropped down to the earth in a straight line.   no flashes or explosions were seen from this.     the lights moved in one direction going from the left to the right(we are facing south).    in a few minutes they were out of sight.   my husband saw airplane lights to the right of this viewing.   we thought at first if might be a bunch of helicopters, but then the lack of sound and lack of blinking lights ruled that out.  we were so amazed at the sight that we didn't think to try to take pictures!   we watched the lights till they were out of our site range.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Straight-line path","formattedAddress":null,"id":63754,"landingOccurred":false,"latitude":30.68616109105538,"location":null,"logNumber":"US-03052015-0018","longitude":-97.93363502424582,"occurred":1425613500000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425625958000,"summary":"Observed 12 red orange non blinking lights moving across sky in random order without sound. ","tags":["sound","lights"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"78642","daysBetweenOccurrenceAndSubmission":0,"locationName":"Liberty Hill, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53400"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Garland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"In the past i have had experiences seeing crafts hovering over my home before and taking my sister and i.  i have in the past seen entities entering my bedroom and taking me with them.  however, last night i have no memory except for not remembering going to sleep and waking up extremely drowsy like i had been drugged.  i remember this sensation from previous experiences.  when i woke up i opened my door and noticed foot prints that appeared from the middle of the yard where a bi-pedal entity walked towards my door and the prints stop at my door step.  there are no return prints.  i have included several photographs. i would really like to know what left behind these very strange prints.  whoever left them was heavier than myself as far as i know because the prints pierced the snow into the ground.  this is the first report i've ever made of any of my experiences.  i've never actually seen evidence left behind before after any of them.  for comparison i imprinted my own foot about 4 inches to the side of it and it appears to be about 11 inches long.  thank you very much for your time, i apologize i do not have further information to give you on this incident.","distance":"20 Feet or Less","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":63753,"landingOccurred":false,"latitude":32.85964935229916,"location":null,"logNumber":"US-03052015-0017","longitude":-96.67029578345272,"occurred":1425553200000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1425625374000,"summary":"Did not observe craft.","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63753_submitter_file1__IMG20150305204733.jpg","http://www.mufoncms.com/files_jeud8334j/63753_submitter_file2__SAM2758.JPG","http://www.mufoncms.com/files_jeud8334j/63753_submitter_file3__SAM2763.JPG","http://www.mufoncms.com/files_jeud8334j/63753_submitter_file4__SAM2765.JPG"],"weather":null,"zipcode":"75041","daysBetweenOccurrenceAndSubmission":0,"locationName":"Garland, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53401"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover), Unknown","city":"Canyon Lake","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"At home with my husband and we step outside to let the dog out. it was about 7:48pm and we look up to check and see if our \"star friend\" is there tonight. sure enough just like almost every night we see it. it is so large you cannot miss it. it is a star-like hovering object in the clear night sky. it has rays of light that shine from it all along the bottom and sides but never the top. it is extremely bright. it moves ever so gently up and down and side to side as if it were hovering. this \"star\" is so large in size that i just cannot believe no one else here is reporting it. this \"star\" will sometimes stay in its position for hours. i have stayed up past 1:00 am with it even. we have been watching it for months and we always see it in the same place in the sky despite the time that passes or the earth's and constellations rotation. there have been times when we have seen it \"die out\" and \"relight\" in a repetitive manner. but mostly it just shines extremely bright. this \"star\" never makes noise. we have seen planes and helicopters even pass very close by it but nobody seems to be saying anything about this. it is truly just plain obvious and stands out. i can confidently say that it will be here tomorrow and the next day and even the day after and so on.... \r\n\r\nwe also have some strange imprints on our back door window. i am quite freaked out by these as they look like smaller than palm sized face prints with large almond eyes and brow structure. these prints are from the outside of the window and they look like they have an apple shape to the tops of them and the \"eyes\" are so close together they just about touch. there looks to be no nose but under the eyes in between it looks like teeth??? there are two, one at the very top of the window and the other in the middle. the size which is a bit smaller than a palm is strange to us because of the height from the floor to the base of the window is about 4ft. this back door is to our small partially covered deck with stairs going off into a small meadow and woods. it is very creepy because it is as if something was pressing its face in our door window and looking in. i will not wash this off in case some one wants to investigate. i cannot say in confidence that it is from an unknown creature at all but it sure is unusual and doesn't look like it was naturally formed by the elements. i hesitate to say it but none the less i will, they resemble very small \"greys\" and are slightly different in proportions to each other but the same size as though they are two completely different face prints. \r\n\r\n","distance":"Over 1 Mile, Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary","formattedAddress":null,"id":63752,"landingOccurred":false,"latitude":29.8752177,"location":null,"logNumber":"US-03052015-0016","longitude":-98.2625127,"occurred":1425613680000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1425624739000,"summary":"Hovering star-like object moves side to side and up and down.","tags":["hovering"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"78133","daysBetweenOccurrenceAndSubmission":0,"locationName":"Canyon Lake, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53402"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Shelbyville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Checking noises outside,looked up and seen lights in the sky,went in got camera and took pictures,this is what i seen.","distance":"Unknown","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Other","formattedAddress":null,"id":63751,"landingOccurred":false,"latitude":42.51941279040172,"location":null,"logNumber":"US-03052015-0015","longitude":-85.51887111245394,"occurred":1425456000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1425617295000,"summary":"Noises outside went outside and seen lights in sky","tags":["lights"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63751_submitter_file1__IMG1892.JPG","http://www.mufoncms.com/files_jeud8334j/63751_submitter_file2__IMG1893.JPG","http://www.mufoncms.com/files_jeud8334j/63751_submitter_file3__IMG1894.JPG","http://www.mufoncms.com/files_jeud8334j/63751_submitter_file4__IMG1895.JPG"],"weather":null,"zipcode":"49344","daysBetweenOccurrenceAndSubmission":1,"locationName":"Shelbyville, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53403"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Albany","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was driving down salem rd. in the west bound. as my view cleared out from behind trees at davidson st. ne i could see an orange light in an unusual place about 25-35 feet above the tree and building tops at 7:34 p.M. i tried to calculate where it could be hovering as i kept one eye on it in passing. i figured it was due south before i crossed the tracks around burkhart st. i kept glancing at it even in my side mirror and it stayed in one place until i had no more view of it. my best estimate, knowing the area well, would be over the main shopping area between pacific blv. to 14th somewhere. i arrived at my destination down salem rd. closer to main st. at 7:39 p.M. i could no longer see it anywhere in my view as i walked to my friend's place. after greetings the cat wanted out really bad and when let out the object was sighted again. \r\nat 8:05 p.M. it came from the direction i had seen it earlier. my friend said it rose quickly at an angle from behind some trees in that direction then abruptly moved west. at this time i came out and we watched it hover while he shot some very blurry footage. it was glowing very bright, mostly shades of oranges, with flashes of red. it appeared bigger than the streetlamps nearby though it was at some distance up oak st. closer to queen st. than before. i thought it looked bell shaped with a rim at the bottom. after about 3 min. it began to move rapidly due south and ascending.It was gone in a couple of seconds.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Hovering then path,Path then hovering","formattedAddress":null,"id":63750,"landingOccurred":false,"latitude":44.6094657,"location":null,"logNumber":"US-03052015-0014","longitude":-123.1136617,"occurred":1425526440000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425615657000,"summary":"Hovering, bright, orangish, lights on glowing bell shape over pacific blv.To samtiam blv  as seen from old salem rd.","tags":["lights","hovering"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"97322","daysBetweenOccurrenceAndSubmission":1,"locationName":"Albany, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53404"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Carson City","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"On a clear day. my cousin and i were both 7 years old. we entered a small enclosed field on the edge of town and saw the craft on the ground. there were some pieces of metal pig hut along the treeline from a tornado and at first i thought it was one of those. we approached and it zipped up in a zig zag manner.\r\nit was silver and had a little bit of heat wave shimmer. i don't remember any features, it happened quickly. \r\nmy mother says we came back very \"wound up\" so she went to look and found a flattened, burnt area with holes like a coffee can was shoved in the ground.\r\ni don't remember being afraid but i was scared of the fuel oil tank on legs after that and kept dreaming about a long flat chicken coop back there.\r\ni just painted a pic and decided to update a report i made a long time ago in which i think i got the year wrong. after talking to my mother and narrowing down when i was there i pinpointed the year.\r\n","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":63749,"landingOccurred":false,"latitude":43.1742943,"location":null,"logNumber":"US-03052015-0013","longitude":-84.8502054,"occurred":-121050000000,"potentialRelations":[],"rating":"Unrated","region":"Michigan","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1425613774000,"summary":"First was on ground then rose in a zig zag fashion","tags":["none"],"timeZone":"America/New_York","timeZoneName":"America/New_York","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63749_submitter_file1__img027.jpg"],"weather":null,"zipcode":"48811","daysBetweenOccurrenceAndSubmission":17901,"locationName":"Carson City, Michigan","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53405"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I've posted two facebook statuses to date about my experiences. i will transcribe them, with dates, below, as this is by far the easiest way to tell my tale.\r\n\r\ndecember 16th, 2013\r\n\r\ni have been debating bringing something up for some time now. some of you may look at me like i'm batshit bonkers, but i hope i have proved my sanity and my intelligence over the years, at least enough for you to lend me some credence when i say something completely outlandish. \r\n\r\ni had a very long discussion with a good friend the other day and maybe it's finally time to bring it forward. \r\n\r\nthere is no way to ease into this conversaion, so i'll put it bluntly. \r\n\r\ni have had close encounters of the fourth kind. for many years, several times per year. \r\n\r\nfor those of you who do not know what a cefk is, it is prolonged close contact with an alien being. no, not a mexican - an extra-terrestrial life form. \r\n\r\nand no, i have never been taken aboard a spaceship. i've never been probed. i've never been poked and prodded or the top of my head taken off and i've certainly never been seduced by an alien queen to save their dying race.\r\n\r\nthey don't do anything really. \r\n\r\nfor nearly as long as i can remember, the first instance i can remember being at the age of four, i will have a visit from what i tend to refer to as a gentleman, three to five times a year... every three months or so, usually, some times with an extra one thrown in.\r\n\r\ni wake up in the middle of the night in a panic for no apparent reason - very similar to what someone might call night terrors - instantly, fully awake, terrified, panicking, unable to move, unable to speak and unable to breathe, at least at first. \r\n\r\nthe only thing i can control are my eyes and my breathing. and near me, maybe two or three feet away, is a small grey. \r\n\r\nnow, greys are what most individuals will recognize as a stereotypical extra-terrestrial. small, smooth grey skin, big, almond-shaped jet black eyes, tiny nostrils, thin lipped mouth, usually hairless. \r\n\r\nthey scare the daylights out of me. even running across a photo of them awakens a nameless dread in my heart - odd thing? only very specific types of artist renderings or supposed photographs upset me. i can instantly tell if something is cgi or real - every time a new video comes out, i know months in advance if it is a hoax or 'undeterminable.' \r\n\r\nand there is a particular video on the internet that was deemed 'undetermined' that when i saw it, the thought that crossed my mind was innocent, but terrifying - \"she's just a baby. let her go.\" an unspoken rule of psychology - to know an infant, you must have observed an adult. to know a gender, you must have observed both. so that is very frightening to me on a very deep level. it is the first time i really considered that perhaps these occurrences were not nightmares or flights of fancy. \r\n\r\nback to the gentleman in my room - he is older, i can tell that much. how, i'm not sure. he doesn't do much. he observes me. passes a hand over me now and then, but he never touches. he doesn't poke or prod or anything of the sort. he simply observes. and occasionally, he will wave a hand about in the air, almost as though touching a computer screen - i think he's indicating something to a computer in his head, perhaps something over his eyes - much like our own google glass. \r\n\r\nmy waking state goes from petrification to irritation. there is no threat except for the fact that i am restricted. i cannot speak but at times, when i... how shall i say, think, at him, he usually stops and stares, cocks his head to the side and then makes another note. i'm not sure if he can understand my thoughts, but something does indicate that he can perhaps read my moods and my emotional level. i can understand snippets of his thoughts and emotions, i know that much. they aren't so much words as occasional images - and no worries, no plans for world domination there. just curiosity.\r\n\r\nlike i said, my first experience with this occurred when i was four years old. that is the only time i can remember there being more than one individual and the only time i can remember them physically touching me.\r\n\r\ninteresting note - this occurred during a period of time while i had the chicken pox. this has no relevance other than the fact that over the years, i have noticed that there are two scars on my stomach, just above my hip, that are perfectly identical to one another and have no similarity to any other chicken pox scar on my body. in fact, they appear to be tiny burn scars. i didn't realize this until about two years ago, when i burnt myself with a cigarette ember. \r\n\r\nmost ufo conspiracists jump at this when i have discussions with them and tell me they probably left some sort of implant. i do not have any such thing anywhere in my body. i've had multiple x-rays, ct scans, mri's and the like. never found anything unusual. \r\n\r\nbut, i've always found the notion of them leaving something metal or ceramic in the body to be silly. these are beings that can traverse the stars - they would be beyond these things. even as primitive as we are compared to these beings, we are beginning to understand and utilize nano-technology and biological computers. \r\n\r\ngiven that i have had several medical oddities occur in my life, i personally think that they may have injected nothing more than a few cells into my body that take readings and they can read when they are in close proximity to me. it would certainly explain why they run their hands through the air above me. reading something magnetic, perhaps. also, radio equipment sometimes behaves strangely in my presence. \r\n\r\nthese medical oddities aren't something to be laughed at, either. i have never broken a bone in a serious way, even though i have been in many serious accidents, my knuckles a few times in fights, my knee cap in what should have been a fatal, 90 mph accident while not wearing a seat belt. my wounds heal at rates that are about twice as fast as predicted by professionals.\r\n\r\ni was born with asperger's syndrome. i went through a childhood that, in a general consensus, should have left me a serial killer or a pedophile or a rapist. i was on so many prescription drugs as a child that it stunted my growth. i was under five feet tall until i was 15, 16 years old. \r\n\r\nwhen i reached that age - my depression became self manageable. i took myself off over 120 mg's of ritalin a day, over 30 mg's of paxil a day, 10 mg's of abilify a day and 50 mg's of zoloft a day without any withdrawals or negative side effects - all on the same day. i grew to 6 foot 2 inches in a year and put on about 120 lbs of muscle. my asperger's became manageable and truthfully, hardly noticeable. my creative levels jumped through the roof - i was suddenly able to draw, paint, work with ceramic. i could look at patterns and discern things that nobody else could see was there. my intelligence level leaped from near genius to well above genius status. i hardly ever get sick. family members around me will be sick for three weeks at a time while i will be sick for two to three days with the same symptoms. \r\n\r\nwhat does any of that have to do with anything? i'm not sure. but that is when the visitations went from 1 - 2 a year to 3 - 5 times per year. that the visitations jumped from maybe half an hour to an hour at a time to a full three to four hours at a time. i'm convinced there is a connection between the increase in visits and length and my unusual physiology. that for some reason or other, they took an interest in keeping me alive for observation.\r\n\r\nso this leaves the question of why. why me? possibly exactly because of my childhood. that for some reason or other, what i lived through did not change me into a delusional psychotic set on killing people. perhaps they are interested in autistic individuals, perhaps asperger's individuals specifically. i've always been a little off. a little different. \r\n\r\nand that certainly fits into my ideas of what they are - they are not so different from us. corporations and big pharm aside, pure scientists do not interfere with nature. they go out, they tranquilize, tag and release and then visit their subjects once in a while to better understand them. i view what they are doing to me as no different. as harmless observation and data gathering. and i don't mind that. having said that - when a scientist comes across a unique specimen, they pay extra attention to it and give it extra good care, perhaps even to the point of protecting it so they can learn as much about it as they are able.\r\n\r\ni just wish they'd talk to me instead of restraining me. but, as my friend pointed out - i would be a very large specimen. i am big, fast, powerful and intelligent. bears can be tamed, yes? but you don't go up to it in the wild, hand it a cigarette and discuss politics with it. you protect yourself any way you can until it is used to your presence. i hope, one day, that my curiosity to converse with them will overpower the fear i have while they are in my presence and maybe, just maybe, they'll let their guard down. \r\n\r\nanyway... that's my crazy tale. think of it what you will.\r\n\r\n\r\nfebruary 26th, 2015\r\n\r\n\r\ni made contact last night. one finally spoke to me.\r\n\r\nat least, i think... i will post what i can remember. i openly confess that my conscious mind is continually trying to convince me that this was a dream.\r\n\r\ni was lying in bed, somewhere between dream land and the waking world. thoughts wandering. you know how it is. \r\n\r\nsuddenly, i became, as i often have in my lifetime, aware of a presence. this night, however, i was not struck by the paralysis. not an involuntary one, however. i was so terrified i could barely move, but move, i could. i pulled myself up and huddled against the wall.\r\n\r\nmy door creaked open and in walked a strange creature. \r\n\r\nin my previous posts, i have described these creatures as a-typical greys. small, hairless, enlarged eyes. the usual \"alien\" image which has pervaded the human mind for centuries. \r\n\r\nthis individual was different. \r\n\r\nhe was tall. above eight feet, he had to stoop to avoid hitting my ceiling with his head. his body was thin, very thin. i couldn't see much of him, he turned his body so he was shrouded in darkness. his face was comparable to the beings which i have seen before, but it was ancient beyond anything i can describe. withered and hard, but with an emotion i can only describe as softness in the corner of his massive, black eyes. \r\n\r\nhe \"spoke\" to me, although no words left his mouth and i don't think any left mine either, throughout the entirety of our conversation. i'm not even sure words encompass what i experienced. my room fell away and we were left in darkness. flashes of colors, scenes from distant worlds i can't describe in any way other than \"fantastical.\" soaring skyscrapers, flashes of movement, bizarre creatures with too many eyes and limbs that moved like fluid, glass domes and red and gold skies over green oceans. \r\n\r\nhe told me his name was \"prou,\" pronounced \"prow,\" (the spelling somehow appeared in my head) and he was pleased to finally meet me. \r\n\r\ni, in a moment of incredulity, extended my hand and he shook it with his. it felt strange, wooden in texture, but warm and soft. it enveloped my entire hand and he held it for a moment before telling me that it brought him joy to experience friendship with someone he had studied closely for so many years. \r\n\r\nhe apologized for the many years of fright and assured me there was no need to be afraid. he told me there was a purpose behind their visits - and the visits millions of other people around the world have, but are completely unaware of. \r\n\r\nhe told me that they were not aware i could remember, not until they came across the memory of my last post about their visitations. told me it made me an oddity in their eyes and unique in their experience, that i could accurately remember a real visit. i asked what he meant, and in a moment, i understood the reasoning behind extra terrestrial encounters... to a degree, at least. as far as my limited human understanding could grasp. \r\n\r\nthey harvest memories. they observe our world, our culture and our society through our eyes. he also told me that for some reason, when confronted with a visitation, the human mind will create memories that are not quite real (abduction stories) to adjust for the amount of fear they feel. the vast majority of people who are visited will never be aware of their visits. the human mind simply represses it. the et's themselves have no hand in making us forget - our mind does not want to remember, so it does not. my accurate memories of visits and contemplation of them makes me very unique in their books, it would seem. \r\n\r\nhe told me that the human race is unique in the universe in how young we are and yet how advanced we have become. in the past two thousand years, we have nearly caught up to their civilization, which is nearly twenty thousand years old. they are the greatest of this galaxy's civilizations. we are accomplishing feats in decades which took them centuries to work out. as a result, they, and the other races of our galaxy, are afraid of us, but they want to understand us before they approach us. \r\n\r\nas a bynote, he told me that his civilization, nor any other, has yet to discover a way to travel to other galaxies. nor have they made contact with any beings from another galaxy. it may be impossible. but they are hoping that we may unlock the secrets to intergalactic travel. \r\n\r\nhe's not sure, but his civilization believes that their rather unscrupulous, arrogant ancestors may have had a hand in our creation and evolution. it isn't the first time they've come across a random world with beings that resemble themselves in a distant manner. they feel the need to watch over us as a result. they do not directly interfere, but they are constantly watching us in silence.\r\n\r\nhe told me that our visits are purely scientific. each of their subjects are injected with a biological particle - he admitted being impressed that i had thought of that possibility. the particle is quantum in nature. it phases in and out of this reality. it cannot be found unless you know how to find it. as a result, it is capable of storing massive amounts of information, but it cannot be read at a distance. they must be within three meters of the particle. many people are \"visited\" from outside their dwellings - hence why there are videos of extraterrestrials outside windows, doors and in backyards. \r\n\r\nour visits are information dumps from this \"biological hard drive.\" it stores our memories, thoughts and experiences. \r\n\r\nin harvesting this information, they have been able to greatly advance their own culture. his explanation was that humanity and humans as individuals are vastly more creative than their own. they are a logical people, and as such, have limitations. humans, he said, are basically insane - and as a result, think so far out of the box that we end up inventing things far beyond our time. and we are so diverse that we devote massive amounts of time to thousands of projects - he said if we could breed out our aggression, we would be the only utopian society besides his own in the known galaxy. \r\n\r\nthey seek out unique individuals - those with genius intellect, the mentally unstable but still functional, the creative thinkers - and they observe their minds for the spark of innovation. \r\n\r\nthey take our mundane, day to day ideas and they create each and every one of them. if you are one of their subjects, every crappy daydream invention you've come up with, they have made it, utilized it, improved it, tested it and either incorporated it into their lives or done away with it. in the past thousand years, we have improved their technology a thousand fold.\r\n\r\nthey also plant ideas in our heads - ingrain their presence in our culture and lore in the hopes that we will accept them when we finally meet. \r\n\r\nand he told me to tell of our meeting. told me i am a prized subject and that they have influenced my life, mind and body in ways i cannot comprehend. that they watch over me and many others like me since we were little children. \r\n\r\nwe are star-children and we are their friends in their eyes. we have no need to fear them. he told me we would meet again soon and we would have much to discuss. \r\n\r\nthen... he asked if i wanted to come with him. told me i could live a thousand years and see a thousand worlds. never want for friendship or admirers. \r\n\r\nto my own surprise, i told him no. although i have wanted nothing more than to traverse the stars and often daydream of other worlds... i'm not ready for that, and i have too much to live for here. too many people i love that i could not bear to never see again. my children, my lover. i told him that maybe at the twilight of my life, i would be ready. \r\n\r\nhe told me he understood, and in a moment i was back in bed and he was gone. i laid there a long time in a daze before coming back to reality. \r\n\r\nthere is so much in my mind right now i want to share, but i don't know how. \r\n\r\ntake it as you will...\r\n\r\nend\r\n\r\nand that's my story. i don't know if you've had anything similar or if you'll ever get back to me - but i feel compelled to share this story, no matter how insane it my seem, with everyone i can. \r\n\r\ni hope to hear from a mufon representative soon. \r\n","distance":"20 Feet or Less","duration":"","entityEncountered":true,"favorited":0,"features":"Unknown","flightPath":"N/A","formattedAddress":null,"id":63748,"landingOccurred":false,"latitude":43.9763248,"location":null,"logNumber":"US-03052015-0012","longitude":-99.8952431,"occurred":1424937600000,"potentialRelations":[],"rating":"Unrated","region":"South Dakota","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1425612205000,"summary":"I met one. ","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":7,"locationName":"South Dakota","triangle":false,"type":"Alien Encounter","$$hashKey":"object:53406"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Morpeth","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"The incident happened as i was driving north along the a1 in northumberland, england between morpeth and alnwick on 4th march 2015. it was about 3.30 pm, sunny with scattered cloud and good visibility.\r\ni noticed a white, cylindrical object to the east of me, approximately in the vicinity of acklington. \r\nat first i thought it was an aircraft, as it looked like a plane's fuselage with it's wing tipped towards me making it difficult to see, but i quickly realised that it had no windows or tail.\r\ni considered that it might be some sort of unusually shaped balloon, but it was a windy day and the object was hovering in place and maintained a stationary position throughout the sighting.\r\ni initially found it difficult to judge the height of the object. the cloud was quite low and as a cloud went past it, i expected the object to go into or over the cloud, but it was actually lower than the cloud which passed behind it.\r\nthere is military air traffic,as well as commercial flights in the area, but i ruled out either of these as it was so unusual and anyway, it was far too low for a commercial flight in this area. aircraft descending into edinburgh do so much further to the north.\r\nthere is a small airfield nearby, but this mainly serves microlights and small aircraft and it was clearly not a helicopter.\r\ni was puzzled, then excited, but mostly puzzled. i watched it for about 15 minutes. frustratingly, i looked away for a few moments and when i looked back it had gone, so unfortunately i didn't see it move.\r\nit definitely wasn't receding into the distance at all. it stayed in the same place and then a few moments later it had vanished.","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":63746,"landingOccurred":false,"latitude":55.171850000000006,"location":null,"logNumber":"GB-03052015-0011","longitude":-1.684853,"occurred":1425511800000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Cylinder","source":"MUFON","status":null,"submitted":1425603168000,"summary":"Cylindrical object stationary despite strong wind. good visibility","tags":["none"],"timeZone":"Europe/London","timeZoneName":"Europe/London","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":1,"locationName":"Morpeth, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53407"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Peru","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"While attending college at the campus of a thousand oaks located in the southeast corner of nebraska in 1968, my world view took another turn.  some locals in downtown peru mentioned to me that some students at a keg party had been frightened by some bright object that rose up out of the woods next to them the night before.  there was quite a buzz in classes as spring was changing the landscape of this beautiful/remote campus.  by the end of the week rumors were still flooding the campus.  shortly thereafter i heard that the dean’s secretary had been followed by a bright light just outside here car window as she and her child were going from peru to another town.  the following week i had to go to the administration building and decided to approach her and ask a few questions.\r\nupon asking her about her experience she turned noticeable pale and began shaking.  she gave a brief response about the event and i left, not wanting to upset her further.  however, it was evident that she was extremely scared.\r\n\r\nlater, a student told me that a disc ten feet in diameter had flown over down town peru in broad daylight and that two local officials had seen it.  they immediately jumped into a pickup and chased after the object to a wooded area near the missouri river.  upon walking into the woods with loaded guns they suddenly looked at each other and retreated quickly.  even though they did not see anything in the woods they sensed that they were in the wrong place at the wrong time.  i knew both of these individuals and they were not the type of people that scare easily.\r\n\r\nas rumors of sightings continued on campus i became distracted by meeting and dating my future wife.  for our first official date i had decided to take j for a walk along the bluffs of the missouri river.  there was a place about one mile south of downtown peru that required about a twenty minute climb.  at the top of the bluff there was a bench.  looking east, where we could see iowa, missouri and nebraska.  for several hours we enjoyed the view and got to know each other.  as the sun went down we started back to the car.  we arrived at the car as darkness fell.  i was in the process of starting the car when j said, “what’s that?”.  i looked up to see where she was looking and then, upon looking to the east, i was blinded by phosphorus looking light hanging over the missouri river.  i couldn’t look directly at it for it was too bright.  for the next fifteen minutes we watched as it hung there motionless then, it started to move to the south maintaining the same elevation of about 30 degrees.  at this point i got out of the car to see if i could hear anything but no sound was coming from the object.  turning to the south i looked up at a ninety degree angle and observed four star-like objects moving around each other in outer space.  as i turned to the west i looked north and saw one star-like object rising up off the northern horizon moving fast.  in outer space, as it passed over me, another object split off of it to the west without losing speed.  the original object continued to disappear off of the southern horizon.  i later calculated its speed at approximately 80,000 mph.  then, looking south again i followed the object that we had first seen dancing further south.  after about twenty minutes it stopped at what appeared to be the same elevation directly over the nuclear station being built south of brownville, nebraska.  having rafted down this part of the river recently, i was familiar with the distance.  \r\n\r\nthe student sightings continued for about a month and a half that spring until graduation.  j and i got married and stayed in peru for the summer.  i wanted to get back out to the missouri river valley for observations at night but driving back and forth to nebraska city each day and working drove the agenda.  i should note though that there was some reluctance on my part to going out there at night by myself—i never did.  before graduation i had tried unsuccessfully to get other students to go out with me.  there is no doubt in my mind that the nuclear station was the main attraction.  along those bluffs at least 60 students and locals were involved in sightings during this time period.  one of my friends had contacted offutt air force base that spring but they didn’t share what was going on in those bluffs or in outer space.  overall, 1968 was an amazing year.\r\n","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Hovering then path","formattedAddress":null,"id":63745,"landingOccurred":false,"latitude":40.4741686,"location":null,"logNumber":"US-03052015-0010","longitude":-95.7336054,"occurred":-52765200000,"potentialRelations":[],"rating":"Unrated","region":"Nebraska","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1425601705000,"summary":"Nuclear connection suspected at brownville, nebraska in 1968","tags":["none"],"timeZone":"America/Chicago","timeZoneName":"America/Chicago","tweeted":0,"urls":[],"weather":null,"zipcode":"Unknown","daysBetweenOccurrenceAndSubmission":17110,"locationName":"Peru, Nebraska","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53408"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Whittier","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Before going to bed i took the dogs outside. when ever i go outside i always look at the night sky and pay attention to the planets and stars. when i looked up, it looked like there was an unknown planet next to jupiter. i wondered to myself what that planet was. then it started to move to the east, so then i thought it was the international space station. i watched it like i have watched the space station in the past but after about five seconds, to my shock and surprise the object did a u-turn and started heading west. i kept watching as it started to execute what looked like slow lazy downward spirals almost like a glider or sail plane. then it would start climbing straight up and gain altitude which did not maneuver like any conventional aircraft i have ever seen. i ran to call my boys to come look. one son used his ipod to video for only a few seconds, why for only a few seconds, i don't know. i told my other son to video the object too, but for some reason and to my dismay, he only took a few pictures. the object kept traveling up and down and circling around toward the west slowly then  gaining speed as it climbed and then slowing down again and again. i looked at it through my binoculars and when it came towards my direction i saw three white lights in a straight line. when it circled and turned the other way, i think there were three red lights. i never heard any sound and there was no other aircraft in the area. it finally meandered toward the west and i couldn't see it any more. the whole observation lasted for about twenty minutes. my boys and myself are left with the impression that this was not anything man made.","distance":"Over One Mile","duration":"00:20:00","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Stationary,Hovering then path,Straight-line path,Path with directional change,Path then hovering","formattedAddress":null,"id":63744,"landingOccurred":false,"latitude":33.9814893,"location":null,"logNumber":"US-03052015-0009","longitude":-118.02767399999999,"occurred":1425534300000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Circle","source":"MUFON","status":null,"submitted":1425600753000,"summary":"After noticing stationary bright light it started to move and circle around then meandered west out of view.","tags":["light"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":0,"locationName":"Whittier, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53409"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Ilkeston","country":"United Kingdom","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I always star glaze but only this time i caught a small ball of light i managed to snap a few pictures i took 2 pictures which took me around 20 seconds as i looked at the camera and then looked back to the object it was gone. the object made no sound no strange movements i saw it was moving slowly and was spinning.","distance":"101-500 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Hovering then path","formattedAddress":null,"id":63743,"landingOccurred":false,"latitude":52.975018,"location":null,"logNumber":"GB-03052015-0008","longitude":-1.311008,"occurred":1425535380000,"potentialRelations":[],"rating":"Unrated","region":"England","reportedWeather":null,"shape":"Fireball","source":"MUFON","status":null,"submitted":1425590204000,"summary":"Orange ball of light","tags":["none"],"timeZone":"Europe/Dublin","timeZoneName":"Europe/Dublin","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/63743_submitter_file1__P1030650.JPG","http://www.mufoncms.com/files_jeud8334j/63743_submitter_file2__P1030651.JPG"],"weather":null,"zipcode":"de7 8au","daysBetweenOccurrenceAndSubmission":0,"locationName":"Ilkeston, England","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53410"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (under cloudcover), Over 500 Feet (no cloudcover)","city":"Eureka","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"10 pm, full moon, clear night, pulsating red starlight object caught my eye from a window facing south.  i was surprised to see such a bright red light on a bright full moon night.  i continued to stare at the object through my window and then searched for my camera, and exited the house to the back yard, where the object was continuing its flight path in a northerly direction.  the object flew above a dark cloud like cover almost overhead as my neck was strained gazing in its direction and disintegrated. never reappeared and continued its trajectory, just extinguished itself. ","distance":"501 Feet - 1 Mile","duration":"","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":63742,"landingOccurred":false,"latitude":40.76219705038403,"location":null,"logNumber":"US-03052015-0007","longitude":-124.13797737723019,"occurred":1425536100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1425588947000,"summary":"Pulsating red light with a straight flight path then disintegrated in dark cloud like cover","tags":["none"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":[],"weather":null,"zipcode":"95503","daysBetweenOccurrenceAndSubmission":0,"locationName":"Eureka, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53411"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Hobbs","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Driveing down highway on edge of town returning from movie. noticed flares approx 3feet dia traveling approx 2feet above power line running along parallel road 1/2 mile distance 30 mph. car was traveling 60 mph. going opposite direction. converged and turned onto road heading opposite direction to return friend home who lived down that road. thought flares might be overload power burst from power station. had never seen anything like it. after turning onto side road and heading towards friends house passed by power transfer station on way to friends house.When passing power station car suddenly died. pulled off side of road under power station lights. got out of car, all 4 of us. thought car might be out of gas although gas gage was reading 1/4 tank. sent friend to restaurant 1/2 mile away to call brother to bring gas. while standing outside car waiting for friend to return a flare started traveling along 3 feet above power line. when our eyes automatically back tracked back to the origine of the flares path  with our eyes looking almost straight up above our heads there was a hovering disc 30 feet  above us no lights silent. apparently it had been there for the approx 5 minutes we had been standing outside the car but we never looked up directly above our heads all that time. we were astounded because it was so close and we had not seen it.Although it had no lights the power station lights were reflecting off it and clearly showed a grey disc easily visible with sharp edges and blotting out bright stars in the clear desert sky altitude 3600feet msl. our mouths fell open and tears were forming in my eyes. no more flares came out as we observed it approx 15 min. after observing it for approx 5 min it very very slowly started to ascend straight up. i got the impression that it was in distress.It took 10 min for it to ascend until it appeared the size of a dime. all this time it was clearly visible with a sharp outline. seconds later it disappeared from sight .When it had ascended to an altitude where it was the size of a nickel my friend returned from calling his brother for gas and witnessed the last 2min of the sighting.We put the 3 gal of gas in the car and it started and we went home. we called the police to report it and the officer seemed annoyed and gave me an excuse that seemed to me to be a stock answer to give people who report ufos. he said white sands 300 miles away had tested a rocket that day. the next day i checked the gas gage on the big buick and it was 1/2 full. i'm 63 now and have never reported this again. i have only told about a dozen people in my life. i just wanted to get this story out before i die. i am a retired aircraft mechanic for a major airline. aim also a commercial pilot rated to fly many types of aircraft. thanks for listening.","distance":"21-100 Feet","duration":"","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Stationary","formattedAddress":null,"id":63741,"landingOccurred":false,"latitude":32.708241599999994,"location":null,"logNumber":"US-03052015-0006","longitude":-103.12988030000001,"occurred":-79117200000,"potentialRelations":[],"rating":"Unrated","region":"New Mexico","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1425587312000,"summary":"Launch flares.That followed power lines hovered above power transfer station ascended straight up very slowly and disappeared 4 witnesses all alive today","tags":["none"],"timeZone":"America/Denver","timeZoneName":"America/Denver","tweeted":0,"urls":[],"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":17415,"locationName":"Hobbs, New Mexico","triangle":false,"type":"UFO Sighting","$$hashKey":"object:53412"}],"last":false,"totalElements":82751,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":851}
