{"content":[{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Mohave","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"It was late in the afternoon on the day of the first landing of the spaceshuttle columbia. i was a stringer for nbc news and shot the landing from thedry lake bed.I left edwards air force base and headed back to the san joaquin valley onhighway 99.Late in the afternoon, i saw something that looked to be a dark spot on the sun.I pulled over and got out my binoculars. the sun was too bright, so i waitedtill the sun started to set. soon, the dust from the earth allowed my binocularsto see what cannot be anything but ufo92s.First there was the large round ship that i could see with my naked eye and gaveme the reason to pull over, thinking it was a sunspot. when i looked below thelarge ship, i saw six smaller ships lined up three in a row, like on a dice, allat 45 degree angles. next to these93dots94 was a long dark bar like a pencil that was twice the length of the large sunspot ship. all these items were stationary is space between earth and the sun. idid an experiment to see if i was just seeing things. i positioned myself infront of distant telephone poles and placed the ufo92s directly behind them.  i watched as the group slowly dropped at the samerate as the sun. they started above the telephone wires and as the sun set theyended up below the telephone wires till they all sunk into the horizon.These things had to be huge since they were not even close to being on earth anddropped into the horizon at the same rate of the sun.I am amazed to this day, that no one has reported this and if they have, i wouldsure like to know about it.Thank you,steven whetstone","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":3225,"landingOccurred":false,"latitude":35.2143346,"location":null,"logNumber":"","longitude":-113.7632828,"occurred":356146200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":356146200000,"summary":"It was on the day of the first landing of the spac","tags":["landing"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mohave, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567689"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Anaheim","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. i was outside the city water treatment facility, looking up into the earlymorning sky, facing south. observing the position  brightness of the moon, andthe planet venus.2. i looked up again, as i was going back into the building, and saw it. atfirst i noticed how bright the object was, how fast it was moving,  how itappeared rather abruptly, without any sound at all.3. at firsti thought that the object was a meteorite shooting star, and that itwould burn up as it fell.4. my reactions were that it was not a meteorite, a commercial airliner too fastor a satellite too low alt. i was amazed that it was silent.5. the object was the brightest one in the sky - as it traveled at a high rateof speed - in a direct straight line, and not changing course. i thought thatperhaps the front of the object was reflecting the rising sun, but it was still40 min. from sunrise, and the object was too low in the sky. it was very bright.As it moved away from me , heading east, i noticed that the sides and back ofthe object were dark - with the luminous front gradually disappearing from myvantage point - and i think a small red, or redorange type of light was on itsleft side.6. it moved along its course, and was no longer visible because of the terrainhills.Additionally, i logged onto the j-track program on the web, and no east boundaircraft were being tracked at that time, around my position.If this was one of our u.S. military aircraft, it is definitely classified.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3224,"landingOccurred":false,"latitude":33.8529621,"location":null,"logNumber":"","longitude":-117.7476656,"occurred":1094042700000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1094042700000,"summary":"Saw bright object.","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Anaheim, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567690"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New Gloucester","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were out on the deck following supper, chatting, observing the night sky anddoing a little stargazing. we had just cleared the dishes when my brother lookedout to the west, and there the thing was in the very first few short seconds oflooking at it, i remember thinking my god is that some kind of a huge militaryjets headlights plowing right at us, thinking that the pair of orbs couldpossibly be the mist-enshrouded headlights of some kind of super- giant miltaryjet...But it was just seconds before i realised that that made no sense at allfor numerous reasons - the thing appeared to be almost stationary at first,there was no mist, and there was no sound, to begin with, plus i realised thelights were just plain all wrong for such a thing, and the thing was changinganyway as it moved towards us almost immediately negating my initial thoughts.To the naked eye, the thing glowed a bright, slightly greenish-white. form-wise,it looked sort of like a single dumb-bell with a shortened bar between its ends- two distinct, roundish halves connected by a little bar, glowing verybrightly. as it moved towards us, the bar elongated and the orbish forms at eachend appeared to shrink somewhat but continued to glow a little bit more brightlythan the bar. as it moved even closer, it slowly began to fade in and out a bitin brightness mostly fadingbut to spread in form and size until it became like agiant, softly glowing amoeba or, indeed - a distant galaxy, very freeform.Looking through the binoculars at first when it was still the very defineddumb-bellish shape, it almost had the appearance of like a miniature northernlights type thing, except it was all basically just bright whitish green with noother color with maybe just a trace of rainbow-prism action at the featheryedges and it still had that very defined form to it, but it was kind of allflowing and shifting around the edges. about halfway into the watching of it, ateveryones insistance, i called wcsh-tv our local nbc news affiliate, and sureenough, the person i spoke to in the news room said theyd received numerousother calls, and some folks were saying theyd seen more than one of whatever itwas i was asked a bunch of questions and the woman said they were trying to getto the bottom of it and that if they figured it out, it would definitely be onthe eleven oclock news - well no soap not a word... no one found it in any ofthe papers today, either this thing has got to be in the news somewhere -","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3223,"landingOccurred":false,"latitude":43.970913,"location":null,"logNumber":"","longitude":-70.2775436,"occurred":1093969800000,"potentialRelations":[],"rating":"Unrated","region":"Maine","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1093969800000,"summary":"Bright glowing prconnected orbs movesmorphs west t","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New Gloucester, Maine","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567691"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Atherton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Lying in a hammock on a summer saturday looked at clear blue afternoon skybetween non moving branches of oak tree, noticed a starplanet on a clear day itwas chrome like reflective, didnt move. i asked my son to bring binoculars andnoticed it appeared ovalspherical. i could not make out any windows but couldeasily see no bottom attachments, rotars, wings etc, which would be manmade.Thesfo flight pattern is around my house and they turn at 12 to 1 mile in the airto land. a jet flew by crossing its wing across the object giving someperspective as i believe it was perhaps2 or 3 miles from me. as i watched withbinoculars, the bottom seperated slowly and decended a hundred feet or so.Itbottom 13, slowly moved east and appeared more discal shaped. the originalbody remained motionless for a few more minutes until it slowly moved west.After a while i lost sight of them both.Just wondering if others had seen thisat about the same time. as near as i could tell, it must have been situated overthe south san fran. bay.-clayton heatley","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":3222,"landingOccurred":false,"latitude":37.4613272,"location":null,"logNumber":"","longitude":-122.197743,"occurred":1056967200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1056967200000,"summary":"Sighting,summer,last year daytime","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Atherton, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567692"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Chicago","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I know that you will not post this but i still want someone to read it. i wastraveling eastbound on touhy ave. and i always look up at the planes and i am anavid aviation enthusistsp and have many many years of experience and canidentify most commerical planes in a matter of seconds. what first struck meabout the object was how small it was in comparison to a plane on the 27l flightvector this is the standard course and altitude that the palnse take to land atohare. it was so small about the size of the tail section of a 747. and what wasmost striking was that it was flying south to north directly over the path ofthe incoming planes....That is what caught my eye. then after i viewed it withmy mouth open, it literally disappeared. i am a lay expert when it comes toplanes disappearing and reappearing it is a common affect of an airplane againstcertain color skies. this dissappeared on a clear blue day.  i thought you mightwant the info.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3221,"landingOccurred":false,"latitude":41.8860836,"location":null,"logNumber":"","longitude":-87.6281682,"occurred":1093727760000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1093727760000,"summary":"Ufo seen going across ohare flight path","tags":["ufo","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Chicago, Illinois","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567693"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Beckley","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I first noticed the object above the tree line as an indistinct blob. i grabbeda pair of binoculars and when i returned the object had moved and was larger. iobserved a distinct shape as if two opposing crescents had been joined togetherwith a large point in the center of one.The object continued to move slowly across the sky, growing larger and fainteruntil it was lost to view almost directly overhead.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3220,"landingOccurred":false,"latitude":37.7781702,"location":null,"logNumber":"","longitude":-81.1881557,"occurred":1094011200000,"potentialRelations":[],"rating":"Unrated","region":"West Virginia","reportedWeather":null,"shape":"Boomerang","source":"MUFON","status":null,"submitted":1094011200000,"summary":"Slowly moving luminous object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Beckley, West Virginia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567694"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Eugene","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Friend called me and said the news said there was a ufo over eugene.  kezi localtv station i guess showed it with some nice zoom in from their camerason the1100 news.  he said it had been up there for a couple hours and that the newshad been getting calls on it from about 900 pm.Another friend and i drove to where it was reported.  there were a few people inthe parking lot.  they pointed it out to us.  it initially was very dim withlight pollution and haze.  we brought our cameras and a pair of binoculars.It moved a bit then hovered and we were able to get a better view of it.  wewatched it for the next 20 - 30 minutes while more people from town streamed in. it was too faint for our cameras to pick up, but with the binoculars there wasmuch more clarity.The object would move a bit then hover in place for about 5 minutes or so, thenmove in another direction and hover again.  you could tell it was hovering byits stationary position to background stars.  when it moved sometimes it wasslow, and sometimes very fast.  total movement over 20 minutes encompased about90 degrees of the sky.  eventually it moved rapidly down and farther off andwent over the horizon.  this seemed like a controlled movement and not like itcrashed.If the object moved normally it would have likely been mistaken for an airplane. with the binoculars it had various lights in a triangle shape.  a red one uptop, and a green one on the left and sometimes another green one or red one onthe right.  the green light would sometiems be very bright, and other timeswould dim, perhaps as the light pointed other directions.  at one time itstarted flashing a bright blue light in the middle for a total of 4 lights.The news is going to repeat their coverage on their morning editions.  kezichannel 9 in eugene.  a call to the station indicates they shall not likely putthe video online, unfortunately.The day was sunny and about 90 degrees and clear skies.  some haze then cloudsmoved in at night.  clouds a couple hours later were moving opposite thedirection that the object was last seen travelling.  the moon was near full butin the other half of the sky.Due to the flight characteristics it seems the object is unidentified.  it wasnot a plane because planes dont hover for 5 minutes at a time.  it did not movelike a baloon and although its movement was mostly zigzag and it sometimes movedslowly like drifint, its was also controlled, and wou","distance":"501 Feet - 1 Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":3219,"landingOccurred":false,"latitude":44.0619591,"location":null,"logNumber":"","longitude":-123.0807436,"occurred":1094019300000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1094019300000,"summary":"Ufo over eugene oregon, august 31, 2004","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Eugene, Oregon","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567695"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Hampton","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"We were standing on my neighbors porch and i noticed behind the clouds what ithought was possibly the moon - but it didnt look right. the clouds passed andthere was a glowing object that i jokingly said looked like the bat signal butit was more like a butterfly. it pulsed somewhat in we 4, spoke of. it slowlydrifted ne and began to dissapate but still glowed. it looked to me that therewas one area to the left of the object - one small area that flashed a few times- although it may have been my eyes playing tricks from staring at it.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3218,"landingOccurred":false,"latitude":42.9427732,"location":null,"logNumber":"","longitude":-70.8334019,"occurred":1094011200000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1094011200000,"summary":"Glowing almost  butterfly shape mass","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Hampton, New Hampshire","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567696"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"Can anyone confirm a comet in the sw sky relative to ny state around 9 pm estnebulous object with very faint tail observed from 9pm to around 930pm in sw skystarting at about 45deg moving very slowly to about my zenith 90 deg. seemed todissipate as the sighting went on. moved very slowly in relation to the stars.Tried unsuccessfully to observe through telescope, but was able to observe using10x50 binoculars.1. me and my wife were out for a walk.2. we were looking up at the stairs and noticed it at the same time.3. had no idea.4. see description.5. see description.6. slowly dissipated.Would very much appreciate it if any one can confirm a comet. the object seemedto me to be extremely high in the atmospherenot a comet or not very farin thesolar system, maybe a cometout in space. thanks","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":3217,"landingOccurred":false,"latitude":40.7606495,"location":null,"logNumber":"","longitude":-73.9635176,"occurred":1094011200000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1094011200000,"summary":"Can any one confirm a comet","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567697"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Poplarville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1. at home sitting on my deck 2.The lights 3.Did not know 4.Amazment 5.Theobject was huge it was approx. 2 miles high w and appendage out the back of themain body. it had several lights in the further most corners.What amazed me wasthe size,it completely blocked out stars if i had to guess i would say it wasaleast 3 football fields long and half as wide.It made almost no sound just aslight hum. it appeared to move so slow ,a normal aircraft would have not stayedaloft. i watched it for about 5 minutes till it was out of sight.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3216,"landingOccurred":false,"latitude":30.8483563,"location":null,"logNumber":"","longitude":-89.5242615,"occurred":945063000000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":945063000000,"summary":"Huge ufo","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Poplarville, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567698"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Poplarville","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"1.Family home 2.Heard the jet 3.Ufo 4.Amazment 5.Three metal disk following amilitary jet,flying aprox.100 yards behind and in triangle formation.6.Whenf.B.I. pulled into yard. they wanted to know what had happen a few days beforeatthe railroad tracks about a quarter of a mile from our house.A friend saw atriangle shape object as big as a houseon the tracks.Also several people in town5 miles north saw this object.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3215,"landingOccurred":false,"latitude":30.8401863,"location":null,"logNumber":"","longitude":-89.5342315,"occurred":-2736000000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":-2736000000,"summary":"3 disks following jet","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Poplarville, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567699"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Renovo","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I would like to report that i, along with a number of adults, didsee a ufo in the fall of 1952 dont hold me to the date, but there is anewspaper story that confirms this. it was a summer or fall evening ithink fall. i left my house about 930pm to walk to a small store for asoda. as i was walking east on erie ave at 10th street, in renovo, pa, isaw what i thought was a full moon over the ne mountain. i was about 10at the time and although i wasnt a trained observer, i was aware of andinterested in science so it occured to me that it was unusual for themoon to be where it was in the sky. it took about 3 minutes or so to getmy soda and when i left the store, walking west now, i looked over myshoulder and the moon was gone. i thought it had set rather quickly,but i was involved in something at home and didnt think any more about it.The next evening, in the renovo daily record, there was a story abouta flying saucer over renovo. it seems that a number of men who wereworking in the pennsylvania rail road marshalling yard had also seen theufo and had watched it traverse from the southern mountain to thenorthern mountain i just caught the tail end of the scene. while therewas some speculation about the object i seem to recall that the war inkorea was on-going at the time and there was concern that ourmarshalling yard might be the subject of bombing...I know now that thisis nonsense, but at that time, this seemed sort of real. we were doingduck and cover at school etc..Im 62 now and retired from ibm. over the years, i considered thevarious alternatives it really was a full moon - nope, not according tothe ephemerishow about venus - no wayi later owned a six inchreflecting telescope and it wasns a planet or a starfireball - nope,none reported in pa for that dateairplane with landing lights on - noton any air route, no sound and way too large, to say nothing of landinglights which would have been pointing in the direction of flight,essentially north, not westnoticlucent clouds - too late and far tomuch motionhallucination - maybe, but it struck a really strange groupof people, railroad brakemen and a 10 year old. my net a genuine ufowith insufficient information to resolve oh, i almost forgot theresno swamp gas anywhere near the sighted position as it was about 500 feetabove the valley floor.I doubt this is of much use to you but let it be","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3214,"landingOccurred":false,"latitude":41.3264556,"location":null,"logNumber":"","longitude":-77.7508202,"occurred":-546982200000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":-546982200000,"summary":"Saw large disk moving s to n","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Renovo, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567700"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Kingsland","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was the passenger in a truck headed to kinglsand, ga, headed south on i-95.Theobject was seen while we were approaching exit 6 6 miles from gafl line. thedriver could not see the object once we were close enough for me to realize thatit did not seem to be moving. it seemed to stay in the same spot in the air forthe duration of the sighting until we were too far away and trees obscured theview. the object was a few hundred yards sw of i-95 exit 6, perhaps about800-900 feet in altitude.At first, i thought the object was a plane, naturally. however, a plane thatlarge, would require some velocity to stay aloft. this object seemed to be justhovering motionless. the only problem with my assertion is that i was in amoving vehicle. as we got closer to the object, i could see that there were 3bright lights in an equilateral triangular pattern. occaisionally, pure blue skywas behind the object and a structure seemed visible. it appeared to be straightlines connecting the bright lights. there was another, less bright light thatwould occaisionally flash. it seemed to be a light red or pink color. it wassituated in the center of the 3 bright lights. the strangeness of it hit me wheni could not figure out which direction it was moving. it seemed to be locked inposition above the woods near a road called old still road. i could notunderstand how it could not be moving. it reminded me of some footage frombelgium in about 1991 of a triangular ufo only it did not seem to be moving andi watched it for at least 6 or 7 minutes. i bet someone else saw it as it wasjust a few hundred yards west of one of the busiest highways in the area on asaturday night. the driver of the vehicle i was in did not really notice it atfirst and when i decided it was strange, he could not see it from his positionwithout pulling over, which i wanted to do, but we were in a hurry to get to agig i am a professioanl musician in kinglsand at exit 3. i lost sight of theobject as we got farther away. it still seemed to be over the same area of thewoods at the same position. i could not see it anymore when we pulled into ourdestination a few mile south of the area of the sighting.","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Hovering then path","formattedAddress":null,"id":3213,"landingOccurred":false,"latitude":30.7999563,"location":null,"logNumber":"","longitude":-81.6898261,"occurred":1093750500000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1093750500000,"summary":"Possible anomolous triangle","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":["http://www.mufoncms.com/files_jeud8334j/3213_submitter_file1__RobinsonGeorgiaMufonReport.wmf"],"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kingsland, Georgia","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567701"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lake Mary","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was about 3 miles away from home,riding my bike along the road because theirwere no cars whatsoever.I was using a 5 mile range walkie talkie to talk to mymom,eveything was going so good util i got a static-like interference,i couldntcall,speak,i just absolutely could not do anything i was scared.Suddenly a bigglowing object appeared i said oh great, as the hovering unknown craftapproached i heard a unintelligable ancient-like chant and all of a sudden ifelt a deep calmness after the wierd chant all i could think of was aliens areyou going to harm methen another interuption came in,but this time it was acocky soundin guy,the large triangle had little blue looking men.Then a wholerow of tall greys and then two angry looking lizard-like beings,they were verybuilt standing on two legs with devices in their grasp but then i heard ahelicopter coming then suddenly the beings did a slow 360 degree turn into theirship and peered outside the huge, huge window and blasted off over a house thenturned upward and went into space.Then a militaryhelicopter appeared and the man said to me over the walkie talkie are you o.K isaid yes,then i replied there was a ufo that just took off with a huge roar theman started to laugh and he said thats what they all say it was only our fighterjet the f-117 goldstreakwhere did you here about them ufosthen the militaryhelicopter flew and then a older lady stepped out of her house and said what inthe world was that roaring noise that came from over my housei said that was notfrom this world it was from up thereas i pointed at the sky of stars where theextraterrestreial object used to be the lady chuckled as she shut her door.Theni started to levitate off the ground for about 2 14 of a mile but my w","distance":"101-500 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary,Other","formattedAddress":null,"id":3212,"landingOccurred":false,"latitude":28.7588833,"location":null,"logNumber":"","longitude":-81.3178446,"occurred":1092591600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1092591600000,"summary":"The things in the window","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lake Mary, Florida","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567702"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Key Harbour","country":"Canada","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"July 29, 2004 my family and i were camping on henvey island approx. 3 miles duesouth from the town of key harbour on georgian bay, ontario canada. my son wastaking pictures of the sunset he did not see a craft in the sky but he didcapture what appears to be a craft on our digital camera. attached you will find3 pictures that were taken within a period of two minutes. the last image has awhite self-illuminating triangular object in front of the setting sun. my sonnoticed this image a few minutes after taking the picture when viewing thepictures on the lcd screen on the camera back. these pictures have not beenretouched or affected in any way. i had a professional photographer look at theimage to see if he could explain away what was captured with the camera - lightreflection, spot on lens, bird, etc. - he was not able to explain away whatappears to be some sort of self-illuminated craft.","distance":"Unknown","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":3211,"landingOccurred":false,"latitude":45.883333,"location":null,"logNumber":"","longitude":-80.716667,"occurred":1091160240000,"potentialRelations":[],"rating":"Unrated","region":"Ontario","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1091160240000,"summary":"White self-illuminating triangle caught with digit","tags":["photo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Key Harbour, Ontario","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567703"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Cusseta-Chattahoochee County","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":"I was sleeping.  i woke up to find this figure over me what looked like a greyand i could see a sex organ vagina but it was just a hole.  the alien thenlowered itself onto me and i could not move or do anything.  the alien wastelling me every thing will be ok and it would not harm me. then i remeberwaking up in the morning remembering what had happened.  i checked myself to seeif i had any traces of having sex but nothing.  i dont know what happened but itseemed so real. my wife was beside be the whole night but she did not mentionanything unusual.  i usually dont remember any of my dreams after a few monthsor years.  but to this day i remember this one exactly how it happened sevenyears later.  i now live in ft lewis washington and have not had any moreencounters that i can remember.","distance":"Unknown","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":3210,"landingOccurred":false,"latitude":32.3523691,"location":null,"logNumber":"","longitude":-84.9688191,"occurred":817718400000,"potentialRelations":[],"rating":"Unrated","region":"Georgia","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":817718400000,"summary":"I think an alien raped me","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Cusseta-Chattahoochee County, Georgia","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567704"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Madison","country":"United States","county":null,"created":null,"deleted":false,"description":"","detailedDescription":null,"distance":"501 Feet - 1 Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3209,"landingOccurred":false,"latitude":41.3371456,"location":null,"logNumber":"","longitude":-72.6302272,"occurred":1093496400000,"potentialRelations":[],"rating":"Unrated","region":"Connecticut","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1093496400000,"summary":"Night sparklers","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Madison, Connecticut","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567705"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Manchester","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were looking at the stars and a bright light was blinking and it was hoveringand getting closer, we didnt know what it was at first. we were all scared andmy friend pooped. please contact me i am very concerned about my dogs reaction.As it got farther away it appeared to look like a hotdog then flashed, and itwas gone.","distance":"21-100 Feet","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":3208,"landingOccurred":false,"latitude":42.9973397,"location":null,"logNumber":"","longitude":-71.4486891,"occurred":1093511340000,"potentialRelations":[],"rating":"Unrated","region":"New Hampshire","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1093511340000,"summary":"Scary triangles","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Manchester, New Hampshire","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567706"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Amo","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I take a walk whenever weather permits with my cats, preferably at night.I had dreamed of ufos a month previously which caused me to think i would beseeing some soon. this is how my sightings frequently happened in the past, iget notice.It was a lovely night and i was watching the sky as usual but not expectinganything peculiar though i love to see shooting stars, meteors, airplanes andsatellites. iam quite familiar withlocal air traffic patterns and what goes onin my neck of the woods. amo is about 500 population and the cemetary has around paved road so it is ideal for a walk and the south side looks out at openfields and countryside facing south.I was looking up and saw two dim white lights  slightly larger than a star butmuch closer. one was over the other slightly above and they moved in tandem asone very slowly then without stopped after two seconds or so just winked outcompletely.I see planes and heliocopters all the time and know the differencethese objects made no noise whatsoever. this is just one report.15 minutes earlier on the other side of the round walkway i saw what i thoughtwas a meteor at first. it was a single dim white light larger than a star andcloser yet very high up about 50 degrees or so moving from left to right again,very slowly then without stoppin it lit up considereably and looked veryintensely bright white and larger as a result, i believe of the intensity.Then it kept moving grew dim again then simply winked out how odd to see boththese instances at once when i usually have sightings sometimes years apart.But then i had been asking to see them mentally and calling them so it did notseem like a real surprise. i am going out every night now that it does not rainand taking my camera and binoculars in case. i love being outside anyway.Many people i know have seen things here and are afraid to discuss out of fearof ridicule. i myself talk to only people who are like-minded.","distance":"Over One Mile","duration":"00:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3207,"landingOccurred":false,"latitude":39.6881019,"location":null,"logNumber":"","longitude":-86.6136129,"occurred":1093368600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1093368600000,"summary":"White lights over amo cemetary, indiana","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Amo, Indiana","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567707"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Nederland","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I had been unable to sleep well for about an hour and at 423 i got out of bed tolet the cats inside, they were meowing at the door and saw a large glowingwhite-yellow object in the sky out of the bed room window as i looked to thenorth. it was flat and long. when i first saw the object, i was drawn to howlarge and glowing it was and low in the sky.  it moved at a steady rate of speedfrom west to northeast decreasing in elevation.  the window was open but therewas not sound coming from the object even though it appeared to be very low inthe sky and close.  i ran to get the binoculars and watched it for an additional30 seconds through the binoculars and saw one red and one yellow light towardsthe bottom of the object.  none of the lights blinked. they were steady. theobject continued to move at a steady rate downward and went in back of the treesand out of sight.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3206,"landingOccurred":false,"latitude":39.9613759,"location":null,"logNumber":"","longitude":-105.5108312,"occurred":1093346580000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1093346580000,"summary":"Large cigar shaped object over golden gate canyon","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Nederland, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567708"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"South Bend","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"While watching a couple of turkey buzzards from my drive way sunday afternoon, inoticed a high flying object moving overhead to the northwest.  i thought, atfirst, it was amazing a buzzard could fly that highthen it made an instant right turn to the northeast then north with out slowingor banking.  i ran into the house and grabbed my binoculars and ran backoutside, it was still above slightly to the north.  when i got a good look atit, it was a black triangle wider than long, kind of like a hang-glider, withall red accross the back.  it made some turns back and forth then stopped,hovered for maybe 15 seconds rotated in place then shot off to east like abullet.  when it took off, it was instant full speed with no noticeableacceleration.  about 4 - 5 seconds later a commercial jet flew over going inalmost the same direction.  the jet left a contrail, the object did not.  also,i could just hear the jet noise, but the object made none.It looked to me, the object was at about the same altitude as the jet justscimming the bottom of a small puffy white cloud.  the object also looked aboutthe same size as the jet, a little smaller than my little finger nail at armslength.  i believe someone else had to have seen this being a mostly clear daywith just a few puffy clouds.  i also believe the pilot of the jet must haveseen the object.  the object was in my sight for most of about three and a halfto four minutes.","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3205,"landingOccurred":false,"latitude":41.6858113,"location":null,"logNumber":"","longitude":-86.2448066,"occurred":1092609900000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1092609900000,"summary":"Saw a black triangle","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"South Bend, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567709"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Northborough","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My son and i were in the back yard lying down looking at the very clear sky at10pm. before viewing what we could not id we watched a satellite move overheadand saw planes flying towards boston. we saw some shooting stars as well. then inoticed another satellite and saw it was not one light, but three shaped in along triangle moving sse in unison. two lights followed the first. it did notseem to obstruct any stars that i noticed. it may have, but i was not watchingfor that.When we first saw it we were facing south. it was around 2 oclock high, belowthe elliptic and east of the milky way.It appeared to be moving at a similar speed of most satellites and towards thesse. we watched it for just a couple of minutes before it faded out. if i heldmy arm out straight and placed the object between my finger and thumb it wasabout an inch.","distance":"Unknown","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3204,"landingOccurred":false,"latitude":42.319538,"location":null,"logNumber":"","longitude":-71.6411786,"occurred":1093237380000,"potentialRelations":[],"rating":"Unrated","region":"Massachusetts","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1093237380000,"summary":"3 lights in a triangular shape move like a satelli","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Northborough, Massachusetts","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567710"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Arvada","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was relaxing in my hot tub in back of my house, with my eyes closed. i heard acrackling sound, which caused me to open my eyes. i immediately saw what iperceived as a meteor, that traced a path from near zenith until it went behindthe trees in a north-northeasterly direction. the color was orange-red, and itleft a glowing trace. i sure looked like a meteor to me, but the cracklingsound, almost like embers in a fire popping, was highly unusual and caused me tocall 911 to see where i should call to report this sighting. i was directed tocall the ufo hotline, where i was encouraged to report my sighting here.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3203,"landingOccurred":false,"latitude":39.8120644,"location":null,"logNumber":"","longitude":-105.0793742,"occurred":1093239360000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1093239360000,"summary":"Crackling sound meteor sighting","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Arvada, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567711"},{"address":null,"addressResolution":null,"altitude":"500 Feet or Less","city":"Charlestown","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My son and i were watching the pleiades meteor showers when my son got tired andgot up  we were watching them in my side yard to go to bed as he was about toturn the corner he turned to say good night but stopped short and pointed up andbehind me. i got up to see what it was that he was pointing to and there was abright light coming toward us. as it got closer we could that the shape wastriangular in shape with a brilliant white light at each corner.This object was jet black in color but we could tell the shape by thedisappearence of the stars and the reappearence behind it. the object made nosound and moved directly overhead. its lights seemed brilliant but had no extralighting outside of the beam of each of the three lights. its travel was in anorth-east direction and was in site till the tree line obscured it.  tree lineis approx. 14 mile behind my house","distance":"101-500 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3202,"landingOccurred":false,"latitude":38.45824,"location":null,"logNumber":"","longitude":-85.6664006,"occurred":965982600000,"potentialRelations":[],"rating":"Unrated","region":"Indiana","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":965982600000,"summary":"Triangle with lights on each corner","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Charlestown, Indiana","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567712"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Utica","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":null,"distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":3201,"landingOccurred":false,"latitude":43.104913,"location":null,"logNumber":"","longitude":-75.230064,"occurred":1093152600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1093152600000,"summary":"Three white lights, long triangle in the night sky","tags":["triangle","lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Utica, New York","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:567713"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"1. i was in my truck and my father was driving home from new jersey. i waslookin g out the window. 2. i was looking aa tplanes. looking up, and theobects3 flew at a slow pace but fast above my head. 3. i thought ufo. 4.When isaw it i felt excited because ive always wanted to see a ufo. after samething.5.It glowed as it flew. a goldish brown color. i wasnt sure how the 3 objectswere powered. it had a hover effect but traveled forward. 6. i lost site becauseit was very cloudy and it went through the clods. i never saw it again.","distance":"101-500 Feet","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Straight-line path","formattedAddress":null,"id":3200,"landingOccurred":false,"latitude":40.0597638,"location":null,"logNumber":"","longitude":-74.4003212,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"New Jersey","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1038643200000,"summary":"My dad was driving home from new jersey and i saw","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New Jersey","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567714"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Steens","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was sleeping outside on my land in steens ms on august 13.  about 1000 or 1030i saw an intermittent bright light traveling across the sky directly above me atan extremely high rate of speed.  it had a level trajectory and made no sound. it lit up three times before i lost sight of it from the tree line.  i have noidea what the object was, but it didnt cause me concern.  i went to sleep afterthat.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3198,"landingOccurred":false,"latitude":33.5714198,"location":null,"logNumber":"","longitude":-88.3109878,"occurred":1092460800000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1092460800000,"summary":"Lights in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Steens, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567715"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Steens","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was sleeping out on my land in steens ms on the night of 1314 august 2004. about 400 a.M., i was sleeping outside i saw three or four bright objects to thewest that would appear, disappear, and then reappear in different locations, butin the same area of the sky.  they made no sound.  i watched for a few minutes,then, went inside the camper to sleep.  i havent found anything on the internetthat would explain this, not even a good example on the ufo sites and was hopingyou might have an idea what it was.  ive also reported reported another object isaw around 1000 pm.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":3197,"landingOccurred":false,"latitude":33.5691398,"location":null,"logNumber":"","longitude":-88.3091978,"occurred":1092481200000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1092481200000,"summary":"Jumping stars","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Steens, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567716"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Steens","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was sleeping outside on my land in steens ms on august 13.  about 1000 or 1030i saw an intermittent bright light traveling across the sky directly above me atan extremely high rate of speed.  it had a level trajectory and made no sound. it lit up three times before i lost sight of it from the tree line.  i have noidea what the object was, but it didnt cause me concern.  i went to sleep afterthat.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":3196,"landingOccurred":false,"latitude":33.5634498,"location":null,"logNumber":"","longitude":-88.3161478,"occurred":1092460800000,"potentialRelations":[],"rating":"Unrated","region":"Mississippi","reportedWeather":null,"shape":"Bullet,  Missile","source":"MUFON","status":null,"submitted":1092460800000,"summary":"Lights in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Steens, Mississippi","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567717"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Crawford","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"The three of us were in black canyon of the gunnison national monument at ourfriends cabin, it was around 1035 pm and we were laying on the roof gazing atthe stars. since i am working on a degree in astrophysics, i was busy pointingout various constellations, messier objects, planets and the random satellites.All of us were interested in how bright and obvious venus was in the westernsky. just around this time is when we saw a bright flash near venus. all of usstoppped and looked at each other knowing instantly that none of us knew what wehad seen, i think it is wise to mention that my other friends are both engineersand neither of them knew what we saw either. we did not hear any sound after,during or before the flash either, it looked like it had come from the  left ofthe bright planet. also there were no airplanes in the sky nor were there cloudsto have produced lightning. the area around the cabin is very secluded, andsince fire works are prohibited in the mountains in colorado it would seemhighly unlikely that this could explain what we saw, plus the nearest town is tothe north-east.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":3195,"landingOccurred":false,"latitude":38.7038767,"location":null,"logNumber":"","longitude":-107.6089466,"occurred":1086629700000,"potentialRelations":[],"rating":"Unrated","region":"Colorado","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":1086629700000,"summary":"Bright flash in south-west colorado","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Crawford, Colorado","triangle":false,"type":"UFO Sighting","$$hashKey":"object:567718"}],"last":false,"totalElements":82760,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2656}
