{"content":[{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Centerville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Ill make this short and sweet..It looked in the window at me and i looked at it,we stared for a moment and i said to my self  what the hell is that and wecontinued to stare at each other and at the time no one talked about aliens backthen so i thought it was a guost..And a while later7b yrs7d the rag magasines came out with a picture of an alien and i said to mymother,  that is what i saw it was white, you could almost see through it and ithad round black eyes..This is really hard to describe. and i had a burning smellin my nose for about a week after. and when i was about 12 orso the sky lite uplike it was on fire and i turned around and my house was behind me..I didnt knowhow i got there and my motherfather and brother were gone..I still find it verypuzzling..And a short time later a man from the government came to my housewearing  a suit, carrying a briefcase and drove a big black car and asked my dadwhat he had seen along with my neighbors..I was young and didnt really stickaround to hear him..I just thought it was kinda cool, a guy from the governmentcame to our house..We lived in the country kinda and it was rare to see someonein a suit, let alone from the government...And my brother told me years later hesaw one  elien  look in the window..It was white with big black eyes and longboney fingers. he will not talk about it anymore. he thinks people will thinkhes crazy..That was in michigan..Then like i said i saw one look in the windowat me when i was in tennesse when i was 17..But the one i saw was white withround black eyes..There have been other things also but its a long story..I dontcare who believes me...I know what i saw and what me and my family also saw..And how come all of us who have seen them say the same thingthey are white humanform with black eyesbelieve me or not i dont really care, but that is what i sawwith my own eyes... karen","distance":"Unknown","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2663,"landingOccurred":false,"latitude":35.7789565,"location":null,"logNumber":"","longitude":-87.4669587,"occurred":-76438800000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-76438800000,"summary":"Karen77","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Centerville, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1715"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fort Worth","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was going to whataburger that night for a burger of course and i saw somethingup in the sky. like...Something on fire but it was pretty high up and it wasobviously moving. i passed one treeline and made sure that it wasn92t just a flag or a radio antenna or even a sign on a building...It was toohigh for that. so i passed a second treeline and it was more faint. then ipassed a building and when i could see that part of the sky again, it was gone.At first i was thinking it was a plane on fire or something along that nature,but it just disappeared. very odd.It seemed to me that what i was seeing was the exhaust from a jet-engine.Instead of there being a shape of the actual object, i saw the shape of the fireor jet propulsion. it was red-orange and it was flickering, but the object wasdefinitely moving. the shape of the emmission, i suppose, was blimp-like.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2662,"landingOccurred":false,"latitude":32.732039,"location":null,"logNumber":"","longitude":-97.3125696,"occurred":1067760000000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Blimp","source":"MUFON","status":null,"submitted":1067760000000,"summary":"Saw red-orange blimplike object","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort Worth, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1716"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Fort Worth","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Facing south around mid night, looking up at the stars while the dogs went outfor the evening. saw a star move slowly thought nothing. then it moved very,very fast south east, then stoped, stayed like that for about 30 secounds. icalled my friend inside the house and asked her to look at it wanted to makesure i wasnt mistaken. we looked up and it moved so slow for 5 or 10 sec. thenit speed across further eastward and vanished.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2661,"landingOccurred":false,"latitude":32.734609,"location":null,"logNumber":"","longitude":-97.3181496,"occurred":1067802900000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1067802900000,"summary":"Floating bright light at midnight","tags":["floating","light"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Fort Worth, Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1717"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"High Point","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I walked out our back door at approx 1207am. because i often have troublesleeping, i am accustomed to searching the night sky for anything i may considerunusual. we live 3 miles from an airport piedmont triad intl and i often seeplanes at a distance. i saw what appeared to be an exceptionally bright, coloredstar in the eastern sky. after watching it for only 20 seconds or so, i couldsee that it was the most unusual star, or plane, i have ever seen. i thought my17 year old son was upstairs and i was afraid to lose track of the object. iopened the back door and called him. he was in the kitchen and i called hisname. i told him to get out here, quick, im not kidding.We both watched the object for 45 minutes. it seemed to be miles away but wecould see it had a quality to it that was so unusual that it certainly wasnt aplane and was very unlikely to be a star or planet.The object, even at a distance, was changing colors. it had an overall whiteappearance, which remained throughout the event, but had secondary colors ofred, orange, blue, almost cobalt blue, and green. these colors did not flash ina pulse-like manner, but did change in succession, almost like the object wasturning. it first appeared to be closer and slowly, over 45 minutes, to moveaway. it appeared to dance side to side and up and down, more often in adiagonal pattern. in other words, not directly up and down or side to side.We attempted to use the trees in the backyard as a fixed point of refernce toconfirm or deny movement but, honestly, were never really able to cleary say itsmovement was indeed erratic although it appeared so, especially after observingother stars in the sky. what we were able to confirm using the trees asreference, was that, slowly, over a period of 45 minutes, the object moved fromleft to right, probably 10 degrees or so. other stars, in comparison, did not doso.It appeared to me to almost look like an a in the sky, or, perhaps to describeit in another way, the shape of fighter jet standing on end, nose up.After 45 minutes, i went back inside, incidentally, i called and left a messagewith the control tower at the airport, as we were so sure of its oddity toreport it.I returned to the backyard 20 or so minutes l","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Other","formattedAddress":null,"id":2660,"landingOccurred":false,"latitude":35.9556923,"location":null,"logNumber":"","longitude":-80.0053176,"occurred":1067932800000,"potentialRelations":[],"rating":"Unrated","region":"North Carolina","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1067932800000,"summary":"Object changing colors in eastern sky at midnite","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"High Point, North Carolina","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1718"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mobile","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was at a grocery store waiting for my cab and, i was looking out the front window of the store. the object grabbed my eye as it appeared from the nw and flew south and then zigged back north and imediately zigged south. the object was bright white and triangular moving quickly south. seeing the object brought a cosmic type of mind to me, very calming. the event only lasted about a minute.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Path with directional change","formattedAddress":null,"id":2659,"landingOccurred":false,"latitude":30.7039266,"location":null,"logNumber":"","longitude":-88.0415841,"occurred":1067888700000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1067888700000,"summary":"Large bright white triangular object seen over mobile","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mobile, Alabama","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1719"},{"address":null,"addressResolution":null,"altitude":"Over 500 Feet (no cloudcover)","city":"Mobile","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was outside looking for the northern lights associated with the solar flares of recent. i noticed a bright white object coming over the trees at a fast clip. the object did not make any noise and had flashing white lights it sped acros sthe sky from the southwest to the northeast. i lost sight of the object on the horizon. the object appeared to be triangular and white.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"Unknown","flightPath":"Straight-line path","formattedAddress":null,"id":2658,"landingOccurred":false,"latitude":30.7023466,"location":null,"logNumber":"","longitude":-88.0399741,"occurred":1067062500000,"potentialRelations":[],"rating":"Unrated","region":"Alabama","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1067062500000,"summary":"White triangular object in sky over mobile, al","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Mobile, Alabama","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1720"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Woodburn","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"While driving home from shopping at approximately 530 pm, i noticed a brightball of green light moving across the horizon. i also observed that there were acouple of airplanes flying at that time.  both airplanes seems to be flyinghigher than the green object and flew much more slowly that the object.  theaircraft had the typical white and red flashing lights.  the bright green ballof light was flying approximately 3 times faster than the airplanes and had noflashing lights.  it had no tail like a meteor or commet would have and it hadno trailing lights like a spot light.  it was simple a solid green ball of lightflying very straight from the west side of i-5 highway to the east side, where itook the woodburn exit offramp to my house.  the object moved rather quickly, soby the time i approached the woodburn exit, the object was already out of mysight.  any one else see anything near woodburn, hubbard, gervais oregon around530pmthank you.","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2657,"landingOccurred":false,"latitude":45.143731,"location":null,"logNumber":"","longitude":-122.8553725,"occurred":1067736600000,"potentialRelations":[],"rating":"Unrated","region":"Oregon","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1067736600000,"summary":"Green ball of light flying over oregon freeway","tags":["lights"],"timeZone":"America/Los_Angeles","timeZoneName":"America/Los_Angeles","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Woodburn, Oregon","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1721"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Meadville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"1. i was driving northbound on i-79 at mile marker 160, near meadville, pa.2. i noticed the object due to its extreme level of illumination, and its speed.3. i first thought it to be a plane, but it was much lower in altitude than aplane, and moving much faster than a plane. horizon to horizon in under 10seconds the objects bright glow did not change in intensity as it passed me fromright to left, indicating that it was not the headlights of a plane. the objecthad no flashing marker lights, and there were planes in the area to compare.4. i immediately pulled the car over to observe the object.  i had a camera, butthe objects speed did not give me the time to get the camera.5. the object passed from east to west over the highway about 14 mile in frontof me, moving pretty fast.  it then turned north and disappeared over thehorizon.  after about 1-2 seconds, it rose over the horizon again very briefly,then disappeared below the horizon again.  conditions were very clear, and itdid not leave any trail, light or dark, behind it.  it is hard to estimate theexact object distance and speed, as i do not know the actual size of the object. my estimate is it was 100 feet in diameter, and at about 1,500 to 2,000 feet inaltitude.","distance":"501 Feet - 1 Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2656,"landingOccurred":false,"latitude":41.6414438,"location":null,"logNumber":"","longitude":-80.1514484,"occurred":1067572800000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":1067572800000,"summary":"Large fast moving orange orb with no tail","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Meadville, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1722"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Amherst","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"My brother and i were looking out the bedroom window and saw a distant red lightzip left then right across the eastern sky. it then zipped left again and washovering above our house. we got our parents who were in the back of the house,i went out the front door, my father looked up out the front door i looked up atit, and ran into the house. i stood in about the center of the house, and hearda wiring soung like a washing machine on spin cycle. after a few minutes it wasgone. i felt very alone. no one else remembered this event after.  the year i amnot certian about it was between 1964 and 1968 i remember school would start ina week or two, so it had to be late august.","distance":"21-100 Feet","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Stationary","formattedAddress":null,"id":2655,"landingOccurred":false,"latitude":42.978391,"location":null,"logNumber":"","longitude":-78.7997558,"occurred":-107895600000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-107895600000,"summary":"A saucer i had seen as a child","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Amherst, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1723"},{"address":null,"addressResolution":null,"altitude":"Landed","city":"Kingston","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"On september 12, 1997, my son and i went to mow dogwood church and cemeteryafter i got off  my job. when we were finished, i asked my son what time it was. he said it was 850 pm.A few minutes later, while i was loading my mower on my trailer, my son said,what the helli asked, whats wronghe pointed to the sky and said, that star next to the full moon is moving.I looked up, and at first i couldnt tell that the star was moving. then inoticed that it moved forward and stopped. i stopped watching it, and went backto tying my mower on my trailer. when i got in between my truck and trailer, ilooked up again.  it stated to move forward again. i thought i was tying down mymower with my eyes closed. i was feeling weird.As i turned to my son, i asked him, is it gonemy son said, didnt you see it leavei said, no. where did it gohe said, it went straight up.I said, damn it i miss it.We got in the back of my trailer and set on the rails. my son was on one sideand i was on the other. we started talking  about it and looking at the sky.  wesat there a little while before we got out of the trailer and got into the truckto go home.I turned to my son and said it might have been a meteorite. when we got home, iwalked into the house and i told my wife we saw a ufo at the cemetery. i left itat that. i didnt  say any more about it the rest of the night.The next day, i got up and went to work. i told the guys at work  that i saw aufo at the cemetery. i left it at that, i didnt say any more about it the restof the day.As days went by, i had a flashback like a tv screen coming on in my head. later  when i would talk about it, i would lose my eyesight for about four or fiveseconds before my vision would return. it only happened when i would talk aboutit.I dont lose my eyesight any more. i guess it is all the memory i am going toget. this is what i remember in my flashba","distance":"20 Feet or Less","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Stationary","formattedAddress":null,"id":2654,"landingOccurred":false,"latitude":35.8809084,"location":null,"logNumber":"","longitude":-84.5085447,"occurred":874077180000,"potentialRelations":[],"rating":"Unrated","region":"Tennessee","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":874077180000,"summary":"The ship i saw was long and gold color","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Kingston, Tennessee","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1724"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lakewoodcleveland","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"About 3am this am, i was hearing noises in my joints neck muscles.Unable to sleep, i decided to walk around the neighborhood.I had observed helicopters flying approximately parralel to i-90 east,there is a hospital heliport at lakewood hospital but these were not lifleighthelicopter noises or patterns.  i am making the asumption that this may havebeen a helicopter carrying a lighting banner but, at this hour there would notbe an event. as the craft veered from what appeared to be its path along thefreeway, it turned directly north towards my location, descended slightlyand accelerated,   i again felt pressure in my foreheadsinuses, then a feelingof relief fromthe pain  tension i had felt    i originaly left my residence towalk  get sleepy   the aircraft may have been flying towards burke lakefrontairport ,  but the wind was from the southwest at the time and would have beenapproaching downtown cleveland too far to the south for this to be the case. the noise was neither helicopter nor single engine.,noise was very lisght anddistinct... i aksed a convenience store attendant the location is freuqented bylate shift policeman if he had heard the crafts or of an accidnet, no.....The object continued northward heading050-070 lihgts were sporadic,then i lostsight of it, about 315am......Later, about 0340, i observed similar light in a light ascent to the southwest,reached an altitude of perhaps 2500 then became stationery  dissapeared.The ringing in my ears and headache ceased until morning when it resumed...","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2653,"landingOccurred":false,"latitude":40.4261971,"location":null,"logNumber":"","longitude":-82.898923,"occurred":1067598600000,"potentialRelations":[],"rating":"Unrated","region":"Ohio","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1067598600000,"summary":"Triangle.","tags":["police"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lakewoodcleveland, Ohio","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1725"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Tucson","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was coming home from work and noticed a bright light in the northeast. grabbedmy 10 x 25 binocs. and started watching it at about 245 am at a dark nearbycorner where i could get a good view of it. it seemed to be stationary over thecatalina mts. and noticed 1, 2, and one time 3 lights flanking both sides of thebright main one seeming to dance around the main one, sometimes merging into themain one or fading out and then back on. even the main one would fade out  thenback on as bright as venus. sometimes i would see two equally-bright lights dothis in the course of an hour. called the davis-monthan afb here in tucson. theysaid they were getting other calls about it but could not identify it","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":2652,"landingOccurred":false,"latitude":32.2227429,"location":null,"logNumber":"","longitude":-110.920729,"occurred":1067424300000,"potentialRelations":[],"rating":"Unrated","region":"Arizona","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1067424300000,"summary":"Saw a strange hovering light.","tags":["light","hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Tucson, Arizona","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1726"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Rio de Janeiro","country":"Brazil","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"A strange but very real facti will try to recollect what happened more than 30 years ago, so please considerthat some details may be a little imprecise, even though as true as one can be.I was just 17 years old and it was in rio de janeiro, june 1970. when theweather was nice, i and my friends used to go a suburb named barra da tijuca. in the 70s, barra as we called it, had just a bunch of houses in its first 15miles of unspoiled beach now the place is full of luxury skyscrapers. aseverybody else, we bowled, laughed and had a wonderful time with our girlfriendsin front of a paradisiacal beach. close to the beginning there was a biologicalmarine reserve with barbed wire fences at both sides of the beach road. there isalso a nice restaurant at the marisco rock, at the end of the 15-mile longbeach.One day however, on friday or saturday of the week before my 18th birthday, iwas driving my girl home in my blue opala chevrolet from this restaurant alittle after 3 am. we were speeding fast on the bumpy beach side road to arriveat the girl92s home before her mother woke up. i was singing happily while listening to theradio and seeing the beautiful night sky with a full moon and bright stars. iwas totally unconcerned while my yellow high light beams vanished the darknessahead of us. when we started crossing the marine reserve with its fences, theradio suddenly started to give static and went completely off. i thought it wasjust because of a bump on the pavement. then, the road lights also went off in asequence of stretches, blackening out the entire beach, but this was not unusualat that year in rio. however, to my total surprise, seconds later bothheadlights also went off entirely96 and the engine stopped  that","distance":"20 Feet or Less","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"Window(s)","flightPath":"Unknown","formattedAddress":null,"id":2651,"landingOccurred":false,"latitude":-22.9015093,"location":null,"logNumber":"","longitude":-43.2055469,"occurred":14121000000,"potentialRelations":[1994],"rating":"Unrated","region":"Rio de Janeiro","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":14121000000,"summary":"A strange but very real fact in rio","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Rio de Janeiro, Rio de Janeiro","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1727"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Montebello","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Everything you want to know is reported at the national ufo reporting center.This is, perchance, the third appearance of this ufo in two months over a majorcity or cities, namely montebello, el monte, commerce, bell gardens, picorivera, etc.This time, the time was 1135pm on 10252003 when i went outside for a glance atthe very smokey southern californian sky due to extreme fires around whentowards the southwest which would be montebello and commerce,...The very brightred star or planetary-like ufo caught my eye once again. i wasam surprise thatit had return for the third time. also, the ufo appears only on saturdays, whichis strange because at around that time, everybody is active in fun filledactivities. and, many did see this ufo. a mass ufo sighting. yes. anyrate, itwas moving slowly towards my area, when suddenly, it changed color to white andtook the shape of a spiraling wheel with five small star-like objects dancingrather oddly. time duration of that spectical was about 2 minutes whenfinally,...It just disappeared or fade out of existence. time of disappearance1145pm. i would guess that the brightness of this ufos introduction of thatnight102502and the previous saturday nights is about the extreme brightness of awelders arc, but red.Continuing. as i stood in the backyard discussing the event with the othereyewitness for several minutes, believing the show was over,...It suddenlyreappeared. time of reappearance 1200am sunday 10.26.2003. this time it was adifferent appearance. the ufo first flashed once like a cameras flash, then inabout 3 seconds it appeared like a growing glowing white bright spherical light,like a welders arc, or like some pyrotechnic when it explodes. but the ufo didnot explode, but remained bright white for about 1 minute. then, it changed intoa christmas tree or cone shape with many little lightsred, green, white blinkingor acting rather oddly around the main object. the time of duration of that wasabout 2 minutes, when suddenly, the ufo faded out and never reappeared.For information onlytime duration of last sighting 30-35 minutesday labor day2003 appearance was,...B","distance":"501 Feet - 1 Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2650,"landingOccurred":false,"latitude":34.0165053,"location":null,"logNumber":"","longitude":-118.1137535,"occurred":1067150100000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1067150100000,"summary":"Red spherical ufo visits montebello, ca again","tags":["ufo"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Montebello, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1728"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Puerto Vallarta","country":"Mexico","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were on a hotel balcony in puerto vallarta mexico just enjoying the view wheni thought i saw a shooting star in the eastern sky. it started out in theeastern sky traveling south to north, but then the shooting star stopped,changed direction twice then disappeared.  as i pointed to the sky to show myhusband and 2 friends where this had happened, another objected appeared andbehaved in the same manner.  most of the time there were 2-3 objects visable atthe same time, zipping about the sky above the sierra madre mountains thendisappearing briefly only to reaapear seconds later, however there was onemoment where we counted 4 different lights in the sky at the same time.  oneeven stopped, hung still in the sky and pulsated brightly. this continued for30-45 minutes until a haze moved into the area from the south. we were in suchawe and excitement, im surprised we didnt wake up the whole hotel because wewere shouting out everytime one appeared. we checked the sky every night afterto see if anything was there, but nothing was ever seen again.  i am justgratefull i had the three others to witness this with me, because nobody elsewould believe it unless they had seen it themselves  i had seen this same thingbefore with only one object for about 5-10 seconds, and much much closer to uswhen in costa rica in 1995.","distance":"Over One Mile","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Straight-line path","formattedAddress":null,"id":2649,"landingOccurred":false,"latitude":20.6220182,"location":null,"logNumber":"","longitude":-105.2284566,"occurred":1066893000000,"potentialRelations":[],"rating":"Unrated","region":"Jalisco","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1066893000000,"summary":"White lights above the sierra madres","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Puerto Vallarta, Jalisco","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1729"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It is something but i dont know what it ishttpwww.Space.Comspacewatchsun_cam_animated.Html","distance":"Over One Mile","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2648,"landingOccurred":false,"latitude":31.9777788,"location":null,"logNumber":"","longitude":-99.8997831,"occurred":1066978800000,"potentialRelations":[],"rating":"Unrated","region":"Texas","reportedWeather":null,"shape":"Saturn-like","source":"MUFON","status":null,"submitted":1066978800000,"summary":"Strange object floating around the sun","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Texas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1730"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Osawatomie","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was aprox. 300 a.M.We lived in the country,i was in bed but was unable tosleep. the sky lit up like it was daytime.I got out of bed and looked at theclock and discovered that it was still night,so i walked around the houseinsidestill seeing daylight in the house . seemed like the whole countryside waslit up, i didnt see darkness anywhere.I went to check the children in thererooms and both were still asleep as well as my husband.About 20 mins. later wheni was standing in the livingroom, everything slowly began to turn back to normalnight time again. after checking on the kids again, i went back to bed and justlaid awake until morning  to see if it would happen again. it didnt. my daughterdeveloped an unusual white spot on her left rear cheek which later became so badthat she almost lost her leg. the drs. said that she had a birthmark that theblood had stopped circulating to. my son grew up with learning problems but inever related it to any of this.   about two weeks later a friend of mine cameby to visit and told me that his cousin had been killed in a car accident inkansas city because of some bright light that lit up the sky, it shocked him sobad that he ran off of the bridge. after i told him about what i saw wediscovered that it was on the same night.I didnt have a phone at the time but idid listen to the tv and radio. nothing was ever said or put in the paper.Tothis date, i am still curious and would just like to know what it could havebeen.  thank you , pat","distance":"501 Feet - 1 Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"Other","flightPath":"Unknown","formattedAddress":null,"id":2646,"landingOccurred":false,"latitude":38.4972372,"location":null,"logNumber":"","longitude":-94.9505207,"occurred":-21218400000,"potentialRelations":[],"rating":"Unrated","region":"Kansas","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":-21218400000,"summary":"Brightly lit sky at 300am","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Osawatomie, Kansas","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1731"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Los Angeles","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"It was about 2pm on a perfectly clear day.  my wife noticed a glowingcylinder-like object that was looming very high in the sky, not really movingmuch.  it kept changing shapes, moving almost like a worm.  then it formed anarrow shape and made a few very quick moves, only to return to its originallocation and start the worm-like moves again.  i watched for nearly 15 minutes,and kept wondering what it could possibly be.  at first i thought it was a lostkite, but it was so big, and so high, and it held its position for so long ididnt think it could be that.  plus, it was such a clear day and it was so high,i figured if it was kite or something like that, i would see the shiny materialrelfecting in the sun, but it held a constant glow, and didnt make anyreflections even when it moved.  it had to be a ufo and i dont really believe inthem.","distance":"Over One Mile","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary,Other","formattedAddress":null,"id":2645,"landingOccurred":false,"latitude":34.1898566,"location":null,"logNumber":"","longitude":-118.451357,"occurred":1066942800000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":1066942800000,"summary":"Cylinder, changed shapes","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Los Angeles, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1732"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Carson City","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I have had numerous sightings over the past seven years, missing time with scarsleft on my body after the missing time.  i do have video tape footage of what ibelieve are these crafts. i have mentaly asked for these crafts to appear forother people with some succsess.  this sighting was a result of an appointmentthat i asked for after and experience in the middle of the night.  the followingis the experience.  i woke in the middle of the night an alien put hishers handin mine.  it had three long silky fingers.  it was a very friendly gentlegesture but i took it the wrong way.  i tried to look up at the individual butcould not.  i could not wake my girls friend sleeping next to me.  it seems thatall i cold do is bend his fingers back and try to break them.  it is strangebecause i have been through a lot with both these aliens and humanoids and havenever been harmed.  i have had numerous sightings and experiences and want mycase researched.Thanks gary w. white psychicman99@ lycos.Com 775-849-7952","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2644,"landingOccurred":false,"latitude":39.1637984,"location":null,"logNumber":"","longitude":-119.7674034,"occurred":1067065200000,"potentialRelations":[],"rating":"Unrated","region":"Nevada","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1067065200000,"summary":"One triangle shaped craft","tags":["video"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Carson City, Nevada","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1733"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"San Jose","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Very warm summer or autumn night, approx 2230. the sky is very smoggy, so thatcommercial aircraft from san jose airport enroute to los angeles cannot be seen,though they can be heard. typical aircraft on this route includes boeing 737with the very loud rolls-royce turbines and douglas dc7 triple-engine jet.Out in the front yard, looking at the sky to try to see what aircraft are upthere and trying to find the aircraft i had heard just before and see ninebright pinpoint lights of a deep, sodium-orange color, in a triple-triangleformation  come slowly from the southeast. they must have been low, because theycould be seen through the smog, where any aircraft could not. they moved veryslowly northwest. they did not move relative to each other and did not appear tobank or change altitude. there was no sound at all from the lights, though icould hear a 737 far to the north climbing and turning south and another jet tothe northwest. i also heard a small plane go north from reid-hillview approx 30minutes prior to seeing the orange lights. otherwise, it was quiet. even thedistant freeway was silent on this night.I assumed at first that the lights belonged to a small aircraft but there was noengine noise and there was no traffic at all at nearby reid-hillview airport atthe time. the objects were also not headed toward the airport and were not onany usual flight path taken by any aircraft. then i thought that perhaps theybelonged to one or more of the new sr-12 spyplanes but they remained absolutelyfixed in position relative to each other and proceeded in a perfectly straightline as they passed overhead. any aircraft in the area would have had to usenavigation lights, being so near two airports but there were no navigationlights at all.The lights were arrayed in the vertices of three equilateral triangles which inturn formed the vertices of one larger equilateral triangle three times the sizeof the three triangles.I specifically looked for signs that they moved relative to each other, to tryto find out if it was a formation of aircraft but they did not move.There was no wind on the ground that i could tell. but i was on the lee side ofthe house and would not have noticed a breeze. the prevailing wind in this areais from the north-northwest, which is the direction the objects were goingtoward.I continued to watch the lights until they were no longer visible through thesmog. the total arc during which they were visible was approx. 90 degrees. ittook a long time for the objects to traverse that arc.There is no selection to indicate smoggy sky conditi","distance":"Unknown","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2643,"landingOccurred":false,"latitude":37.3417357,"location":null,"logNumber":"","longitude":-121.8933055,"occurred":123494400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":123494400000,"summary":"Triple triangle made of orange lights","tags":["lights","triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"San Jose, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1734"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Marina","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"On my way home, riding a motorcycle, to seaside from work in sunnyvalesouthbound on sr1 and having just left castroville, i saw an occasional flickerjust on the edge of my helmet visor which i thought was just a diffractedterrestrial light. it persisted flickering several times and seemed to come fromthe same apparent direction though i had changed direction following sr1. ilooked up and saw a vaguely dark object with orange and green flickers of light.I exited at del monte blvd after crossing the salinas river and looked up at theobject and saw a black object, rock-like, round with rounded ends and pinched inthe middle in the sky about 70 degrees above the horizon, south-southwest of mylocation, or, from my location at the onramp to southbound sr1, in the directionof the water tower at fritzsche field at fort ord. the object was stationary,pointed down at approx 45 degrees and appeared to be aligned in a north-southdirection. the object was emitting sheets of deep green and orange flame  fromthe front and sides and smaller jets of yellow, red, red-orange and blue flameoccasionally from all parts. there appeared to be a faint trail of gray smoke orcloud behind it, or going out the end farthest from me, which faded outcompletely about one of the objects length behind. there were amber sparksemitted a couple times which faded out before going past the object. the flamesand sparks moved back across the object, or, away from me and my viewingperspective. the object was much blacker than the night sky and could clearly beseen against stars to the southwest of the milky way. there appeared to be somelight reflected from parts of the object, too, which made it possible to see anapparent crater on the far side of the waist in its middle. the moon was notvisible but i recall thinking that the moon might be in a position over thehorizon to the east to reflect light on the object.I watched the object for at least 20 minutes, and it appeared to move veryslowly relative to the stars but appeared not to move at all relative tolandmarks. the object did not appear to spin or rotate in any manner. i wenthome when it got too cold and watching the object made my neck sore.The month given is approximate. i do not recall the exact date and notes of theevent were lost or destroyed. the time is approximate i recall checking my watchand was concerned at how long i was there.I inquired of faa and local news about the object. they were interested ingetting off the phone as qui","distance":"Unknown","duration":"00:30:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2642,"landingOccurred":false,"latitude":36.6930429,"location":null,"logNumber":"","longitude":-121.797033,"occurred":544183200000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Other","source":"MUFON","status":null,"submitted":544183200000,"summary":"A stationary black rock","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Marina, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1735"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"New York","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was at my friends party camping out outside, and i first noticed a hovering,moderately large hovering blue object, it kind of glowed, and at first i thoughtit was a light from a plane until it just hovered above and wasnt moving.  ibegan to panic as it got closer, but then it backed up and disappeared, my twofriends spotted it as well, as we were a bit scared.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Dome","flightPath":"Stationary","formattedAddress":null,"id":2641,"landingOccurred":false,"latitude":40.7186528,"location":null,"logNumber":"","longitude":-73.9966931,"occurred":913658400000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Sphere","source":"MUFON","status":null,"submitted":913658400000,"summary":"Hovering glowing bright blue sphere","tags":["hovering"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"New York, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1736"},{"address":null,"addressResolution":null,"altitude":"Treetop","city":"Victorville","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Had come from an errand back to my home on august 24 2003 . as i drove inthedrive way i saw what i thought was a kite . i got out of my wifes car lookingeast over my neighbors garage about 515 pm. which was daylight still igave it a very calm wave. it was hard to judgedistance i say it was 4ft. in diameter and 200ft. inthe sky but now i amthinking it was much lower than that. maybe 50ft.    i ran into the garage toput my keys down . i ran back to the car watchingit glide very slow and low overmy neighbors house . then i ran again back to the car and took more things outof the car and into the garage. ran  to the sideyard fence  near the car openedthe gate and followedit . it was 25ft. from me and noticed every thing was veryvery qwiut no sound of anything except the wind .It was like a ghoust town in myneighborhood .I noticed as it got closer to my back corner neighbors cottonwoodtree and my 50ft. pine tree it had three red triangles like aradiation hazardsymbol  .It it had changed to all kinds of colors in the metalexamplewhen you put a drop of water in old car oil there is a rainbow of mixed colors .Thats what the metal looked like . it was a disc with a pie slice cut out of itand it was dark inside there . at this point it turned coffee black and startedto wobble very badly . i never saw the top of it , always the bottom  . it hidbehind the pine tree i followed it to the other side of the tree and it was notthere .I did not hear a sound . then i looked over my back yard fence 100 yardsaway icould see it hovering the next block over  much smaller this time . iwaved at it  . at this point i was very tired . i went to tell my brother what isaw then had a cigarette and rested. i still cannot believe what i saw is what isaw . several weeks later i had adream that woke me up and i could not sleep forthree nights in a row  . really i dont want to talk about it . because it is very strange what i did in my dream.","distance":"21-100 Feet","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Insignia,  Other","flightPath":"Straight-line path","formattedAddress":null,"id":2640,"landingOccurred":false,"latitude":34.54718,"location":null,"logNumber":"","longitude":-117.125816,"occurred":1061708400000,"potentialRelations":[],"rating":"Unrated","region":"California","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1061708400000,"summary":"4ft. diameter dull grey disk with  a pie slice cut","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Victorville, California","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1737"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Las Vegas","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"We were driving home after dinner out, approx. 8pm on friday night. i saw anintensely bright light, that appeared to be up on the mountain. as we gotcloser, i realized that it was not on the mountain, but above it. we initiallythought that it was an airplane, but ruled that out after it did not move. wewere curious and slightly nervous after we realized it was nothing we had everseen before nor anything that we could accurately say  that it was.  the objectappeared to be disc shaped, the bright lights, upon closer looking, were chasingone another , moving consecutively, white, red, so on and so forth. the lightswere bright enough going around it, that you could faintly see that it wasprobably silver or gray and that there was a dome shape on top.The dome shape was subtlely lit up with a green-ish light. it only hovered andwe lost site of it as i turned down the street going to my house, which then putthe object behind us rather than to the left side of us as before. i pulled myvehicle over,looked out my side window and could no longer see it.","distance":"501 Feet - 1 Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"Dome,  Window(s)","flightPath":"Stationary","formattedAddress":null,"id":2639,"landingOccurred":false,"latitude":36.118676,"location":null,"logNumber":"","longitude":-115.163586,"occurred":1067007600000,"potentialRelations":[],"rating":"Unrated","region":"Nevada","reportedWeather":null,"shape":"Disc","source":"MUFON","status":null,"submitted":1067007600000,"summary":"Bright lights caught our attention","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Las Vegas, Nevada","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1738"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Granite city near low wat","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Will only speak to persons only in person about the objust , with the picture ihave taken and with other witiness i have, also part of the wreck from the site","distance":"21-100 Feet","duration":"01:00:00","entityEncountered":false,"favorited":0,"features":"Patterned Surface","flightPath":"Stationary","formattedAddress":null,"id":2638,"landingOccurred":false,"latitude":40.6331249,"location":null,"logNumber":"","longitude":-89.3985283,"occurred":1038643200000,"potentialRelations":[],"rating":"Unrated","region":"Illinois","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1038643200000,"summary":"Saw ufo in low water dam in the nite on oct 7, 200","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Granite city near low wat, Illinois","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1739"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Aurora","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Sorry to bother you with an observation so trivial and devoid of detail.1 - i was out on my lawn looking to see if the northern lights were visiblesolar activity in the preceding 36 hours made a display of the aurora lessunlikely than usual.2 - i was simply scanning the sky and enjoying the stars.  the pleiades werequite visible to the east.  i noticed the object about 10 degrees south of thepleiades position at about 2130 hours.3 - at first i thought it another star shimmering low toward the horizon, butthe amount of motion was more than could be accounted for by atmosphericdistortion.  then i thought it was an aircraft, or possibly a satellite, but itstrajectory seemed highly unusual, and thats really all i have to make me thinkit was anything out of the ordinary.4 - i suppose id describe my reaction as detached curiousity.  as its path inthe distance took it behind some tall trees on my property from my position andperspective, i strolled toward the road to see if i could pick up sight of itagain.  i was distracted by the sudden barking of a dog on a neighbours propertya few hundred yards in the other direction, and lost sight of the object.5 - when i first noticed the object, it seemed nearly motionless, like any otherstar in the sky.  unused to seeing a gold star in that area, however, andnoticing that its atmosphere-induced shimmy was excessive, it held my attentionfor a moment, at which point i realised it was or had just then begun movingsouth with some slight acceleration.  it began to climb or at this point in myobservation, i considered it was perhaps merely turning west and toward myposition, describing an arc that covered perhaps 10 degrees horizontally and alittle less than that in elevation.  its apparent motion came back a shade pastvertical, having described something of a quarter-circle, then it cut gently andwithout any change in speed southward again, moving in a very flat horizontalarc, first clibling very slightly then very slightly descending over perhaps 15or 20 horizontal degrees.  its descent, again without any change in speed, thenbecame steeper, rather parabolically, and then flattened once more to continuesouth.6 - at this point i began to lose sight of it behind the large trees that bordermy property, so i moved first one way, then the other, and saw it again for amoment in a gap in the woods near the road, but a sudden sound distracted me andin the moment i turned away and looked back i found i could no longer locate itbehind more trees across the road.Again, sorry to take your time with so pedestri","distance":"Over One Mile","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"None","flightPath":"Path with directional change,Unknown","formattedAddress":null,"id":2637,"landingOccurred":false,"latitude":42.7539591,"location":null,"logNumber":"","longitude":-76.7024485,"occurred":1067056200000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Star-like","source":"MUFON","status":null,"submitted":1067056200000,"summary":"Gold object, erratic path, at great distance","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Aurora, New York","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1740"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Lincoln","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"This is all based upon stories i heard from several fellow students thatsomething happened over benton county missouri july 1,1963 lights thousands orhundreads of thousands of  lights in the sky appeared scaring the hell out ofall the animals and most of the people who were in the area suffered a greatstampede. animals from the benton county area went on a rampage killing hundredsof people who tried to stop it.  most of the people who saw this event are oldor dead now. my father was also home at that time getting ready to go to workthe next day. he went to bed at 830 that night and didnt get up until three thenext morning and according to him nothing happend at all.  it was reported thatthis event took place over the home that i was comming home to.  the eventlasted four hours from nine to twelve midnight. and it has been told to me thatmy birth was the sign of an ill omen. as for mei was born in kansas city mo at menorah hospital.I was born at 3.36.P.M.  it was exactly seven hours later when the event happendand according to my fatherwho is now deadhe said that everyone was crazy telling of the stampede that took place. hethought they had gotten into the pop-skulla drink made from sorgum squeezens andhallucinated the whole thing.At that time, my father had beagle puppies in the old barn which doesnt exisitanymore.  my former home was one mile south and three miles east on lake road h.The home has a gravel road in front of it.  if there had been anything going onthe puppies and their mothers would have been raising hell about it. none ofthem said anything and got throught the night just fine with no incident. therewas no evidence but there were cow patties in the yard and hoofprints goingacross the pasture. still my father who used to work for the fajin gunstockcompany which is also defunct. thought everyone there had was nuts and told meto stay away from them.  so i dont know what to tell you. if there is anyonethere who can verify anything that happend. then perhapse they will tell yousomething. this event happend a very long time ago. whatever you can find wouldbe a help to me if there is anything at all. animals both wild and domestic ranfor their lives in sheer fright. what couldnt get away died of fright. manyfarmers lost their homes and had to go through a long and terrible recoveryprocess. many men who were up older thought it was the end of the world and diedof fright as well. the lights were said to be beautiful and were bright  lightswithin lights comming and going and if there was ever a time when the world wasgoing to endthen the lord was practicing for the big day of his return. i dont know anythingmore than what other people have said. whe","distance":"Unknown","duration":"01:59:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Unknown","formattedAddress":null,"id":2636,"landingOccurred":false,"latitude":38.3908555,"location":null,"logNumber":"","longitude":-93.3346497,"occurred":-202550280000,"potentialRelations":[],"rating":"Unrated","region":"Missouri","reportedWeather":null,"shape":"Unknown","source":"MUFON","status":null,"submitted":-202550280000,"summary":"Grand armada in the sky","tags":["none"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"0","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Lincoln, Missouri","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1741"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Philadelphia","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I should be honest about this...I got two days off from work i work as a programassociate at an international exchange program after a long, difficultconference.  on monday night, october 6th, my roommate and i decided to have arelaxed night, knowing i didnt have to get up on tuesday morning for work.  onmonday night, we were drinking and smoking pot, although not to a point where itfelt excessive.  i will admit right there that this could call my story intoquestion, but i should be honest.  we live in a two-story rowhome, and i decidedthat since it was a great night, i would climb onto the roof, which i had neverdone before.  my roommate, being heavier than i, didnt even want to try.  icimbed up the back of the house for a wonderful view of the city from therooftop.I was laying on my back on the roof watching the stars, ejoying the tricks thatthey play on you when you stare at them for too long, when i noticed two smallabout the size of a star orange-yellow bits of light in the sky.  i was on myback, with my feet facing south, so i would say they were in thesouth-southwestern part of the sky, moving in a straight line towards the duesouth horizon.  from my home at 20th and washington, they looked like they wereheaded towards the part of the horizon where veterans stadium is, which is duesouth and a few blocks west.  i thought at first it was either stars, asatillite, or the beer, honestly.  so i kind of closed my eyes and shook my headto get the cobwebs out and refocus my vision -- when i noticed that the objectswere still there, moving on the same trajectory, at the same speed, and at theexact same distance apart.  still thinking this was in my head, i looked to adifferent part of the sky for a few seconds, then looked back to where theyellow-organge lights should have now been given their speed and trajectory, andsure enough they were still there, moving together, same speed, at the exactsame distance apart.  i followed them until they faded away as they got close tothe limit of my vision.  in the city, obviously, the light pollution makes itdifficult to see anything unless it is very high above the horizon.I came inside and told my roommate about it, and that was about the end of theconversation, both of us laughing that it was in my head.  i think the time onthe cable box was like 1245 am, but i could be a bit off.  i remember that itwas earlier than i thought it was, but still after midnight.  this would make itofficially early tuesday morning by this point.Anyway, i didnt really think about it much at all u","distance":"Over One Mile","duration":"00:05:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2635,"landingOccurred":false,"latitude":39.960735,"location":null,"logNumber":"","longitude":-75.158429,"occurred":1065510000000,"potentialRelations":[],"rating":"Unrated","region":"Pennsylvania","reportedWeather":null,"shape":"","source":"MUFON","status":null,"submitted":1065510000000,"summary":"Ufo over philadelphia, pa","tags":["lights"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Philadelphia, Pennsylvania","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1742"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Clearwater","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"Witness observed a bright light that emitted a trail like an airplane butremained stationary.Witness also stated that object was observed by some membersof local law enforcement and fire fighters as reported on local news channel. noother news or reports on this matter in local newspaper.Witness stated that newsreports of law enforcement claimed to have seen additional objects in the shapesof triangles to have emitted from mothership or carrier ship","distance":"Over One Mile","duration":"00:10:00","entityEncountered":false,"favorited":0,"features":"","flightPath":"Stationary","formattedAddress":null,"id":2634,"landingOccurred":false,"latitude":27.9658533,"location":null,"logNumber":"","longitude":-82.8001026,"occurred":1066917600000,"potentialRelations":[],"rating":"Unrated","region":"Florida","reportedWeather":null,"shape":"Oval","source":"MUFON","status":null,"submitted":1066917600000,"summary":"Observed bright lights with vapor trail that remai","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Clearwater, Florida","triangle":false,"type":"UFO Sighting","$$hashKey":"object:1743"},{"address":null,"addressResolution":null,"altitude":"Unknown","city":"Syracuse","country":"United States","county":null,"created":null,"deleted":false,"description":null,"detailedDescription":"I was returning to boston from a conference in toronto with some colleauges ofmine, and we were just about to pick up the thru-way near syracuse, new york. we were still heading south at this point as i noticed what looked like twoheadlights shining through the cloudy sky above.  i thought they were twoindividual planes at first, but quickly disregarded that idea.  i then thoughtthat they might actually be the reflection of a cars headlights in the window,so i moved my head around in an effort to make them disappear, to no avail.  theobject seemd to be moving due west, directly over the van.  as it passed aboveus, i could tell that there was a definite structure behind the two headlights. i jumped over to the passenger side window to try to catch it again.  as itre-emerged from behind the vans roof, i saw a much dimmer white light on theobjects underside which, combined with the brown sky, provided enough contrastto see the structure was that of a black, perfect isosceles triangle.  therewere no other lights on the object, so that once it had passed overhead, it wasno longer visible.I failed to mention to anyone what i was seeing until i jumped to the passengerside and they asked what was wrong.  i calmly stated that i was watching somestrange, triangular aircraft.  i was indeed remarkably calm until after thefact, when i realized that i had just had the classic flying triangle sighting.","distance":"Unknown","duration":"00:00:59","entityEncountered":false,"favorited":0,"features":"","flightPath":"Straight-line path","formattedAddress":null,"id":2633,"landingOccurred":false,"latitude":43.0481221,"location":null,"logNumber":"","longitude":-76.1474244,"occurred":1066844700000,"potentialRelations":[],"rating":"Unrated","region":"New York","reportedWeather":null,"shape":"Triangle","source":"MUFON","status":null,"submitted":1066844700000,"summary":"Flying triangle in upstate new york","tags":["triangle"],"timeZone":null,"timeZoneName":"","tweeted":0,"urls":null,"weather":null,"zipcode":"","daysBetweenOccurrenceAndSubmission":-1,"locationName":"Syracuse, New York","triangle":true,"type":"Black Triangle Sighting","$$hashKey":"object:1744"}],"last":false,"totalElements":82762,"totalPages":2759,"sort":[{"direction":"DESC","property":"_id","ignoreCase":false,"nullHandling":"NATIVE","ascending":false}],"first":false,"numberOfElements":30,"size":30,"number":2674}
